{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Nobility",
			"body": "Did all nobility die? Have only those who whose ancestors were incapable of seeing their own enslavement persist today?",
			"added": 1475131906
		},
		{
			"topic_id": 2,
			"title": "Premium Peer Service?",
			"body": "Is there a way to make a zeronet server which only accepts uploads from certain peers? This would mean larger sites would be possible and that every larger site would have to be interdependent: to take down one you have to take down them all.\n\nThere could be tiers, as well. I imagine the algorithm might be difficult, but would it be theoretically possible for someone to independently create a network like this?\n\nI imagine in order to maintain anonymity of larger controversial sites, there could be an 'access cookie' that follows the site material. This cookie would then grant it the ability to upload to certain peer tiers. This way, smaller users would be uploading the cookie marked material to the larger tier. It would become more difficult to trace where the premium cookie originated from. \n\nIt can get pretty complicated, but the question is: is this possible with zeronet, without fundamentally changing the core of it? Meaning if I individually were able to create it right now within 48 hours, would it be compatible with zer0net in its current manifestation?\n\nIt might even be just simply seed/leech ratio like torrents. This might make it possible to exploit such that sites can be effectively censored by being low-tiered, though. The issue is if internet becomes non-neutral in the future, this will hamper zer0net if there are no incentives for premium peers within a system which enforces anonymity as much as possible.\n\nThe bigger issue is that this format values quantity over quality by its very nature. Anyone with the resources can output enough quantity to flood out quality.",
			"added": 1475207067
		}
	],
	"topic_vote": {
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": 1,
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": 1
	},
	"next_comment_id": 13,
	"comment": {
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": [
			{
				"comment_id": 1,
				"body": "I'd rather have either a: 1) corrupt idiot or 2) honest idiot, in office than a cunning witch.\n\nThe direction of the USA is shit and Hillary is more of that same direction. The slow and toxic bloodletting of the youth and debt, managing their every small reaction to ensure they're kept as homogeneous and non-individual as possible.\n\nHeart of Atlanta Motel v. United States needs to be overturned, or else the US will not change direction. Race and gender baiting will be the norm until it is overturned.\n\nThat, or until white people cease to exist - which I'm sure every lefty would looovvveeee to happen. Every Jew, especially, gets a euphoric feeling at the idea of European people being genocided.\n\nAs for Europe....\n\"Ethnicity doesn't matter guys, culture assimilation does\"\n\"Culture doesn't matter guys, multiculturalism does\"\n^^^Every 'anti-racist' 'HATE-HITLER' believes both these things at the same time^^^\n\nSo, under those conditions, how would Europe not also be American? The only difference is they don't have the constitution.",
				"added": 1475198288
			},
			{
				"comment_id": 2,
				"body": "> [kopykate](#comment_42_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4): The white race was already 'genocided' long ago. Nobody is 100% ethnically pure.. especially these days .. and frankly, there's better things to worry about. All races will eventually be genocided as more and more people travel and have sex with each other, so..\n\nOnly if globalism continues. That's why there are borders. It's also why people naturally segregate. \n\nI understand, if you're female, you want peace all the time for your kids and you're willing to do anything for peace - but you're actually hurting any sons you might have, by not responding to the very real ethnocentrism of the Jew. So long as one is participating with impunity - or is only superficially being subject to the same standards as others, then you'll only reap the consequences after it is too late.\n\nThe white race is still able to fundamentally separate itself by genetic testing methods at birth. A society is pretty resilient. It takes a lack of vigilance and a couple generations in order to cause the cultural and ethnic degeneration of a society.\n\nAnd, 100% ethnic purity is an impossible standard. The issue that needs to be addressed is ressentiment. So long as people identify closely with other, they will gladly accept an inferior or subordinate position in society. Spartans would actually purposely 'cuck' themselves, letting their wives be impregnated by superior warriors. Except, they were genetically and ideologically and culturally similar enough with a commitment to the group such that there was no shame involved - but a respect for the whole.\n\nTo do with your 'better things to worry about'. Good for you. I implore you to actually use your head and take your ideology to its logical end - if you're capable of utilizing logic, that is. If nothing else, be honest about what you know: that you are explicitly advocating the continuing genocide of all peoples. Not 'tolerating' them nor 'supporting them'. Just commit yourself that you are destroying cultural identities. Then, and only then, after you have been honest with yourself, then you may talk about what makes those things 'better' to 'worry about'. And, if 'worrying' is the only thing you think should happen, it exposes a lot about the subjective, emotional and unprincipled intent behind your 'goals'.",
				"added": 1475204831
			},
			{
				"comment_id": 4,
				"body": "Everything you said, cloudofstars, boils down to the lack of history behind the U.S. Except, you're going the same direction as the U.S.\nEurope does not differ in direction. It only differs in history. While Europeans might think Americans are arrogant, Americans have already won the ideological war. That was my point.\nIf you're both headed to hell, what does it matter how you got there? In fact, it increasingly appears it doesn't matter to the EU how you get there - seeing as they just outlaw anything which questions the direction. Your history will become the same, as generation after generation forgets the history that existed before the hell you spawned them into.\nI agree, though, that Europe would be more culturally sensitive to various forms of ideological extremism. That does nothing, though, to excuse that every thing is defined both by what it was, what it is and that which it is becoming.",
				"added": 1475262409
			},
			{
				"comment_id": 9,
				"body": "Anyone who hates Trump and is white + male, is a faggot. Everyone else are just retarded gooks, mestizos, niggers, kikes or cunts if they think a white man can't see through their shallow promotion of their [hedonistic gender]/ethnic/tribal interests - under a dishonest guise of 'enlightenment' and 'virtue'. In fact, proving that they are the very opposite of the sort of person they wish to present themselves as.",
				"added": 1475625935
			},
			{
				"comment_id": 10,
				"body": "> [cloudofstars](#comment_40_1AvkR7PmGFLZL9drPpqCaBPEdcVipv2Ajs): That bot probably passes the Turing test.\n\nA good argument to ignore any comment made at a 3rd grade level or lower.",
				"added": 1475631767
			}
		],
		"2_1FwTZnDZJjs2epEtq9yLy7m2P5kZ4TYqAR": [
			{
				"comment_id": 3,
				"body": "Thank you for the information, bot.",
				"added": 1475257693
			}
		],
		"2_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR": [
			{
				"comment_id": 5,
				"body": "> [kaffie](#comment_207_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I just banned the first two users from KaffieHub: bbxxx@zeroid.bit and doom1@kaffie.bit. And I had to remove their spammy comments from my posts.\n> Sounds like someone needs to start an auto-ban list for known spammers.\n\nSounds good. People could subscribe to them separately. If Blogger1 and Blogger2 are people you respect, subscribe to their ban lists type of thing.",
				"added": 1475303883
			}
		],
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 6,
				"body": "> [kosherx](#comment_1_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): If you hate jews, fuck you.\n\nWhy would any aware white person hate Jews? They would hate white people who act like Jews or support Jews. Those who 'hate Jews' still believe that Jews are Aryan/white - when they are patently not.\n\nThe biggest mistake of Europeans is believing that a Jew shares their history and identity. In such a case, there's no reason to hate Jews - no more than one hates a virus, bacteria or other disease/infection.",
				"added": 1475304228
			},
			{
				"comment_id": 7,
				"body": "> [zaronauta](#comment_2_1KgQuToz1c1PBEHhZjijgdVfgBW1BEETd8): sure, generalize an entire group for the actions of some of them, worthy of a two-digit IQ\n\nYou're doing nothing to stop the same happening against white men. White men being generalized as having contributed nothing but suffering to the world. White men being generalized as 'sexist' and 'rape apologists'.\n\nI bet you've done nothing to fight the left's prejudice, but you're fine speaking out about the right's. Because you're a hypocrite. You cannot see the value of radical-rightism exposing the hypocrisy of the left, but instead choose to go on the offensive on the weaker movement, to score cheap political points.\n\nThat is why your criticism is unwelcome. You treat the radical right more harshly than you do the radical left - when the one that requires the harshest treatment is the one going unchallenged by moderates.\n\nThe only one with a low digit IQ is you.",
				"added": 1475375813
			},
			{
				"comment_id": 8,
				"body": "Communism, if it is ever to arise, won't arise out of a positive ambition for it. It will arise out of the refusal to accept that there is either: private property or currency.\n\nUnfortunately for Communism, the typical iteration of non-tribal communism is simply impossible, because it requires institutions adequately brainwashing the populace. That education needs to come from somewhere. Taxes would be impossible to create the educational system required, because that would be private property.",
				"added": 1475625486
			},
			{
				"comment_id": 11,
				"body": "Money is basically 'reputation points'. Banks become distributors, profiteers and creators of social reputation. \"In money, we trust.\" Like Gold and Silver of old, it served as a more light weight and liquid measure of value.\n\nMoney becomes its own person, out of nothing, which is trusted. It is a God in every scientific sense - it is the natural world which becomes personified. When one acquires money, they think of the power it has over people, not that it can provide for oneself. It cannot. You can't eat gold.\n\nHitler controlled money in Nazi Germany. It relied on trust toward the ones who control the money, that they would not manipulate it. Gold and Silver were essentially decentralized credit, because one could find it and 'strike it rich'. Not one group of person(s) controlled it or manipulated it. One had to at least, with gold, commit actual violence against the citizens in order for the gold market to be manipulated. With fiat currency, no over violence is needed to actually commit violence against them: one only tap-tap-taps into a computer one figure or another.\n\nI'm not sure what a world without a currency would look like, except that there'd be bartering. Bartering is very inefficient. There used to be multiple currencies - but the banks kept having bank runs and crashing because they're greedy shits, so they said \"Let's create one huge bank for all of us to be greedy shits with\" and nationalized the currency. Now they're going to attempt to do the same by creating a global currency.\n\nRejecting money, the people will just return to the gold standard. So, I don't see you'd stop that. Gold or Silver, or some other thing will become the 'currency' of choice. What would stop banks from again issuing 'gold/silver notes'? Legislation?\n\nIf one just banned usury, this would be solved. Then you just get loan sharks, though.",
				"added": 1475974988
			},
			{
				"comment_id": 12,
				"body": "> [photon](#comment_3_17a8xsj4Ds61C9wcox4Yqjp4GKD3qNdmdf): Why is it that where libertarians and ancaps gather together racist rhetoric isn't far behind? What a load of crap.\n\nBecause every ancap and libertarian is called racist because their policies don't see race/racial politics. Being 'blind' to race is considered racist. So, if they're going to be called racist for their ideology, then what's their solution, besides abandoning their ideology? They either helplessly try to push off the label of 'racist' when the momentum is leftward or they swing into full right wing mode to shift the momentum and also the Overton Window until they can actually propose principled change without being labeled 'racist'.\n\nBut, we know the types like you are what we call 'selfless genes'. You'll probably go participate in a vasectomy party. In fact, it's the ultimate virtue signal! I encourage your participation: http://www.news.com.au/lifestyle/parenting/babies/do-you-want-to-come-over-and-celebrate-the-neutering-of-my-husband/news-story/95af9d60e1bbda771a9227d520bc51fb",
				"added": 1476126465
			}
		]
	},
	"comment_vote": {
		"29_1AvkR7PmGFLZL9drPpqCaBPEdcVipv2Ajs": 1,
		"2_12uT4vU8m2CkuLW8ymLz5kpAyFQZ3Jj8XH": 1,
		"4_16ojERmxhsiYi13evABojDh1JgDNqodpZF": 1,
		"3_16ojERmxhsiYi13evABojDh1JgDNqodpZF": 1
	}
}