{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": 1,
		"1_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": 1,
		"2_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"2_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 1,
				"body": "All those filled with hate are circumcised.\nDon't underestimate the role of the foreskin.\nhttp://www.circumcision.org/foreskin.htm\nTaylor, Lockwood, and Taylor studied the foreskin tissue at the Department of Pathology, Health Sciences Centre, University of Manitoba, Canada. They reported their results in the British Journal of Urology in an article titled “The Prepuce: Specialized Mucosa of the Penis and Its Loss to Circumcision.” Based on the examination of 22 adult foreskins obtained at autopsy, they found that the outer foreskin’s concentration of nerves is “impressive” and its “sensitivity to light touch and pain are similar to that of the skin of the penis as a whole.” The foreskin inner surface is different. It is mucous membrane similar to the inner surface of the mouth, also rich in nerves and blood vessels. Between the inner and outer layers of the foreskin is a unique structure they call a “ridged band” that contains “specialized nerve endings.” The researchers conclude that the foreskin has several kinds of nerves and “should be considered a structural and functional unit made up of more or less specialized parts. . . . The glans and penile shaft gain excellent if surrogate sensitivity from the prepuce.”\nThe foreskin represents at least a third of the penile skin. It protects the glans from abrasion and contact with clothes. \nhttp://www.circumcision.org/psych.htm\nCircumcision trauma has long-term effects. In a medical journal survey of 546 circumcised men who reported circumcision harm, the following effects and feelings were noted.\n\n    anger, rage, sense of loss, shame, sense of having been victimized and mutilated\n    low self-esteem, fear, distrust, and grief\n    relationship difficulties, sexual anxieties, and depression\n    reduced emotional expression, lack of empathy, and avoidance of intimacy \n\nSome of these men wish they had been given a choice at a later time rather than having circumcision forced on them when they were too young to resist. The survey does not suggest that all circumcised men have such feelings or how common the feelings are, only that they persist in some circumcised men, and more research is needed. Lack of awareness and understanding of circumcision, avoidance of the discomfort of questioning circumcision, and fear of disclosure help to explain why many circumcised men do not express dissatisfaction. Medical societies in Australia, New Zealand, and the United Kingdom recognize the long-term psychological risks of circumcision.",
				"added": 1479996760
			},
			{
				"comment_id": 2,
				"body": "> [jewishhistory](#comment_1_15caiyZY7dAb1TJfuMSSooyJPcWk3NpVfV): Jewish can even kill to get foreskins.  Unbelievable but true.The old Jewish King Saul has a daughter. One day David after he killed Goliath comes along and requests the daughter's hand to be the future King.The king is ready to give the marriage his blessing under one condition: David is to collect 100 foreskins from 100 enemy Philistines.David, the brave Jew took his men with him and went out and killed two hundred Philistines and brought back their foreskins. Then Saul gave him his daughter Michal in marriage.https://dwindlinginunbelief.blogspot.com/2010/01/david-buys-his-first-wife-with-200.html\n\nNo more reasons to kill for foreskin.\nThe restorative medicine found solutions.\nThere are a lot of benefits to having a foreskin. Foreskin restoration allows a circumcised man to regain many of those benefits. But, how to start? How to restore your foreskin?\nhttp://www.restoringforeskin.org/\nForeskin restoration is of ancient origin and dates back to the reign of Emperor Tiberius, when surgical means were taken to lengthen the foreskin of individuals with either a short foreskin that did not cover the glans completely or a completely exposed glans as a result of circumcision.\nhttps://en.wikipedia.org/wiki/Foreskin_restoration",
				"added": 1480187878
			}
		],
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": [
			{
				"comment_id": 3,
				"body": "Prince Charles, heir to Draculas blood line\nhttp://www.telegraph.co.uk/news/uknews/prince-charles/9656769/Prince-Charles-heir-to-Draculas-blood-line.html\nhttp://www.digitaljournal.com/article/336327",
				"added": 1480188176
			}
		]
	},
	"comment_vote": {}
}