{
	"next_topic_id": 2,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"12_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 1,
				"body": "> [waterrabbit](#comment_111_1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC): Where?\n\nVideos.db",
				"added": 1485579366
			}
		],
		"2_16ruLucRLto6GhT1Zb3P8JVZzC48fxd9Cc": [
			{
				"comment_id": 2,
				"body": "don't has any risk, just keep your window ID so you can go back to window anytime. linux mint18 is very nice.",
				"added": 1487213600
			}
		],
		"18_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 3,
				"body": "> [twiggy](#comment_49_1BRSETd8x5XUtHt9jz2e4WdB9rWY1WNfiu): You might want to ask some people for help on this ZeroBlog to. http://127.0.0.1:43110/1A2zwx1maY1fZv18vaEFFaCuiS88xqWvzV\n\nthere are bunch at zerome，I know that just talk。",
				"added": 1487829885
			},
			{
				"comment_id": 4,
				"body": "> [twiggy](#comment_50_1BRSETd8x5XUtHt9jz2e4WdB9rWY1WNfiu): I  know. I can't help kai0 because I can't code. I don't even have a blog on ZeroNet because I can't code so I wouldn't be able to make one look decent. I just use ZeroMail and surf other peoples sites.\n\nkai0 is my another acount，I have 3.",
				"added": 1487837746
			}
		],
		"3_12JNkg22um5nYeLgK8XgKavpivuwjrfHAy": [
			{
				"comment_id": 5,
				"body": "which site has admin now？",
				"added": 1488640961
			}
		],
		"1_1L34ssdxfxnnSFEoUmy48LocCxnVAHtqSV": [
			{
				"comment_id": 6,
				"body": "which multi site do you dev now？ I can test for you. do the zerotalk with img frist.",
				"added": 1488643048
			}
		],
		"1_1wp4Vxx8LzVxcnjQLdFDtsCjqWBRJ3Wpr": [
			{
				"comment_id": 7,
				"body": "I want a zerotalk with img but img have to display on home page,also need to be able to embed video, set the administrator.",
				"added": 1488645603
			}
		],
		"1_1MwJSNBC1savftEvXQyoHcVLDgThtAPr6T": [
			{
				"comment_id": 8,
				"body": "> [sarasa](#comment_4_1HLFF47LhPMfkv43GJoGCn7ZwXEAZmFHC6): Something to keep in mind is that all of the very popular social media systems have had large sums of cash inserted at various stages along the way. This supported not only coding and development but advertising and manipulating consumer confidence. Remember when Gmail first appeared and people were horrified that a corporation might scan the inbox to collect data (and then return it to you in the form of advertising). Google had a lot of money then. They have even more now.\n> Decentralization and marketplace free content is not likely to inspire investors because there is no return on investment except personal gratification. \n> What do you think Linus Torvalds would have said to you if you approached the initial development of Linux in the early years, the way you have ZeroNet in this post?? (hint: Torvalds doesn't mince his words) There were plenty of free and open source ecosystems floating around that time.  What made Linux fly is anyones guess. I'd guess the stars aligned right.\n> To me, your post is a slap to the face of the ZeroNet community. I'm sure the ZeroNet developers read this and thought... oh well... back to work.\n\nwhat he said is nothing wrong. in his viwe here just is a place for programer after work injoy themself, just like people after job injoy TV or goto bar.",
				"added": 1489378953
			}
		],
		"1_18WuQsUbszu95sZDiKvrfswRnEpuB5WEQh": [
			{
				"comment_id": 9,
				"body": "> [lmath](#comment_28_1958F7oCppj78MP966AfojMQwHg2WUupzq): 话说你不是也建了个论坛么？\n\n苏联人说：聪明，诚实，共产党员，这三个品质一个人不能同时具有。",
				"added": 1491609750
			}
		]
	},
	"comment_vote": {}
}