{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "THE IncaKoin 1% STRATEGY",
			"body": "Buy 1% of the total coins available (or whatever percentage you are able to hold and support).\n\nIncaKoins gain +9% more coins every 35 days proof of stake mined, with the maximum increase at 90 days.\nBe certain to stake mine the coins on schedule to keep and hold your percentage of the network while the coin base expands.\n\nHold a relative value of Bitcoin (specifically for NKA support) to ensure your 1% of the network has some support behind it.\n\nBuy more coins beyond that 1% you hold, buy them at support levels.\n\nSell those extra coins to the public on paper wallets, buy Bitcoin with the money, and add it to support levels, repeat over and over.\n\nPlace small amounts of those coins for sale at each sell price level, and as they sell, add that Bitcoin back to support price levels below, until those price level hold.\n\n\nFind others who wish to stake mine and hold 1% of the network, there are only 100 possible “1%”s for sale of course.\n\nFind IncaKoin on \nhttps://www.cryptopia.co.nz/\n\nContact nkacrypto (at) gmail.com",
			"added": 1476145592
		},
		{
			"topic_id": 2,
			"title": "Surfing .bit domain sites",
			"body": "Is zeronet now the only way to access .bit domains? Does anyone know if there is another, or better way?",
			"added": 1476642269
		}
	],
	"topic_vote": {
		"1_1AWKKjCvCFvUbmrbBtqrMSfAGZ8D6tAVHt": 1
	},
	"next_comment_id": 6,
	"comment": {
		"4_1CHcEy3SYsQvrW9uskKTZxUWj97BmZmvfa": [
			{
				"comment_id": 1,
				"body": "http://127.0.0.1:43110/1CTUDQj9PZVh9Sn81e3pVGTc29gFWvTrbk/",
				"added": 1476456866
			}
		],
		"2_1AWKKjCvCFvUbmrbBtqrMSfAGZ8D6tAVHt": [
			{
				"comment_id": 2,
				"body": "Do any of those pluggins still work? The ones I've recently tried again, did not. And it left me wondering why....",
				"added": 1476644884
			},
			{
				"comment_id": 3,
				"body": "But, is there a way other than zeronet for armies of noobs to enter the .bit world easily? I don't see anything at the moment, and what happened to those pluggins? Unsupported by developers for lack of benefit for labor?",
				"added": 1476702396
			}
		],
		"2_19dSnqd1GpiMTnuiD4n1tPasyKTDfNSFyz": [
			{
				"comment_id": 4,
				"body": "http://127.0.0.1:43110/incakoin-nka.bit",
				"added": 1476748933
			},
			{
				"comment_id": 5,
				"body": "http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1_1AWKKjCvCFvUbmrbBtqrMSfAGZ8D6tAVHt/THE+IncaKoin+1+STRATEGY",
				"added": 1476749009
			}
		]
	},
	"comment_vote": {}
}