{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "It seems there is no actual discussion here: just a lot of hate and racism.  If decentralization and decreased censorship is ever to succeed, we should start posting content that is constructive and more diverse.",
			"body": "",
			"added": 1478493117
		}
	],
	"topic_vote": {
		"1_1ANXCwkxieV453iigVj4d6FNNkQJCHaPwE": 1
	},
	"next_comment_id": 4,
	"comment": {
		"4_1BFTNXtYQDMCurqyg45KLmsV6oJD7bQSsH": [
			{
				"comment_id": 1,
				"body": "I agree with this",
				"added": 1478476758
			}
		],
		"1_1ANXCwkxieV453iigVj4d6FNNkQJCHaPwE": [
			{
				"comment_id": 2,
				"body": "> [ancap](#comment_103_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz): This is an example of a totally useless post that contributes nothing.My thoughts:\n> \n> Decreased censorship is already working (we have hateful and racist posts here)\n> Decentralization is working (you can clone this forum and have your own)\n> Diversity is working (we have posts from people from all over the world)\n> Constructive content is subjective. I'm sure some racists find their post very constructive. If you don't find that content meaningful, create your own.\n\nThis has nothing to do with my points.  What I'm saying is this project will never succeed if half the forum are posts including \"Adolf Hitler for President\" and hating on the Jewish religion and other minorities.  This alienates people from decentralization.  The principles of censorship free discussion only work if we take responsibility for what we post and publish and keep hate based on religion and race to ourselves in a socially forward society.  Otherwise, we are doing nothing but hurting the decentralization stance we fight for.",
				"added": 1478568319
			}
		],
		"1_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG": [
			{
				"comment_id": 3,
				"body": "IRC, by definition, relies on a central server to relay messages to users.  Since there is no central server model on Zeronet, IRC and other such messaging platforms have been replaced with decentralized alternatives such as ZeroMail.",
				"added": 1478990743
			}
		]
	},
	"comment_vote": {
		"41_1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC": 1,
		"104_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz": 1
	}
}