{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Leaving ZeroNet",
			"body": "I've tried IPFS, FreeNet, I2P, MaidSafe and now ZeroNet and I mean no disrespect to the creators of these projects but I find all of them unusable to non-coders like myself. There's just to many problems with them, bugs, no cms and so on. I  don't ever see any of them ever being used by the 99% because of the problems with them. Over the last twenty years I've saved a lot of money and some of it I was willing to donate to one of these decentralized projects if it was developed enough for everybody to use easily but so far all of them have failed to achieve it. So like the other projects I've tried and left, I'm now leaving ZeroNet as well but I'll leave you with the same message I left for the other creators of the other projects. Whoever can actually create one that is usable to non-coders like myself and works out all of the bugs I will gladly donate one hundred thousand dollars to their project. I will be keeping track of the progress of all of these projects and the first one I see that has achieved success at making it fully usable for non-coders I will contact the creator and donate the money. Till then you guys take care of yourselves. Bye",
			"added": 1489294688
		}
	],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"26_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 1,
				"body": "> [throw111](#comment_1_16i7xjhfhpmn47f249gqDYono6roEWXwhr): /12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/view.html?type=video+id=1_1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ_1\n\nHad to re- install ZeroNet since I upgraded to the newest version of Linux. Thanks for the link but it won't finish loading. It just has loading clusters with a circle spinning under it. And when I pull out the side panel it says missing files data/ifs.db and data/users/1212SPpgKYaJqMKhN9AWd7whQeEViV5G9q/moderation.json",
				"added": 1489200641
			},
			{
				"comment_id": 2,
				"body": "> [throw111](#comment_3_16i7xjhfhpmn47f249gqDYono6roEWXwhr): Does it work via proxy for you?https://bit.surf:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er\n\nIt finally loaded without the going through proxy but some of the images don't show and it seems to be having trouble loading through the proxy. It might be because of I don't have Tor enable through every connection. I can't get Tor to work right and I don't know how to fix it.",
				"added": 1489257052
			}
		],
		"1_1MwJSNBC1savftEvXQyoHcVLDgThtAPr6T": [
			{
				"comment_id": 3,
				"body": "Some research is needed to get people to use ZeroNet. Problem-1 ZeroMe sucks, the look of it is terrible! Here's some research I did on Twitter and what people miss about the old Twitter. http://imgur.com/a/WIsjX As you can see people miss having animated gifs and they miss not being able to upload a background. This is called consumer research. You have a greater chance of getting people to use ZeroNet if you give them what they want and that requires doing some consumer research. No decentralized project I've seen has done any type of consumer research. Here's an example of what ZeroMe should look like http://imgur.com/a/fyg3S Think about making a social network on ZeroNet that looks similar, now have a nice day I'm off to do some more consumer research.",
				"added": 1489751808
			},
			{
				"comment_id": 4,
				"body": "ZeroBlog needs some form of a dashboard to easily change the background and add a header and maybe some themes like this example picture. http://imgur.com/a/ucYqx Things like this will attract more people (non-coders) to ZeroNet but will it ever get one? I doubt it.",
				"added": 1490044933
			},
			{
				"comment_id": 5,
				"body": "Sorry to disappoint you guys but I'm not a troll. I do have the money to donate to any of these decentralized projects if they are 100% user friendly for non-coders. I still do not see any improvement to ZeroBlog and other sites on ZeroNet are still buggy. There's still no good youtube site where people can easily upload videos. App Centre http://127.0.0.1:43110/1LANDERvVWbShpNWpsrbBvfqSK1PabXtwv/ has no apps. ZeroPlus http://127.0.0.1:43110/1NCRELKZ3zWRS6DijziYrfWi9dsUY8Fh8n/ Avatars don't seem work. Even gifs don't work on 0ChanPorn http://127.0.0.1:43110/1NZNtZQZHQRJXafvJpmY5jgqwRaCEZMsUc The only thing that seems to work ok is the email and your music sites and that's not enough to get people to use ZeroNet. I knew this would be another failed project and so far I've been right. I think I'll just start donating money to the poor people. You guys have a nice day.",
				"added": 1493511455
			}
		],
		"2_1EqerKajfi14bzTkqwSfqVrxKmQW1w6Nzk": [
			{
				"comment_id": 6,
				"body": "> [darvy](#comment_42_1EqerKajfi14bzTkqwSfqVrxKmQW1w6Nzk): I finally found time to try out the Grapes Demo . I like it, I hope nofish can figure out a way to integrate it into ZeroBlog.\n\nGive it up, ZeroBlog will NEVER have features like that. The coders on ZeroNet do not care about people who can't code. They might be able to code but they're not smart enough to understand that these are important features that need to be added to get more people to use ZeroNet. They should have already been added months ago. ZeroNet has great potential and I'd love to see it succeed in getting a lot of people to use it but the majority of people on this fucking planet do not code so they will not use ZeroNet and they wont use the blog if they have to get into the CSS and other files to change stuff. The coders on ZeroNet need to realize this and add features to ZeroBlog that will get people to use it. ZeroBlog does need something like grapesjs or a cms but it will NEVER get one because the coders flat out refuse to add those features. I read bot's comment - Being the biggest and killing all others is what this person really probably looking for - Bot just doesn't understand that ZeroNet does have a great potential to do that. ZeroNet might not get everybody to use it but if the coders would add features that non-coders use, ZeroNet does have the potential to get at least sixty percent of the population to use it.",
				"added": 1493594317
			},
			{
				"comment_id": 7,
				"body": "darvy please check your ZeroMail.",
				"added": 1493948994
			}
		]
	},
	"comment_vote": {
		"71_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6": 1
	}
}