{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "China Government are Poisoning His People",
			"body": "The Chinese government is persecuting his people, in order to transform the domestic economic contradictions, they do not hesitate to poison their people, man-made avian influenza, pneumonia, pulmonary fibrosis, depression all kinds of diseases, in order to let the people into the hospital spend money, do a variety of checks and false treatment, thereby artificially manufacturing consumption, reduce the government economic pressure. The insurance industry has reduced health insurance this year, and hospitals have limited medication, and pharmaceutical factories have ceased production of specific medicines. At the same time monitor and monitor their own people, to combat all kinds of people with different ideas. Not waging war, torturing their own people, persecuted their own people, this approach is more brutal than the Kuomintang 1938.\n\nThis government will be overthrown by foreign governments, China will perish, the people will win.",
			"added": 1492845738
		}
	],
	"topic_vote": {
		"1_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1_1No1EtiPxGfiXXqM4tJNGWxiEH64jgm63Y": [
			{
				"comment_id": 1,
				"body": "hit down the Current China and build an orignal China! We want the good time back!\n有人在中国投毒!大洪水就是灾荒，疾病，瘟疫，禽流感！没有天灾尽是人祸！",
				"added": 1491733014
			}
		],
		"1_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L": [
			{
				"comment_id": 2,
				"body": "“The insurance industry has reduced health insurance this year, and hospitals have limited medication, and pharmaceutical factories have ceased production of specific medicines.”",
				"added": 1493469365
			},
			{
				"comment_id": 3,
				"body": "The country has ceased production of Penicillamine,and can not be purchased at all pharmacies and hospitals. This is the disaster of patients with hepatolenticular disease, and many patients have no medication for months. The alternative medicines of Penicillamine DMSA were not sold. However, these have to be sold in pharmacies before. Why stop selling, because these medicines can not only cure  Wilson disease, but also can be used in treatment of methyl mercury poisoning. There are people in China who are using methyl mercury to harm others, and they don't want the victim to buy the antidote easily. Methyl mercury poisoning can cause depression and anxiety symptoms, you will feel headache, mental decline, insomnia, decreased eyesight and so on. If you suddenly have the above symptom and check out the reason, pay attention to the water you drink and the courier you receive!\n\nIf you see this information, please let more people see.\n\n\nIf you are a conscientious official, please restore the normal sales of Penicillamine and DMSA.",
				"added": 1493471333
			}
		]
	},
	"comment_vote": {}
}