{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "כפרות Kapparot  is a Jewish ritual sacrificing a living gentile child(can be chicken or money also with less effect) to gain eternal life. 'This is my exchange, this is my substitute, this is my atonement. This gentile child will go to its death, while I will enter and proceed to a good long life and to peace.' 'Children of man who sit in darkness and the shadow of death...'  should be recited three times",
			"body": "https://www.youtube.com/watch?v=2I4Y6ToPmv8\nhttps://www.youtube.com/watch?v=AYGPAHCTCjg\nhttps://en.wikipedia.org/wiki/Kapparot\nhttp://www.chabad.org/media/pdf/339/eOux3393298.pdf\nKapparot כפרות\n'This is my exchange, this is my substitute, this is my atonement. This rooster (hen) will go to its death, while I will enter and proceed to a good long life and to peace.'(chicken variant)\n'This is my exchange, this is my substitute, this is my atonement. This money will go to charity, while I will enter and proceed to a good long life and to peace.'(money variant)\n'Children of man who sit in darkness and the shadow\nof death, bound in misery and chains of iron—He will bring\nthem  out  of  darkness  and  the  shadow  of  death,  and  will\nsunder their bonds. Foolish sinners, afflicted because of their\nsinful ways and their wrongdoings; their soul loathes all food\nand they reach the gates of death—they cry out to the Lord\nin  their  distress;  He  saves  them  from  their  afflictions.  He\nsends forth His word and heals them; He delivers them from\ntheir graves. Let them thank the Lord for His kindness, and\n[proclaim] His wonders to the children of man.\nIf there be for a man [even] one interceding angel out of a thousand\n[accusers], to speak of his uprightness in his behalf, then He\nwill  be  gracious  to  him  and  say:  Redeem  him  from  going\ndown to the grave; I have found expiation [for him].'\nThe verses should be recited three times.\nOn the Jewish site http://kapparot.net/ advises to use the chicken sacrifice variant instead of money as it is more effective.",
			"added": 1479905102,
			"parent_topic_uri": "9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}