{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "About Islam - Stories about Islam from around the world",
			"body": "http://127.0.0.1:43110/17orvGa6rdFUjPxuXk5eMdP1bfubNfe8Lu",
			"added": 1482804050
		}
	],
	"topic_vote": {
		"1_1A4zF6rpFeUPPfA9xNBU4pPt3PwvXu1EZT": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1_1A4zF6rpFeUPPfA9xNBU4pPt3PwvXu1EZT": [
			{
				"comment_id": 1,
				"body": "# Reporting while Muslim: how I covered the US presidential election\n\n“We should exterminate them.”\n\nThe words rolled off the voter’s tongue as though he was merely discussing a pest invasion in his home. He was talking about Muslims.\n\nI froze as I became suddenly aware of my own Muslim identity, my long hair just barely covering my necklace that bears the name of Allah in Arabic scripture. \n\nhttp://127.0.0.1:43110/17orvGa6rdFUjPxuXk5eMdP1bfubNfe8Lu/?Page:reporting-while-muslim-how-i-covered-the-us-presidential-election",
				"added": 1483017234
			},
			{
				"comment_id": 2,
				"body": "## Muslim teen in NYC chases down assailant of Orthodox Jewish woman\n\nA Muslim teen from New York City helped police catch a homeless man who hit an Orthodox Jewish woman on the subway.\n\nAhmed Khalifa, 17, told the New York Daily News about the incident aboard a Brooklyn-bound train Tuesday.\n\nhttp://127.0.0.1:43110/17orvGa6rdFUjPxuXk5eMdP1bfubNfe8Lu/?Page:20161230-muslim-teen-in-nyc-chases-down-assailant-of-orthodox-jewish-woman",
				"added": 1483104281
			},
			{
				"comment_id": 3,
				"body": "# Forgiveness is strength\n\nGenerally speaking, I’m lousy at forgiveness. At any given moment, I’m holding tight to a grudge or two, and there’s always another in my mind’s on-deck circle. As a Sunday school kid, I endured countless yawn-inducing sermons about turning the other cheek, and while I understood why I should, I also knew I never would. There was never a convincing reason why forgiving those who’d trespassed against me seemed preferable to a vendetta burning like an eternal flame.\n\nThen I read Asma Jama’s story.\n\nIn a Minnesota courtroom last week, Jama forgave Jodie Burchard-Risch, who smashed a beer mug in Jama’s face at a restaurant in October 2015. Burchard-Risch was upset that Jama was speaking Swahili to her own family and demanded that she speak English. When Jama refused, Burchard-Risch assaulted her.  \nhttp://127.0.0.1:43110/17orvGa6rdFUjPxuXk5eMdP1bfubNfe8Lu/?Page:20170101-forgiveness-is-strength",
				"added": 1483284947
			},
			{
				"comment_id": 4,
				"body": "## My Muslim Sons Will Never Learn to Hate People\n\nHabeebie Saif,\n\nI remember when you realized that you were a Muslim. You were tiny. You were sweet and round and friendly. It was at an event at school. Your schools so far have been English-language curriculum schools, and the student body came from more than 100 nationalities. One day the students had to identify their religion, and you came back “aware” of your religious identity. You took this identity very seriously. You began to ask me what you “had to do” to be a Muslim. I explained as best as I could the simple steps of knowing that the big Guy in the sky, who created the world, was really called Allah, and that hundreds of years ago, he had sent us his Messenger Mohammed with the Quran. I told you that we prayed five times a day, and I reminded you of Ramadan, when we would not eat all day until the evening.\n\nSoon you were coming back from school telling me what I had to do to be a “good Muslim.” It seems your Arabic teacher and his colleague, your religious studies teacher, had a better idea of what being a Muslim meant. You became a little aggressive, and I began to realize that your mother and I were not the only ones bringing you up. I saw that we had competition for your attention. I panicked a little. I had images of you running away to Syria to fight in a war where people would exploit your good nature. I imagined you cutting yourself off from us, your family, because we were not strict enough Muslims according to the standards that you had picked up from these so-called teachers of yours. I had the urge to go to your school and punch them and tell them they had no right to teach you these things.\n\nhttp://127.0.0.1:43110/17orvGa6rdFUjPxuXk5eMdP1bfubNfe8Lu/?Page:20170103-my-muslim-sons-will-never-learn-to-hate-people",
				"added": 1483485214
			},
			{
				"comment_id": 5,
				"body": "## Muslim-Owned Eatery Offers Free Food To Anyone Who Needs It\n\nA small restaurant is giving with a big heart.\n\nMarché Ferdous, a Muslim-owned eatery in Montreal, hands out free meals to anyone who is hungry and can’t afford to pay. And it does this entirely based on good faith.\n\n“We do not ask any questions, we do not judge people,” co-owner Yahya Hashemi told Global News. “They want to eat, [we] give them the food. That’s it, that’s all.”\n\nhttp://127.0.0.1:43110/17orvGa6rdFUjPxuXk5eMdP1bfubNfe8Lu/?Page:20170104-muslim-owned-eatery-offers-free-food-to-anyone-who-needs-it",
				"added": 1483569407
			}
		]
	},
	"comment_vote": {}
}