{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"5_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": [
			{
				"comment_id": 1,
				"body": "> [nofish](#comment_872_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Actually the protocol is ready for it and it would not be hard to add. (2-3wk)The problems:\n> Meaningful video content is hard to produce and rare. (movies/porn does not count)\n\nThis last comment honestly has me deeply worried to read from the current lead developer of zeronet.\nIt reminds me of a complete wrong mindset comparable of that of totalitarian systems like former nazi-germany declaring what is \"proper\" or useful (content? mindset? worthy form of living?) and what not.\n\nWould love to know the motivation then what you want to accomplish at all with zeronet if you hold back technology that could explore these needs, if the other two technical points are only temporary blockages as in the near future, bandwith and storage will increase to be available in such quantities, that in 10-15 years, a decentralized form of interent will be serving likely anything in a way zeronet does now.",
				"added": 1487331153
			},
			{
				"comment_id": 2,
				"body": "> [nofish](#comment_873_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): ZeroNet is created for real-time updated sites and communication. \nNo, it is exclusively not. You technically seem to do everything lately to narrow it down to that, but other than that, it is not.",
				"added": 1487335734
			},
			{
				"comment_id": 3,
				"body": "> [nofish](#comment_874_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Believe me: it is :) It never meant to be a file sharing network.\n\nJust repeating it doesn't make it any truer.\n\nI think anyone here that reads or participates in these threads is interested to see great things awaiting/happening in the future of zeronet:\n\nI'm sure with your own limitation or imagination of what zeronet is capable, it will just fail or never overcome the ranks of I2P, Freenet and the like.\n\nAs for the reason, imagine the founding fathers of the internet would have \"declared\" the internet to be \"envisioned\" only to be used for text and communication... and then ignore or actively discourage or even stop more and more people willing to drive the technology beyond for what it might have originally been envisioned for _instead_ of embracing it and even help to expand it in those directions (though i think sharing pictures, animations and even videos was already in the mind as a form of communication in the future to be shared over the internet).\n\nSo if you like to stick declaring and keeping zeronet to be just another decentralized Diaspora, you should clearly advertise it as that. People will likely spend time and effort elsewhere.\n\nBut just looking at the #1 zeronet site shared by \"millions of users\" making it the most successfull of all current sites, plus looking at what people request here, in the forums and via the hundreds of github proposals, even offering code and asking for plugin exapandability should be a BIG indicator that people by all means likely think otherwise.",
				"added": 1487337444
			}
		]
	},
	"comment_vote": {}
}