{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": [
			{
				"comment_id": 1,
				"body": "Henneck Kardel in “Adolph Hitler: Founder of Modern Israel” claims Hitler was a mixed Jew.\nhttp://holywar.org/txt/founder_of_Israel.pdf\nhttps://www.youtube.com/watch?v=u_qx4udpq5Y",
				"added": 1477925271
			}
		],
		"1_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": [
			{
				"comment_id": 2,
				"body": "The Talmud, highest authority for modern Talmudic Judaism, endorses pedophilia. It calls it \"Halachah\" or binding Jewish law!\nThe Talmudic rabbi most instrumental in persuading rabbis today to indulge in pedophilia is 2nd century A.D. Simeon ben Yohai.  It's hard to imagine a rabbinic sage more esteemed than ben Yohai. He is credited by Ultra-Orthodox Jews as the author of the Zohar, or Kabbalah. \nEvery year in Meron in Israel (where ben Yohai died), more than 10,000 Hasidic Jews gather for a week of singing, dancing, and praising ben Yohai, who may well be Kabbalist Judaism's most venerated authority. \nThe Talmud teaches that when sages of ben Yohai’s stature pronounced new laws, they did so out of the memory of what God had taught them in heaven.\n\nR. Simeon ben Yohai stated: ‘A proselyte who is under the age of three years and one day is permitted to marry a priest. For it is said, But all the women children that have not known men by lying with them, keep for yourselves; and Phinehas surely was with them.’\nOrthodox leaders are thus obligated to protect rabbinic pedophiles because such perverts are acting out sexual liberty granted by God.\nThe Talmud footnote 5 to this passage says ben Yohai's permission for sex with 3-year-old girls stands for all time.\n\nThe Talmud teaches that since little boys aren’t sexually mature, molesting them has no moral implications. Because such a minor isn’t a “man” in the mature sense, the boy and his sexual predator are exempted from the Mosaic ban on homosexuality.\nSanhedrin 69b summarizes: “All agree that the connection of a boy age nine years and a day is a real connection; while that of one less than eight years is not.”",
				"added": 1478002101
			}
		],
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 3,
				"body": "Who on earth would publish religious books saying it is okay to have sex with babies? Only the Judaism. At least in Islam the girl has to be nine before you are allowed to penetrate her.",
				"added": 1478002248
			}
		],
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 4,
				"body": "MONSANTO Family Were Jewish Slave Dealers And Owners\nThe Jewish Monsanto Family of Louisiana included  Benjamin, Isaac, Manuel, Eleanora, Gracia and Jacob. They  made frequent purchases of Blacks including twelve in 1785, thirteen and  then thirty-one in 1787, and eighty in 1768. \nhttp://rense.com/general76/ssje.htm\nJew-controlled Monsanto responsible at least 200,000 suicides in India past 10 years\nhttp://www.cameldog.net/war-peace/49562-jew-controlled-monsanto-responsible-least-200-000-suicides-india-past-10-years.html",
				"added": 1478078423
			}
		]
	},
	"comment_vote": {}
}