{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"7_162gsjqc5VB9ijkvSZMZVrcqdmqQ7XugiF": [
			{
				"comment_id": 1,
				"body": "It is OK.  I've been using it with Firefox for about 1 year now.  It did not get to my donation standard yet but it is close.  I saw that Tor included it also.  I can't tell exactly because it is part of a cocktail of add-ons.",
				"added": 1487596873
			}
		],
		"10715_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 2,
				"body": "I don't know why it is allowed to enter plea deals without discovery and evidence.  Europe has it's own gun markets (Belgium, Serbia, etc) what makes anybody think they can sell there without proper licenses.  Gunbroker.com does ship internationally.  Sounds like you can be computer smart and still a LIFE IDIOT.  It can be entrapment or fake news because details are not provided.",
				"added": 1487600061
			}
		],
		"10718_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 3,
				"body": "Good security is expensive if you started on the wrong foot.  Ebay discontinued secured emails because of the cost.  Open hardware is suppressed by money printers and spies.  Certified Training is more brainwashing than actual knowledge.  Last but not least:  there are more bored idiots and desperados in the world.  Good article!",
				"added": 1487601155
			}
		],
		"10719_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 4,
				"body": "I hope he gets paid with \"fake\" block chain money too.",
				"added": 1487601636
			}
		],
		"10721_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 5,
				"body": "Neither the blogger or the poster know how Write-Once (used by big banks and also legacy supermarket receipts) works.  Junk posting!",
				"added": 1487602042
			}
		],
		"10723_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 6,
				"body": "NO MALWARE PLEASE!!!  VERIFY YOUR LINKS AGAINST FILTERS!\n\nuBlock Origin has prevented the following page from loading:\n\nhttp://tags.news.com.au/prod/newskey/generator.html?origin=http%3a%2f%2fwww.theaustralian.com.au%2fbusiness%2ftechnology%2fusers-verified-online-you-can-take-brontechs-word-for-it%2fnews-story%2fcedd4d76d291c006fea880a79315745c&14876024181184503255\n\nBecause of the following filter\n\n||tags.news.com.au^\nFound in: EasyPrivacy • Fanboy+Easylist-Merged Ultimate List • hpHosts’ Ad and tracking servers",
				"added": 1487602583
			}
		],
		"10709_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 7,
				"body": "Hearsay article with no independent testing. CRAP!  I had Mac malware several times but if you keep connected to the APP (aka Spy) STORE it will eventually get cleaned (or you can do it yourself).  The chance of this guy selling security software 100%.",
				"added": 1487603365
			}
		],
		"6_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp": [
			{
				"comment_id": 8,
				"body": "Just deleted Jessy!  Wheezy was OK but not my style.  No VRMS is OpenSuse but have lots... Probably 10%\nhttp://software.opensuse.org/search?utf8=%E2%9C%93&q=vrms&search_devel=false&search_unsupported=false&baseproject=openSUSE%3ALeap%3A42.2",
				"added": 1487633051
			}
		],
		"10_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp": [
			{
				"comment_id": 9,
				"body": "Vax and Prime but you were not born when they were used.  Used only industrial processors.  ASICs only!",
				"added": 1487869475
			}
		]
	},
	"comment_vote": {}
}