{
  "comment": {
    "5_18xjeQQDs7av6EFb3tP6SKRGQ6C9FGVndZ": [
      {
        "body": "2. @耶稣之人权24：泸县打人致死事件，充分显露了坍塌的公信力，他们已经失信于民，没人相信他们，他们也不按照常规来解决问题。他们唯一会做的事就是使用暴力、收买、删帖。这也显出他们的恐惧，叫做“施暴者的恐惧”。他们不敢揭示真相，他们怕政权不稳。所有的突发事件如：雷洋案，维权律师、江西老农事件等莫不如此。", 
        "comment_id": 2, 
        "added": 1491403114
      }
    ], 
    "2_C": [
      {
        "body": "h", 
        "comment_id": 1, 
        "added": 1491276663
      }
    ]
  }, 
  "next_topic_id": 13, 
  "topic": [
    {
      "body": "Please upload the video to fill this space (with 1000GB), upload video can play online.\nThis internet disk is shared, no matter what you upload, I do not care.\nnote! Can only be uploaded, can not be deleted!\n请上传视频填满这个空间(有1000GB)，上传后视频能在线播放。\n这个网盘是共用的，无论你上传什么东西，我不管。\n注意！只能上传，不能删除！", 
      "title": "15/5000 Fēnxiǎng yīgè gòngyòng wǎng pán, huānyíng dàjiā shǐyòng Share a common network disk, welcome to use分享一个共用网盘,欢迎大家使用", 
      "added": 1491275589, 
      "topic_id": 1
    }, 
    {
      "body": "Share a common network disk, welcome to use.\nThis network disk has 1000GB of space, can only upload files, can not be deleted. Support any file.\n\n这个网盘有1000GB空间，只能上传文件，不能删除。支持任意文件.\n\naddress地址\nhttps://iteoedugr0-my.sharepoint.com/personal/0_xxxo_ga/_layouts/15/guestaccess.aspx?folderid=192b0d126c7db40d498d751b5060f81d3&authkey=AajCngglg6VT9Ihm6y5Nceo", 
      "title": "Share a common network disk, welcome to use", 
      "added": 1491276371, 
      "topic_id": 2
    }, 
    {
      "body": "图片：离奇死亡的14岁少年赵鑫（右）生前与母亲合照（网络图片）\n近日，一名14岁少年的死，成了中国境内舆论热点，却成不了焦点新闻，而这背后有着中共政府的维稳之手。\n\n这名14岁少年为四川泸县太伏中学的住校生赵鑫，综合目前披露的信息，他因没交一万元保护费，在4月1日晚间遭5名学生暴力殴打致死。但事后泸县县委宣传部发通报称，死者为坠楼身亡，排除他人加害死亡，并要强制火化死者的遗体。\n\n同时，政府和学校希望私了，以一个人出二十万，共一百万的金额息事宁人，但遭家属拒绝。有网友透露，5名凶手中有镇长之子和派出所所长之子。\n\n官方的处置，引发死者家属和民众的强烈不满。自2日开始大批民众连夜上街抗议，与警方发生激烈冲突。官方持续增援，调集数千特警、士兵赶赴现场镇压，并抓捕反抗民众，还有民众遭到警方殴打。而死者家属则遭到控制，无法对外联系，太伏镇也被封锁，以防止外人及记者进入。\n\n中国社交网上则是大肆删帖。据悉，网信办通知各网站立即删除涉泸县太伏学生死亡消息，只能出现官方报道。3日有许多网友在微信上透露，当地警方有偿付费，以一人50元要人民签名，认同死者为跳楼身亡这一说法。另外，当局还派人员挨家挨铺走访，宣传官方的说词。一服饰店的监控视频显示，官派人马对店内人员表示，学校死去的男孩，政府已定性为自杀，希望大家与官方统一口径不要乱说。\n\n直到4月4日，推持上有视频显示，太伏当地仍是军警林立，情势紧张。\n\n罪恶的根源\n\n在网络信息被管制及媒体被操控下，政府的单方说词引来网友普遍质疑，有许多微博显示来自泸州的网友表示，当地没人相信少年是摔死的，而是被打死，但政府校方都在压住此事。而这句“昨天保护不了母亲！今天保护不了儿子！明天保护不了自己！”被不断转发着。\n\n来自成都的卢思位律师4日发声明表示，如果死者家属需要，他愿接受委托，维护他们的权益。同时，他也指出，太伏中学生非正常死亡事件持续发酵，各种视频、传言满天飞，当局应放弃高压维稳的思维，让所有的质疑在公正、公平、公开的环境中得到澄清，并让受害者家属现身，保障有自主选择律师、自主选择尸检鉴定机构和见证人的权利。\n\n独立中文笔会副秘书长王金波则在推特上表示：“四川泸州泸县太伏中学事件证明，中国所有的矛盾，最终都归结为官民矛盾。”\n\n曾任职于中国国家民政部政策研究室的许梅邨在推特质疑，太伏中学命案不应发展成政治事件。他表示，所谓政治事件是威胁到党的统治，但“一个平常的事件”若会威胁到党的专政，充分说明“这个党才是一切罪恶的根源，是一切社会暴力的始作俑者”。\n\n中美差异\n\n事件发生后，有民众表示，当地霸凌事件多，只是这次闹大了。而在整个中国，更是霸凌事件频传。在2015年震惊中美两国的留美学生凌虐同学案件，似乎没有引起中共当局的重视。\n\n当时12名中国留学生被指控对两名女留学生施以各种残酷暴行，包括扒光衣服、用烟头烫伤乳头、强迫其吃沙子、剃掉头发逼受害者吃掉等欺凌手段。事后，有三名成年被告留学生受到6项绑架指控、2项折磨虐待指控和4项人身侵害指控，仅折磨罪最高就可判终身监禁，而折磨罪在美国十分罕见。最终，在达成认罪减刑协议下，分别获刑13年、10年和6年，服刑期满后将被驱逐出美国。\n\n发生在中国校园的霸凌事件，解决办法却多是批评教育为主，或是双方赔偿合解，犯罪成本极低甚至没有成本。而美国法律则是所有参与者都要“连坐”判重罪。若有前科且后果严重，即使未成年也可当作成年人刑事案件审理，按成人犯罪定案、量刑。若小孩未成年，其父母也要一同进入司法程序，甚至会转移监护权或上训导课。\n\n另外，美国法律还规定校方若发现有霸凌事件，必须举报、调查、干预，重者开除学籍。曾有家长发现学校没报警，该校校长因此被开除的例子。\n\n反观现在的太伏中学生命案，有当地民众在微信透露，赵鑫在事发前曾向爷爷奶奶告知收保护费，家属报警，但派出所仅是登记并无重视，而校方也知道此事，但最后仍让悲剧发生。事后，校方、警方和政府却联手打压死者家属，及前来声援的民众。\n\n同时，在中共体制腐败又滥权，在此环境教育出的官二代，多有“我爸是李刚”的思维，信仰权力与金钱，认为以此能横行霸道、为所欲为，法律观念淡薄。被指控打死赵鑫的校霸里，即被认为有官员的孩子。\n\n有评论人士认为，被打死的赵鑫，是中共暴政下又一位无法获得正义的无辜死难者。\n\n仿佛是为了增添更多的“中国特色”，事件有了新发展。4月4日晚间，一则视频被大量转发，内容是太伏镇镇长和泸县副县长到死者赵鑫家中，表明政府和警方认定赵鑫为跳楼自杀，让死者赵鑫的爷爷奶奶签字，把老人家当场气晕。\n\n〖图：太伏中学赵鑫坠落现场〗\n\nhttp://www.botanwang.com/node/82311\n博谈网记者 #苏智敏 报道\n#霸凌 #非正常死亡 #四川泸州 #时事见解", 
      "title": "可避免的悲剧  死于体制下的14岁少年", 
      "added": 1491401941, 
      "topic_id": 3
    }, 
    {
      "body": "原天津滨海新区区委书记宗国英，因“天津大爆炸”事故遭受处分两年后，目前已被中共中央批准，转任为云南省人民政府副省长。\n\n据云南当地官媒《云南日报》3月31日消息，云南省十二届人大常委会第三十三次会议表决通过了有关人事任免事项。决定任命宗国英为省人民政府副省长。\n\n公开资料显示，现年54岁的宗国英，河南内黄人。“60后”官员，长期在天津市任职，，2013年1月开始，任天津市副市长，滨海新区区委副书记、区长。2014年10月“入常”， 2015年1月，任天津市委常委，滨海新区区委书记。\n\n3月28日据官方发布消息，宗国英转任云南省委委员、常委。\n\n2016年2月，中国安监总局发布的天津港“8·12” 瑞海公司危险品仓库特别重大火灾爆炸事故调查报告，宗国英作为省部级官员曾被党纪政纪处分。\n\n宗国英履新云南副省长（图源：新华社）\n天津大爆炸案发生于2015年8月12日晚23点34分左右，滨海新区天津港的瑞海国际物流中心货柜码头集装箱内易燃易爆品发生连串爆炸。事故共造成165人遇难，直接经济损失68.66亿元人民币（1人民币约合0.145美元）。\n\n事实上，曾因“犯错”被点名通报的官员，再获重用，并不是罕见的事情。\n\n《新京报》曾通过调查52起受到关注的因突发事件免职的案件发现，自2008年以来，在85名被免的官员中，29人亦即三成已经复出。\n\n报道称，2008年的山西襄汾溃坝事故，造成277人死亡。时任临汾市委书记的夏振贵被撤销其党内职务，5年后又回来当山西省委统战部副部长。\n\n以及此前，被中纪委点名通报，又重获重用的还有上海常务副市长周波。", 
      "title": "【天津大爆炸被处分官员，转任云南副省长】", 
      "added": 1491402042, 
      "topic_id": 4
    }, 
    {
      "body": "10.【四川泸州泸县血案，政府起了什么作用？】\n泸州市太伏学校一名14岁中学住校生因没钱交一万元保护费，昨晚在学校活生生被黑社会打死并抛下楼....混身上下伤痕累累，手脚均被打断；最让人不理解的是学生家长还未到达现场时，学校就要强行将尸体火化，警方则认定这个学生是摔死的！目前学校与当地警方正在维稳。据说是为了维护社会稳定。 ——逼迫14岁的孩子交保护费？保护孩子，这本该是政府的责任。目前说法不一，如果这个新闻是真的，这样的黑社会如此恶劣在当地横行，政府吃屎去了？\nhttps://botanwang.com/node/82169", 
      "title": "10.【四川泸州泸县血案，政府起了什么作用？】", 
      "added": 1491402226, 
      "topic_id": 5
    }, 
    {
      "body": "31\t登基之初(上) 1949～1953年 55～59岁\n张戎（Jung Chang）,乔．哈利戴（Jon Halliday）\n \n\n31\t登基之初 1949～1953年 55～59岁\n\n国民党到共产党的政权交替，没有出现大的无政府状态。中共军队一路前进，一路接管所有社会机构，招收受过教育的男女青年，在共产党老干部领导下紧锣密鼓地工作起来。大部分旧职员原封不动地留下，经济照常运作。工厂开工，商店开门。工商业国有化、农业集体化，要在几年后才实行。\n在最初几年，由于实行宽松的经济政策，中国从十多年战火中迅速恢复，百业俱兴。死亡率下降。\n但新闻媒体马上被严格管制，公众舆论顷刻不复存在。残余的武装反抗被毫不手软地镇压下去。\n\n毛有一个能干的班子，由刘少奇和国务院总理周恩来执掌。一九四九年六月，毛派刘少奇到苏联，把整套苏联模式搬来中国。两个月之中，刘跟斯大林见面六次。斯大林还从来没跟哪位外国领导这么频繁地会见过。刘参观了工厂和集体农庄，与苏联各部门领导开了无数次会。数百名苏联专家很快被派来中国，有的在刘返程时同车而至。毛还没有正式宣告政权易手，一个斯大林式的极权框架已经摆好，只等套上去。\n\n胜利了，毛没有大赦天下。他搞的第一个运动是杀人：镇压反革命。毛维持政权靠“运动”而不靠法律。他从心底讨厌任何法律，曾对斯诺说自己是“和尚打伞，无法无天”。★（★毛政权也有一些法律的门面，被判刑者可以“上诉”。但上诉通常被算作“态度恶劣”、“抗拒改造”，要加重判刑。）\n\n镇反于一九五○年十月发动，毛亲自掌舵，叫公安部长把报告“直接送给我”。运动对像一类是“土匪”，包括卷入武装反抗毛政权的人；一类叫“特务”，囊括所有为国民党情报机关工作过的人。国民党政权的基层干部全体当上了靶子，上层国民党官员则受保护优待，以引诱海外国民党人来归。毛说：“我们杀的是些‘小蒋介石’。至于‘大蒋介石’……我们一个不杀。”\n\n说稍加不满的话也受到镇压。有一句奇怪的话曾在华北数省不胫而走：“毛主席派人下乡割蛋，送给苏联去造原子弹。”“割蛋”，就是阉割男人生殖器的意思。在村子里，夜间要是谁大吼一声：“割蛋的来了！”全村便会四下逃散。当时中共在华北农村征粮出口苏联，使这“谣言”应运而生。后来，毛接到报告说：杀了一批人以后，“谣言平息，社会秩序安定。”\n\n镇反中，毛一个指示接着一个指示，嫌他的各省领导太手软，太“右倾”，要他们“大捕大杀”。与此同时进行的是占人口三分之二的“新解放区”的土改。在这两场运动中，被枪毙、被打死、被逼自杀的人大约三百万左右。★毛希望每一次杀人都达到杀鸡儆猴的效果，要公开进行。一九五一年三月三十日，他指示：“很多地方，畏首畏尾，不敢大张旗鼓杀反革命。这种情况必须立即改变。”在毛的督促下，北京一地就开了三万次公审枪决大会，到会的达三百四十万人次。一个有一半中国血统的英国姑娘目睹了在北京市中心开的一次大会，公审两百人，然后当众枪毙，脑浆溅在旁边的人身上。躲过了这些大会的人常常躲不过游街示众的场面，或看着大卡车拉着滴血的尸体穿街而行。\n（★毛在最高国务会议上讲镇反中杀了七十万人。这个数字不包括土改中被打死的。从各类资料中可以得出结论，土改中被村民打死的人数，至少相当于被政府枪毙的人数。自杀的人数大致相当被杀的人数。）\n\n毛要的是全体人民参加镇反，要他们都受到恐吓。在这一点上，毛比斯大林和希特勒走得更远。\n要不是考虑到有些人能当劳动力使用，毛杀的人还会更多。他说：有些人“犯有死罪”，但杀了他们会“损失了大批的劳动力”。于是数百万人被“宽大处理”，送进在苏联专家指导下建立起来的劳改营。劳改意味着在最荒芜的地带，污染最严重的矿井，干最累最苦的重活，听最不堪忍受的训斥。身体虚弱的、性格倔强的，往往就死在这些黑暗的集中营里。除了累死病死的，枪毙的，自杀的更不计其数。\n\n在整个毛统治期间，死在监狱、劳改营里的人，和被枪毙的人，总数大约有两千七百万。★（★据估计，毛统治下的囚犯人数每年约一千万。因各种原因造成的死亡人数，平均每年应不下百分之十。）\n\n一种典型的毛式惩罚方式叫“管制”，决定了二十七年中数千万人的命运。这些人生活在监狱外的监视中，一有运动就揪出来批斗一番，平时终日战战兢兢，不知道哪一天大祸临门。他们的家人也备受歧视欺负。这批社会罪人的命运天天都在提醒著周围的人：不要得罪共产党。\n\n镇反时，全国每个工厂、村庄、街道，都成立了“治安保卫委员会”，成员是一般平民，往往是最爱管闲事的积极分子。他们的职责不仅是监视政府眼里的罪犯，而且是所有老百姓。毛政权还确立了一项最根本的控制方式：从一九五一年七月起，全国实行“户口制”，人人都必须有固定的居住、工作之地，没有人可以随意迁居、换工作。\n\n利用镇反，政府也收拾了刑事犯。土匪、黑帮、抢劫、杀人、聚赌、贩毒、嫖妓，都在打击之列。由于共产党组织严密，铁面无情，下得了手，社会治安很快变得空前的好。到一九五二年底，贩毒基本上绝迹，妓院也一扫而空，妓女被组织起来参加劳动。\n\n毛泽东再三说他的杀、关、管“是非常必要的，没有这一手不行”。“这件事做好了，政权才能巩固。”\n\n在大杀中国人的同时，有两个外国人被处死：意大利人李安东（Antonio Riva）和日本人山口隆一。他们的罪名是企图在一九五○年“十一国庆节”时用迫击炮炮打天安门城楼，刺杀毛泽东。这两个人在国庆前一天跟几个外国人一道被捕，十个月后被押著站在吉普车上游街示众，然后在北京天桥附近当众枪毙。第二天的《人民日报》大字标题，说他们是“美国政府间谍特务企图举行暴动”，幕后指挥是其实早已离开了北京的美国原驻华武官包瑞德（David Barrett）。\n\n警卫森严的天安门广场和周边地带，一万警察，一万武装部队，满广场高度警觉的中国人。孤零零几个外国人，动了在这里谋杀毛的念头，这好像是个讲给小孩子听的故事。二十年后，周恩来在邀请包瑞德访华时，含含糊糊地向他道歉，等于承认这事是子虚乌有。\n\n假造这个案子的目的是激起反美情绪，那时正值朝鲜战争（韩战）。另一个目的是打击在中国拥有三百三十万信徒的天主教会，被捕的人中就有梵蒂冈在北京的主要代表、意大利人马迪懦（Tarcisio Martina）。毛对梵蒂冈跨国度的巨大权威很感兴趣，津津有味地询问来访的意大利人。正因为它的号召力和能量，天主教会对毛是个威胁。中共接管了天主教办的学校、医院、孤儿院，诬蔑教士、修女吃孤儿院里孤儿的心肝，用孤儿做医药试验。\n\n宗教、准宗教团体，或作为“反动组织”镇压，或置于严格管制之下。几乎所有的外国教士都被驱逐。跟他们一道被赶走的还有外国生意人和记者。到一九五三年，中国基本上没什么非共产党国家的外国人了。\n\n一九五一年底，毛把注意力转移到锁紧国家的钱柜上，反贪污，反浪费，反官僚主义的“三反”运动开始。反贪污是主要目的。贪污犯叫“老虎”，贪污旧币一亿元（合一九五五年币制改革后新币的一万元）的叫“大老虎”，要判死刑。\n\n从古到今，中国人都希望有个清廉的政府，官员们不中饱私囊。人们对三反热烈拥护，心想这是共产党在铲除腐败。人们不曾意识到，国家钱柜里的钱，是从全国老百姓那里拿来的，但钱柜只有一把钥匙，攥在毛一个人手里，他想怎么用就怎么用，与老百姓的利益无关。\n\n为了把钱柜锁得牢牢的，毛不断给各部部长、各省和军队领导倾盆大雨般的发电报，要他们捉“大老虎”，还定下指标：“全国可能需要枪毙一万至几万贪污犯才能解决问题。”他激励各省竞赛“捉虎”，威胁说“违者不是官僚主义分子，就是贪污分子”。找老虎的方式是坦白和检举。三百八十三万政府工作人员，还不算军队的，靠这些办法审查。刑讯时有发生。最后抓出的“大老虎”比毛预定的要少得多。\n\n三反的另一个靶子是“浪费”。实际上，运动本身造成的浪费更多。建设国家急需的管理人员、技术人员被关在屋子里开会搞运动，一关几个月，业务陷于停顿。在东北，生产降低一半。一九五二年二月十四日，天津汇报说：“自三反以来，内外交流、城乡交流停滞，对天津经济已发生重大影响。批发商业成交较前减少一半；银行不贷款，银根很紧；私人不买货，也无心卖货；工业生产开始下降；税收显著减少。一部分直接受到影响的劳动人民已在叫苦。”(待续)\n(http://www.dajiyuan.com)", 
      "title": "《毛泽东：鲜为人知的故事》(58)", 
      "added": 1491402411, 
      "topic_id": 6
    }, 
    {
      "body": "反萨德个个有种，泸州血案令人发指，却人人沉默。正应了米兰 · 昆德拉说的一段话：“他们只有在愚蠢的时候才是真诚的，他们只有在安全的时候才是勇敢的,他们只有在免费的时候才是慷慨的，他们只有在浅薄的时候才是动情的”。", 
      "title": "支那人的个性", 
      "parent_topic_uri": "9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj", 
      "added": 1491402582, 
      "topic_id": 7
    }, 
    {
      "body": "@tianlan：之前看刘仲敬写的近代人物点评，总结的一个心得：占共产党便宜，和沾染中国股市差不多-极少数散户占了便宜还能及时跑掉；部分散户占了便宜却不舍得收手，最后十倍奉还；大多数散户跟风进坑，结果高位接盘一进套牢，最后尸骨无存。看雄安一事，忽然想起这个。", 
      "title": "刘仲敬写的近代人物点评，总结的一个心得", 
      "added": 1491404406, 
      "topic_id": 8
    }, 
    {
      "body": "学生死亡疑涉官二代　军方封镇断声援\n2017-04-05 22:09\n来源: \n自由亚洲电台\n作者: 文宇晴\n四川省泸州市初中生死亡事件受到官方猛力镇压，有当地民众向本台爆出背后的原因，五名涉事凶手中，其中三人均为官二代，疑官方刻意包庇。事件持续发酵，大批民众连日来聚集抗议，先后有数百示威者被抓。有当地民众向本台反映，军队已进驻及封锁太伏镇，阻挡外省民众前来声援。\n\n泸州市泸县太伏镇警民冲突过后， 有民众向本台反映，围殴赵鑫致死的5名同校学生，其中3人的身分已确认，均为官二代。\n\n民众说︰5个凶手里有3个人的身分确定了，是镇长的儿子、派出所田所长的儿子、校长的儿子。\n\n事件怀疑因涉及官二代，当局在处理上一直压下来，不但在利诱封口，要求民众统一口径，死亡的初中生赵鑫是跳楼自杀。周三又派出逾百名警察到殡仪馆，强行抢走遗体，企图进一步把事件压下来。\n\n了解情况的民众易先向本台表示，殡仪馆外聚集的一批民众协助家属保护遗体，可是警察的人数实在太多，最后更使用武力把阻止的民众带走。\n\n易先生继续说，当局抢尸的行动早在前一天已经部署好了，大量警车突然从外地驶进来，然后又在通往太伏镇的各个路口设了关卡，外地车辆无法进镇。加上当局的镇压手段和维稳措施不段升级，已经少了外地民众来声援。\n\n易先生说︰所有在那边接触尸体的都被抓起来了，全部被控制了，具体多少人我也不清楚。现在整个镇都被封锁了，军队的车都开过来了，反正整个地方都进不去了。哪会想去了解情况？如果你不认同他们的说法，不是挨打就是被关起来。谁敢去了解？\n\n易先生补充，事件在民间持续的抗议声音下，当局的行动却一步步升级，民众在网上发布消息，不是被删，便是无法发出去，镇内的网络也经常断，估计是为了阻止有消息流出。\n\n易先生说︰我们这边都被公安系统的网监全部封锁消息，我们的视频和文字方面全部都发不出去的。打了好多报社记者的电话，根本就没有人去管。我们都感到很惊讶，如果政府行为是对的，为甚么没有正面的报道，为甚么没有的消息全部封锁？\n\n当局除了封镇和抢尸外，亦派出约1千名手持盾牌的警察，来到赵鑫就读的太伏中学门外，阻挡聚集讨公道的民众冲进学校里。在现场抗议的民众林先生对本台表示，抗议的民众逾千人，都是自发来为学生讨公道的，大家纷纷发表对此事的看法。警察在场威胁，称煽动、制造事端的一律予以处理。\n\n林先生说︰现在的行动都是自发的，反正这个事情引起一种民愤。警察看到有人在反对时，态度强硬一点的都被抓起来了。那些武警是成百上千的，今天十点多也有抓人，下午三点多也有抓人。这几天总共抓了好几百人了，今天也抓了有几十个。反正当局就是用武力镇压，其实我们这些老百姓都没有闹事，只是要政府给一个说法。都没有离开学校，在那里的人现在还有很多。\n\n本台致电肇事的太伏中学了解情况，但是电话语音提示称线路故障。\n\n至于泸州市政府方面，接线的人员建议记者以泸县政府官网上的公告内容为准，一切传言都不能相信。\n\n泸州市政府值班︰你说的青况现在我不了解，这应该不属于我们市政府负责的范围，如果有攻击的话应该是由公安局负责，你可以打公安局询问。这消息你是听说，要到网上看正规的公告，泸县(政府)的官网已经出了正式的公告，你可以看那个。\n\n泸州市初中生赵鑫离奇死亡事件除了引发当地衆的大规模的抗议外，菲律宾华人网“菲龙网”周三消息称，名为“血影网安”的黑客对泸州各政府网站进行爲期至少三天的攻击。\n\n记者向泸州市政府网络维护部门了解，对方称︰现在正在检查，正在检查。\n\n本台曾浏览泸县政府官网，但未能成功找到泸州市政府人员所说的，有关于赵鑫死亡事件的公告。\n\n关键词: 学生血案官二代四川泸州\n栏目: \n要闻", 
      "title": "四川省泸州市初中生死亡事件受到官方猛力镇压学生死亡疑涉官二代", 
      "parent_topic_uri": "9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj", 
      "added": 1491404783, 
      "topic_id": 9
    }, 
    {
      "body": "维权律师廖曜中接受本台采访，就泸州死亡学生案发声。批评该事件中的体制内毒瘤。(廖曜中微博，拍摄时间不详)\n\n四川省泸州市学生死亡事件疑涉官二代，令案情增加复杂因素。死亡学生的家属遭当局维稳控制，多位维权律师主动为家属提供法律援助。律师寄语政府，公平公正才能赢得公信力。\n\n太伏镇太伏中学初中学生赵鑫上周六在校内非正常死亡，因涉嫌及官二代有关，当局强力维稳，将赵鑫父母及多位亲属严密控制，封禁社交媒体资讯。\n\n本台多次拔打赵鑫双亲游小红和赵廷学的手机，皆是无人接听状态或被挂断。据一位太伏学生的家长向本台透露，赵鑫的家属都处软禁之中，包括便衣在医院控制赵鑫住院的祖父母。而早前传言政府收买当地民众让他们证明赵鑫系跳楼身亡也属实。\n\n学生家长（parents）：他（赵鑫）的所有亲戚包括他的父亲母亲都被软禁了，然后他的爷爷奶奶已经晕倒，现在全在医院，在医护人员的“陪同”下和政府人员的监督下。所以他的亲戚就没人出来请律师。我不懂这些程式，但我很想帮这一家人，因为我的娃儿也在这个学校读书，如果一旦这个娃儿真的是被打被害死的，那么以后他（打人者）就更倡狂。\n\n早年从官场辞职成为维权律师的廖曜中，周二透过社交媒体，表示愿意为学生家属维权，控告公权力部门和涉事的太伏中学违法。他还打破早年间自订的“不接受外媒采访”规矩，为该事件破例接受本台采访。\n\n廖曜中（liao yaozhong）：中学生被打是很恐怖的事情，如果不支持，他们家里人很弱，我们这些人确实也看不下去；第二个原因我们知道体制内有些人是不讲理的，因为我是体制内出来的，可能和他们有个沟通的渠道；第三个方面来讲体制内有些毒瘤通过我们这些敢于才能揭露一点点。我们已经无法忍受了，这个社会简直恐怖到了极点。\n\n维权律师卢思位也于周二发出声明，要求当局立即让家属现身；由四川省级司法接管该案侦查和监督，并进行案情通报；他也敦促当局放弃高压维稳的思维定势。他同时呼吁更多的维权律师介入该案，包括王宗跃、吴魁明等多位律师已支持为家属提供法律援助。\n\n至本台发稿前，微信公号“最爱大泸州”称，家属周二已同意尸检并启动程式。多位律师担忧被控的家属在政府压力下签字，他们正透过一些渠道以尽快取得家属的授权。\n\n关键词: 学生血案四川泸州\n栏目: \n要闻", 
      "title": "学生死亡掀声援潮　律师主动提供法援", 
      "added": 1491409225, 
      "topic_id": 10
    }, 
    {
      "body": "首页\n时事见解\n社会透视\n新颖视角\n财经观察\n史海漫步\n品味生活\n要闻\n关于我们\n你在这里\n首页\n〖兲朝浮世绘〗习近平，你的中国梦该醒醒了！\n2017-04-05 04:16\n来源: \n博谈网\n作者: 金鸣\n1.【韩海警派遣12艘舰艇配重火力武器打击中国渔船】\n\n\n\n韩联社4日报道称，春季梭子蟹捕捞的高峰期，非法捕捞的中国渔船将随之增加。韩国海警派遣9艘警备舰和3艘防弹艇，打击非法捕捞。船艇内装有机枪、舰炮等班组武器。去年11月，韩国海警曾使用M60机关枪对中国渔船射出600至700发子弹。——非法捕捞，祸害完自己又去祸害别人，中国渔民的断子绝孙网真的该管管，更不用说跑到人家领海去了。\n\n2.【有钱国内没地方花，援建柬埔寨国家体育场投资约11亿元】\n\n\n\n由中国政府投资约11亿元人民币援建的柬埔寨王国国家体育场，4日在新址举行隆重的开工仪式。现场，柬王国首相洪森和中国驻柬大使熊波亲手按下动工按钮。——这对于人均GDP仅1200美元的柬埔寨而言，是天量增援了。据多家报道说非洲最好的体育馆也多为中国援建。 \n\n3.【重庆市公安局局长是高危行业，传何挺被双规】\n\n\n\n港媒《星岛日报》4月3日引述两名消息人士的话报导，何挺目前正接受调查。报导称，五年前发生王立军事件，何挺接任重庆市公安局长，未料如今步上王立军后尘。何挺落马的消息震惊山城政界。何挺2012年3月接替王立军出任重庆公安局长后，被网民披露其在不同场合戴不同名表，包括价值20多万元的江诗丹唐和逾8万元劳力士表。被民众举报是“新表叔”，民众并呼吁当局彻查。不过，重庆市政府网站“副市长”一栏，目前仍有何挺的介绍。中共官方也未证实。——这个何挺是周永康的亲信，据说他是个远比王立军更狠的角色，手上沾满鲜血，是西南政法帮代表人物之一。他因积极追随中共江泽民集团迫害法轮功，多次被海外“追查迫害法轮功国际组织”列入追查名单。\n\n4.【辽宁国资委原纪委书记刘凯受贿1249万元 获刑9年】\n\n\n\n经查，刘凯利用职务便利，非法收受财物共计折合人民币1249.8745万元。其行为已构成受贿罪，数额特别巨大。但鉴于刘凯主动交待全部犯罪事实，且已退缴全部赃款赃物，故一审判刘凯犯受贿罪，处有期徒刑九年，罚金一百万元。——体制内犯罪成本太低，所以官员们都去犯罪。这个判决是在鼓励有机会犯案的积极作案。一千多万才判九年，曾庆红家400亿，不知道是不是应该判360年？一生90岁，够杀他四次了吧？连抓都没抓；周永康家上千亿，够杀他十几次了吧？不是都没杀么？\n\n5.【枉法裁判的司法人员是社会秩序的最大破坏者】\n\n\n\n坚决支持卢律师为死者家属维护正义的权益！泸州太伏中学学生赵某死亡亊件刚发生一天，当地公安局就匆匆认定＂符合高坠伤特征，现有证据排除他人加害死亡”，这个说法太草率，令人生疑。4日晚，镇长和副县长到死者家里去，叫他爷爷奶奶签字，说是跳楼，把他们气晕死了。这引起当地百姓上街游行，官方出动大批警力维稳。不稳定究竟是谁造成的呢？四川泸县中学生坠楼事件的背后到底隐藏着什么？到底是官在撒谎，还是民在造谣传谣？到底是活活被打死，还是跳楼自杀？副县长和镇长为何威逼死者爷爷奶奶签字？今晚又是谁删除了疑似死者生前被毒打的视频？谁给泸县政府出动大批军警对付老百姓的权力？到底是哪些王八蛋制造了这起群体事件？四川泸县难道是法外之地吗？这样的流氓政府还有什么公信力可言？造成社会不稳定的也正是这些不作为或乱作为官员！ 习近平看到你所统领的这些官员的所作所为了吗？当大多数人都对你们失去了信任，你们的中国梦就该醒了…不抛弃中共独裁体制，不让民众参与监督，不走民主道路，这个体制会一直烂下去，直至灭亡…\n\n6.【政府雇佣黑社会，邪恶当道，无法无天！ 】\n\n\n\n视频中被围殴的，是太伏一婚纱摄影店老板，就因为这几天用摄影机将太伏发生的事记录下来，遭政府雇用黑社会毒打。目前已经确认的事件准确性和进度如下：1.孩子已经去了另一个世界，全身被打得淤青死血，手脚被打断。2.凶手为同寝室室友勾结校外人员半夜进学校把孩子打死。3.泸县教育局和公安局公布孩子为跳楼摔死。4.目前民众与家长对警方和政府部门袒护凶手，编造虚假跳楼极为不满。5.目前特警全时段封锁相关场所保护凶手与捏造虚假信息的官员，特警已经开始四处抓捕死亡孩子的亲属。6.四川省长已经到泸县把泸县相关路段封锁禁止车辆和行人通过。7.悲愤的亲属和公义人士通宵守护孩子灵魂最后的临时落脚点，与特警对峙，截止发消息特警在四处抓人中。——这是个什么世道？？邪恶当道，无法无天！ // LifeTime  ：泸州的事，为何成为社会关注焦点？1）视频显示，官方太粗暴。2）事件曝光后，越抹越黑，越捂事越大。如何了结？只能公开依法处置。 \n\n7.【四川一大学生遭网络诈骗，通过QQ报警又遇假网警】\n\n\n\n重庆晚报：去年刚踏入大学的四川小伙小罗，近日在朋友QQ空间看到一个扫描二维码送手机的广告。他扫码后，加了一个QQ好友，该QQ要求小罗缴纳66元运费和450元手机激活费。小罗转账516元后，以为可以坐等新手机，但对方仍一再要求转账，他意识到被骗了。小罗说，因为在QQ空间被骗，他没有拨打110报警，而是从QQ上搜索“网警110”。在加了“网警110报警服务台”为好友后，按照其要求操作，又被骗走银行卡里仅有的1610元。目前，警方已立案调查。警方提醒：从未开通过报警QQ。\n\n8.【四川遂宁男子在警方官微侮辱因公牺牲民警，被行政处罚】\n\n\n\n4月3日晚，@遂宁公安 通报称，4月2日下午，25岁遂宁大英县人唐某在位于重庆市万州区一出租屋内浏览新浪微博时，在@遂宁公安 发布的清明节前夕祭奠全市因公牺牲民警博文中，发表不当言论公然侮辱英烈，造成恶劣的社会影响。通报称，在调查过程中，唐某对自己的违法行为深感后悔，如实交待了自己的违法行为，且通过个人微博发表道歉申明积极消除社会影响，根据《中华人民共和国治安管理处罚法》相关规定，目前遂宁警方对违法行为人唐某依法作出了行政处罚。——发布驴怼大巴那个公安小编自首了没？别的不说，官微下的那些投诉、申冤、爆料，官方也这么雷厉风行的出击解决就好了。\n\n9.【雄县警方带走一批炒房团】\n\n\n\n经济观察网：4月1日开始的雄县房地产热还在持续。当地居民已经开始高价抛售房产，原本3150元的开盘价被卖到了3.1万元。雄安新区多名房产中介被公安人员追赶并控制，3人被送至警车上带走。一位在售楼中心门前维持秩序的公安人员称，4月1日起，全城的公安人员出动，被派往各售楼处附近维持秩序。公安人员已经带走了一批炒房团，并查处了一家五证不全预售房产的开发商。\n\n10.【马云在美扩张受阻 美议员呼吁调查蚂蚁金服】\n\n\n\n据网易科技，周五，美国众议院两位共和党议员呼吁美国外商投资委员会对蚂蚁金服公司收购MoneyGram一案进行“全面彻底”调查。Euronet首席执行官Michael Brown致信财政部长姆钦，表示蚂蚁金服的收购有可能威胁到美国国家安全。网络支付服务提供商会掌握用户在使用过程中产生的关键数据。议员还指出蚂蚁金服部分归属于中国国家机构。若收购成功有可能导致外国政府控制美国的关键基础设施，并可用于“情报目的、位置追踪和寻找薄弱的易受攻击处。”—— //@长岛律师Kevin: 为什么去美国收购扩张的中国公司，一定要有国有资本在里面，都不总结教训，给别人拒绝找借口。\n\n11.【安徽一邮递员专拆纪委信件 给被举报人通风报信换钱】\n\n\n\n新京报：安徽一投递员鲍某，打起用自己天天经手的信件换钱的主意。为此，他专门私拆寄给县政府、县委和纪检等部门的举报信件，不仅如此，鲍某还将3封举报县教育局副局长和7封举报县法院副院长的信件提供给被举报人以换取钱财。记者4月4日获悉，安徽省阜阳市中级法院于2017年2月7日作出终审判决，以私自开拆、隐匿邮件罪，判处鲍某有期徒刑一年十个月。——应该改改新闻名：贪官的卧底被抓，坚称自己是普通快递员。\n\n12.【保护自己的家人和财产的人被定故意杀人罪了】\n\n\n\n@刘文华律师：明经国已于近日批准逮捕，罪名由故意伤害罪变更为故意杀人罪。明对自身行为是认可的，但辩护人认为其行为不宜定性为故意杀人。——你能扒我的房子，却不准我反抗，兲朝的法制呵呵了。。", 
      "title": "〖兲朝浮世绘〗习近平，你的中国梦该醒醒了！", 
      "parent_topic_uri": "9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj", 
      "added": 1491409557, 
      "topic_id": 11
    }, 
    {
      "body": "愚人节这一天，北京突然宣布筹建雄安新区作为“陪都”。这个爆炸性的消息立即成为知识和专业人士的关注热点。普遍的第一反应是困惑不解，当局为什么要在此时做出这样一个关系重大且风险也极大的决策？\n\n很显然，这一重大决策是在极少人参与的情况下，由习近平拍版做出的，因此，这个决策体现了他对首都治理挑战的理解以及他应对这个挑战的想象力，也就是说，这一决策折射了他的“中国梦”。\n\n多年来，北京试图控制迁入人口的规模屡遭失败，以致产生了越来越大的迁都压力。发展雄安新区的决策是这一压力的结果。但是，雄安新区能缓解迁都的压力吗？我的判断是不能。中共定都北京，原本就有先天的缺陷，因为河北的生态和人文环境远逊江南，而在中央权力支持下，北京与河北高强度的工业发展，令这一问题更加恶化。雄安新区试图以巨大的资源投入来改变首都的生态和经济大环境，带来的风险，就是把原来北京的治理难题以更大的规模升级，从而给整个中国治理，带来更大的危机。\n\n北京成为超大城市，其背后的机制与上海、广州和深圳有一个根本性的区别，那就是高度依赖首都地位带来的资源榨取能力。如果仅仅是文化中心，北京不足以支持超大规模的城市经济，也就不会对河北的自然和人文资源榨取过度。建立雄安新区，就是把北京对各种资源的榨取效应进一步扩大，这必然给其他地区的发展带来不利。\n\n事实上，北京的治理难题，一方面是因为周边自然和人文资源环境的恶化，另一方面，也有来自治理失败地区，尤其是来自治理失败的农村的人口迁徙压力，而发展雄安新区，既难以真正解决周边环境资源不足的问题，同时，反而会加剧另一个难题，即人口迁入的压力。\n\n雄安新区大兴土木，必然需要向这个资源脆弱的地区引入大量临时人口，而这不仅不能疏导北京人口，反而会继续增加北京人口流入的压力，因为会有很多人追求进京就业得到雄安新区定居的资格。\n\n雄安新区的目标是吸引更多高端人才，这其实对于改善其他地区的治理十分不利。东北地区的自然和经济环境比华北要好，但为什么会深陷治理危机，关键是许多人才对于在在本地发展已不抱希望。而雄安新区的发展不仅不能回应这类地区面对的治理挑战，反而会加剧这类治理失败地区的人才外流。\n\n总之，创建雄安新区的理念不是通过区域治理能力的良性竞争来推动资源和人才在空间的合理配置，而是借助中央集权来制造“样板”，这不仅会导致资源的大量浪费，而且会对全国的地方治理带来全面的激励扭曲。各省市会效仿中央，用行政手段集中资源各自发展自己的所谓“新区”，从而加剧农村和小城镇的治理危机，加剧中国的治理危机。\n\n习近平为什么看不到这个逻辑？这是因为习近平难以改变对中央集权的迷信，而这种迷信，正是建设雄安新区的主导思想，也是习近平和许多主流精英们的中国梦的主导思想。雄安新区的创建过程，将是一个代价极为高昂的过程。历史上，对中央集权的迷信让中国付出过无法计数的生命和财产代价。如果雄安新区的高昂代价能够换来中国精英对“集权梦”的最后觉醒，那么雄安新区的试验，或许不完全是一件坏事。\n\n关键词: 雄安新区习近平中国梦\n栏目: \n新颖视角", 
      "title": "雄安新区与习近平的中国梦", 
      "added": 1491409813, 
      "topic_id": 12
    }
  ], 
  "topic_vote": {
    "8_18xjeQQDs7av6EFb3tP6SKRGQ6C9FGVndZ": 1, 
    "7_18xjeQQDs7av6EFb3tP6SKRGQ6C9FGVndZ": 1, 
    "12_18xjeQQDs7av6EFb3tP6SKRGQ6C9FGVndZ": 1
  }, 
  "next_comment_id": 3, 
  "comment_vote": {
    "2_18xjeQQDs7av6EFb3tP6SKRGQ6C9FGVndZ": 1
  }
}