{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "ZeroMe Alpha version",
			"body": "All our updates in current Big Patch 1, you can see first here:\nhttp://127.0.0.1:43110/me.plasmmer.bit/",
			"added": 1492364290
		},
		{
			"topic_id": 2,
			"title": "DCRS - platform for in future run ZeroNet, IPFS, OSs and apps",
			"body": "Please help by doing coding/suggestions in GitHub or by Seeding our site on ZeroNet:\nhttp://127.0.0.1:43110/dcrs.bit/",
			"added": 1492879420
		},
		{
			"topic_id": 3,
			"title": "Kaffiene is now OPEN-SOURCE.",
			"body": "http://127.0.0.1:43110/zeronews.bit/?Post:4:Kaffiene+is+now+open-source",
			"added": 1492993236
		},
		{
			"topic_id": 4,
			"title": "How the LBRY:// protocol can replace services like Youtube, Spotify, iStockphoto and Amazon Kindle",
			"body": "https://steemit.com/lbry/@rouse/how-the-lbry-protocol-can-replace-services-like-youtube-spotify-istockphoto-and-amazon-kindle",
			"added": 1493491405
		}
	],
	"topic_vote": {
		"1_136wmwLTBJoGTjXTAa7sWmXewn9P53EKML": 1,
		"2_136wmwLTBJoGTjXTAa7sWmXewn9P53EKML": 1,
		"3_136wmwLTBJoGTjXTAa7sWmXewn9P53EKML": 1,
		"4_136wmwLTBJoGTjXTAa7sWmXewn9P53EKML": 1
	},
	"next_comment_id": 12,
	"comment": {
		"1_136wmwLTBJoGTjXTAa7sWmXewn9P53EKML": [
			{
				"comment_id": 6,
				"body": "up",
				"added": 1492899372
			}
		],
		"2_136wmwLTBJoGTjXTAa7sWmXewn9P53EKML": [
			{
				"comment_id": 7,
				"body": "up",
				"added": 1492899377
			}
		],
		"4_136wmwLTBJoGTjXTAa7sWmXewn9P53EKML": [
			{
				"comment_id": 8,
				"body": "> [border0464fred](#comment_145_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): Hummm, an other protocol implementation that do the same thing that torrent do.  [...]\n\nNo. Totally no. If you read the bounty page of LBRY, you can see they are thinking to implement bittorrent on it. Then how can it be based on bittorrent? It also uses a blockchain and monetizing features.",
				"added": 1493504653
			},
			{
				"comment_id": 9,
				"body": "> [akito](#comment_22_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY): Just because it's apparently based on it, doesn't mean it came out of same intentions and has the same meanings... Maybe it's not \"new\" as it seems to you, but there's obviously still a difference.\n\n> [styromaniac](#comment_53_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It says in the video that you directly sell content using encryption. BitTorrent does not have that, so it has no standard to compete in that fashion. LBRY solves a problem I've had exactly as I needed it to be solved. [...]\n\nI know border and a lot of posts I do, he is in it disregarding all. Just a troll.\nThanks for the people that understands me and LBRY. Lets do good things instead of just trolling.\n\nMy ZeroMe profile is [here](https://bit.surf:43110/me.plasmmer.bit/?Profile/1White24UrrwQrD86o6Vrc1apgZ1x1o51/136wmwLTBJoGTjXTAa7sWmXewn9P53EKML/znews@zeroid.bit).",
				"added": 1493504700
			},
			{
				"comment_id": 10,
				"body": "> [mi6agent](#comment_24_14YdhMiNAG8LDichYEQvyZZboGL8bSeZEu): Is this anything other than a monetized bittorrent? Why would I, as a user, want to use this instead of just waiting for one fan to buy whatever media is sold on lbry and then upload a torrent to zeronet or tpb or whatever? Does this accomplish anything other than cutting out the middle man for people trying to make money by selling original content?\n\nIs you agent from the same agency of border?",
				"added": 1493505967
			},
			{
				"comment_id": 11,
				"body": "> [kaffie](#comment_283_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Looks like a shitty blockchain version of KopyKate and other distributed streaming platforms. By a show of hands, how many people want to pay money to watch youtube? Who actually pays for youtube red? Fucking no one.\n\nBecause the paid videos options don't means the whole blockchain/system of the project is \"shitty\".\nAlso, it is starting in the beta phase, so anything in LBRY can change.",
				"added": 1493541532
			}
		]
	},
	"comment_vote": {}
}