{
  "comment": {
    "1_12wGEUrb2N4oeNxs7bEjcV5GJe8VP9Cdsq": [
      {
        "body": "Meh. Demonsaw is problematic in that it's not open source and it hasn't been audited; there's no way to know that it's not recording everything you share and say and reporting it to law enforcement.", 
        "comment_id": 4, 
        "added": 1487170597
      }, 
      {
        "body": "> [linal](#comment_1_12wGEUrb2N4oeNxs7bEjcV5GJe8VP9Cdsq): Indeed, I edited the post to add some link for a better understanding. In the meantime Demonsaw is still a great software to share files.\n\nI've met the creator (Eijah) in person and discussed this, and he's said the same nothing that is in those posts. He won't open source and he keeps promising an audit and not delivering. Demonsaw is unsafe.", 
        "comment_id": 8, 
        "added": 1487178538
      }
    ], 
    "1_1MwJSNBC1savftEvXQyoHcVLDgThtAPr6T": [
      {
        "body": "> [planespherev3](#comment_180_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): I don't see any particular bugs or even something lacking in Zeronet. \n> Compared to freenet it's super fast, reliable, there are working search engines,  and we have streaming and the possibility to integrate comments in a Zite. Things that were lacking in freenet. \n> Since i'm a little more skeptical than the other ones i'd say that your post is an attempt to demoralize the project. I don't know for who, or for which reasons, but i don't think it's gonna work.\n\nNot everything is a conspiracy. OP is just bad at computers.", 
        "comment_id": 22, 
        "added": 1489415956
      }
    ], 
    "2_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": [
      {
        "body": "> [nekololi](#comment_12_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): i know! my reason for coming to zeronet to find cp on zerome and for the bitcoin doubling programs. so i could really do without the holocaust denying. come on people\n\nAh good, Nazis AND pedos!\n\n> [whitemask](#comment_5_1FnQQkQ4AwjwBhbz61RmqPazDrvdBGy79K): bc they're usually banned on mainstream social media?\n\nThat makes sense I guess, but can't they stay on Stormfront?", 
        "comment_id": 2, 
        "added": 1487083876
      }, 
      {
        "body": "> [wigy](#comment_4_1CwyP7JyaXpKVNXHKZfvRozBkCSk7hFAWe): Well, there are many anti-semitic people. I even know many jews who are anti-semitic :) On the clearnet they are censored, here they are not. It is a great challenge for the decentralized internet to provide everyone a comfortable filter bubble like on the clearnet, but one that anyone can look out from when they feel strong enough.\n\nHonestly, I prefer it when my filter bubble excludes fucking Nazis :)", 
        "comment_id": 3, 
        "added": 1487170551
      }, 
      {
        "body": "> [4lexandre](#comment_8_16ruLucRLto6GhT1Zb3P8JVZzC48fxd9Cc): I think I'm gonna make a black list.\n\nI would appreciate that. So far I have besmart@zeroid.bit (1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL) and deception@zeroid.bit (125b8FxS36xSSCHkvZEhimvF5KPxjckS7o) blocked.", 
        "comment_id": 6, 
        "added": 1487172053
      }, 
      {
        "body": "> [hexkey](#comment_6_18NsJqjikBYBjwLzMVp7aBJSpqtyRSd9qF): https://en.wikipedia.org/wiki/Online_disinhibition_effect\n\nI missed this somehow, but you're right.", 
        "comment_id": 7, 
        "added": 1487173102
      }, 
      {
        "body": "> [joe7](#comment_1_19Ue9ebzYZLWiauSD1k3YWXWt1YpkWjB5U): Why are so many Jews here when they already controll the clearnet ?Now honestly who from the Jews here have already sucked blood ? We dont know anyway your real identity.\n\nThe blood libel isn't real, asshole. Fuck off.", 
        "comment_id": 10, 
        "added": 1487188329
      }, 
      {
        "body": "> [nyarlathotepee](#comment_3_1HggY6scKX9CZARntQ5iqCqjdpL767y8a1): If you're a fan of censorship, why did you come here?\n\nI don't like censorship, I just don't like Nazis. Additionally, I'm mostly interested in ZeroNet from a technical standpoint. I'm not a libertarian nutcase.", 
        "comment_id": 20, 
        "added": 1487471242
      }
    ], 
    "2_162gsjqc5VB9ijkvSZMZVrcqdmqQ7XugiF": [
      {
        "body": "I agree that this would be nice, but real operating systems let you turn off networking for individual applications, so I don't think it's a priority.", 
        "comment_id": 25, 
        "added": 1489416249
      }
    ], 
    "6_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": [
      {
        "body": "> [balancer73](#comment_29_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): I am not engaged in rocket production, but I support a rocket modelling forum on the usual Internet. In Russia it is now not the safest subject for discussion therefore I have tried to move communication to some subjects in ZeroTalk. But people don't hurry to go here yet :) ZeroTalk here: http://127.0.0.1:43110/1JHnwMMGFJJ78KENfJZx1kjRmYRhQqt46D/\n> But there it is still empty also the main language — Russian :)\n\nThis looks very cool! I don't speak Russian, unfortunately; am I still allowed to comment there?", 
        "comment_id": 21, 
        "added": 1488307774
      }
    ], 
    "1_1CKPXN6PimcbmYkqWzyfPSXqxHYqswgeri": [
      {
        "body": "Because there is an inherent tradeoff between security and usability. Yes, QubesOS could be better designed, but if you want security by isolation, you have to accept many of the tradeoffs QubesOS has made (either spin-up time or constant RAM usage by VMs, more friction when moving data between arenas, et cetera) because they are the whole point. If there weren't more friction for copying/pasting, there would be no additional security.", 
        "comment_id": 23, 
        "added": 1489416146
      }
    ], 
    "5_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": [
      {
        "body": "> [mi6agent](#comment_4_14YdhMiNAG8LDichYEQvyZZboGL8bSeZEu): Give me my god damn YouTube clone zite which lets me browse content from YouTube and pull it into ZeroNet for distributed hosting in order to prevent censorship.\n\nUnlikely to happen due to the storage and bandwidth required, sadly.", 
        "comment_id": 12, 
        "added": 1487210593
      }, 
      {
        "body": "> [xxearthfyahxx](#comment_1_14Jg9Gfa7bt5TgqR3LPoPVRQAyvxYhjFtE): A site which gathers all the revolution vidéo footage to make us aware of whats happening in the world second by second ! And If someone know such an adress let us know ! fR\n\nAgain, video content on Zeronet is a no-go due to bandwidth/storage concerns.\n\n> [4lexandre](#comment_9_16ruLucRLto6GhT1Zb3P8JVZzC48fxd9Cc): A bar of research for Web sites already consulted in Zeronet. That will avoid me using the scroll bar of my Web browser.\n\nThat exists, check out Kaffie's search engine: http://kaffiene.bit/", 
        "comment_id": 13, 
        "added": 1487271790
      }, 
      {
        "body": "> [twiggy](#comment_34_1BRSETd8x5XUtHt9jz2e4WdB9rWY1WNfiu): ZeroNet will fail if there is no video content.\n\nVideo content can't be served on ZeroNet. It does not work with the model. However, there's no reason that ZeroNet pages can't link to/embed video content served on other networks, either legacy Internet or neonets like IPFS.", 
        "comment_id": 14, 
        "added": 1487273079
      }, 
      {
        "body": "> [nofish](#comment_872_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Actually the protocol is ready for it and it would not be hard to add. (2-3wk)The problems:\n> \n> Tor network is not suitable for this. (50%+ users using it that way)\n> Distributing large files efficiently requires more peers\n> Meaningful video content is hard to produce and rare. (movies/porn does not count)\n\nThe problem is precisely your second point: large files need more peers ALL of whom must use a great deal of their personal storage - most people won't want to do that.\n\nI'm all for having lots of video content on ZeroNet but I think that the social cost (that is, the increased seed churn) imposed by video will be fatal. Think of it from a user's perspective; why keep a 4GB video file around after you're done watching it, except out of some kind of altruism?", 
        "comment_id": 15, 
        "added": 1487274601
      }, 
      {
        "body": "> [nekololi](#comment_17_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): if people want to have a distributed network with persistent content which is quickly accessible, they need to develop a culture of giving up that bandwith or their precious hdd space in order to make that network happen.\n> this is a social problem and not a technical one, which hampers the growth of pretty much any decentralized service. it cannot be resolved with clever code. people need to learn to share and give back.\n\nI agree completely. The issue is that people will never learn that.", 
        "comment_id": 16, 
        "added": 1487284078
      }
    ], 
    "1_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd": [
      {
        "body": "Downvotes on Reddit exist for a reason, and we should have them here.\n\nOn the other hand, this is a forepressure based system - so create some pressure by producing new content! If non-Nazis actually write highly upvoted posts, then the Nazis will get downvoted to heck.\n\nAdditionally, I want to be allowed to choose which content I do and do not share with others. I have no desire to be seeding anti-Semitic bullshit to others.", 
        "comment_id": 5, 
        "added": 1487170810
      }, 
      {
        "body": "> [planespherev3](#comment_159_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): You sound like anti-semitic bullshit is the biggest problem in this world. \n> In the end of the day, do what you want, with your all your blocklists proposition and censorship, you won't stop this concept of P2P internet.\n\nCensorship? I never said people shouldn't be able to say whatever they want. I just want to avoid wasting my time with it.", 
        "comment_id": 11, 
        "added": 1487199049
      }, 
      {
        "body": "> [drlane](#comment_2_15EAH8W3qs47ZJ9wsxEakKtwZ238VFeYGt): Ah but downvotes prevent me from seeing messages others don't like. Bad.\n\nSo does forepressure though, so I'm not sure where that argument's going.\n\nIf everyone posts a lot in threads they like, and none at all in threads they don't, you won't see those threads.", 
        "comment_id": 18, 
        "added": 1487446687
      }, 
      {
        "body": "> [border0464fred](#comment_55_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): Reddit have a defined set of moral they enforce on users.\n\nYes, as a private company that is their right.", 
        "comment_id": 19, 
        "added": 1487446699
      }
    ], 
    "2_16ruLucRLto6GhT1Zb3P8JVZzC48fxd9Cc": [
      {
        "body": "Yeah, there's not really any \"risk\"... the only possible risk is that some software isn't supported that you need, or some hardware isn't supported, but it's pretty unlikely. If you have issues please feel free to message me on ZeroMail.", 
        "comment_id": 9, 
        "added": 1487180741
      }
    ], 
    "1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
      {
        "body": "This is the most ridiculous things I've ever heard...", 
        "comment_id": 1, 
        "added": 1487021923
      }
    ], 
    "6_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp": [
      {
        "body": ">4 non-free packages, 0.2% of 2002 installed packages.\n>1 contrib packages, 0.0% of 2002 installed packages.\n\nThe magic of using Intel integrated graphics!", 
        "comment_id": 17, 
        "added": 1487343403
      }
    ], 
    "1_127xneP1vvFJyc6SQZNzh2hyrkBuezpcvr": [
      {
        "body": "This would be awesome.", 
        "comment_id": 24, 
        "added": 1489416166
      }
    ]
  }, 
  "next_topic_id": 7, 
  "topic": [
    {
      "body": "Are there any other model/real rocketry nerds on ZeroTalk? I'm not a physicist or anything; I'm just interested in making things go up in the air.\n\nI personally don't have any high power certifications, but I'd like to get certified when I get out of college.", 
      "title": "Fellow rocketry nerds", 
      "added": 1487021889, 
      "topic_id": 1
    }, 
    {
      "body": "Of the posts on the front page two are openly, clearly anti-Semitic. What the fuck?", 
      "parent_topic_uri": "9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj", 
      "title": "Why are there so many Nazis on ZeroNet?", 
      "added": 1487022050, 
      "topic_id": 2
    }, 
    {
      "body": "Are there any other Rust programmers?", 
      "title": "Rust programmers?", 
      "added": 1487023524, 
      "topic_id": 3
    }, 
    {
      "body": "I made a quick example of session types and why they're awesome:\nhttp://127.0.0.1:43110/1BXPKEbS1PL6tSu6uED5yPsse1UCaLrL2J/?Post:3:Session+Types", 
      "title": "Session Types: Ensure Correct Usage at Compile Time", 
      "added": 1487186446, 
      "topic_id": 4
    }, 
    {
      "body": "What would people like to be available, that isn't?", 
      "title": "What content do you want to see?", 
      "added": 1487200606, 
      "topic_id": 5
    }, 
    {
      "body": "I've been working on rocket engines a lot. http://127.0.0.1:43110/1BXPKEbS1PL6tSu6uED5yPsse1UCaLrL2J/?Post:7:Notes+on+Rocket+Fuel+Mixtures\n\nHas anyone else been?", 
      "title": "Rocket Engines!", 
      "added": 1488231786, 
      "topic_id": 6
    }
  ], 
  "topic_vote": {
    "1_12wGEUrb2N4oeNxs7bEjcV5GJe8VP9Cdsq": 1, 
    "2_1E5qiz3ku3EzkMaUSj7mSSVJGtecNTGtBj": 1, 
    "1_15eCayxQsqggLVaj9kYJSCgTpoA2GPQEuW": 1, 
    "2_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": 1, 
    "1_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1, 
    "5_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": 1, 
    "4_162gsjqc5VB9ijkvSZMZVrcqdmqQ7XugiF": 1, 
    "1_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd": 1, 
    "1_1G2F1tV2cdZVDMsPWaVdENX6G9xhE3gnHE": 1, 
    "14_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": 1, 
    "4_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": 1, 
    "6_162gsjqc5VB9ijkvSZMZVrcqdmqQ7XugiF": 1, 
    "2_16ruLucRLto6GhT1Zb3P8JVZzC48fxd9Cc": 1
  }, 
  "next_comment_id": 26, 
  "comment_vote": {
    "5_1GuYKebkQAqGJ4tNpNp4TD1UuoHHudCJLA": 1, 
    "6_18NsJqjikBYBjwLzMVp7aBJSpqtyRSd9qF": 1, 
    "7_16ruLucRLto6GhT1Zb3P8JVZzC48fxd9Cc": 1
  }
}