{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1H7K8A2z57cN6Hc2X37yYjUYX5v9LkMrtU": 1,
		"1_1GeNYmPV2DqfpW7imG5Rx3b6AvgyLHAXL6": 1,
		"1_1CDcBUTtVqQWFLPb9sieczmPwzyivk9QYt": 1,
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": 1,
		"1_1EWcSH8L4VBXvQVn4NB4s8HsJuJzNwATYD": 1,
		"1_1No1EtiPxGfiXXqM4tJNGWxiEH64jgm63Y": 1,
		"1_1DoE2oLDwVmMgdk56QaNB7khXJWuyZstnU": 1,
		"3_12p3yAJYYbtSY226FLMaxXLMtFkBaLxu9a": 1,
		"1_1ER16jERiTJN3APCS3qvwx59E3Wk5V4EE4": 1,
		"2_12p3yAJYYbtSY226FLMaxXLMtFkBaLxu9a": 1,
		"1_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1,
		"1_1E1fsmFRrsPsfiYVbXfifNMcaWwuk8iFcp": 1,
		"1_1KLTeqiNMx1QNWTqBzJsjTQp112dDZPeqZ": 1,
		"1_1At4zensbxPGhXYbe5bnx9eGuE4V1vnbc8": 1,
		"1_1DqaWUpq6dRXfuXCokpjYoAkDj2nzZDnAn": 1,
		"1_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1_1H7K8A2z57cN6Hc2X37yYjUYX5v9LkMrtU": [
			{
				"comment_id": 1,
				"body": "- Erdogan could be an oppurtunist who thinks he can manipulate the Jews and the Jews think they can manipulate Erdogan. In this case it is a purpose alliance.\n\n- It is also possible that Erdogan is a Crypto-Jew. If this is the case he will never recognize it and will try to hide it with all methods available.\nCRYPTO-JEWs are not only a phantasy product of conspiracy theorists but they really EXIST.\nhttps://en.wikipedia.org/wiki/Crypto-Judaism\nCrypto-Judaism is the secret adherence to Judaism while publicly professing to be of another faith; practitioners are referred to as \"crypto-Jews\".\nCrypto-Jews are existent in almost every religion around the world and they are the best Mossad agents and the worst subversive elements of the Jewry.\n\n- DÖNMEH - the Turkish Crypto-Jew branch\nSabbatai Zevi in 1665\nThe Dönmeh (Turkish: Dönme) were a group of Crypto-Jews in the Ottoman Empire who converted publicly to Islam, but were said to have retained their beliefs. The movement was centred in Salonica.\nDespite their conversion to Islam, the Sabbateans secretly remained close to Judaism and continued to practice Jewish rituals covertly. They recognized Sabbatai Zevi (1626–1676) as the Jewish Messiah, observed certain commandments with similarities to those in Judaism, and prayed in Hebrew and later in Ladino. They also observed rituals celebrating important events in Zevi's life and interpreted Zevi's conversion in a Kabbalistic way.\nhttps://en.wikipedia.org/wiki/D%C3%B6nmeh\n\n— Erdogan’s wife Emine (Gulbaran) Erdogan: Sabbatean-Jewish origin from Syria’s Aleppo region; family settled in ethnic-Kurdish town of Siirt in Southeastern Turkey.\nhttps://en.wikipedia.org/wiki/Sabbateans",
				"added": 1492326553
			}
		]
	},
	"comment_vote": {}
}