{
	"next_topic_id": 2,
	"topic": [],
	"topic_vote": {
		"2_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG": 1
	},
	"next_comment_id": 77,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "Do I lose this ID when I shut down zeronet or how does that work?",
				"added": 1465595516
			}
		],
		"10_1MEWJRMLgvofqG9Mbsb2Rc4hFFyv7HeRx7": [
			{
				"comment_id": 2,
				"body": "By my definition, this is not deep web. Zeronet is too mainstream to be considered deep web, imo.\n\nIf you ask if something is the deep web, then in all likelihood it is not. You'll know it if you see it. Tor is not by default deep web, but there are deep webs on tor if you catch my drift. Same goes with freenet and i2p.",
				"added": 1465633209
			}
		],
		"1_1AhXDbKvcLap7TcS2542J7bFYzKHM3xeRU": [
			{
				"comment_id": 3,
				"body": "This is funny. To me Anarco-communism doesn't make any sense. Anarchism means no rulers, and communism wants a society where everything is shared, now it is obvious that not all humans want this, thus it has to be enforced. Oh hi, ruler!\n\nAnarcho-capitalism makes perfect sense. It's where one is free - free to make voluntary contracts. That means you may be a wage-slave, but it's your choice. Remember that there would be no copyright laws, thus corporations wouldn't grow as big as they are today.\n\nAlso, just a reminder that your anarcho-communist society can exist nicely inside an anarcho-capitalist world. However, an anarcho-capitalist society cannot exist nicely inside an anarcho-communist world. So lets opt for Anarc-capitalism and then see how many you manage to opt-in for your ideal communism mumbo-jumbo afterwards.",
				"added": 1483862847
			},
			{
				"comment_id": 5,
				"body": "> [thisweb11](#comment_222_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): No it doesn't, gramatically, logically or politically.   Do you know what anarchy is?  How can you be anarchiust and capitalist if the definition of anarchy is anti-capitalist.  To be a capitalist you have to be in a heirachy of power.  Thats what capital is. By definition (this isnt my definition, look it up - adam smith agrees with me! )\n\ndon't know about your invented definition, but it literally means one without ruler. In an anarcho-capitalist society it would be just that - one without ruler. What you're saying about Adam Smith is just BS. Give me an actual quote, because I have never heard that in my life. Capital is a good or service that will give the owner of the capital revenue. That's the definition. Where does the hierarchy come into the picture?",
				"added": 1483906231
			},
			{
				"comment_id": 6,
				"body": "> [thisweb11](#comment_223_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): How is it anyone would choose to be a wage slave.  Wage slavery is always forced on people.  A free market allows you to get rich and buy guns and enforce copyright with or without a state.   Which is pretty much what copyright law has become today.  And TTIP is corporations making their own states!   Libertarians who get rich will become corporations.  So how will it help change anything.  Capitalism leads to inequality, and there is no capitalism without a state, state is just a word, but in the end it means people who have all the money and guns.  That can be a single libertarian.\n\nStupid people do stupid shit. Wage slavery is NEVER forced on people. If it's forced it's actual slavery. It's not a good situation, but it's their choice. They choose to sign the contract and they can terminate the contract at any time they please. It's a voulentry contract. They stay in it because it's benefitial for them. Just because they chose to live beyond their means doesn't mean they are actual slaves. They are idiots. But that's allowed.",
				"added": 1483906557
			},
			{
				"comment_id": 7,
				"body": "Just a hypothetical question to you commies. Assume that I make a machine, on my own from wood that I chopped. Doesn't matter. I have something that I made my self from materials I gather my self. Would it be ok for me to become rich? If no, what could you do to prevent it?\n\nTaking the it one step further. What if I needed more people and we shared it 80/20. This person would still become tremendously wealthy. Would it be ok even if it was unequal? After all, it was I that built the machine.",
				"added": 1483908496
			},
			{
				"comment_id": 8,
				"body": "> [thisweb11](#comment_227_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): How would you get rich by doing that.  Unless you had money.  Whos going to make money and print it and regulate it?   you?   I'd laugh at you.  Then i'd go and collect my own wood, make a machine and give it to anyone I'd like to see make use of it. \n> \n> You can't think of a world without money.  Money is a faith, a religion, a hypothetical and EXTREMELY MODERN intangible invention.    You are a human being, get out and stop thinkign about money.  Share , create, give and contribute.  Stop thinking of your enviroment and others  in terms of their worth and profit.  \n> An anarchist looks at someone elses mantelpiece,  wonders from the objects what kind of person they might be.  A capitalist looks at someone’s mantelpiece and wonders only what those objects and that person is worth.\n\nYou're avoiding my questions. The machine is so complex you wouldn't be able to copy it. (It's a thought experiment and you're not smart enough to even recognize that, and you think you have the question of all of the worlds problems. Jesus christ).\n\nAnyway, assume I can produce something and sell it for huge amounts gold. (Yeah, I know. In your fantacy world it wouldn't be valuable. Forget your fantacy). I could see it for huge amounts of freeze dried food. Or whatever is valueable. Just answer the question.s If you cannot answer such basic questions how are you going to convince 7 billion people to live with unicorns under your rainbow?",
				"added": 1483912680
			},
			{
				"comment_id": 9,
				"body": "> [thisweb11](#comment_225_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): All financial (capitalist) debts are backed by structural violence.    If you can give me a single example of one that isn't I will give you all my bitcoins.\n\nThere are several micro lending institutions based on sharing economy and ratings. I shall generate a bitcoin address, just a second. Btw. I think you should be a good comrad and give me your bitcoins anyway. That's a pretty capitalistic thing to have.",
				"added": 1483913251
			},
			{
				"comment_id": 10,
				"body": "> [thisweb11](#comment_226_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Who is this they?  And why do you think 'they' live beyond their means..    Some people work their asses of just to feed themselves. And often the 'voluntary contract' is simply the only optiuon they have to feed themselves.  Not everyone circumstances are the same.  Depending on who you are, where you live, what country, class or gender etc  you are.    Your arrogance is exactly why libertarianism wont work.  You can't see past your own percieved brilliance at making money. (its perceived brilliance, even if you are rich )\n\nIt's simpler. If they have to get in debt to pay for an appartment, they live beyond their means. Also, you can't blame me for having such a regulated ecnomy. Without regulations there would be jobs for everyone and vages would be much higher then they are today.",
				"added": 1483913373
			},
			{
				"comment_id": 11,
				"body": "> [thisweb11](#comment_224_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Bullshit.   If you put a gun to my head and force me to do something Im gonna do it. Technically I could let you kill me instead but to all intense purposes i  wouldnt say it was stupid to choose any alternative to death.  (or starvation and abuse)   Do you think slaves deserve everything they got because they were stupid?  How about all the victims of the 2008 financial collapse? How about disabled people?  Or victims of terrorism? All those people forced under threat of homelesness and starvation to take a jon to pay of debts?  This is exactly the problem with capitalists.  They think everyone is else stupid because they got lucky. \n\nThen it's not a voulentary contract you idiot. That's why I'm reffering to you guys as idiots. You are uncapable of doing rational conclusions. All the problems you listed are a result of states, not free-markets. If you are in a contract that is not benefitial to you, then you are by definition stupid.\n \n> \n> Ok seriously, how can capitalism work without a ruler?  If I don't pay you for the goods you sold me how will you get the 'revenue' owed?   Money - all money (except bitcoin/crypto (at the moment)) - is backed by rulers.  Do you think Adam Smith disagrees with that?  Do you think any banker does?\n\nNo, gold, silver and rear earth metals are not backed by governments. They are used by governments, but not backed. Often in a business situation you pay up front. At least in part. By paying parts both parties take risk. But in the long run it's in both interests to be trust worthy. I wouldn't know about Smith, but I know Rothbard would disagree.",
				"added": 1483913712
			},
			{
				"comment_id": 13,
				"body": "> [planespherev3](#comment_83_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): The answer is simple: you're a greedy person. But it's not really your fault since you were born in this society. In a boxing match, you can't blame one boxer to hit the other in the face: it's the rule. However, there are other sport to practice, and even fighting sport less violent (wrestling, jiu jitsu). See my analogy: an other world is possible, but first we have to acknowledge it. \n> Linus Torvalds and Brahm Cohen could have easily been billionairs if they wanted to. Same for Nicolai Tesla.\n> But guess what: they though the technology itself was more interesting than the amount of money they could get from it.  \n> On the opposite, you have assholes like Edison, Gates or Steeve Jobs. Well they can rule this world, but not force me to like them, or sharing their view of society.\n\nStill not answering my questions. News flash. There are greedy people on this planet. Anarcho-capitalists biggest issues is to cope with agression. You cannot even cope with a person with ambition. Talk about a broken philosophy.\n\nAlso, no. Linus couldn't have been a billionair. I've been using linux exclusiveley since the nineties and was a linux evangelist for a decade. The only reason why Linux is so tremendously popular is because it was licenced under GPL. If he had been greedy it wouldn't have been a success. So I don't acknowledge that. As for Cohen, I wouldn't know, but I wouldn't automatically assume that to be true for him either.",
				"added": 1483915138
			},
			{
				"comment_id": 14,
				"body": "> [planespherev3](#comment_84_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): I think you are somehow projecting your frustration on us. That's why you get aggressive.  Deep inside you know that capitalism cannot, and never have worked, without a state. You treat us as delusional, because somehow, it's anarcho capitalism that is delusional. At least we have proof that anarcho capitalism worked before (primitive tribe, and also currently in the last primitive tribe on earh), and also, and more importantly, in order to be sure the concept work: in modern era: revolutionary Catalonia (1937). \n> You blame the state, but the state is the only thing that can glue together a capitalist society: a society with money, hierarchy and a working class/ owner of the means of production duality. Without a state in a capitalistic society, people would jump on each other, or it would be like the dystopias i refered to: blade runner, alien 2, avatar, where big corporations run everything.\n\nYes, I won't deny I get frustrated with you anarcho-commies. You have all these grand ideas, just like the venus project, but they are completely out of this world. You cannot talk 7 billion people to live in harmony and singing combaya.\n\nI completely reject that second paragraph. There is no basis of this assumption. And, if there is, it applies equally much to anarcho-communism. \"The state is the only thing that can ensure that all people own the capital goods.\" I could just as well say that with no justification.",
				"added": 1483915474
			},
			{
				"comment_id": 15,
				"body": "> [planespherev3](#comment_86_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): \n> Agree. That's why it's not for tomorrow. Only when there would be no social antagonism left, would the global an-com society emerge. That's decades in the future. Without internet, it could have taken centuries, but with internet, i hope to see it when i'm still alive. \n> \nIt's ironic, isn't it, that the one true an-cap realm there is, the internet, is what is going to give you an-com? ;)\n\n>  Well, my basis:  an-cap never has existed, an-com did (revolutionary Catalonia).\n\nIt has. Americas wild west. But it was still pretty much an-cap after the introduction of the state for a great while. Personal freedom transformed what is today the USA from being a newly discovered continent to, hands down, the riched, most prosperous region on the planet in a mere 200 years.",
				"added": 1483918406
			},
			{
				"comment_id": 20,
				"body": "> [thisweb11](#comment_235_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): \n> What is the question?  What are you asking?\n\nOk, I'll restart because it drifted away and I was unable to get my point across.\n\nFirst of all, I am in no means AGAINST open source everything and free shit. I would love to live in an an-com world, I just see it as impossible. So that's not what I'm saying. Fundamentally, what I want is personal freedom. If that comes in the form of an-com or an-cap is largely unimportant. However, I cannot understand how one can have personal freedom in an an-com world. It is contradictory. This is your cognitive dissonance. You cannot both have freedom AND soscial equality at the same time. Unless of course, you don't an-com don't want personal freedom. I wouldn't know, because I haven't read much about it.\n\nThat is what I'm trying to find out though my thought experiment. Can an-cap and an-com live side-by-side? Assume we live in an an-com world. What would happen if someone decided they wanted to make a profit? Because ultimatley, there are greedy people on the planet and there is no way around it. An-com have to deal with it somehow.",
				"added": 1484051646
			},
			{
				"comment_id": 22,
				"body": "> [thisweb11](#comment_247_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): \n> well an-com would let you do what you like.  It wouldnt effect us until you started to harm us and hurt us in doing so.  The best thing about an-com is that it can happen within any political system It does.  and it is.  Right now.  Anarchists arent waiting for a 'anarchist' world.  Anarchy is something you do not something you are.\n\nIf all an-coms had the same perspective as you on this consept, then an-com and an-cap could easily co-exist. We litteraly want the same thing - freedom. Unfortunently many an-coms don't respect the consept of ownership of your own labour, hence they will not achknowledge private property. Some people goes so far as to say that a stock-pile of fish that you smoked and stocked for the winter is common property because you cannot own an animal (fish). So they would feel entitled to take this fish from you.\n\nI agree that anarchist is something you are, however, it is also something you get put in jail for. Hence we do need some sort of social change.",
				"added": 1484173888
			},
			{
				"comment_id": 23,
				"body": "> [thisweb11](#comment_246_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): You cant make profit from fair exchange.\n\nOf course you can. That is the most stupid thing I have ever heard.\nEdit: Basically what you said is that your time is of no value. That might be true for you, but certainly not for me.",
				"added": 1484173976
			},
			{
				"comment_id": 25,
				"body": "> [thisweb11](#comment_249_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): They wouldn’t feel entitled to take the fish from them, unless the person who had the fish had more than he needed (was keeping for profit) and the person taking it was hungry.\n\nAnd who would be the judge that said that he had more than he needed? Maybe he was hoarding for a cold winter. Maybe he is expecting twins. Nobody knows, that's why we have and need property rights. Even the simplest lifeforms have property rights - and a pecking order. You say it's unnatural but nature disagree.\n\n> [thisweb11](#comment_250_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): If you made a profit it wasn’t fair.  You sold it for more than it was worth to you. You exploited someone and didnt need to. Thats unfair.\n\nNo. Investing time in building or providing other people with something they want has a value. The seller sets the lower bound of the value and the buyer sets the upper bound. The price is anywhere in between. Nobody was exploited, the deal was voulentry. They could choose not to buy it, but they wanted it for that price, hence that's what the customer thought it was worth. If the customer didn't think it was worth the price but still got it, then either he's an idiot or his not being honest.\n\n> [thisweb11](#comment_251_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): My time has no financial value.  It has social value.  That's why I'm not charging you for this conversation. Lucky for you, otherwise with my enourmous wealth of knowledge I'm giving away to you, you'd be bankrupted by now ;)\n\nI tend to agree. Your knowledge has no value and I would get bankrupt even if it was given to me.. Hehe..\n\n> [planespherev3](#comment_95_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Warlock sees everything as property, money, copyright, valuable time, market.\n> If this kind of guy understand that it would be better for everyone, including him, to live in a propertyless, moneyless, copyrightless, and timeless society, then everything will be okay again.\n\nNot copyright! But yes. I believe in property and money (real money, not fiat currency). My time has value. I'm exchanging my time for something that I later can exchange for something that I cannot provide for by my self. E.g. food, clothing and electricity. I have a child and what I want more than anything in life is her security. To protect her I claim the right to own certain things. Some things that are mine and that no one can take from me just because they believe I won't have any use for it. It doesn't matter if they'll die without it. My daughter might die without it. They can buy it from me, but not take it. And I'll be the judge of what I need, and nobody else.",
				"added": 1484585130
			},
			{
				"comment_id": 30,
				"body": "> [thisweb11](#comment_257_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Well thats the thing about anacrhy we'd talk about it.  Nobodies going to make him, if he thinks he needs it and everyone else should starve thats up to him.   But he can't expect anything in return from the community.  And he isnt going to want that.  No human (like all the apes) can survive without community for long.>\n\nI agree. Then you would have people like me making their own community with free market, trade and prosperity. Your primitive culture wouldn't stand a chance. You'd be the Amish of the free world. And that's perfectly fine. I just believe that most people in your community would opt for what an-caps have instead.",
				"added": 1484641102
			},
			{
				"comment_id": 31,
				"body": "> [planespherev3](#comment_99_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Tragic that you haven't understood that you need the system (guaranteed property and land), in order to defend yourself against the same system (theft: if there is no property, there is no theft).\nThat's just a rhetorical trick.\n\n> Think i believe everything is happy and pinky in this society? Everything is shit. But contrary to you, i think it's not human nature, but social organization: capitalism to name it.  And i also have strong stuff to defend myself and to survive in case of a chaotic crisis. \n> However, in the primitive tribe, no one had to defend against each other. If your fellow human is your brother and not your rival or your enemy, then you can count on him instead of protecting yourself against him. Property, hierarchy and work are some sort of contagious mental diseases transmitted through generations. \n\nThat's our mindset too. an-caps and an-coms aren't that different.\n\n> But heh, i'm not naive, i know anarcho communism isn't for tomorrow. If one day i'm a centenarian, i might just see it. Many things can happen in between, and they could be not pretty.\n\nI believe we will see freedom too, but the road will be pretty bad. Technology will set us free. Like scum floats to the surface, so will their lies. People of bad conscience will stand up and tell people what's happening behind the scenes, just like Manning and Snowden. People will loose their faith in the system, and the power that be will respond in the only way they know - by tightening the grip. This tightening will just reinforce peoples vanishing faith, and civil war will break out. I don't want civil war and I hope it doesn't come to that. Unfortunately I believe people have been conditioned to believe that civil war is the only solution, when in fact just stop paying taxes and ignoring and rejecting the established system will be much more damaging.",
				"added": 1484641745
			},
			{
				"comment_id": 33,
				"body": "> [planespherev3](#comment_102_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Trade is obsolete. \n> Post scarcity society is the future. \n> When in 10 years from now, there will be a full open source, and open hardware smartphone, made with almost nothing from 3D printers, who will be the retard, the one with such a device, or the stupid fuck who spend half his wage to buy an iphone 18?\n> Scarcity is what make people steal and commit crimes. And the most stupid thing is that scarcity is mostly in our head. Is an iphone scarce? Yes. Should it be? Is it worth it? No: there are smartphones which do the exact same thing for only 1/10th of the price. There is real scarcity, sure, but mostly it's in our head.\n\nThat's why communism comes short. You are dictators and you care not about what people want, only what you want people to want. \"Nobody needs an iPhone! You are stupid fucks! This Nokia from 1997 can perform phone calls just like an iPhone. You do not need an iPhone!\"\n\nAnd there will most certainly not be a printable open hardware phone in 10 years. And probably I would still pay for a good phone, than to build my own. Why? Because I WANT to. I don't want a printed brick. I want a smooth sexy and sleek phone that I can buy with instant gratification. Not something I have to tinker with and spend time producing and fixing.\n\nBut I agree to some extent regarding scarcity. Scarcity is forced by the state. There would be perfect iPhone copies in a free market economy, so people could get an iPhone for half the price. And TONNS of people would pay for a good looking, neat, smooth phone instead of printing a phone.\n\nScarcity is not always why people commit crimes. People commit crimes because they are envious, poor and in some cases lazy. And some people are just bat-shit crazy and steal for the thrill. But yes, people would steal less if people had everything they wanted. But I don't see that as realistic any time soon.",
				"added": 1484659038
			},
			{
				"comment_id": 37,
				"body": "> [thisweb11](#comment_265_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM):  As I , a communist anarchist would have solidarity and honour  with the community, it would be mutually very good for all of us, ... <cut> ... We only work shit jobs because we are punished and brutalised by capital if we don't.\n\nNo. That's it not true. A big difference between an-cap and an-com is that an-cap is universally over almost all countries not legal. (Not paying taxes.) Where as for an-com there are literally several tens of countries where they tax profits specifically. Since you only do trade, live without money and do not have profit you could live your an-com life if you wanted to. In many countries there are very cheap real-estate as well, but yes. You need to invest a buy-in to get a real-estate. But from there, you could grow your food and live in peace. Legally.\n\nBut you aren't. You know why? Because you want what we have. You wouldn't have electricity. You wouldn't have internet. You wouldn't have cars. Because ultimately you are also selfish, but you are pretending you are not. You want everything that the market provide, but you don't want money.\n\nJust know that there are several places on earth where it is allowed to live an-com. You just don't want to.",
				"added": 1484734605
			},
			{
				"comment_id": 38,
				"body": "double post",
				"added": 1484734618
			},
			{
				"comment_id": 41,
				"body": "> [jjg](#comment_1_1AfMv5MuNfa3BfmdsvGiHn9fnrEsCwxhhC): The thing is, you probably can't afford that sexy phone, not if you don't subsidize it with slavery.\n> So the question is, do you want to live in a world of free people with reasonable things, or do you want to have fancy things and tolerate slavery and human exploitation?\n\nI don't buy that argument. In a true free market products will be produced as cheap as technological possible at that time. It optimizes production. You cannot say the same because you don't have the same incentive to improve the production.\n\n> The fact of the matter is that you don't have to give up nice things in exchange for freedom, at least not forever.  \n\nNo, to the contrary. In a free market nice things will become much cheaper.",
				"added": 1484815151
			},
			{
				"comment_id": 42,
				"body": "> [planespherev3](#comment_109_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): God dammit it feels good to know we are a majority here, even if it is in one of the furthest place possible of mainstream internet. I hope 60 years from now, most people on this planet will think like this. \n\nI'm confident in my belief system. I don't need reassurance from others. ;)\n\n> [planespherev3](#comment_109_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): \n>  I'm absolutely not miserable if i have a 20 euro watch, a 60 euro smartphone and a 70 euro jacket. People mostly judge you on on your social skills, not your belongings anyway.\n\nThat is factually wrong. People judge a person in less than 10 seconds. Your appearance means everything. Obviously once you get a deeper connection with a person, they will learn who you are and judge you by ethics and what not. But appearance means more than you think.",
				"added": 1484815319
			},
			{
				"comment_id": 44,
				"body": "> [binero](#comment_202_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): In a true free market there is no attention to important things like climate change. It also opens up the way for deceit and lies. Who regulates the food is healthy? At least with communism, bussiness interests are aligned with public interest, in capitalism this is not the case.\n> You'll probably use the argument that with capitalism your personal interest is aligned with other people their interest, but that's only superfically true. Your interests are aligned with what other people think is in their interest.\n\nNo. I agree. But people are selfish. Even if you pretend not to be, you cannot make 7 billion people live in harmony. I'm being realistic. Try playing prisoners dilemma with 7 billion participants. I ain't gonna work out for you. So we have to make the best of it.\n\nThe world is fucked anyway. (And since people here cannot differentiate between my opinion and the an-cap philosophy, I will emphasise that this is my opinion.) The problem with earth today is that there are 7 billion people - and growing. This is not sustainable, no matter what you will happen to believe. Global warming is a problem because we are 7 billion people. Inequality is a problem because we are 7 billion people. Private jets are a problem because we are 7 billion people. Deforestation is a problem because we are 7 billion people.\n\nIf we were 1 million people non of this would be a problem. We have to make the best of the situation. We cannot force 7 billion people to behave in the altruistic good. That cannot be achieved without total tyranny. Communists will make exactly the same decisions as capitalists. Ultimately, a communist will chop down the forest if he believes it increases his likelihood of his and his offsprings long term survival.",
				"added": 1484825541
			},
			{
				"comment_id": 46,
				"body": "> [thisweb11](#comment_271_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): No.  This is crap.  Anarchists cant escape the system because the people who own the resources have guns. Even though they can still act as anarchists (and also many do do this).   Its not selfish to want to not die or go to prison.  Its hard! Anarchists dont need capitalists, its just that capitalists fight anarchists who want to try living without them because they demand everywhere on earth is private property.  And it is.  Every square inch of it is claimed by a capitalist somewhere backed by men with a lot of power and guns.  Even the trenches in the ocean.  Its the capitalists that are selfish.   I mean YES of course i could probably live in the gobi desert as an an com as long as I avoid the state, but yeh, I DONT WANT TO.  I want to live near water and resources.  There are no places where an coms can live , legally (according to capitalist law) , that have these without having to fight oppressive stae and corporate forces. .  And many do fight. Some are serving long time in prison for it right now.    By your own logic you have manegaed to say anarchists are selfish if they try AND  selfish if they dont!  Youi can't have it both ways!\n\nIt's beyond my comprehension why I keep debating an-cap with someone who consistently assume I'm a crony-capitalist. If you knew what an-cap was, this whole paragraph would not make any sense.\n\nAnd yes. There exist places were such things exist. There are people doing it. There are people living these lives. Just do some research. Many eco-villages are, for instance, similar to an-com in their very nature.\n\n\n> [thisweb11](#comment_276_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Not one of these is true.  Of the 7 billion people, most (around 70%) are extremnely poor and consume and polute  way way way less than fat rich people in the top 30%.  They have very little land, food, energy source or water, dont drive cars,  don't fly and consume little meat.  All the problems you listed are because the top of the capitalist pyramid produces and consumes to excess.   eg, deforestation in Brazil occurs to produce cattle farms to make Big Macs.  Only a fraction of the worlds population has ever eaten at mcdonalds.    Increased population growth WILL of course be a problem on a finite planet.  But as it stands, there is more than enough to go around.   We just don't want to share it.  And raising the standard of living for people reduces population growth.    As has been shown in almost every wealthy country in the world (exceptions being those that don't allow contraception or are extremely oppressive to women)\n\nThat's exactly my point. Private jets isn't a problem in and of it self. It's a problem when many people wants that lifestyle. And just like you said in the previous paragraph, the earth can't take 7 billion people, because I DONT WANT TO live like the poorest 1 billion. The earth can take 7 billion people if everybody has the standard of living that the bottom 1 billion has. But I want to live with the standard of living that I have now. If everybody wants my standard of living, we can't have 7 billion people. It's as simple as that.",
				"added": 1485185907
			},
			{
				"comment_id": 47,
				"body": "> [planespherev3](#comment_119_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): fusion reactor\n\nObviously fusion energy totally changes the ballgame. I agree that with fusion energy we can have plenty more than 7 billion. Thorium energy, if successfull, I guess could sustain many billion for a while, but then we HAVE to make fusion work, because even though thorium is abundant, it's still finite. Water on the other hand. Also finite, but not nearly as finite.",
				"added": 1485208725
			},
			{
				"comment_id": 48,
				"body": "> [thisweb11](#comment_281_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Of course i don't know what Anarcho Capitalism  is .  Nobody does.  Because it cant possibly exist as described by you or any other an-caps..  Its an oxymoron.   One part of the word negates the other.\n\nNo. Spoon-feed me the reasoning, because in no way is that an oxymoron.\n\n\n> [thisweb11](#comment_282_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): OK so why are you complaining they dont do it?  You dont make any sense. \n\nComplaining they don't do what? I'm not complaining. I'm happy for them. I'm telling you that you can be an an-com today if you want to. But you don't. Only in the comfort of your current environment will you be an an-com. You're not a pioneer. You are waiting for someone to do the dirty work for you. Typical an-com philosophy in other words.\n\n > No the earth can take 7 billion where everyone has a good standard of living that isnt excssive.  Food, housing, edcuation an healthcare.  But I'm sure you have done all the sums to prove we cant.  So go ahead.\n\nThe burdon of proof is in your hands. Only 1 billion of the 7 billon live in my luxury today and nature is suffering. Feel free to enlightenme how we will raise the standard of living for 6 billion people to my level of luxury AND preserve nature WITH the current technology.\n\n(In before: Abolish capitalism.. Yadda yadda. Come up with a better answer than that)",
				"added": 1485209069
			},
			{
				"comment_id": 50,
				"body": "> [planespherev3](#comment_122_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): History never serve the same dish up again. An-cap was a state of development of capitalism, a previous version of it, but still the same system. It exist in the free cities in medieval times and in the far west. I won't even question the value of this system (however regarding the far west there is lot's of criticism to make). It won't happen again, since capitalism move forward, never backward. And forward, there is no an-com, but ultra-liberalism, were you can buy children and be obliged to be euthanized when you're not productive anymore. The only way to stop capitalism isn't to go backward, but to fight capitalism upstream, before it's new evolutions happen. \n\nThat wasn't an explanation why an-cap is an oxymoron.\n\n> \n> You can be ancom if you join one of the many anarchist communities around the world, but the standard of living is poor. What's more, if one do so, he is not really fighting capitalism, but fleeing it. \n> An-com is something which will need the global social conscience to wake up, and choose an other path. \n> \nHow do you propose fighting capitalism, wake up the global social conscience AND streer them into an-com while at the same time stay true to the an-com ideals?",
				"added": 1485249688
			},
			{
				"comment_id": 55,
				"body": "> [planespherev3](#comment_124_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Easy, doing what i'm doing here, and IRL. Even the stupidest will understand (see what i mean in some areas of the world...). Only it will take a lot of time. \n> Capitalism succeed in totally discrediting communism during the last decades, systematically assimilating to bolshevism, or even more stupidly: Stalin. It worked perfectly. \n> With the net, it's not possible to make such bashing successful again. Information isn't vertical but horizontal.\n\nSo did Soviet on the free market. The disinformation continues to this day - from both sides. I agree 100% with information. From what I've read I've come to the conclusion that an-cap is true freedom. You have come to the conclusion that an-com is. One side will never manage to convince 100% of the people, so we have to find a way to agree to disagree and co-exist.",
				"added": 1485266694
			},
			{
				"comment_id": 57,
				"body": "> [planespherev3](#comment_128_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Well do your an-cap, see that it's not true freedom (you'll have hierarchy, money, class struggle, delegation of power).\n> Then you'll come to your senses.\n> Sometime, the only way to understand that an ideology isn't what it promised to be, is to try it.\n\nThen you and I have different view of what freedom is.\nI would love to try an-cap, an luckily I will. We're getting there. It's inevitable.",
				"added": 1485267796
			},
			{
				"comment_id": 59,
				"body": "> [binero](#comment_207_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): What's the difference between not being allowed to do something, or not being able to afford something, and being inable to generate sufficient funds? They both are not freedom. \nIn your opinion.\n\n> How does anarcho-capitalism prevent things like slavery? When there are no regulations, you get slavery. Look at Africa or South East Asia. Lack of regulations creates inequality and eventually slavery. At least a communist can argue in their system there is no incentive to be a slave master.\n\nWell, if we're talking philosophically here, then by definition they wouldn't be an-caps, since they would enforce people to do something against their will.\n\n> [thisweb11](#comment_286_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): really?   I see zero progress.  Because it can never exist!   can you give me an example of anarcho capitalism in action.\n\nNah. I don't care about you. You're a bad debater and I'm wasting to much time on you. You're just throwing strawmans at me and I'm tired of tackling them.",
				"added": 1485295885
			},
			{
				"comment_id": 60,
				"body": "> [planespherev3](#comment_130_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): \n> However, in the end of an-cap, there is an-com.\n\nI'm tempted to agree. Because with a true free market we will have good products, that will last longer and be much cheaper. I believe almost everyone will be provided for, and the consumerism we see today will fade away. Eventually people will have everything they need. People have for instance almost stopped purchasing new computers because they last so long and most people don't generally need more computing power. Only a few groups of people need state of the art. When people no longer have to buy stuff, they can work less and spend more time with their family. And small communities resembling an-com will emerge where people print stuff they need and you have local handy-men fixing stuff. But I still believe their will be money. People will work. People will buy food, etc.",
				"added": 1485296467
			},
			{
				"comment_id": 61,
				"body": "> [thisweb11](#comment_288_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): \n> Nah.  You just can't. Ive been asking this since the start of our debate.  You have always side stepped it.    And every question you don't like you flag as straw man.   C'mon man. Play fair.\n\nNo. The difference between you and planesphere is that he assumes that the consept of an-cap is a real thing. You just plain out reject it. Saying it can never exist. Saying it's the same as crony-capitalism. Saying it's an oxymoron. You don't acknowledge. He doesn't support it, but at least he is being productive. You are not.\n\nLook at it this way. Let's say we were discussing artificial intelligence and we discussed the potential of love between robot and man. You'd be the guy that would just keep on repeting \"No, it's impossible because computers can't feel\". It's extremly unproductive, and it's wasting my time.\n\n> [thisweb11](#comment_289_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): I'm glad youve changed your tune.  You were telling planesphere people will always want the latest/newest/best iphone computers a few days ago.\n\nNo. I said many people wanted something that looked good, that they could buy with instant gratification and didn't have to tinker with. Also people want to decide for them selves what they wanted, and not having someone else tell them that they didn't need a phone that looked good because looks didn't serve any purpose.\n\nSee? All you do is twist my words, assume shit about me and an-caps, and throw shit around. Thanks for illustrating the point. Good night.",
				"added": 1485297368
			}
		],
		"2_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG": [
			{
				"comment_id": 4,
				"body": "> [thisweb11](#comment_189_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): The capitralists would love a more libertarian world.\n\nAbsolutley not. That is, if you refer to capitalists like most media is, then absolutley not. If you refer to capitalist as free market capitalists, then yes.\n\nCapitalists, as we know it through media, are actually fascists, where they love the merging between the corporations and state. That means that they can use the full force of the state to enforce their will for their profit. With minimal state that is no longer the case. Heck, they wouldn't even have copyrights protecting their intelectual property.\n\nNo, capitalists wants more government, as is vividly apparent with the raise of TISA/TPP/TTIP. They want to set the rule though a corporate judge and then enforce the ruling with state force. This would be demolished in a more libertarian world.",
				"added": 1483896831
			},
			{
				"comment_id": 12,
				"body": "> [thisweb11](#comment_228_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Did you hear how warlock describes wage labour on the anarchist thread : a choice made by idiots. But it is capitalists who promote it! How do they square asking people to be idots so they can make a profit and then asking these idiots not to be idiots - its the very definition of cognitive dissonance - and exactly why exploitation happens.\n\nListen. People can be exploited because they let them selves be exploited. People are idiots because they buy shit they can't afford and are forced into a job that doesn't value them. And then they look for more government to solve the problem, when in fact it's government that cause the problems in the first place.\n\nIf people weren't desperate, something they are because they live beyond their means, they wouldn't be forced to take underpaying jobs. In a free-market economy skilled, smart and unworried employees are valued because they performe miles better than someone who walks about worring about getting food on the table. That's what a job used to be like before governments came and fucked it up. In a free market the job owners usually (as a rule) genuinley care about their employees. But there are exceptions. And you are an idiot if you work for them. That's my point.",
				"added": 1483914198
			},
			{
				"comment_id": 16,
				"body": "> [planespherev3](#comment_87_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): It's possible, but i'm not interested in a society based on money and a working class/ owners of the means of production duality.  I don't like it. I want to see in others fellow humans, and not other pieces of a gigantic machinery, were pieces are separated according to their importance for the functioning of this gigantic machinery.\n\nMoney is not evil and posess no magic enslavement power. Money is a means of exchange, and prioritize your time/resources. Just because the state enforced fiat currency is a bad thing, doesn't mean that the concept of money is bad too.\n\nImange that you don't know how to fish but you're a damn good hunter. If you shoot a bird you would have to search for a cod-fisher that happens to want a deer-beef. That's a huge waste of time. In stead you can find anyone who is interested in a deer-beef, exchange it for gold, and then find any cod-fisher and exchange gold for cod. It's an invetion to simplify trade, just like the wheel simplify cargo.\n\n>  But i understand why a warlock could like it. Sorcery is about taking life force from others after all.\n\nHehe, touche. ;)",
				"added": 1483918770
			},
			{
				"comment_id": 17,
				"body": "> [warlock](#comment_16_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): \n> Imange that you don't know how to fish but you're a damn good hunter. If you shoot a bird you would have to search for a cod-fisher that happens to want a deer-beef.\nIf you shoot a deer*\n\nI miss an editing function here.",
				"added": 1483920368
			},
			{
				"comment_id": 18,
				"body": "> [planespherev3](#comment_88_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): \n> PS: about the editing function, check the little pen which appear if you put your mouse on it at 7 o'clock of your name written on the post you want to edit. It doesn't appear on some web-browser (some bug i don't know) , but on firefox it should work. See? I even help some admirers of the horned god like you. Oh, and this has nothing to do with the subject, but in the end, he'll loose. Just succeed to take some losers with him.\n\nThanks! I don't have such a pen, but will investigate further at some point maybe.\nThe down side of chat forums is that emotions are hard to convey. I know I can come of as angry or irritable, but I'm not. Thanks for showing you can separate our disagreement and humanity. I appreciate that.\n\nedit: Oh, and I found the pen. Awesome.",
				"added": 1484049420
			},
			{
				"comment_id": 19,
				"body": "> [thisweb11](#comment_230_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): But I think their 'idiocy' is created by capitalist force (threat of violence)  as you say yourself.  They are forced into jobs.\n\nI wholeheartedly disagree. True free-market capitalists use voulentary contracts. Threat of violence is fascist, and by definition something else than capitalists. They are not forced into jobs by employers. They are forced into jobs because they take stupid decisions. I believe that once the government stop treating people like babies and stop protecting corporations a new generations will raise to become street-smart and understands when they are about to be conned, tricked and decieved. Hence they will take better decisions, and become free.\n\n> [thisweb11](#comment_231_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): jesus man!   What if people arent smart?  What if they are stupid or uneducated or mentally disabled or whatever.  What will you do for them?  Make them cut down your trees?  What if they can't work?\n\nI believe the true root to this problem is that feminism forced mothers into the labour force to become \"free\". God knows how they managed to pull that magic trick off. \"Freedom is slavery\". Jesus the world is Orwellian. Anyway, I think you will agree that we have lost our humanity, friendships are becoming shallow and families are being split. When people once again are free, families and friends will take care of those in the need, but people need to be free to have the energy to take care of others. You cannot take care of others before you can take care of your self. Besides, a close relative of mine actually worked as a manager for a company that employed mentally and physically challanged people. Obviously their salary was low, but they were having a real job. This job ment the world to them. (Even though you would say they were exploited.) For the first time in their life they felt usefull and that they had a purpose. They didn't feel exploited and my relative didn't want to exploit them, he wanted to give them normal lives.\n\n> [thisweb11](#comment_233_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): But capitalism has nothing to do with that.  It is about exploiting and STEALING money (profit).   Its not about fair exchange.  Whether thats paying 10 deer for 1 rotten fish and a black eye or  paying $10 for $100 worth of production and a threat to reposess your home.\n\nYou are talking about crony-capitalism. That is something that cannot exist without protection of the state violence. A free market (REAL capitalism) is not about stealing. Profit and stealing are two completely different things, and I don't know why you confuse them. Nothing has han absolute value. All values are relative. If you think that a house is worth $10 and the seller think it is worth $5, then the seller didn't steal $5 from you just because you paid $10. You VALUED the house to $10. Both parties are happy. If the buyer knew he would have sold the house for $5 he could be upset because he made a bad deal, but he still thought the house was worth $10, otherwise he wouldn't have paied $10 for the house.\n\n> [thisweb11](#comment_234_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Money isnt evil.  Profit is.\n\nI will never understand this. Profit is what innovates. If you remove the incentive of making a profit, then why should anyone invest time and resources in improving something?",
				"added": 1484050759
			},
			{
				"comment_id": 21,
				"body": "> [thisweb11](#comment_244_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): The capitalsists are fascists.   They use violence (police and courts) if you don't pay what they assert is the debt.\n\nOnce again, the state is the fascilitator. In a true free market there would be no government to corrupt.\n\n>   And I agree the patriarchy co-opted feminism to get 2 for the price of one in the workforce.   But I dont think women are the problem with family and friendships, anymore than men.  I  agree society lost its way. To capitalists who co-opted the state (because thats what all capitalists do).   So the mentally ill should have low salaries?  Why? Not treating people fair is exploitation.   Employing disabled is commendable only in a capitalist wordview.  Otherwise it should just be considered the norm.  \n\nObviously I don't believe woman are a problem. But I believe that women should be home with their children. It is my beliefe that most of the sosial problems we see today is because the children were \"rejected\" by their family and put in a kindergarden. Also they don't get the connection with their family that they are supposed to have and they don't get the love and recognition they deserve, hence they get insecure and end up like teens are today.\n\nDon't twist my words. The mentally ill (or challanged) shouldn't have lower wages because they are mentally ill (or challanged). They have because that's their market price. It's no use discussing it with you, because you don't understand (Or don't want to understand).\n\n> All profit is theft. As is property.   (Marx)\n\nThat is just the opinion of a man that lived long ago.  Its not an argument, it's just an assertion.\n\n> No, this software you are using is innoivative, like linux bittorent etc.   Profit doesnt innovate it hinders it, profit is what drove copyright and patent laws.  Capoitalists demanded them so they could increase their profits.  And innovation has stagnated for all we know wed have way more if it wasnt for such laws and profiit driven motives.  People are motivated to produce things without profit.\n\nGNU/Linux is by no means innovative. Bell labs innovated it. GNU/Linux made it available for the general public. That are two completely different things. To come up with something new is a whole different ballgame.\n\nIt's no use discussing with you anymore. I'm sorry. I'm discussing an-cap and an-com. You are discussing fascism and an-com. For this to be fair, I would have to treat you like you believe in gulags is a result of an-com and shit, but I I respect you and don't result in strawman arguments. You obviously don't respect me back.",
				"added": 1484173604
			},
			{
				"comment_id": 26,
				"body": "> [planespherev3](#comment_96_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): \n> Coming back 50 years ago? Why? I want to come back 12000 years ago. \n> Of course, you get the point. We'll come back in the past regarding our social organization: no hierarchy, no property, no work, same relationships with the children and the marital dynamics as in the primitive tribe. But of course, we'll keep the technology. \n> Humans are not supposed to be slaves, serfs, or workers. This is not our nature. We cannot be happy if we don't understand our roots, and how we are supposed to function. Humans being anarchist and communists in the beginning is not a point of view: it is a fact. Every anthropologist will confirm.\n\nI agree to this. I want exactly the same thing - but with one crucial difference. I want the ability to do exchanges. I'll become an expert in A, and you an expert in B. If we cooperate we can have much more of both A and B if I only do A and you only do B and then we exchange later. I will do the exchange in gold. This increase both of our securities.\n\nAlso I want the right to own land and to own what I create or gather. That is essential for me to secure my and my families life. With no land that I own, then my life is, once again, in the hands of others. We might have been communists way back when. It doesn't matter. It doesn't mean it's the correct way of life. We are humans and we evolve. We used to remove then skin from animals with a rock. That doesn't mean we should disregard the knife. We should embrace it. Communism is good for organizing small groups. A family or a small business. It doesn't scale to 7 billion people. It's just not possible.",
				"added": 1484585731
			},
			{
				"comment_id": 27,
				"body": "> [planespherev3](#comment_98_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Have you ever heard about the german tribes? They were communists. Lands, animals and production were shared, but they were able to fight on par with the roman empire.\n\nNo, I haven't heard of them. But it's not going to work with modern technology. It's too complex to organize super high technology without a leader. I will be convinced that communism works when I see it. When I see a self-organized crowd-funded rocket filled with 100 crowed-funded satalites launched into orbit and then land the rocket standing on a floating platform off-shore, I will convinced that communism can work in practice. E.g. never.",
				"added": 1484602561
			},
			{
				"comment_id": 28,
				"body": "> [thisweb11](#comment_255_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): I would be happy to do this.  Because this isnt capitalism - yet -  Unless you are going to give me less B than its worth for my A and take a profit so you can sell mmore lesewhere and grow your capital and power.\n> [thisweb11](#comment_256_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): That can't happen when capitalists control ALL the resources and infrastrcuture with guns. And they do control ALL of it!\n\nYeah. You're still not differentiating between crony-capitalism we have today and a free market economy. Why don't you gather all your communist and anarchist friends, wind us all up in a gulag and kill us - just to show how peacefull you are. See? Strawmen arguments goes both ways.\n\n> You can keep what you create and gather, but not the land,  that belongs to everyone.  Should they NEED it.  Nothing is yours forever or even in life.  You only have temporary use of everything.  Even the food you eat goes back into the earth.  The notion of owning land is as stupid to me as it is to a bird.  Its not that we shouldnt evolve, its that we shouldnt go insane to serve the selfish few.  Its against evolution.  Humans are destroying themselves and the entire planet.  We arent evolving, we are DEVOLVING into extinction.  And its entirely because of capitalism, greed and profit.  The world is a misserable place for most people, when it could be so much better if capitalism hadnt raised its ugly violent evil head.\n\nYes, water is wet and when we die, property is a meaningless concept. What if I also need it? Who is to determine who needs it more? What if you figured you needed my food because you were starving and as a result I couldn't feed my family?",
				"added": 1484640464
			},
			{
				"comment_id": 29,
				"body": "> [planespherev3](#comment_100_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Are you binero alter ego? He had the exact same argument (you can check in this very topic).\n> Thus i'll answer the same counter argument: have you heard of Debian organization? It's super complex, but it's organized in a democratic way. https://www.google.no/search?q=debian+organigram&client=ubuntu&hs=Yax&channel=fs&source=lnms&tbm=isch&sa=X&ved=0ahUKEwi-utjY28fRAhXBFSwKHXDtB1gQ_AUICCgB&biw=1375&bih=773#imgrc=n1t8tVNQOWSI2M%3A\nDon't know him. Debian is software so it not really complex. It just takes a lot of time, and you can do forkes and all sorts of local adjustments. This is not always the case for hardware.\n\n> [planespherev3](#comment_101_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): And about satelites, i'm not sure that we need them. With fiber optical we have all the needs in communication covered, for GPS, it can be replace with a system without satellites. https://www.extremetech.com/extreme/202111-darpa-to-re-invent-gps-navigation-without-satellitesFor weather, multiple weather stations already give a pretty accurate weather without the use of satelites.\n\nSatellites wasn't the point. Image 15 years ago when we had single core CPUs of 100 nm or whatever. They were pretty good. But, could we organically organize the people needed to get to 15 nm technology and get 16 core CPUs with the same power as a small super computer at the time? How would we distribute the CPUs? Who would get first batch and the second? Who would have to wait? Who makes these decisions? Who decides on the architecture?",
				"added": 1484640890
			},
			{
				"comment_id": 32,
				"body": "> [planespherev3](#comment_103_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS):  Instead, we have CPU with 16 core but most people don't use their potential. And most of the people who use 1000 dollars CPU to their potential are spoiled brat who play video games. \n\nThis is the big problem with \"you guys\". You decide that what is good enough for you is good enough for everyone. That is clearly not the case.\n\n>  Who would have to wait?\n> I don't care to wait a few years. My CPUs are always a few years back and it's more than enough. A 2011 AMD FX is enough for 99% of the people.  \n> In our current system, the poor don't have to wait, then don't have access to this technology. Is it better? \n> \nThe first people who buys new technology product, maybe rich or maybe just people with different priorities, takes a much bigger economical burden. They pay for the development of the product. Once they sale starts gaining momentum the synergy of higher production means cheaper unit-price, then poorer people can afford, which again increase the production and decrease the price, so the even poorer can afford. It's a very fair system. Those who get it first, pays for the development.\n\n> Direct democracy.\nYeah, may be it could work, but I doubt it.",
				"added": 1484658376
			},
			{
				"comment_id": 34,
				"body": "> [planespherev3](#comment_105_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Totally agree (however it's pretty obvious). \n> However it would be better if as a whole society we would debate and vote for the new technology to develop in the near future and then put effort toward creating it instead. Like a crowd funding but without money, just voting. \n> So i could vote for thorium reactors, which are just 100 times more important than new smartphones. If all the money invested in smarthones r and d and buyers have been used to this technology, we would already have at least 100 of these thorium reactors around the world, and many more to come.  \n> \nThat I do not believe. If thorium is so fantastic as people say it is, it would be in production already, and it is not. The reason for that is that where there is opportunity, there is money. They just presented a list of the 8 richest men on the planet. I can promise you that he who solves the problem of producing clean and sustainable energy will be on that list. So there is a lot of incentives to get thorium working, and it's still not. So I think it's several decades away, and I don't want to halt innovation in other fields while everybody is trying to get Thorium working.\n\n> In Swtizerland, although it's just a partial direct democracy, it works.\nThat's politics. I'm talking about running some sort of voluntary \"business\" where people are not paid money and were technical challenges has to be overcome with no people directly in charge. So what I thought you meant was the the people working for the business would appoint a leader that would take technical lead, for instance. That might work. But voting directly on technological alternatives, e.g. landing the rocket upright, I think will not work very well because a lot of incompetent people will be voting.",
				"added": 1484732228
			},
			{
				"comment_id": 35,
				"body": "> [thisweb11](#comment_258_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Its not a strawman argument.  Its about capitalism.  You tell me:  IS capitalism about making profit or not?  If it is, how do you collect the profit , where is it derived from, and how do you make people pay debts without force (anarchism says don't make others do things by violence )  SO if your going to be ANARCHIST Captialist how will you make people pay for things you have profiteered from (and thus, by definition, don't need). \n\nThis is just plain out bullshit. I'm not going to justify it with an answer.\n\n> Nobody NEEDS profit,\nNo. And people don't NEED a telephone. Or electricity. Or internet. Or cars. Or roads. People need water, food, shelter, sleep and sex. Everything else we want.\n\n> inless others exploit with profit. The argument is circular. Thats why 'crony' capitalism exists.  Capitalism is not reformable. Crony capitalism is the game of capitalisation.  That IS capitalism.  It can't be any other way.    Capitalism creates the need for profit because it starts making profit.  This creates greed.  Don't you get it?  \n\nNo I don't get it. Honestly. I didn't understand that argument at all.\n\n> Capitalism is capitalism! There is no exist from this,  but through anacrhy.  Google the word anarchy.  If you think capitalism is great fine.  But dont tell me you can be both a capiatlist and ancrhist.  If you can demonstrate  how thats possible do tell.  So far youve made no attempt to engage in the facts or the meanings of either of those words on their own, never mind together.   You just keep telling me how being a commie is bad and capitalism works (despite it never working and 70% of the world population living on less than a $ a day) You have no evidence of any failed anarchist societies at all (that werent brutalised by capitalists) .  You arent even a capitalist.  Never mind anarchist.   You are delusional about both.\n\nIt's a philosophy. It's a philosophy we believe will transform the planet into freedom. And you still cannot fathom the difference between crony capitalism and a free market. You just keep on repeating that they are the same, when clearly they are not. That's why I keep telling you that I will not differentiate an-com with gulags before you differentiate an-cap with the crony-capitalism that we know.",
				"added": 1484732903
			},
			{
				"comment_id": 36,
				"body": "> [thisweb11](#comment_259_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Thats pretty fucking easy.  We share.  What would you do if your mother/child/lover/friend were hungry and you had food , would you panic and arm yourself? Or would you share.     Its an absurd question.   If youre an anarchist of any stripe you should know that.  This just goes to show how you think.   Only of yourself.  Youa re no anarchist.  Anarcho capitalist or otherwise.   And in any case - under anarchy there would be more / excess resources for everyone (as there were in anarchist catalonia when they started farming and working and sharing production was at an all time high -and they worked less) , unlike now where resources are ALL owned, inneficiantly harvested, withheld and even destroyed (for profit) by a wealthy, powerful violent minority.\n\nThen why are you on the internet? The money you have paid for everything in your life you could give away for charity, because you don't NEED the internet and a computer. So, go ahead. Give it all up. Lead by example.\n\nNow, can you see the different responses you get compared to what I give to planespherev3? That's because he comes with rational arguments. All you come up with is loads of shit. \n\n\"Don't argue with an idiot. He'll drag you down to his level and beat you with experience.\"\n\nSo, don't assume anything about how I am, who I am, how I treat others, what I am and what I am not. You do not know me. You see, we an-caps see YOU as the selfish ones. You want everything to be free. Up for grabs. If somebody don't need it - it's mine. We, on the other hand, want to know what we can do for you. What can WE provide YOU? If WE don't provide OTHERS with what they want - we die. That's how we look at the world. Somebody that we can help. So please, let that sink in before you keep on telling us that we are dumb fuck selfish brutal dictators that just want to kill people if they don't give us any nasty nasty profits! I take my profits with milk and sugar in the morning. And a sigar. Cuban sigar. Oh baby.",
				"added": 1484733625
			},
			{
				"comment_id": 39,
				"body": "> [planespherev3](#comment_106_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Wrong, it exist functionnaly still the end of the 80s (THTR-300), in the form of the pebble bed reactor.\n> And it will exist again in China by the end of 2017 (HTR-PM, which is thorium fully compatible).\n> But heh, fossils fuel companies didn't want it because they were clinging to their business. That's an other flaw of capitalism, in adition of enormous wealth gap between individuals and hierarchy. At one point, powerful businesses don't do what's best even for the whole market, or for the well being of humanity, but what's best only for them.\n\nNo, that is a preposterous claim. If you really believe what you are saying there, then it mwans all capitalists in the world are cooperating on suppressing technology. That is clearly not the case. This tells me you don't understand the free market at all. Thorium is in fact the best example I can think of. If someone can make it work, then they will corner the whole energy market. They will literally rule the energy of the earth for a number of years. That's such a tremendous opportunity that any capitalist would take it, even if it meant braking allegiances.  Claiming it's a global super conspiracy is just to easy. It's just a way for you to uphold an illusion that you are being suppressed by the market.\n\n> You obsessed about rockets?\nIt represent one of the the most challenging technological endeavours of mankind.\n\n\n> [planespherev3](#comment_107_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): No. Because An-com with gulags (guess you mean bolsheviks) aren't an-com at all. They are state capitalists, or slavers, depending on the fact that you are outside or inside the gulag.\n\nExactly my point. They are not the same. They fly under the communist banner, so the comparison is fair.\n\n> What he tries to tell you is when you start to organize society with hierarchy (owners of the means of production, workers), money, delegation of power, then it's too late. Profit calls for more profit, and nothing will stop it. \n\nThat's might be true, but that's not a bad thing in my opinion. In a true free market the profit margins would be squeezed down to almost zero because of competition in the market. So the products you would buy would be produced almost as efficiently as possible. Because if there is room for doing something better and cheaper, in a free market somebody would.\n\n> You create a game, capitalism, and define the rules. Then everybody will act according to these rules, but they will always play the most agressively possible according to these rules, and sometimes (even often), they won't even respect the rules and go beyond them. That's why i believe free market will never be possible, since there will always be super rich sociopath who will do whatever they can, publicly or not,  to prevent this free market to ever happen. \n\nThat's funny. That's exactly the same reason why I believe communism wouldn't work. There will always be sociopaths who would justify that they could break the rules or that they and their friends should be more equal than others, etc. Someone would would claim their \"fair share\" of the production and then sell it for profits, trade it for goods, what ever.\n\n> However, if you completely change the game, and abolish the main rules (hierarchy, money, private property of the means of production), then there is no possibility of cheating anymore. Maybe there will  be other cheats possible, but we aren't here there.\n\nTo us it's a meaningless concept of \"cheating\". So long as everybody plays by the rule that nobody should be forced to do something against their will, then you cannot cheat either. I guess you have the same rule, otherwise it wouldn't be anarchist at all. Hence, we can co-exist. You cannot stop us from making a profit. And we will beat your game because we give people what they want, not what you determine they should have.\n\n> [planespherev3](#comment_108_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Charity exist still capitalism exist, and it doesn't really work. It's like bandages to heal a fatal wound. What we need is a system where we don't need charity. Were we don't need to take on some to give to others. \n\nThat wasn't the point. He comes with stupid strawmen arguments all the time. In the other thread he asked me why I was on zeronet. This was sort of a reference to that.\n\n> So you try to restore balance between what you have and what other have. Why not having a system were there is no balance to restore, because everything is even (at least regarding living condition, because i'm not against someone being a natural leader or someone respected  because he's competent). \n> Not everything is to be free, just the means of production to be shared. Then if you want to have your own watch or your own computer, nobody will take it from you. It's the distinction between private property and personal property. Personal property (E.G a watch, clothes, a car...), cannot be used to produce other stuff, so you can keep them.\n\nBecause communism breeds laziness. You want everybody to share everything. You even say it in this very paragraph. Share the means of production. That creates an imbalance, where people who don't contribute their fair share gets rewarded. People will see that some people are slacking but get the same thing. They determine that they shouldn't be working their ass of either. So, it's a negative spiral.\n\nMean while the free market breeds production. We are rewarded, and you might not approve of it, but generally people are motivated by a reward. People produce awesome shit, and get an awesome reward. People want the reward, but how to get it? Hard work! Obviously some people become envious, so they steal, because they feel that they are entitled to something. Because of scarcity the price is to high, they cannot afford it and they steal it. (That's why our solution to poverty is more free market, because that will lower the price of everything)\n\nAnyway, what you say doesn't make any sense. It's a contradiction. First you say that there wouldn't be envious people because everybody would have what they wanted. Then you say the means of production is shared. I guess that implies that you wouldn't just get free shit. You would have to use the means of production and produce the item, e.g. work. Well. What if people don't want to work but still want the product? They will steal! You face exactly the same problem as we do.",
				"added": 1484749045
			},
			{
				"comment_id": 45,
				"body": "> [thisweb11](#comment_278_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Ok.  So What makes a free market crony?   And how do you propose to stop that happening again?\n\nWhen it colludes with the government/state/mafia/others who initiate force and violence to make laws that it benefits from.\n\n> [thisweb11](#comment_279_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): I only make assumptions about your belief in capitalism.  (I genuinely think most capitalists would think you are wrong about it too)  The reason I use the internet is in hope to contribute to a better society for all.   As is the case with all the things I purchase and live with.  But its a straw man argument anyway.  My goal in life is perfect anarchy.  I can't create that single handedly. That doesnt mean I just wither and die instead of fighting and using the tools I have access too.   Even if they are products of capitalism.   I am a fish in a tank, I can't escape the toxic water and clean it from the outside.  And the reason I asked  why you use zeronet was because you specifically pointed out that capitalists make better innovators than open source ones.   That is not a straw man line.   Its a straight up question because unlike almost any other software, there are more capitalist social network  services than anything else.  Some belong to the largest corporations in the world.  And none of them are decentralised.  I think decentralisation of the web and blockchain tech is one of the most game changing innovations of the last decade.   And not one major software company came up with it, in fact they just didnt want it.   They spend more time fighting it than embracing it.  As they have with torrent software.  Thats the problem with profit.  It hinders innovation.   If microsoft had of invented bitcoin, it would never be allowed to exist.\n\nJust because I said the free market are better innovators, doesn't mean that they will have all the inventions, duh. And I don't understand where you've got it from that I don't want open source stuff like GNU/Linux and zeronet. I love these projects. I've never said that I don't want to use something that does not come from the market. The point I'm trying to make all along (\"try\". Obviously I fail) is that we have so much in common. We want freedom from oppression. It's just that I also believe that we cannot have freedom without the free market, because then it wouldn't be freedom at all.\n\nMy Major point is here: *If we have anarchy we have the right to engage in voluntary contracts. If I cannot conduct business with somebody else, then it is because it is enforced by someone. Hence, I would have a ruler, and there would by definition be no anarchy.\n\nWe literally want the same thing, but you are more focused on the social aspect and we are focused on business aspect.\n\n> [planespherev3](#comment_118_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Would you please shut up and read the wikipedia page about the THTR-300? (not for the current debate, but because i'm sick that not enough people know about this):\n> https://en.wikipedia.org/wiki/THTR-300\n\nYes. I never questioned that it would work. I didn't know they had a working production facility that many years ago. I fail to see your point though. Is that they need a non-renewable source that comes as a by-product of petroleum industry for cooling? (Helium) Is it that it wasn't financially viable?\n\n> [thisweb11](#comment_280_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): And, warlock, this is a fine  example of how capitalism stifles innovation to protect profits of those with powerful interests (oil and gas).  Thorium is less profitable than oil/gas because oil and gas is in limited supply. \n\nNo. Absolutely not. I've explained it already that in a true free market there would be no conspiracy to undermine the market. The reason is that someone would realize that if they broke the bond (between the co-conspirators) they would be richer than if they kept the bond. In fact, it's a prisoners dilemma with a well known strategy - you should defect.\n\nAlso it's not more profitable because it's limited supply. That doesn't make any sense. By the same logic Thorium energy would be almost free of charge because it's so abundant and all sold energy would be profit since there is practically no cost of mining thorium. It's more profitable because\n1) it is what people want. People can't fuel their car with thorium - yet. \n2) The process of converting petrochemicals to energy is much simpler because it relies on electromagnetism which is orders of magnitude simpler than dealing with, and taming, the electroweak iteration.\n\n> And is exactly why profit and capitalism can't ever solve the worlds problems. \nI agree that the free market may not work as well for solving climate problems. On the other hand - I don't believe it can be solved. Because as I've already mentioned somewhere. You cannot force 7 billion people to comply without total tyranny.\n\n> The reason you arent using Microsoft or google decentralised web platform right now isnt because its not a great invention, its because its not profitable.  They can't control the market, access or supply of data.   Same goes for so much technology when left to capitalism. The motivations of profit conflict with the motivations of what people actually want.  Advertising is needed to train us to want what they are selling, and to give up on our imaginations and innate desires, to tell us they are fantasies and that only they have the solutions you can purchase for just 10 dollars eaches. \n\nThe beautiful thing about anarchy (with free market) is that people like you and other hacker spaces would create a search-engine that was just as good as google, but on that didn't have advertisement. So people could chose from which service they wanted. The reason why people cannot do it today is because google be some sort of magic \"owns\" the algorithm. It's absurd. Google wouldn't be in the position it has today in a free market - that is what you people don't understand.\n\n> Warlock you should read DrSeuss's The Sneeches if you havnt already.  Its for children so should be accessible to you : the tale demonstrates a blindinlgy obvious problem with capitalism. Its not just about the state and power and control of resources (which is still a major issue) .  But about manipulating peoples desires.   And the idea you said:  that nice clothes and the latest smartphone are good things and the reason we need capitalism is because you  are a foolish star belly sneech.   But dont worry you are in for a good ending.   Don't forget the frankfurters.\n\nNo thanks. I don't buy in to moralistic propaganda. It's unbearable.",
				"added": 1485185354
			},
			{
				"comment_id": 51,
				"body": "> [planespherev3](#comment_120_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): The irony is that now in the USA they want to replace the coal power station boilers with this technology, mostly because the Chinese are using it. So they don't use the stuff since it's the best technology (the concept was invented in 1947 if i remember), but because they don't have any other choice left, since the competition (China), is using it.\n\nYou're starting to get it. THIS is what you'll have under a free-market and what I've been trying to explain to you. Remove the governments and somebody will understand that if they can make Thorium work, they will corner the energy market and oil will be history.\n\n> Petrodollars, which are a consequence of the capitalism system, has strongly something to do with it in my opinion. If there was already 100 reactors of this kind around the world, and many more to come, oil value, thus the dollar value (which is linked to oil since all oil transactions are made in dollars), would already have significantly decreased. \n\nNo. Petrodollars is a consequence of politics.",
				"added": 1485250293
			},
			{
				"comment_id": 53,
				"body": "> [planespherev3](#comment_123_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Okay then, just answer me a simple question:\n> In An-cap, How do you enforce a contract without a state?\n> I checked: dispute resolution organization (DRO), and it doesn't convince me at all.\n> These dispute resolution organization will never have the full strength and (false, but still) legitimacy of the state. What's more, it is suggested (https://en.wikipedia.org/wiki/Dispute_resolution_organization) that there would be many of such firm competing with each other in a free market. Then what happen if some don't like one organization and doesn't respect it's mediation or personal protection? If more and more were to place their trust in one dispute resolution organization, and others in an other one? \n\nI never said it was perfect, but an-cap is the closest thing to freedom that I can think of. Some contracts will be voided and you will take a loss, for sure. That is also the case today, and that will also be the case for an-com. Signing a contract is inherently risky, but you can gain great benefits and rewards. \n\nYou don't have to be convinced. I believe it will work. If you don't believe it then that's fine. David Friedman, how thought out something similar, is not even 100% sure it will work - but he said he believed it would. Btw, the old stock-exchanges were similar to DROs. If a company didn't fulfil their obligation, they were kicked out of the stock exchange. It has been tested small scale and it worked.\n\n> What if all the people behind one DRO decide that the other ones are not legitimate anymore? What happen then? Civil war. \n\nOne DRO can't decide the other ones are not legitimate. The market makes that judgement. And it's not a given that it will be civil war. That's your assumption.\n\nWith that said, we ultimately have to find a way to deal with violence as well. Even though we have the non-aggression principle, some will not follow it. The same is true for an-com. You seem to be making the assumption that if just everybody could realize what you have realized, then there would be peace on earth. Similarly you assume that in every other case than an-com, there will be war, killing and crime.\n\n\n> One other issue is that even if DRO work, it could end like being some state. So instead of having a public state, you'll have one, or many, private states. Isn't that even worse?\n\nThat depends on what you define to be a \"state\". David Freidman suggested something similar to DROs, that one can have laws in the same manner as one has \"insurance\" policies today. If you sign a contract with this company, they will protect you but only if you follow their laws. If you do not follow their laws, you are not protected. Then in principle you can choose what laws you want to follow depending on what company you choose. Disputes between people will then be settled between the different companies.\n\nThe reason why I entered the discussion in the first place was to see if I could find some common ground. Because ultimately, if states can be overcome then we have to find a way to co-exist. There simply isn't any other way. We can't convince all of you to join us, and you can't convince all of us to join you.",
				"added": 1485265668
			},
			{
				"comment_id": 56,
				"body": "> [planespherev3](#comment_127_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): There is no such things as contracts in an-com.\n\nThat's just a cheap rhetorical trick. Obviously you don't have contracts since that is a legal term. Having a fruitful conversation would be a lot easier without you wasting time on trivialities. You are not dumb and I am certain you understood my point. But since I'm not 100 positive: How will you share the means of production without agreements? And what if agreements aren't met? \n\n \n> Without property, money, hierarchy, and on the condition that there is no human antagonisms left, i don't see the reasons for war, killing and crime (except sexual crimes).\n\nIf that is the case, then why aren't we still in communist utopia? What happened. You said that people used to live an-com, and that if people live an-com there will be no antagonism and no reason to commit \"crimes\". Yet we live in a world of hurt. That doesn't make any sense at all. You are obviously wrong.",
				"added": 1485267635
			},
			{
				"comment_id": 62,
				"body": "> [thisweb11](#comment_291_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): \n> I give up trying to reply to your other points. \n\nThank you. Your complete lack of understand of economics makes it very difficult to have a fruitful conversation.",
				"added": 1485335931
			},
			{
				"comment_id": 64,
				"body": "> [thisweb11](#comment_302_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): You said the rarity of something (eg Gold or Bird's Nest soup)  has nothing to do with its price.   I'm sorry but it  is very basic economics to me that it does.\n\nExactly. It's basic economic yet still you fail.\n\nI've got a rock. It came with a certificate, and I bought it by a well renowned supplier in a well known place for space debree. Chemical analysis showes that it's from a well known asteroid in the kuiper belt. There is only a few kg on the entire planet, yet still I had the financial assets to buy several grams. It is EXTREMELY rear. Yet I own a huge fraction of the available quantity.\n\nHow can that be?\n\n(Spoiler: In economics you have supply AND you have demand. The demand for asteroids is very limited. When there is low demand, the price goes down.)\n\nMy point is: go back to Econ101. You need it.",
				"added": 1485380068
			},
			{
				"comment_id": 68,
				"body": "> [thisweb11](#comment_328_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Right but i was talking about oil.   So demand was  a given.  People have always wanted oil. Or are you saying nobody need oil now aswell.  But just to be clear:  The price of oil has been going up over the last decades.  This is because of its scarcity and because it is in demand.  Which of these were you denying causes the price rise?\n\nNo. We were talking about how a global conspiracy do not invest in Thorium energy because the profit is higher in oil/gass energy where you claimed that oil/gass is more profitable because of limited supply. Later you reinforced the nonsensiacal claim by adding that everybody wants electricity, but lets assume you didn't say that.\n\nAt the current oil price production is barley break even, and many oilfields even operate at a loss. This is true for oil in Europe, Russia and North America. Middle East is still special because they still have oil flowing naturally out of the ground. They have different problems though, where kings and princes claim the profits and some countries are \"bribing\" the public to compliance. This is extremly expensive.\n\nSo,\nPoint 1) You claim they only push oil because there is more profit than in Thorium. Earlier you have also claimed that profit is the only motive. If this was the case, then a significant fraction of the production in North America and Europe should be shut down for the time being because they operate at a loss.\n\nPoint 2) Oil (excluding the Middle East) is extremly complex to produce because either you have to operate wells at deep water with platforms above several hundred meters of water and then drill wells several kilometers through rocks and mountains. For North America you have to fracture rock formation to get the oil, or you have to separate tar from sand, and then produce oil from the tar which can then be refined to petroleum. The energy return of investment is at an all time low.\n\nCompare this with Thorium, and the energy is readily available. The cost of producing Thorium could easily be approximatley free because of its abundance. In other words, you could basically get \"free energy\" with Thorium, given that all your claims are true. In other words, those \"nasty\" capitalists could take something that was free (Thorium), bombard it with neutrons to create energy through a nuclear chain reaction. This energy is sold for a profit. To me this is clearly a much more profitable strategy.\n\nSo basically, if Thorium is as good as you claim, then the energy return of investment should be much higher for Thorium because of its abundance. If all your claims are true, then this is much more profitable (sell energy where the energy carrier is almost free). It is this argument I'm saying doesn't make any sense. Other than that I say that price is determined by both supply AND demand, which is regarded as a universal axiom in economics. And once again you are twisting my words.\n\n\nWith all that said, oil is a special comodity because the supply is not determined by market forces but by an oil cartel called OPEC. You claim that OPEC is also in control of the nuclear energy market in a global conspiracy. I do not believe so.",
				"added": 1485643320
			},
			{
				"comment_id": 69,
				"body": "> [thisweb11](#comment_331_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Yes, and?  does anyone else in the world seriously disagree with this that you know of?  Of course the price of oil is profitable when there is limited supply compared to demand.  Like gold.  (hence the term black gold)\n\nThat's the point. \"Compared to demand\" is a phrase you added after your initial statement. But still it's not necessarily true. You still have the profit maximisation. Selling a huge quantity of something with a small profit for each transaction gives you the same profit as selling a small quantity with a huge profit for each transaction.\n\nThis got way out of track, so I'll go back to square one to try and sort out the confusion. My whole point has been that this statement here is a very simplistic view, and wrong:\n\n> [thisweb11](#comment_280_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): And, warlock, this is a fine  example of how capitalism stifles innovation to protect profits of those with powerful interests (oil and gas).  Thorium is less profitable than oil/gas because oil and gas is in limited supply.  Like gold and bitcoin.  The desire for profit means oil will always be heavily invested in.   The goal of oil industry isnt to find or sell more oil, but to make sure no one else does.   The last barrel of oil will be as valuable as today's 10,000 barrels.  To profitteers thats all that matters.  Its usefulness is secondary to limiting supply.  \n\nAdding some random text here to separate these two quotes of you.\n\n> You dont think everyone wants electricity?  ( By everyone I mean 99.999% of the worlds population - you seem to be  inferring some imaginary marginal group prefers not to have electricity and thus my argument is invalid because I said everyone  - that is obtuse and pedantic, and weakens your position further) \n\nOf course. You gave the impression that people didn't want oil/gass. I must have misunderstood the following statement. For that I apologize.\n\n> [thisweb11](#comment_292_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): 1)  Everyone in the world wants electricity, who said anything about fueling cars?\n\nSkip some of the paragraphs, and jump to this on:\n\n> I never said there was  a conspiracy.  They don't need one.  The laws of capitalism decide oil will be used because its more profitable than all other sources of energy.  And being limited in supply and high in demand it continues to make it so.  (there are no commercial aeroplanes that can run without oil - they dont exist, and as far as I know nobody is attempting to design one)\n\nYes. This is a misunderstanding from me. I realized it after rereading one of your comments. I apologize. ",
				"added": 1485851356
			},
			{
				"comment_id": 70,
				"body": "> [planespherev3](#comment_151_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): It depends on the words you want to use.  For example, taxi drivers around the world, are they part of a global conspiracy when they take  actions (sometime violent) against Uber? Lobbying, pressure group, conspiracy, choose your word. It's not conspiracies which made history, but history which made conspiracies.\n\nThat's a good point. Though the term conspiracy is used when the act of motive is with criminal intent. The taxi lobbying is completely legal, so per definition it is not a conspiracy.",
				"added": 1485851489
			},
			{
				"comment_id": 71,
				"body": "I realize I haven't been good to get my message across here, so I will try an summarize where I've been trying to get at.\n\nMy opinion is that if you want Thorium energy, then free-market capitalism is the best way to achieve it. The reason is simple. The first entrepreneur who can make Thorium energy work will corner the energy market. In other words, those who makes Thorium work can make the oil and gas more or less go out of business. Hence, there is a tremendous interest in the free-market to get Thorium to work! Once the technology is there to make it profitable, Thorium will come.\n\nThe profit margin per kWh for petrochemical might be higher, but the quantity of kWh for Thorium will, in the long term, far outweigh the high profit margin of petrochemicals. Especially now with the electric vehicle \"revolution\". \n\nI guess this is what I have misunderstood where I though you were saying that capitalists didn't want to invest in Thorium because they wanted the limited supply of petrochemicals to increase profits.\n\nAlternatively, Thorium might never be profitable. Then we will not have Thorium in a free-market. In this scenario I don't think the world would be a better place if we stopped using petrochemicals in favour of Thorium, even for environmental purposes. That's my opinion, and I'm sure you will disagree. ;)",
				"added": 1485853078
			},
			{
				"comment_id": 75,
				"body": "> [thisweb11](#comment_335_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Money and capitalism and free markets are the obstacle to innovation.    We can build these reactors and save the planet, but economics and the endless pursuit of profit tells us we mustn't.  Profit over people.  Thats the real definition of the free market.\n\nNope, not an obstacle to innovation.\n\nAlso, you can still build the reactors. Capitalism isn't stopping you. Governments are stopping you. And also, you would have to convince people to donate millions of dollars for the project. If people really cared, they would donate. However, people only care when it doesn't cost them a disadvantage. That's why communism will never work. With no incentive, people simply do not care.\n\nYou cannot expect a revolution and mass awakening. It will never happen. You and your peers have to build the future and make people join you. You have to live and lead by example. That's what An-Caps are doing. They actually build services that people want and like. Many of these services render the existing, sentrally planned, systems obsolete. That's why I'm confident that it will work.",
				"added": 1486239340
			},
			{
				"comment_id": 76,
				"body": "> [thisweb11](#comment_337_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Well, would you donate in your  'anarcho capitalist' society?  (because the moment you did you are just an anarchist)?\n\nOf course I would. And no, that doesn't make me \"just an anarchist\". That assumption just proves yet again that you have no understanding of An-Cap what so ever.\n\n\n> [thisweb11](#comment_338_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): The disadvantage is global warming and the destruction of the world.   Thats a pretty good incentive.  And you're deeply cynical to assume people (not just anarchists) don't care unless they get money.  Not everyone is a capitalist.  There are way more anticapitalists than there are anarchists.   There are socialists and other nations in the world who are happy to pay  more taxes for energy investment to prevent the destruction of the planet.  Not least because so many of them have children who will suffer its worse effects.  People are waking up.  Its a shame you cant see the benefits outside a free market which caused it in the first place.\n\nObviously the world is not very capitalistic at all. We are seeing stronger divisions now than before. After the financial crisis many people have come to hate capitalism. Despite that people are very anti-capitalistic and everybody want the global warming to be fixed, very few want to live by example. Very few wants a reduced standard of living so that we can work toward that goal.\n\nIn fact I tried for almost 10 years to live by example. I never bought new things. We (Me and my wife) bought our things from fleemarkets. We took the bus/train when we could. We still don't own a car. We never upgraded our technological items, unless we absolutley had to. I wore jeans and hoodies with holes in them. We had around 16-20 deg C in our living room depending on season. I showered rarley and with cold water. etc. etc. etc. I almost evangelized that the consumer-mentality people had would destroy the planet. Yet not a single person I met cared. They thought what I did was noble, but that it wasn't for them. Not ONE thought that maybe they too should take action. After 10 years I came to the conclusion that people just don't care. So I gave it up. Raised my standard of living, and haven't regretted it one day.\n\n(And no, being against the consumer mentality is not in opposition to An-Cap. If you believe so, you haven't understood An-Cap one bit.)\n\n> \n> Only if they make profit (else they would drop the capitalist part) \n> \nOf course not. Not all An-Caps want a profit. An-Caps want to be free. Some An-Caps will appear to be An-Com because they create things for free just because they want the technology to exist. Still they want the goods and service that money provide. An-Caps mean you want a free and unregulated market. \n\nBesides, we are not working for an An-Com world. We create service that will move the world toward an An-Cap world. In the process we will probably exploit \"An-Com\" technology too, like bitcoin and zeronet, who one can argue are An-Com in nature.\n\n> No because you need to do things for your own survival that are not profitable and not capitalist.  This is true for everyone.  And the most important things will make the least profit (like fixing man made climate change and sharing resources)\n\nDidin't understand this.",
				"added": 1486401986
			}
		],
		"1_13EUVTHXUNK46bs3QXB8AtJ6sxPXcSQh31": [
			{
				"comment_id": 24,
				"body": "Yeah. I got 10 bitcoin and gave it away some years ago. Just for the lulz. I'm not in the lulz anymore.",
				"added": 1484346159
			}
		],
		"1_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd": [
			{
				"comment_id": 40,
				"body": "Thoughts? Yes. Just like you're not solving the cause of the headache by taking painkillers, you are not solving antisemetism by removing the comments. Get in control of your emotions and accept that there are haters out there.\n\nBesides, you are just reinforcing their impression. If you are to succeed in censoring zeronet the haters will get even more hateful. You are giving them confirmation bias. Deal with your emotions instead of dealing with the pain. Debate them in a respectful manner, but don't feed them. That's my thought.\n\nI'll end with this:\nTo find out who rules over you, simply find out who you are not allowed to criticize.\n --Voltaire\n\nYou can be damn sure they keep this in the back of their heads.",
				"added": 1484814864
			},
			{
				"comment_id": 43,
				"body": "> [00d4n1](#comment_1_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd): You can't debate fascists in a respectful manner - they're not arguing in good faith and will not be convinced by reason. Allowing literal Nazis to air their evil on your general-purpose discussion board is feeding them, certainly far more so than not allowing such would be. It's letting their views spread and perpetuate, it's letting them gain momentum, and all the while it's alienating good people who just aren't safe in a community with no practical way to escape fascist contributors.\n\nI don't believe in censoring any opinions, no matter how much one must dislike it. Because ultimately you're not stopping their opinion. You're masquerading it. Just because you can't read it doesn't mean they don't have it. If they are undermined for a prolonged time they will eventually surface and explode in rage.\n\nJust look to Europe. It is no longer allowed to criticize muslims. Their opinion is censored everywhere. There is no airwave where people can express their opinion on muslims. There is no newspaper where one can express their opinion of muslims. The public sector and the media overall is an echo chamber. These people have no contact with the common man. These people don't even realize that people dislike the immigration policies. They don't get it because they never hear or read about it.\n\nTHAT is why fascist raise to power. Because people are still frustrated and people still talk. And they are mad as hell (and they're not gonna take it anymore). And when they are not taken seriously, they vote for Le Pen, they vote for AfD, they vote for Sweden democrats, they vote for Brexit and they vote for Trump.\n\nThe world is going to burn in a few years, and it is because of people like you who want to undermine people all the time. You are \"forbidding\" them certain thoughts. You are insulting them. Call them unintelligent. You call them deplorable. You are bullying them. All the while you are sitting on your high-horse, but you are no better than they are. You are just different.\n\nLetting them go unchallenged is the problem. You should be welcoming them. I'm not particularly talking about zeronet here. I'm talking in general. Even on national TV.",
				"added": 1484825093
			},
			{
				"comment_id": 49,
				"body": "> [00d4n1](#comment_4_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd): There's a very strong correlation between anti-Semitism and fascism. It's called the Holocaust.\n\nThat's retarded logic. This is equally valid:\nYou want to sensor the expression of a certain opinion.\nFascism also wants to sensor expression of certain opinions.\nIf follows from your statement that by implementing sensorship of certain opinions, one gains fascism, thus anti-semetism.",
				"added": 1485209449
			},
			{
				"comment_id": 54,
				"body": "> [00d4n1](#comment_6_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd): The literal goal of the most notorious and historically most powerful fascist group - the Nazi party - is ethnic cleansing. Anti-Semitism, along with every other flavour of racism and discrimination, is implicit in that goal. Censorship, while effective in furthering fascist movements, is not intrinsic nor unique to fascism and has historically served more noble purposes (for example, V-mail was subject to censorship).\n> Incidentally, I don't want to \"sensor\" (sic) any opinions. \"Pineapple on pizza is disgusting\" is an opinion. \"Black/Jewish/Muslim/[insert any identifiable social group here] people aren't human and should all be killed\" is not an opinion - it is advocating for genocide and does not deserve a platform.\n\n1a) Saying that anti-semetism is inherit in Fascism is like saying that war is inherit in western democracy, since we've been invading a new country every third-fourth year (more or less) since the early nineties.\n1b) Talking about ethnic cleansing. Lets talk about Zionism and Israeli settlements.\n2) Yes it is an opinion, most people (me included) just happen to think it's outrageous.",
				"added": 1485266342
			},
			{
				"comment_id": 58,
				"body": "> [00d4n1](#comment_8_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd): \n> Let me put it this way: genocide isn't a matter of opinion. It's bad, and that's not up for debate. It's objectively a bad thing that should not be done or advocated.\n\nLet me put it this way. I'm not a fucking idiot. The point is, it's my opinion that no opinion is better to be censored. Its universally better to deal with the opnion rather than removing it from its existence. What else should be censored? It's called slippery-slope. And we simply do not get on that \"what is it OK to censor and what is not\". Nothing, nothing, is OK to censor. That's my stand.\n\nOk. So here is the disclaimer. The owner of a website determine what goes and what doesn't. I'm perfectly fine with it. It's not our right to have outrages comments published in the news paper or the comment section. But, under no cercomstance should it be illegal to say something no matter what it might be.",
				"added": 1485294915
			},
			{
				"comment_id": 63,
				"body": "> [00d4n1](#comment_10_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd): Genocide isn't an opinion. Opinions are subjective, and people are free to have differing opinions and to talk about them. Genocide is objectively evil, and anyone claiming otherwise is objectively wrong.\n\nJust to be clear. The act of genocide is not an opinion. Advocating genocide is, per definition, a legitimate opinion. However, it's also outrageous. And yes, I agree that it is objectively wrong and objectively evil. I understand you 100%.\n\nHowever, the reason I'm critical is this. Just like you're on a mission to \"remove\" hatred, I'm on a mission to support freedom of speech, no matter what the opinions might be. That's one of the reasons why I'm running this zeronet node. The whole emergence of \"fake news\" motivates me even more, since governments are seriously discussing to remove \"fake news\" from existence. (E.g. implementing ministry of truth).\n\nI don't know where you are from, but in Europe people have a growing frustration with the established parties, most of which agree on increasing imigration of people from countries we are at (proxy) war with. This has led to the uprising of \"extremist\" parties. And at least two-three countries have tried to silence them using the slippery-slope of anti-semetism. Their logic is that in the 1930 and 1940 people expressed their hatred of jews which lead to genocide. Since people are now expressing hatred of muslims, this too will lead to genocide. This is obviously a logical fallacy.\n\nSome people in these \"extremist\" parties are obviously way across the line, but most people are decent people. I can't recall any having argued for genocide of muslims. People simply want the immigration to stop. Now, Europe wouldn't be in this situation in the first place if people were actually allowed to state their opinion, but they aren't. Just arguing of a tightening in the policy will get them labelled as \"racist\", even though they are not. They will be bullied and assaulted physically and verbally. However, this is NOT considered hate-crime, so usually there is no consequence of assaulting these people. In fact, stating their opinion was the act of hate.\n\nThis is also occurring in the US. People have almost been murdered just for voting for Trump and the justification for the violence was that the person was a racist. This is insane.\n\nThis polarizing is, in my un-humble opinion, the direct result of people being censored. The discussions have to be made, or the problem will get exponentially worse. The more immigrants that come the more people will \"cross over\", and the more traction these extremists get. This is what we get when elected officials stop listening to people, and are not hearing their voice because people might be offended if they hear something they don't like.",
				"added": 1485353072
			},
			{
				"comment_id": 65,
				"body": "> [binero](#comment_212_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): It's a tough issue though, because fake news is a serious issue. While censorship might not be the best action, something needs to be done.\n\nNot to me. To me holding an opinion doesn't change any thing. Action is what matters to me. If people believe we didn't land on the moon or people are involved in Truther movements, really doesn't matter. If only shows that there is to much secrecy.\n\nHonestly. Fake news is easy to cope with. Just have a transparent administration. But they won't. So they cannot cope with fake news, because they have to many skeletons in the closets.",
				"added": 1485420448
			}
		],
		"10_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 52,
				"body": "I disagree. Ultimately it will need a \"killer-app\". It will possibly gain in popularity with these things in place, but the optimum thing would be to make it mainstream. People in general don't really care about censorship. If they continue this crusade against \"fake news\", then maybe zeronet could become sort of a publishing platform. People could be lured in that way.\n\nAnother way would be to get the torrent search working. Many countries have started to block access to torrent search web sites. Getting a working torrent search on zeronet would also be a way of making it mainstream.\n\nBut these functions are all for nothing if zeronet is not advertised anywhere. People need to hear about it to start using it. So the zeronet team need to contact torrentfreak and have them write articles about it, and alternative news publishers to advertise where they can be found, etc.\n\nFinally, a working public gateway could also be helpful. Then people could start using it, before they decided they would want to run their own node.",
				"added": 1485250921
			}
		],
		"1_13GyWy7pXEtCorqUBAv7ZPjyzNfwMA6Hh2": [
			{
				"comment_id": 66,
				"body": "What's the problem with that?",
				"added": 1485528465
			},
			{
				"comment_id": 67,
				"body": "Indeed. I haven't noticed.",
				"added": 1485554916
			}
		],
		"1_15R9r41EsReC5cmHPrLqryHyMHVFnfjLf1": [
			{
				"comment_id": 72,
				"body": "I'm responding just to let you know that the community is not dead, but I'm to lazy to give you a rundown. Have some curiosity and explore. It makes it more fun too.",
				"added": 1485858203
			}
		],
		"1_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1": [
			{
				"comment_id": 73,
				"body": "I just wanted to see if I, as a thread owner, could start a collection of threads. And if I can delete threads. Apparently one can not.",
				"added": 1485958974
			}
		],
		"1_1PvP6Vjh8q44LhyXTiBZc4APMtyzwyttbL": [
			{
				"comment_id": 74,
				"body": "I don't really question global warming, but UN is very questionable imo. My main problem with climate change or whatever it is they are calling it these days is the profound verbal assults you will get if you are skeptical. In science one needs critics for the theory to get vigrously tested. This is not the case for climate change. However, I see first hand that things aren't as they used to, so I haven't really been questioning the whole idea.\n\nBut when I see this:\nhttp://www.investors.com/politics/editorials/climate-change-scare-tool-to-destroy-capitalism/\n\nIt gets me thinking. It would be better if it was an internal document leaked to wikileaks or something though. Just an assertion on a website I haven't heard of isn't very credible. But still it fits well with the globalists narrative.",
				"added": 1486193480
			}
		]
	},
	"comment_vote": {
		"1_1FTFKztuv4Z5uy6iS83k9hB2xtS6yFnDxx": 1,
		"131_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS": 1,
		"24_1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV": 1,
		"13_18NsJqjikBYBjwLzMVp7aBJSpqtyRSd9qF": 1
	}
}