{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"14_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": 1,
		"4_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h": 1
	},
	"next_comment_id": 6,
	"comment": {
		"14_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": [
			{
				"comment_id": 1,
				"body": "ZeroNet is wonderful tech. There's just one thing that keeps me slightly worried: a zite that I pass by might seem innocuous so I don't explicitly delete it. Maybe it was at that time and later they added illegal content - or maybe it always had illegal content and I didn't know about it. Anyways, because I would now be sharing illegal content, I'd be liable.\nI wish sharing was opt-in, rather than opt-out, and that the UI neatly displayed all files the zite has before you choose to host it.",
				"added": 1493629235
			},
			{
				"comment_id": 3,
				"body": "> [kaffie](#comment_291_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Honestly? That'd kill the whole reason ZeroNet even works in the first place. If you want a good example of your 'opt in not opt out' system, go look at KopyKate. Most of the videos people upload are inaccessible because no one can seed them properly because no one starts automatically seeding after visiting it once.\n\nMaybe. Anyways, easier auditing would be useful.",
				"added": 1493638532
			}
		],
		"1_14Knzt7E5McPxaUHrQ8nwoBhwFAPmtRzD1": [
			{
				"comment_id": 2,
				"body": "> [kaffie](#comment_280_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Wait... discord banned loli/shota? Damn internet police really hate that stuff don't they? I would ask to remove my name/banner/links from the hubs, but I like straight shota, and honestly I don't really give a damn. I'm kinda honored you cloned my hub out of all of them :3 [...]\n\nShould be noted that loli/shota is illegal in USA (18 U.S. Code ยง 1466A) and in many European countries. Discord didn't have much of a choice-",
				"added": 1493629812
			}
		],
		"1_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY": [
			{
				"comment_id": 4,
				"body": "I keep all my relevant contact details in http://127.0.0.1:43110/1FuN96E7UCDCqjSbahnH735KfaKizLbSUc/ - makes it easier to keep up-to-date :)",
				"added": 1493665298
			},
			{
				"comment_id": 5,
				"body": "> [akito](#comment_32_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY): IS the GPG valid for Retroshare?\n\nI don't use Retroshare.",
				"added": 1493705981
			}
		]
	},
	"comment_vote": {}
}