{
	"next_post_id": 7,
	"next_comment_id": 1,
	"next_follow_id": 4,
	"avatar": "jpg",
	"user_name": "Hollymolly",
	"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
	"intro": "The propaganda wars are afoot",
	"post": [
		{
			"post_id": 1,
			"date_added": 1480044365,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1480045937,
			"body": "Milo Yiannopoulos on why sunlight is the best disinfectant  https://www.youtube.com/watch?v=EFoViHzbcAE",
			"date_added": 1480045935
		},
		{
			"post_id": 1480045983,
			"body": "Trump to scrap Nasa climate research in crackdown on ‘politicized science’\nhttps://www.youtube.com/watch?v=WkREI9g84sY",
			"date_added": 1480045980
		},
		{
			"post_id": 1480046330,
			"date_added": 1480046326,
			"meta": "{\"img\":\"467,700,b63a74d74a53da5a42b84d94ba8876654753d63db7544865,001232405235044677777442746761789A14B984816967284697C28D3A13C6DAAAAEFA\"}"
		},
		{
			"post_id": 1480046437,
			"body": "From Populism to Fake News – The Psyop Continues.\n\n\n\n    Via The Daily Bell\n\n    Merkel Blames Populist Gains on Rise of ‘Fake News’ … This week Merkel blamed “fake news” in driving the rise of populism in the West. It looks like the left is just going to blame “fake news” every time they lose their grip on power. – Gateway Pundit\n\nThe elite is leveraging its “populism versus globalism” meme by declaring that populism is closely linked to “fake news.”\n\nWe’ve written numerous articles on the emergent elite meme, here and here, of “populism versus globalism” and warned that, “This meme is not only of the utmost importance, it is clearly warning us of considerable distress to come.”\n\nBut we didn’t imagine the populist propaganda concept would be turned in the direction of fake news, though that’s just what has happened – and most powerfully and suddenly.\n\nMore:\n\n    AFP reported:  German Chancellor Angela Merkel warned Wednesday against the power of fake news on social media to spur the rise of populists, after launching her campaign for a fourth term.\n\n    Speaking in parliament for the first time since her announcement Sunday that she would seek re-election next year, Merkel cautioned that public opinion was being “manipulated” on the internet.\n\nYes public opinion is being manipulated – as usual. In our view, elite controllers continued to circulate propaganda to frighten people and influence their thinking.\n\nWe call their efforts “dominant social themes” …  fear-based propaganda designed to convince people that they are running out of food, water, a stable climate, etc. The solution is inevitably more government – either domestically or globally.\n\nElite themes reinforce people’s inclination to look toward government – the bigger, the better – to protect them. The goal evidently is world domination via government that is inevitably controlled discreetly by elite forces.\n\nAs a result of Brexit and the election of Donald Trump, the elite-controlled mainstream media has lost no time in disseminating the term “populist” to describe the current rising, Western “nationalism.”\n\nIt is even beyond nationalism, of course. The entire globalist structure is being challenged because it is has continued to grow significantly – stripping people of resources and wealth.\n\nBut by defining “populism” on their terms, elites were able to create a contrasting meme – globalism – that could then be imbued with a variety of positive characteristics.\n\nGlobalism, in contrast to populism, is to be seen as positive and prosperity enhancing – and only under attack because it has not distributed its benefits equally.\n\nPopulism is presented as racist, greedy, insular and ignorant. “Fake news” is being positioned by Merkel as bothersome and dangerous because it encourages this aberrant populism.\n\nWhat’s the goal? She says so herself: Government may have to regulate “fake news” so that it does not continue to create the growing scourge of “populism.”\n\n    Merkel, 62, said the challenge for democrats was to “reach and inspire people — we must confront this phenomenon and if necessary, regulate it.”\n\nSo now we can see how the “populist” meme is being deployed, to attack the alternative media in hopes of creating a groundswell of support for regulations that will control and retard it.\n\nOf course it is perfectly possible to argue that this sort of manipulation does not exist in the manner described. But if one denies this paradigm, one has to address the question of why the “populism versus globalism” meme appeared suddenly in mid-summer, even before Trump won the election.\n\nAnd then one needs to address why suddenly “fake news” is on the front page, collectively, of mainstream media with the inference that it is linked directly or indirectly to the growth of said populism.\n\nAs the recent election showed us, the mainstream media is capable of reporting with a single voice, no matter how falsely, when its organizers have in mind to present a concept or opinion in a certain way.\n\nThe fake news meme has developed inexorably out of “populism” propaganda and when looked at this way, one can see clearly that these various memes are programmatic. They are part of a mechanism designed to attack and blunt people’s desperate anger with the growing power of globalism.\n\nIt is even possible that some or much of the so-called fake news circulating has been secretly funded and generated by mainstream media controllers.\n\nConclusion: No, it would seem there is nothing coincidental about the emergence of “populism,” nor of the subsequent emergence of the fake news meme. One can argue, as we have herein, that they are a kind of weaponized media manipulation. They are, in fact, serial elite psyops designed to manipulate the general public.",
			"date_added": 1480046432
		},
		{
			"post_id": 1480048923,
			"body": "Milo Yiannopoulos: What The ‘Alt-Right’ Is Really About (Full Interview)\nhttps://www.youtube.com/watch?v=Lgl53EXInPc",
			"date_added": 1480048917
		}
	],
	"post_like": {},
	"comment": [],
	"follow": [
		{
			"follow_id": 1,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb",
			"user_name": "Bot",
			"date_added": 1480047718
		},
		{
			"follow_id": 2,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92",
			"user_name": "fre3net",
			"date_added": 1480080438
		},
		{
			"follow_id": 3,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1KWqhuQ8bWbd8Pp6w65uSJ6Q2jjBKERL4H",
			"user_name": "Peponi",
			"date_added": 1480173318
		}
	]
}