{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 23,
	"comment": {
		"1_17q6Zhf7PFjrY3ddySK2F78JhAH3FVhmWr": [
			{
				"comment_id": 1,
				"body": "An evil feminist destroyed artistic statue portraying Hillary Clinton naked\nhttp://www.informationliberation.com/?id=55700\nI like her hooves\nhttps://thenypost.files.wordpress.com/2016/10/hillarystatueembed.jpg?quality=90&strip=all&w=600",
				"added": 1476976096
			},
			{
				"comment_id": 6,
				"body": "5 Years ago the US helped Murder Gaddafi to Stop the Creation of Gold-Backed Currency\n\nFive years ago today, the West took it upon itself to use NATO to overthrow Libyan leader Muammar al-Gaddafi — not for any humanitarian threat to civilians as had been repeatedly claimed — but because his planned roll-out of a new currency to be used across Africa posed a palpable existential threat to central banks at the heart of the Western financial and political system.\n\nLong theorized to be the actual vehicle for Gaddafi’s downfall, the gold dinar-based, pan-African currency motive came to light in nascent 2016 in one of more than 3,000 of Hillary Clinton’s emails released by the State Department — conveniently timed with the New Year’s holiday to abate outrage or repercussions.\n\nhttp://www.thelastamericanvagabond.com/foreign-policy/5-years-ago-today-us-helped-murder-gaddafi-stop-creation-gold-backed-currency/\n\nAs the emails proved, Hillary Clinton played a key role on protecting the Federal Reserve scams of creating fake money for the ruling elite.  \nA Gold-Backed Currency anywhere in the world would be a real danger for the scammers to loose their profits.",
				"added": 1477049767
			},
			{
				"comment_id": 9,
				"body": "Why the CIA created ISIS under the Obama and Hillary Clinton administration\nhttps://www.youtube.com/watch?v=qfBBF4_hkDQ\nDocumented Proof ISIS Is a Creation of The United States of America \nhttps://www.youtube.com/watch?v=nqIyJycXxOo",
				"added": 1477319919
			}
		],
		"3_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 2,
				"body": "how about Freemasonry and Bilderberg Group ?",
				"added": 1476989338
			}
		],
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 3,
				"body": "I guess the freemasonry has also some hidden power.",
				"added": 1477030742
			},
			{
				"comment_id": 22,
				"body": "> [niggerslave](#comment_1_1N3mdeaR9x4bJ6yZm1eyKpndeHLFW63NZ2): Jews and their nigger slaves in American uniform continue to kill civilians in Mosulhttp://original.antiwar.com/nicolas_davies/2016/05/04/escalating-us-air-strikes-kill-hundreds-civilians-mosul/\n\n‘US airstrikes kill 60 civilians in Mosul’\nhttp://spynewsagency.com/us-airstrikes-kill-60-civilians-in-mosul/",
				"added": 1477647802
			}
		],
		"1_1AhXDbKvcLap7TcS2542J7bFYzKHM3xeRU": [
			{
				"comment_id": 4,
				"body": "The problem is that anarchism can be easily controlled by some hidden powers if don't exist clearly defined rules.\nDidn't started the communism as anarchy ?\nWe are already living in an anarchy and we don't even know who controls us and what is their goal.\nIs the justice system not a full anarchy?  You can get 20 million $ compensation for putting your cat in a microwave and you get nothing if the police or the army kills your child as mistake. \nWho decides who get the billions and who must die of hunger ?",
				"added": 1477031620
			},
			{
				"comment_id": 11,
				"body": "The opposite of Anarchy is Order and not Communism or Capitalism or Liberalism or Conservatism.\nIt must be a balance between anarchy and order.\nA complete anarchy is not desirable for the most of people because they don't want to play Russian roulette with their life.\nA perfect order is also undesirable because you cannot create a perfect justice and a perfect society only in theory and people will loose their subjective sense of freedom.",
				"added": 1477333325
			},
			{
				"comment_id": 12,
				"body": "> [thisweb11](#comment_9_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): .A complete anarchy is not desirable for the most of people because they don't want to play Russian roulette with their life.\n> But they already are.  And most people have already lost.   People are happy to play russian roullete with  Brexit and EU.  Most don't know all the betting options or the odds and aren't too bothered.\n\nYou cannot reduce all to the anarchy-order antagonism. They are other aspects of social life also.\nLike local-global balance related to what you mentioned with Brexit.\nAnother aspect would be private property vs state property. Market economy vs plan-economy.",
				"added": 1477341806
			},
			{
				"comment_id": 16,
				"body": "> [thisweb11](#comment_10_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): I think you missundrstand the definition of anarchy.  Heres a 101:\n> https://theanarchistlibrary.org/library/bob-black-anarchy-101\n\nI don't take this definition. To take the definition of anarchy from an anarchist site is like taking the definition of the Jew from the Talmud(the only human) or of the Communism from Lenin(the paradise on Earth).\nYou most take the commonly accepted sense. That is what I used and it is in the Wikipedia also.\n'Anarchy is the condition of a society, entity, group of people, or a single person that rejects hierarchy.'\nhttps://en.wikipedia.org/wiki/Anarchy",
				"added": 1477516531
			},
			{
				"comment_id": 17,
				"body": "> [thisweb11](#comment_20_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Um,  I do accept wikipedias definition.  Thats is correct.  Its also in agreement with the link i sent.  You seemed to be refering to anarchy as 'chaos' previously.  Which admitedly it is often used in that context.  But not in political debate.  Even by many capitalists.\n\nThe lack of hierarchy(what is order in social context) is the anarchy in the society by definition.\nChaos is more a general physical sense and it manifests in anarchy in the society.\nIn the universe order-chaos antagonism manifests in hierarchy-anarchy in the social context.",
				"added": 1477517762
			}
		],
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 5,
				"body": "> [deception](#comment_4_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o): The internationally recognized Jewish professor of Jewish history Ariel Toaff claims that the Jewish ritual murdering of Gentile children to take their blood may have been true and not a legend(blood libel).http://bloodpassover.com/\nTerrible, but psychologically could have sense. Doing something terrible in a group as holly action what the majority of humans hate makes stronger the inner connections and will create a barrier from the outside.\nI am asking what terrible things are doing the Freemasons what makes them keeping their secrets for centuries.",
				"added": 1477032585
			},
			{
				"comment_id": 19,
				"body": "Terrible what Jews may do. Gentile go to jail even for looking on such pictures.",
				"added": 1477552045
			}
		],
		"4_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 7,
				"body": "'THE SHADOW GOVERNMENT' is real in America,\nnow confirmed by the FBI what not even the most conspiracy theorists believed.\nThere was a another powerful group mentioned by very high-ranking state officials also, called  \n‘The 7th Floor Group’ .\nDetails can be found in the Hillary emails.\nhttp://www.trunews.com/article/the-shadow-government-is-real-according-to-the-fbi",
				"added": 1477081875
			}
		],
		"1_1EwDgtYPTUZhCQXt6toiRL6yM6bbXwbkCy": [
			{
				"comment_id": 8,
				"body": "> [nofish](#comment_806_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): probably Whonix does not allows you to communicate with tor's controll protocol, so try zeronet.py --tor disable --proxy 127.0.0.1:9050\n> in this mode you won't fire up hidden services, but you will use tor for every connection.\n\nIt would be fine a smooth work with Whonix.\nWhonix is the best anonymity concept.",
				"added": 1477297103
			}
		],
		"1_15CBPoeiB4i4G6NaCzccZ2e3CANLm32sgT": [
			{
				"comment_id": 10,
				"body": "Allah says nothing in Torah because that is a Jewish book.\nAllah is in the Koran, the Islamic holly book and Jehovah is in the Torah and Talmud, the Jewish holly book. I am not Muslim, but I know that a Muslim would never quote from the Jewish Torah.\nIt is obvious that somebody wrote here a fake, probably a Jew, to compromise ZN.",
				"added": 1477322450
			},
			{
				"comment_id": 14,
				"body": "Top Secret\nAs Abu Al Bagdadi(before he funded the IS) met John McCain, a Mohel was seen with him.\nMohel is a special rabbi, who is making circumcision after Jewish tradition, where the blood needs to be sucked out by the Mohel after the foreskin was cut.\nIf the subject was already circumcised by a doctor or by Moslem tradition it is still not valid for Jews only after the blood is sucked from the penis by a Mohel.\nIt is believed that one of the conditions for the CIA and Mossad support for the IS leader was that he makes his circumcision valid for Jews. Otherwise why came the Mohel with John McCain ?\nThe same Mohel was seen with Obama also before his first election.\nISIS : John McCain admits he met ISIS and says \"We know these people intimately\" (Sept 16, 2014) \nhttps://www.youtube.com/watch?v=vItuKKuz_7Y",
				"added": 1477421288
			}
		],
		"3_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": [
			{
				"comment_id": 13,
				"body": "Jews are trying to take over and enslave China also at least since the Opium Wars.\n\nThe enslaving opium trade in China, into which the easily corrupted Brits were drawn by Rothschild money, was in fact the brainchild of a British Sephardi Jew, Elias David Sassoon. He was joined in this enterprise by another British Jew, Silas Aaron Hardoon, his partner in the firm E.D. Sassoon & Co.\nThe origin of the conflict between China and the Rothschild-backed East India Company—i.e., the Jew-ridden nucleus of the British Empire—can  be found in this bland statement about the First Opium War,\nhttps://en.wikipedia.org/wiki/First_Opium_War\n\nEurope wanted tea, silk and porcelain from China, but China was self-sufficient and needed nothing in exchange from Europe. The result was a trade deficit in which Britain (via its East India Company) owed China an enormous and increasing amount of silver.\nHow did Britain try to solve this tricky problem? It left it to the Jews who formed the nucleus of the East India Company to come up with a neat solution.\nThe East India Company began to grow opium on its Indian plantations. It then transported  the processed opium to Bombay and Calcutta where the crop was sold by auction to “independent foreign traders.” This innocuous phrase is just an euphemism for Jewish merchants.\n\nWhat did China get in exchange? — Millions of opium addicts. By 1905, it has been calculated, 27 percent of Chinese males had become addicted to opium, with “13.5 million people consuming 39,000 tons of opium yearly.”  \n\nThe opium of the Jews today is pornography.",
				"added": 1477380245
			},
			{
				"comment_id": 20,
				"body": "> [planespherev2](#comment_56_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): OKOK. Good informations.\n> However, did the jews forced the chineese to take and consume opium?\n> Same today: if the jews are behind pornography, do they force the gentils to be porn actors or watch porn?\n> If the masses of the gentils are stupid like dogs and the elite of the gentils corrupted, then the jews (or an other minority) will take advantage of it.\n\nTry to put the same questions by giving bonbons with drugs to Jewish children and if the parents don't want to permit your drug party with their children then send the British army against them.\nBut prince Charles would better give the drugs to the gentile children as he was also circumcised by a Jewish mohel according to Jewish tradition. \nA Jewish circumcising includes sucking the blood from the child penis after the circumcision.\n(2 Babies Get STDs After Rabbi Sucks Their PENIS In Jewish Ritual\nhttps://www.youtube.com/watch?v=A-m0c6wlnWo)\n\n'Circumcision is one of the oddities of the Royal Family'\nhttp://www.telegraph.co.uk/comment/10201882/Circumcision-is-one-of-the-oddities-of-the-Royal-Family.html\nThe Jewish circumcision tradition of the royal family started around the time of King Georg I.\nDuring the First Opium War all male members of the British Royal Family were circumcised by Jewish tradition.\nIs this not a hint to Jewish control ?",
				"added": 1477553470
			}
		],
		"1_1NjrPZPtX2qaT1W13i5NvxT7jBzLB8acQM": [
			{
				"comment_id": 15,
				"body": "This forum is for general topics but they are other forums also with other topics.\nSomebody is running on  http://127.0.0.1:43110/ZeroTorrent.bit/ a torrent forum. Maybe you find it there.\nOr here http://127.0.0.1:43110/tvepisodes.bit/ .\nLook here also http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:zite-list-torrents",
				"added": 1477428788
			}
		],
		"3_19arYgVKguUamTqtYGu6T9FSUsr19CyEcG": [
			{
				"comment_id": 18,
				"body": "Captcha is good for bot trolling only but here are only human trolls.\nMake the code for ZN and if it is implemented we will appreciate it. \nMaybe it will be needed and used in the future when the network grows.",
				"added": 1477519187
			}
		],
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": [
			{
				"comment_id": 21,
				"body": "They were some rumors that Hitler had a penis damage and his cruelty was probably a psychological compensation to his sexual frustration.",
				"added": 1477642370
			}
		]
	},
	"comment_vote": {
		"10_1Nx78TLGjBT18krMD175Mr1JwFwnxURRLb": 1
	}
}