{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Rudolph Giuliani leak (pizzagate)",
			"body": "Linked to the Pizzagate.\n\nAlways the possibility that it is a fake, but it must be taken into consideration in case it is real.\n\nhttps://archive.fo/IDBh5",
			"added": 1482505603
		}
	],
	"topic_vote": {
		"2_1Cxt2k3farSSee7HTkJKJ7eCTKxfFGNXe6": 1
	},
	"next_comment_id": 134,
	"comment": {
		"3_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": [
			{
				"comment_id": 1,
				"body": "> [shellbound](#comment_17_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9):  Same inequality existed during the industrial capitalism he lived under as with the financial capitalism which we lives in. The big destruction of capital of the world wars hid a 30 year anomaly that made it look like Marx was wrong.. but it has corrected itself today..\n\nGold comment.\n\nThe 2 World Wars were reboots. The rate of profit were falling before 1914 and before 1939. Guess what the WW consequence were regarding the rate of profit? There was a huge increase. http://isj.org.uk/wp-content/old-site-images/147/147roberts11.jpg\n\nWho want to really live in such a system?",
				"added": 1475939092
			},
			{
				"comment_id": 2,
				"body": "> [kosherx](#comment_9_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): http://imgur.com/C0JD03K\n\nSlaves were means of production. What's more they were privately owned. A finished PS4 isn't a mean of production. \n\nBy the way capitalism abolished slavery when it's wasn't profitable anymore. In a time, the end of the 19th century, when it was more profitable to employ a worker and dump him when he wasn't useful anymore. \n\nSlaves have to be nurtured, raised, needed a roof,  and kept in line with a group of paid free men. \n\nWorkers are more flexible, and more profitable in the end.",
				"added": 1475940534
			},
			{
				"comment_id": 14,
				"body": "> [tempcom](#comment_1_1KY97qn2wAVxSVTJ3fg8HvxwcJ7rwrPmt4): I think you have fallen prey to thinking of socialism as state ownership or intervention.Socialism is the democratic control over the means of production.Socialism and Capitalism cannot coexist.\n\nIt depend of what you call socialism. \n\nI don't have in mind one single example of socialism in modern era. Most of the time, a political party call himself socialist but it isn't. See what happened in western Europe since the 80s. Never have been more socialist parties but the proletarians (salaried employees) have never been exploited. To be exploited don't mean you have a master who literrally whip your back when you don't work hard enough. To be exploited means the wages don't grow with the grow of production and profit. So you can be exploited even if you have a nice house and a nice car if the owner of the mean of production who employs you gives you back in the form of a wage less than what your father and grandfather earn for the same amount of work. Today, the production have considerably increased since a century back. So we have the illusion that we are less exploited. Because everyone has a refrigerator, a TV, a dish washer, a washing maching. So the average proletarian say \"see, our grandparents and parents were way more exploited than us today\". However, it's just an illusion. Because the production considerably increase. E.G:  http://gouvernet.com/public/term/sources_et_limites_de_la_croissance/sourcesetlimitesdelacroissance_web_web/res/evol%20pte.jpg\n\nThere are more goods in the market, for a cheapest price. Thus proletarians thinks they are richer than their ancestors. In fact, they are way poorer, because the owners of the means of production take way more from their work, and give them back far less. Due to less paid labor for a particular amount of work. The mechanization, which increase the production and the prices of consumption goods, gives the illusion that the proletarians class is richer when in fact they are poorer. \n\nSocialism doesn't exist. The capitalist class always arm lock politicians. Almost always. When some politician is upright, the capitalist class get rid of him. With their controlled medias, they can make a scandal appear (see the recent news with Trump). Or they can have more radical means (Kennedy). \n\nThere isn't democratic control, because representative democracy is a deception. Representatives don't work for the people, but for the owners of the means of production who paid for their political campaigns. \nThe only democracy is direct democracy. \n\nAbout the State, it is an emanation of the capital. The Capital need the State, because it collect taxes, which is needed to pays the interests on the public debt. The state is also needed because it is needed by the capital to enforce the claims and the liabilities. \nIn History, when money appeared, a (primitive) state appeared. When there was no money (E.G: the german tribes until the 5 century A.D), there was no state. \nMoney and the state necessarily co-exist.",
				"added": 1476202871
			},
			{
				"comment_id": 16,
				"body": "> [planespherev2](#comment_14_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): It depend of what you call socialism. \n> I don't have in mind one single example of socialism in modern era. Most of the time, a political party call himself socialist but it isn't. See what happened in western Europe since the 80s. Never have been more socialist parties but the proletarians (salaried employees) have never been exploited. To be exploited don't mean you have a master who literrally whip your back when you don't work hard enough. To be exploited means the wages don't grow with the grow of production and profit. So you can be exploited even if you have a nice house and a nice car if the owner of the mean of production who employs you gives you back in the form of a wage less than what your father and grandfather earn for the same amount of work. Today, the production have considerably increased since a century back. So we have the illusion that we are less exploited. Because everyone has a refrigerator, a TV, a dish washer, a washing maching. So the average proletarian say \"see, our grandparents and parents were way more exploited than us today\". However, it's just an illusion. Because the production considerably increase. E.G:  http://gouvernet.com/public/term/sources_et_limites_de_la_croissance/sourcesetlimitesdelacroissance_web_web/res/evol%20pte.jpg\n> There are more goods in the market, for a cheapest price. Thus proletarians thinks they are richer than their ancestors. In fact, they are way poorer, because the owners of the means of production take way more from their work, and give them back far less. Due to less paid labor for a particular amount of work. The mechanization, which increase the production and the prices of consumption goods, gives the illusion that the proletarians class is richer when in fact they are poorer. \n> Socialism doesn't exist. The capitalist class always arm lock politicians. Almost always. When some politician is upright, the capitalist class get rid of him. With their controlled medias, they can make a scandal appear (see the recent news with Trump). Or they can have more radical means (Kennedy). \n> There isn't democratic control, because representative democracy is a deception. Representatives don't work for the people, but for the owners of the means of production who paid for their political campaigns.The only democracy is direct democracy. \n> About the State, it is an emanation of the capital. The Capital need the State, because it collect taxes, which is needed to pays the interests on the public debt. The state is also needed because it is needed by the capital to enforce the claims and the liabilities.In History, when money appeared, a (primitive) state appeared. When there was no money (E.G: the german tribes until the 5 century A.D), there was no state.Money and the state necessarily co-exist.\n\nEdit: The mechanization, which increase the production and lower the prices of consumption goods, gives the illusion that the proletarian class is richer than their ancestors because they have access to more consumers goods (a cheaper TV,  phone,  car etc...) when in fact they are poorer: the capitalist class take more of their work.",
				"added": 1476221545
			},
			{
				"comment_id": 17,
				"body": "> [shellbound](#comment_18_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9): When the machines are capable to supply all of our human basic needs they could be made to do it gratis. The means of production will become autonomous. Work would be defined differently from today. If our basic needs are accounted for we don't really need to work... but still will. I envision a universal basic income that ensures people with what they need and a capitalistic layer above that ensures competition and pushes development forward. Poverty as such would be exterminated.\n\nI also see this king of full automatization. However the problem is the same: who will be the owners of these slave machines? Everybody or a handful of ultra-rich?\n\n> A problem with basic income is that it is not really equity but do simplify bureaucracy and would remove the ability for employers to push salaries down. \n\nI think basic income, if it is seducing at first, will create a third class of people. Today we have 2 classes. The capitalistic class: owners of the means of production, and the proletarians: the salaried workers.\n\nZbrezinsky Zbigniew wrote a few decades ago that only 20% of the population could make the whole system work. These 20% would be engineers, computer scientist, reserchers, and generally the people in intellectuals fields. For the 80% left, he proposed Tittytainment. \n\nA basic income would very well create a third class of people. So we will have the owners of the means of production (1%), the salaried workers: these 20% who'll make the system work, and the rest (about 80%) will be the basic income people. \n\nI don't know what you think about it, but for me it looks like this. \n\n> I am not sure if we ever can live state-less as we would always need some sort of law. People will always find ways and become in dispute with each other. It's part of our natural being. With laws you will need some way of enforcing them and that means you will need some sort of a state. This can't be shunned by simply getting rid of money. People will even in abundance still trade because it can never be absolute. You will always find scarcity. I don't see a point with removing a very effective way of exchange. I rather give someone \"money\" instead of dragging my cow to the market and trade it for the item I need to be able to get the item I want. Money doesn't have to be dollar it could just as well be a cryptocurrency.\n\nWe lived, as homo sapiens, 148000 years without money. \n\nThe state emerged when the primitive harmony was broken due to the Neolithic revolution. When humans began to store goods and keep it for themselves,  and not just take them from nature in immediately use/ eat them. \nWith all these new stocks, for the first time appeared (inside the tribe, not between rival tribes), theft. A society with such differences in wealth couldn't exist anymore in harmony. So written law was created, juridisdictions and police to enforce decisions rules by the judge. \n\nAgain, the german tribes, which were pretty evolve didn't use money until the 5 century A.D. Same examples with an other evolved civilization the Anasazis indians (puebloan indians): they didn't use money. \n\nScarcity is only in our heads. It's some kind of disease. The ones who want the most expensive car, or even computer or smartphone are retards anyway. They are alienated. They are others than what they really are, as humans. There isn't scarcity. Give me one example of something scarce really needed for a particular individual (except for health problems), which isn't greed. \nNature give us everything we need, and other stuffs, we have our brains to create it and then share it. \n\nDo you know how many different smartphones there is currently on the market? Thousands. This is madness. Only half a dozen different smartphone models would cover the need of every human on this earth. But greed, ego, want us to have the latest shiny shit.  What's more, with only a handful model, we could produce with enormous economy of scale, needing less people working for jobs they don't like (who like to built smartphones?).\n\n> @planespherev2: Direct democracy sound good in theory but in practice it is always the one who shout the loudest that win. Which means the minority will always be oppressed. Those with a weaker voice will thus have it harder to be heard. Also, do not apply US politics as a generalization. In my (and I believe most other) countries the politicians are paid by the state. So the \"owners of the means of production\" can't really pay the political campaigns. The representation is as such selected by those who vote. Also, most are not full time politicians but have regular jobs. They attend a committee a couple of times a year/month.\n\nIn a particular western europe country were i live, most know that the politics are in the pocket of the banks and the industry.  Maybe in small countries it's different. I heard Scandinavians country are pretty upright. But in this big western europe country were i am? Certainly not. They even have a \"club\" (like the bilderberg or the CFR) were all the politicians, industrials and journalists regularily meet and have wrotten guidelines in a fascimile. \n\nDirect democracy worked for more than a century in Athenes (5-6 century BCE).\n\nAlso, in Switzerland, there is an imperfect direct democracy: they have referendum based on poplar initiative. It works pretty well.",
				"added": 1476226050
			},
			{
				"comment_id": 18,
				"body": "> [japs](#comment_1_1Jqm5dUdtvmo1StgeVy3rk1BHRUrMkKawV): The Jews who provoked Japan into World War, then saw to it that Japan would be bombed with atomic bombs. Their intent was always to use Japan to destroy itself and as many other Gentiles as possible, while promising them world conquest.The Central Bank of Japan is controlled by Jews.Today, Japan is used the Jews as a pawn between China, North Korea, Russia and the United States.In 50 years in Japan will be only Jews and African slaves.Leading Jews are doing the same to America and Russia. If the most cities will be destroyed by nukes in a nuclear war, then they can buy everything very cheap.\n\nYou must be a troll.\n\nEven if this is true (some of your arguments have a bit of truth), then the Gentiles are really like the Talmud described them: animals.\n\nRemember: it is never the elites who fight the war: it is the people. They are too stupid, and are mislead by a promise of a greater tomorrow. \nIt is the people who consume all the garbage, and make the rich richer.\n\nAmong every jew hater here, how many grow their own food? How many are food self-sufficient because they grew their potatoes and vegetables? \nThat's right. Jew haters prefer to eat Jew Coca-Cola, eat jewish junk-food (coca-cola, Danone, Nestle, mac donald) have jewish cosmetics (L'oreal) instead of making their own ones, wearing jewish clothes and watching jewish movies.\n\nYes jews are responsible of a lot of things, the FED, and many americans presidents were killed by jew bankers.\n\nHowever, you guys are only feeding them by buying their shit.\n\nAgain: dispose of the jews, and are all of you jew haters stupid enough to think that the new elite will be considerably better? You're just dreaming. \n\nJew maybe corrupted the society. We saw it with feminism, LGBT, gender theory etc...\n\nBut who bought the lies? Your friends, family, co-workers, etc...\n\nSo if the world doesn't satisfy you, try to change it, beginning with your own habits, before blaming the jews.",
				"added": 1476230312
			},
			{
				"comment_id": 21,
				"body": "> [shellbound](#comment_19_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9): \n> \n> That was an interesting take about it and it is definitely plausible. At least in the beginning it is very likely to be as that. Class are not determined after income though so salaries doesn't really matter in that sense. It is determined in influence over your own time or control over your situation. In that sense UBI will remove classes as you will no longer be controlled. \n\nOr it will be a tool to have even more control over the population.\n\nE.G: put that R.F.I.D chip under your skin or the state will cut off your basic income. \n\nThe hand that gives is always over the hand that receives (Napoleon).\n\n> Artificial scarcity as well as natural scarcity will continue to exist. Things people will continue to be prepared to trade for. It has not with basic human needs as those will be fulfilled by the automation and UBI. People will continue to want that specific book or that vintage vinyl. Things that have emotional value. \n\nNo emotional value towards goods in a true human society. This is alienation.  Primitive tribe don't fetishize goods.\n\nBest thing we could do with those things is to put them into museums. \n\n\nAbout representative democracy, it is a scam because people don't have any sort of control over their representatives. In a commercial society, for example, the board of directors can be removed at any moment by the shareholder. What's more, the company manager is responsible toward the shareholders if he doesn't manage the society well or does mistakes. \n\nOn the contrary,  in our representative democracies, representatives are totally immune. So they can serve the power that is (capitalistic class), without any trouble, they aren't responsible toward the people. \n\nDuring the Budapest commune (1956), workers took over the means of production, and the boards of directors were replaced with \"workers concils\". The representatives in these workers concils were responsible towards the workers, and the workers could also fire them up and replace them at any time, without any justification. \nThat, is exerting power towards a representative. \n\nToday, the workers concils concept is a little outdated,  with the possibility of direct democracy and liquid democracy in the internet era. However, you get the point. Total control over the representatives, or they can fuck themselves with their representative democracy.",
				"added": 1476311362
			},
			{
				"comment_id": 22,
				"body": "> [shellbound](#comment_20_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9): I don't see how that really relates... it could be done for any circumstance. It has nothing with UBI to do. \n\nBecause the ultimate leverage of the working class is  strike which can put the whole system down. When people are feed and entertained with a basic they don't have any leverage.\n\n> They actually did.. but back then it was maybe a piece of bone rather than a record. They where nomadic and couldn't easily carry with them stuff. We will probably never be nomadic again. So that argument doesn't really hold.\n\nThe Jarawas indians, the Guayakis or the pigmees, one the last primitive tribes currently, aren't really nomadic. They can stay in one place for generations. And really, they don't fetishize objects like us. \n\n\n> ehrm... What? That is exactly what they are. A politician can pretty much be dethroned at any time. It happens all the time. You could even dethrone a whole political party and if necessary enforce a re-election.\n\nWhen he is dethroned, the misdeed is done, and he doesn't pay the price. Not being re-elected isn't a price high enough. He must have to pay sometimes a severe fine, or be put into jail if the misdeed are serious.\n\nFor example, Georges W. Bush should have been put to jail for war crimes. \n\nSame for Nicolas Sarkozy for having bombed Libya and killed tens of thousands of civilians. \n\nI have other example, of minister in a western countries order tens of millions of vaccines during the H1N1 period in the media. This alone costed billions of euros. Even the medical community agreed that this minister was corrupted. Did she pay? Not at all. She should have been prosecuted. But representatives are immune. Not being re-elected isn't a sanction strong enough when they consciously did wrong to millions of people.",
				"added": 1476396855
			},
			{
				"comment_id": 26,
				"body": "> [shellbound](#comment_21_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9): That is an option that is always there. UBI won't change it. What makes you think that will happen?\n> \n> They do... look at their necklaces e.t.c... \n> \n> That has nothing with representative or direct democracy to do.. i.e. it wouldn't change to have direct democracy. That is primarily a judicial issue.\n\nToday politician in influent countries are professionals. They made a career on lying and building solid networks to back them up. They serve these networks, and in exchanges, these networks, should they be financial networks, lobbys, or pressure groups, back them up, financially. \n\nIn a direct democracy, you can't bribe the whole people. In don't buy it. If the people were to make the laws, i doubt companies like JP Morgan, Halliburton, Raytheon, Locked martin or Coca-Coca would put money in their pockets in order for the people to make the law in these companies interests.\n\nAgain i give you the example of the corrupted health minister in France. With direct democracy, the people would never have order millions of useless vaccines, with their own tax money.\n\nDirect democracy is the solution against corruption.",
				"added": 1476466245
			},
			{
				"comment_id": 27,
				"body": "> [shellbound](#comment_21_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9): That is an option that is always there. UBI won't change it. What makes you think that will happen?\n> \n> They do... look at their necklaces e.t.c... \n> \n> That has nothing with representative or direct democracy to do.. i.e. it wouldn't change to have direct democracy. That is primarily a judicial issue.\n\nToday politician in influent countries are professionals. They made a career on lying and building solid networks to back them up. They serve these networks, and in exchanges, these networks, should they be financial networks, lobbys, or pressure groups, back them up, financially. \n\nIn a direct democracy, you can't bribe the whole people. In don't buy it. If the people were to make the laws, i doubt companies like JP Morgan, Halliburton, Raytheon, Locked martin or Coca-Coca would put money in their pockets in order for the people to make the law in these companies interests.\n\nAgain i give you the example of the corrupted health minister in France. With direct democracy, the people would never have order millions of useless vaccines, with their own tax money.\n\nDirect democracy is the solution against corruption.",
				"added": 1476466255
			},
			{
				"comment_id": 56,
				"body": "> [zerowe](#comment_13_1Nx78TLGjBT18krMD175Mr1JwFwnxURRLb): Jews are trying to take over and enslave China also at least since the Opium Wars.\n> The enslaving opium trade in China, into which the easily corrupted Brits were drawn by Rothschild money, was in fact the brainchild of a British Sephardi Jew, Elias David Sassoon. He was joined in this enterprise by another British Jew, Silas Aaron Hardoon, his partner in the firm E.D. Sassoon & Co.The origin of the conflict between China and the Rothschild-backed East India Company—i.e., the Jew-ridden nucleus of the British Empire—can  be found in this bland statement about the First Opium War,https://en.wikipedia.org/wiki/First_Opium_War\n> Europe wanted tea, silk and porcelain from China, but China was self-sufficient and needed nothing in exchange from Europe. The result was a trade deficit in which Britain (via its East India Company) owed China an enormous and increasing amount of silver.How did Britain try to solve this tricky problem? It left it to the Jews who formed the nucleus of the East India Company to come up with a neat solution.The East India Company began to grow opium on its Indian plantations. It then transported  the processed opium to Bombay and Calcutta where the crop was sold by auction to “independent foreign traders.” This innocuous phrase is just an euphemism for Jewish merchants.\n> What did China get in exchange? — Millions of opium addicts. By 1905, it has been calculated, 27 percent of Chinese males had become addicted to opium, with “13.5 million people consuming 39,000 tons of opium yearly.”  \n> The opium of the Jews today is pornography.\n\nOKOK. Good informations.\n\nHowever, did the jews forced the chineese to take and consume opium?\n\nSame today: if the jews are behind pornography, do they force the gentils to be porn actors or watch porn?\n\nIf the masses of the gentils are stupid like dogs and the elite of the gentils corrupted, then the jews (or an other minority) will take advantage of it.",
				"added": 1477390667
			},
			{
				"comment_id": 67,
				"body": "> [zerowe](#comment_20_1Nx78TLGjBT18krMD175Mr1JwFwnxURRLb): Try to put the same questions by giving bonbons with drugs to Jewish children and if the parents don't want to permit your drug party with their children then send the British army against them.But prince Charles would better give the drugs to the gentile children as he was also circumcised by a Jewish mohel according to Jewish tradition.A Jewish circumcising includes sucking the blood from the child penis after the circumcision.(2 Babies Get STDs After Rabbi Sucks Their PENIS In Jewish Ritualhttps://www.youtube.com/watch?v=A-m0c6wlnWo)\n> 'Circumcision is one of the oddities of the Royal Family'http://www.telegraph.co.uk/comment/10201882/Circumcision-is-one-of-the-oddities-of-the-Royal-Family.htmlThe Jewish circumcision tradition of the royal family started around the time of King Georg I.During the First Opium War all male members of the British Royal Family were circumcised by Jewish tradition.Is this not a hint to Jewish control ?\n\nYes i heard about those things and it's possible that the royal family is jewish.\n\nProbably more like Frankist or Sabbatheist.\n\nIf the masses had the balls to take the central power and take over the means of production, the best these people could do is to flee and live in a rat hole.\n\nBut the masses are week and play the money game and hierarchy delegation game. It's only normal that they are ruled by psychopaths.",
				"added": 1477563471
			},
			{
				"comment_id": 68,
				"body": "Arminius was a war chief of the german tribes (ancoms). He fought bravely the roman legions. When he was young, he was taken as an hostage by the romans. He was raised by romans so he was influenced by hierachy and had dream of being in charge. \n\nWhen he got back in Germania, he turned against his roman hosts and became a german again.\n\nHe fought brilliantly against the romans legions and won many battles.\n\nAfter much success, he decided that he should rule the german tribes. What's more logical from an alienated point of view? He was educated, smart, had leader skills: he should rule. \nThe germans killed him. He should have kept his place. No one rules. There is only temporary delegation of power. \n\nIf we have so much assholes over us, it's because we are domesticated. Alienated. They didn't hesitate, they didn't replaced a chief with an other chief. They killed the chief, and continued to live without hierarchy.",
				"added": 1477569587
			}
		],
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 3,
				"body": "Right. Very true. Eustace Mullins and Douglas Reed are indeed interesting (for real). \n\nBut that doesn't solve the problem. \n\nSo you don't want the jews to control us. Great!\n\nYou want us to be self-controled, with currency.\n\nHow about NO control? \n\nRight, humans need to be controlled, or so we've been told.\n\nHow did it work for sapiens from 160000 BCE to 12000 BCE? \n\nCurrencies are chains.",
				"added": 1475941371
			},
			{
				"comment_id": 12,
				"body": "> [nigger1](#comment_2_1Bx1tNpf8HRG7FJpcuCVVasdma3CUaho9w): No, The American People will create the currency, fuck the Jews, we will never allow the Jews to create the currency and then have us borrow it from them, EVER AGAIN!!!! FUCK YOU JEW!!!!!\n\nWhat about no currency? What about an other mode of production? Why wanting a long leash instead of a short one? What about having no leash at all?",
				"added": 1476192025
			},
			{
				"comment_id": 70,
				"body": "> [zerowe](#comment_22_1Nx78TLGjBT18krMD175Mr1JwFwnxURRLb): ‘US airstrikes kill 60 civilians in Mosul’http://spynewsagency.com/us-airstrikes-kill-60-civilians-in-mosul/\n\nNo you don't understand. When  airstrikes are made by the US in Mosul it's for liberating oppressed people.\n\nHowever, when airstrikes are made by the Syrian army or by the Russians in east Aleppo, were the good people of Al- Nusra are,  they are war crimes. \nFrench foreign relationship Laurent Fabius (Jewish you'll like him) said about Al-Nusra (and you can verify): \"they are doing a good job on the ground\". \n\nThey are only friendly rebels. When they decapitate, they do it with humanity. When they execute civilians, it's because they have an inherent sense of justice. And when they throw people from the top of a building, it's only because they deserved it.\n\nThe west must protect Al Nusra in east Aleppo. Luckily, our good western mainstream medias are behind these  modern heroes.",
				"added": 1477655282
			},
			{
				"comment_id": 72,
				"body": "> [realjew](#comment_1_1F1ydVnPxeJappxSMjh7qKGTQapc3J3RDx): Our system is evil. YES. But who makes it evil ?Only the Jewish Talmud gives an ideological support to corrupt the system and no other religion.Of course the Jews are also born as innocent but their own religion and odd habits makes them differenthttp://www.realjewnews.com/?p=156https://www.youtube.com/watch?v=Z6WwQgPl_9o&list=PLFFB05929141EE377&index=12http://www.subvertednation.net/jews-suck-baby-penises/\n\nNo. Any system which use money and hierarchy (delegation of power) is corrupted.\n\nIt happened long before the first jew was ever born (Neolotic revolution: 12000 BCE, first use of hierarchy and money. Jews, supposedly about 4000 BCE).\n\nAnd the Talmud is only about 200-500 CE. Is was shit before the talmud. The roman empire, with it's slavory (Spartacus), it's circus game was corrupted and it had nothing to do with jews or the talmud.\n\nDuring the same time, the german tribes lived without money and without hierarchy. And they weren't savages in caves, but a real civilization, able to defeat the roman empire.",
				"added": 1477688736
			}
		],
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 4,
				"body": "> [joey1](#comment_1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA): At least to some degree, every Jew in the world has the mentality that their main goal is to subjugate, subvert, and enslave all other groups one way or another, this is because of their religious learnings.\n> The Jew mentality is the largest destructive force in the world today. Jews are running the Muslim Invasion.\n\nRight. \n\nIt would be so much better if our elite would be 100% good old christians. They would never subjugate, subvert and enslave all other groups, because they went to the good old church when they were young and prayed Jesus. So when one of these good christian elite become CEO of Monsanto,  Locked martin, Raytheon, he will just stop to sell poison and weapons of mass destruction. If he become a trader, he will stop to speculate on homes (2008 crisis), or food (starvation in the thirld world).\n\nI thought like you just a few years back. \n\nThe problem is not the capitalist ruling class religion or ethnicity (jews, satanists, soon Chineeses or whatever).\n\nThe problem is not the system's elite religion or ethnicity. The problem is the system itself: the money game. \n\nHomo sapiens is so brainwashed by the money game since thousands of years (it began 12000 BCE with the neolithic revolution). He has forgotten it is not his true nature.",
				"added": 1475942155
			},
			{
				"comment_id": 6,
				"body": "> [21x](#comment_3_1LtzSR6qY5YBVNfDvktEd7xHo7dwvE2zBf): This is a communist ideology invented by Jews. But you can still fool with it some people in the jungle of South America if you hurry.\n\nYou don't know shit. It's not the Jews who control the world. \n\nIf you think Rotschild, Rockefeller,  Schiff, Warburg and Morgan are Jews, then maybe they deserve to rule over you.\n\nJews are somehow linked to them but the average jew don't know shit, like you, and isn't part of the plot. \n\nIn fact jews in Europe during WWII were sacrificed by this elite because they weren't zionist enough.\n\nAnd about your Hitler, he was a pure creation of the Tavistock institute, MK ultra ancestor (still exist nowadays). Ouch, harsh for you isn't it?  \n\nGuess what? Their ultimate tool to control people isn't mass medias or the FED, but MONEY itself. You know that the bolshevik Lenin never intended to suppress money? In fact Lenin's new economic policy in the beginning of the 1920s was way more liberal than the tzar economic policy. \n\nOnce you guys understand this and concentrate your hatred towards money,  maybe we could do something. Hating the jew but still accepting Mammon. What an absurdity. \n\nUntil you change and accept to let go of the money game, they'll always rule over you.",
				"added": 1475969251
			},
			{
				"comment_id": 8,
				"body": "> [becoming](#comment_11_1FwTZnDZJjs2epEtq9yLy7m2P5kZ4TYqAR): Money is basically 'reputation points'. Banks become distributors, profiteers and creators of social reputation. \"In money, we trust.\" Like Gold and Silver of old, it served as a more light weight and liquid measure of value.\n> Money becomes its own person, out of nothing, which is trusted. It is a God in every scientific sense - it is the natural world which becomes personified. When one acquires money, they think of the power it has over people, not that it can provide for oneself. It cannot. You can't eat gold.\n> Hitler controlled money in Nazi Germany. It relied on trust toward the ones who control the money, that they would not manipulate it. Gold and Silver were essentially decentralized credit, because one could find it and 'strike it rich'. Not one group of person(s) controlled it or manipulated it. One had to at least, with gold, commit actual violence against the citizens in order for the gold market to be manipulated. With fiat currency, no over violence is needed to actually commit violence against them: one only tap-tap-taps into a computer one figure or another.\n> I'm not sure what a world without a currency would look like, except that there'd be bartering. Bartering is very inefficient. There used to be multiple currencies - but the banks kept having bank runs and crashing because they're greedy shits, so they said \"Let's create one huge bank for all of us to be greedy shits with\" and nationalized the currency. Now they're going to attempt to do the same by creating a global currency.\n> Rejecting money, the people will just return to the gold standard. So, I don't see you'd stop that. Gold or Silver, or some other thing will become the 'currency' of choice. What would stop banks from again issuing 'gold/silver notes'? Legislation?\n> If one just banned usury, this would be solved. Then you just get loan sharks, though.\n\nLike other guys, you want the society to be better, however, you're still infected by this shit we call money. Of course money is power over someone else. Whether money is created by a \"jew\" FED or backed by gold. \n\nIf you pay someone to clean your toilet, and he does it because he doesn't have a choice, it's this or sleeping on the street, you exert power over him. \n\nQuickly about Hitler, there are some sources that he was a Tavistock institute creature (but more research have to be done).\n\nBarter is a myth. It never existed. It was invented by Adam Smith and others like him. It's amazing how you guys denounce jews but still accept jew compatible theorists from old time like this Smith. So for you guys Marx is part of a jewish conspiracy to take over the world, but good old Adam Smith is pure as a white dove. He was for an honest capitalism, without exploitation of the working class.  Do you realize just how ridiculous that sound? \n\nAbout barter, the primitive tribes, inside the tribe, don't barter. They produce goods and share them between the people when there is a need for something. That's how the German tribes worked until the 5-6 century A.D. The lands, animals and tools were shared. They fought the Romans and sometimes, they won. Also money less systems existed in other civilizations. Money isn't necessary to civilization. Anasazis indians were a complex civilization without the use of money. Also, and i don't know if some of you are into it, but the pre-flood civilizations were probably moneyless societies. They didn't used money but build wonders like the great pyramid, Sacsayhuaman wall or (among other things) Teotihuacan.\n\nAbout usury, that's the problem most people can't understand, but it's pretty simple. If you have a money system, you'll have usury. It's just simple as that. In every 1 dollar bill, there is usury. \"Oh, you want 100 dollars? No problem! Take it, you'll give me 110 dollars in one month. \"\nOne good example is when usury was forbidden before the 18th century in western continental Europe (England was a little ahead if i remember correctly with the bank of England (1694), ancestor of the FED). So what happened in western Europe were usury was forbidden? Loans were just disguised, mostly with life annuity, which was legal. So the usurer gave money, in exchange for a life annuity for him. It is usury AND hypocrisy. In a sense, it's worse than legal usury. \nSame hypocrisy happen in muslims country with the Sharia. So usury is forbidden. Guess what the stupid hypocrites do? They lend money in exchange of a \"rent\". A rent is legal under such a sharia system. So it's legal for them to lend money in exchange of a rent, which is probably calculated with an interest rate. So the hypocrisy goes to the point were they use interest rate formulas, but in the \"sharia compatible\" loan  contract, the due is called \"rent\". \n\nDo you want such hypocrisy? \n\nI don't. \n\nLet's be ambitious. No half measures. No turning back in the 19th century capitalism. It won't even work since capitalism never goes back, but always further. The only solution is to go ahead of capitalism, to change the entire mode of production. Not to go back in our great  grandfathers capitalism.",
				"added": 1476014022
			},
			{
				"comment_id": 13,
				"body": "> [kosherx](#comment_18_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): Why is it that ignorant people misunderstood right-winged state bullcrap with libertarian anarcho-capitalism? Why don't you study about the subject before saying something as stupid as this?\n\nAnarcho-capitalism is fashionable these days. Right, let's do it! Good idea! Let's rearrange capitalism once again! This time it will work! The capitalistic system is good, we just have to change it for it to be a wonderful society without greed, class, poors, super-richs, destruction of the environment.\n\nAs anarcho-capitalist, we know that money is mandatory for a society to work. What's more money is just a tool. Proof: i give a  hundred dollars a prostitute to suck my dick, see? It's just a tool. I do not exert a power over her. It just a neutral way to organize society. Same for the millions of people who have shitty jobs and hate their lives. With anarcho capitalism, they will be also paid with shitty wages, just enough for them to live, and they will work for the owners of the means of production, but with anarcho-capitalism, they won't be jews owning these means of production so it will be so much better! \n\nWhat's more, with anarcho capitalism, there will not be a few hundreds ultra rich on the planet, but at least 100000 very rich people, the money will be more equally distributed between the owners of the means of production due to more competition in the market! Fantastic! But hey, they will still be someone to clean the toilets and make me my  burgers in some shitty junk food restaurant, but if they are on the bottom of the ladder, it must be because they deserve it. \n\nLow class humans will always exist and will ever exist. These radical Marxists with their one class society are crazy. It never existed. Ok, they'll say it existed from 160000 BCE and 12000 BCE, for about 148000 years,  but they were just savages, living in caves, and hunting mammoths. They didn't have art, healers, harmony, abundance like us, nature never gave them everything they ever needed. I want my Coca-Cola and my iphone 7 god dammit! \n\nWith an Anarcho-capitalist society, imagine the dream society we will have! For the first time in 12000 years, since the Neolithic revolution,  a money-based society that is enjoyable for the people!  Join US!",
				"added": 1476193433
			},
			{
				"comment_id": 33,
				"body": "> [curse](#comment_2_1MrRShZ9dp1stuYhAyzguqFXv8X4E4AjCn): Sieg Heil!\n\nHitler was Salomon Rotschild grandson. \n\nSieg heil?",
				"added": 1476545442
			},
			{
				"comment_id": 82,
				"body": "> [fallendawn](#comment_1_177VPHcJpUCZpUb4HV5V36XnTGT88GSMDS): muslims want war, jews want peace but peace with jews ruling\n\nPax judaica.",
				"added": 1478085278
			}
		],
		"2_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 5,
				"body": "Again, you have only half right. The first half. \n\nInterest yourself about the elite surrounding Putin. \n\nI'm scared about all the elites. If only you knew what's in their head you'll never follow them. \n\nA direct democracy is indeed necessary to stop the nonsense you refered to. \n\nHowever, what would really be ambitious is to go even further: change the mode of production for one not based on greed.",
				"added": 1475950396
			},
			{
				"comment_id": 7,
				"body": "Also, as i said in an other topic, the central bankers (Warburg, Schiff, Morgan, Rotschild, Rockefeller) are not jews. \n\nSatan doesn't care if they have their foreskin or not. \n\nOk, i'll be more precise, they are Frankyists, Sabbateist, Kabbalists.\n\nAlso, there are way more gentile (non jews), working against you than you think. Probably more non-jews than jews working to reduce you as a slave, and later, as food.  \n\nThe demiurge has his chosen people. However, any piece of shit who willingly accept to serve him is welcomed. Hollywood and the music industry are good examples.",
				"added": 1475971076
			},
			{
				"comment_id": 9,
				"body": "> [peterrabbit](#comment_1_1MtCWSi2Y3ZyNGq3qU3WUQkAVGcfJKS3Ls): They are kabbalah following jews.\n\nYes, but be honest: do you really think that there isn't even more gentiles than jews who work against us? \n\nLook in the sky, see those chemtrails? Is every pilot of these planes a jew? \n\nIf the gentiles are so stupid, and corrupted to do everything just for a wage to buy them a nice car and a house with a swimming pool, than the jews should rule.",
				"added": 1476014362
			},
			{
				"comment_id": 15,
				"body": "> [nigger1](#comment_1_1Bx1tNpf8HRG7FJpcuCVVasdma3CUaho9w): I noticed this thread originally started as \"Russia is not the problem\" until some little Jew scumbag edited it to the way it is now.  Jew changed it to \"Russia who is the problem\".\n> So much for piece of shit ZeroNet !\n> This is why the Jews must kept out of all countries and all positions of power !!!!!\n\nI never said Russia is a problem. And you'll be surprised of my ancestry scumbag.\n\nNigger1: \"Jews are responsible of 100% of the shit that happen in the world. I'm responsible of 0%.\"\n\nWhen nigger1 eats his meat, he is not responsible of deforestation and pollution of the soil and over consumption of electricity. It's the jews who are responsible.\n\nWhen Nigger1 is in his car, he is not responsible for the microparticules he emits in the atmoshpere, and make sensitive to air pollution people sick.  it's the jews fault.\n\nWhen Nigger1 buy his Nike shoes, he is not responsible for child labor used to make them. It's the jews fault.\n\nI never said jews aren't responsible of anything, dirt bag. \n\nHowever, if we are to live better, everyone must change his dirty habits. \n\nI'm surprised that people like you are on Zeronet. You probably find out about it by accident.\n\nAlso i just noticed that you blamed ZeroNet :\"So much for piece of shit Zeronet\". This alone completely discredits you. \n\nYou realized you just blamed an open source P2P sharing system, a system working without anyone to operate it? You're just probably too stupid to realize how the Zeronet system works  anyway.",
				"added": 1476208350
			}
		],
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": [
			{
				"comment_id": 10,
				"body": "> [21x](#comment_4_1LtzSR6qY5YBVNfDvktEd7xHo7dwvE2zBf): I am so disappointed of Trump. He capitulated in front of gays, feminists and Jews.Why needs somebody to apologize if he in a private conversation expresses his aversion towards  women with silicone breast ? I mean these are still humans to a certain degree but sexually are certainly not attractive to normal men. Even Jews know that.\n\nHe didn't capitulated in front of the Jews. He was always in their pocket from the beginning. Do you really think that one man can fight the AIPAC and be protected against the mossad? \n\nThat is what happen when you believe in representative democracy: disappointment. And it will happen again, and again. Until you realize that representatives don't defend the people interests.",
				"added": 1476014676
			},
			{
				"comment_id": 11,
				"body": "> [z2](#comment_3_16vpc1mSeaKRT5vcGYnopy2wNhM1djgipn): The end of the world is near. We are all doomed.Even Arnold Schwarzenegger is on their side.Gays, feminists with silicone breast, drones and terminators will kill the last human males.\n\nIt's only the corrupted west. Asia don't care about this feminist shit.",
				"added": 1476031037
			},
			{
				"comment_id": 37,
				"body": "> [deception](#comment_3_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o): Trump made a trip to Israel because he is not racist, he regards the Jews as equal with all other humans and he hoped to find some honest Jews who would support him in his fight against corruption.But he didn't succeeded to find this category in Israel and he was humiliated because the Jews want to have  more rights then all others. This way of taking money from the poor and giving to the rich still worked somehow by Obama but continuing this way will end in a total bankruptcy.\n\nYou stupid?\n\nTrump is a billionaire from new york city.\n\nYou really think he was never in business with jews, or that he don't know how the jewish world work?",
				"added": 1476644385
			},
			{
				"comment_id": 58,
				"body": "> [enoch](#comment_1_1QH1N2BcCN6bQu1J98yUovsnnkvHn8TKhC): Trump is providing a great service to anarchists by undermining the legitimacy of the inherently corrupt system used by the elite to enslave us.\n\nTrue. In Philipp Dru: administrator, Edward House wrote that in a republican election, half of the sheeple will vote for one representative, the other half for the other. This happen everytime. Then all the puppeteer has to do is to concentrate on the 5-10% indecisive sheeple. The use of mass media on them, some last minute scandal or revelation, some paid experts to criticize one or the other, and it's in the election is in the pocket.\n\nRepresentative democracy is rigged from the beginning, and the mass medias make it totally artificial. This is manufacturing of consent, social engineering. \n\nThis shit and the regular false flag operations are what make our era truly despicable. This and the sheeple who buy it.",
				"added": 1477395530
			}
		],
		"1_1HRqipL1thbTsztjAvhN76qkzQBZ1k93nJ": [
			{
				"comment_id": 19,
				"body": "Mesh networks exist in theory. See the serval mesh on android. The problem is that people don't use them, mostly because they don't really understand the technology and the positive implication of P2P decentralized mesh. \n\nHowever, it's important to have ideas about them, they could be used in time, should censorship hit the internet globally in the future.",
				"added": 1476278486
			}
		],
		"1_1PXxt4z65p8H6xXh4zb7ahMtE7kfCRxgaq": [
			{
				"comment_id": 20,
				"body": "In fact it already exist since many years: freenet.\n\nSame principle, but the code of freenet is older so it's way slower.",
				"added": 1476299004
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 23,
				"body": "> [lelzor](#comment_1_12hFP1CZdDAmuPc6wv66sfGJE5e8tJntUv): Well he did say this was a \"reddit-like\" site :^)\n\nI don' know if this is true. Can someone confirm? Is it possible for the administrators to do so? \n\nIf it is, i'll go back to freenet.",
				"added": 1476397618
			},
			{
				"comment_id": 24,
				"body": "> [nofish](#comment_801_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): The site owner able to modify/remove any content submitted by the users to his/her site. (You can check the user's content.json file sign to see if it's modified by the site owner or not)\n\nThat's disappointing. Even if some here have personal issues, they should have the right to speak their mind.",
				"added": 1476448302
			},
			{
				"comment_id": 25,
				"body": "> [teszt](#comment_56_1AdcxsExVKvxffQtEd72E5tckouzZHLEYC): ZeroNet is a very good and promising decentralized network for content publishing.(and maybe the most rapidly developed one)The decentralization is working here on the network level. Anybody can create any site of any content and nobody can delete it. On sub-levels the site owners are controlling the content as I understood.Somebody with known identity cannot let any content on his site even if he is for absolute freedom of speech.Freenet is also not very different in this aspect. Even in RetroShare  you have control of your site and whose content you are seeding as node.In IPFS they even try to block some contents on network level as I know.Maybe a comparative study could better reveal advantages and disadvantages of this systems.\n\nWell i don't like it then. \n\nWe need something no-one can put pressure on. \n\nI think Sone in Freenet qualifies, but unfortunately it's slower than Zeronet.",
				"added": 1476452719
			}
		],
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": [
			{
				"comment_id": 28,
				"body": "Supposedly he was Salomon Rothshild grandson with one of the female domestic.\n\nA report from french secret services for the begining of the 1920 say that is second first name was Jacob.\n\nSupposedly he was also a Tavistock institute creation. One of the first brainwashed dissociated personnality of the modern era. \n\nSo yeah, if this is true, and it's probable, so much for all the retards worshiping him today and in the past.",
				"added": 1476529980
			},
			{
				"comment_id": 32,
				"body": "> [kopykate](#comment_53_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4): We all descended from Africans, anyway. There is literally no such thing as a 'pure race'. White people are essentially just black people who have mutated over the centuries and adapted to cooler climates with less sunlight.\n\nNo. Last knowledge to date is that black africans homo sapiens went to europe about 40000 years ago, and mixed their DNA with neanderthalis, creating a white homo sapiens offspring, with some neanderthalis characteristics (about 4.5% of homo sapiens DNA comes from neanderthalis). Then, or concomitantly,  they exterminated Neanderthalis.\n\nIronic that some black people take the whites for responsible of every bad thing that happens when africans were responsible for the creation of the white homo sapiens.\n\nIt was indeed the blacks who went in contact first with the whites (in the form of neanderthalis then), and not the other way around.",
				"added": 1476545243
			},
			{
				"comment_id": 73,
				"body": "> [zerowe](#comment_21_1Nx78TLGjBT18krMD175Mr1JwFwnxURRLb): They were some rumors that Hitler had a penis damage and his cruelty was probably a psychological compensation to his sexual frustration.\n\nThere are others rumors that Hitler was a Tavistok institute creature (Mk ultra/Monarch ancestor).",
				"added": 1477688824
			},
			{
				"comment_id": 83,
				"body": "> [armageddon](#comment_3_1Je6ZLuzvFihQPFFhveQ7GBU2FBWE28zDv): World Almanac, 1940, pg. 129: World Jewish Population: 15,319,359World Almanac USA, 1947, pg. 748: World Jewish Population: 15,690,000World Jewish Population increased between 1940-1947: + 370,641World Almanac, 1949, pg. 289: World Jewish Population: 15,713,638World Jewish Population increased between 1947-1949:  +23,638http://www.worldalmanac.com/https://www.librarything.com/series/The+World+Almanac+and+Book+of+FactsAs you see after the World Almanac, American edition the World Jewish Population increased between1940-1947 with more then 52,000/year and between 1947-1949 with less then 14,000/year.But the most interesting part is that in Europe increased with more than 400,000 the Jewish population after the World Almanac American edition between 1940-1947.How is this possible ?\n\nThey did even better. \n\nIn the later editions of this world Almanach (after 1950) they retrospectively retrieved the 6 millions from the 1940-1945 period. \n\nE.G: in the 1945 edition, you have the number for the year 1945, and in the 1955 edition, the number of the year 1945 is the number of the 1945 edition, minus 6 millions.",
				"added": 1478104842
			}
		],
		"1_1FZEtMSz2tKFZPmBtjhD7JgR4awtAMD47G": [
			{
				"comment_id": 29,
				"body": "> [redpillslaptop](#comment_1_1FZEtMSz2tKFZPmBtjhD7JgR4awtAMD47G): Well the owner must be a sack of shit then\n\nThat's indeed completely paradoxical to modify or suppress posts in a forum supposed to be censorship resistant, created in response of the clearnet wiliness to take control of the internet.\n\nAnyway, if some want to use a totally censorship resistant social network, i suggest Sone in Freenet. Nobody can modify or suppress anything there.",
				"added": 1476544780
			},
			{
				"comment_id": 30,
				"body": "> [redpillslaptop](#comment_1_1FZEtMSz2tKFZPmBtjhD7JgR4awtAMD47G): Well the owner must be a sack of shit then\n\nThat's indeed completely paradoxical to modify or suppress posts in a forum supposed to be censorship resistant, created in response of the clearnet wiliness to take control of the internet.\n\nAnyway, if some want to use a totally censorship resistant social network, i suggest Sone in Freenet. Nobody can modify or suppress anything there.",
				"added": 1476544782
			},
			{
				"comment_id": 31,
				"body": "> [redpillslaptop](#comment_1_1FZEtMSz2tKFZPmBtjhD7JgR4awtAMD47G): Well the owner must be a sack of shit then\n\nThat's indeed completely paradoxical to modify or suppress posts in a forum supposed to be censorship resistant, created in response of the clearnet wiliness to take control of the internet.\n\nAnyway, if some want to use a totally censorship resistant social network, i suggest Sone in Freenet. Nobody can modify or suppress anything there.",
				"added": 1476544783
			},
			{
				"comment_id": 35,
				"body": "> [kosherx](#comment_22_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): If they censor socialists, I don't even care. More power to them.\n\nIn a capitalistic system, there is no such thing as socialism. Only some ideologies derivated from the capital and one of  them  is called socialism. Every political party, everyone, is for capitalism. All the parties are representing the capital. From the extreme left flavor to the extreme right. It's all about the same system, but with different flavors.\n\nYou cannot have what people imagine to be socialism and a money based society. It is just not possible. \n\nSo you and those believing in socialism are the two sides of the same coin.",
				"added": 1476559980
			},
			{
				"comment_id": 84,
				"body": "> [binero](#comment_6_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): You can. Do note there is a difference between socialism and communism.\n\nSocialism aims to tame money. To collect and redistribute it. \n\nIt can give the illusion that it's making well-being better, but in the end money always finds it's way.\n\nMoney is like water. Block it by the front door, and it'll pass by the window. \n\nE.G: Collect tax from the capital, and it will find tax paradises. Increase the wages, and companies will relocate. Strike, and the capital will organize it's reserve army (migrants). \n\nCapital is flexible. You think you can control it as a socialist, but you cant. Only way to stop this mad societal organization, take capitalism down, entirely.\n\nAdjustments will only make the impression that something better happened, when it's only (at best), saving time until capitalism final crisis.",
				"added": 1478303963
			},
			{
				"comment_id": 87,
				"body": "> [binero](#comment_8_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Capital is pretty easy to keep under control. Tax paradises only work if people can transfer their money to there. They can today because these paradises negotiate trade deals with corrupt politicians, but if you get rid of those, then money is stuck on the social democracy where it is subject to imposed taxes.\n\nAnd with what are those politicians corrupted? You see the point...\n\nWhy do you like money as the fuel of our mode of production? Because we can't do otherwise?\n\nYes we can. Just need a little faith and imagination.",
				"added": 1478309249
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 34,
				"body": "I'm supposed to have reached my allowed space limit (i've send a message to raise it).\n\nCan someone read this?",
				"added": 1476545615
			}
		],
		"1_17q6Zhf7PFjrY3ddySK2F78JhAH3FVhmWr": [
			{
				"comment_id": 36,
				"body": "Because she is a MK Ultra crazy satanist  junkie liar.\n\nThe other one is bad but seems a little more... human. \n\nPeople are stupid enough to not see what someone really is and elect him. \n\nThis happened in 2007 in France with Sarkozy, who slaughtered the Libyan people during his mandate and then started war in Syria (along with great Britain, the US and Israel).",
				"added": 1476615017
			},
			{
				"comment_id": 38,
				"body": "> [joe1](#comment_1_1Mek75J11YRr1NabQfvuu9MiTT46K55yyz): That is true. But they have the proper scammer genes and the proper ideology concealed as religion to use others.And they have their puppet leaders like Obama and Hillary and their pawn soldiers in American uniform to make all humans their slaves.\n> \n> This scenario is so hypothetical like would be now dinosaurs the top predators in the food chain.\n\nNot really.\n\nFor example in China, you have today ruthless bilionairs business men who pressure their employee, making them work 80 hours a week for a low wage, out of greed. Take the foxconn scandal.\n\nAlso, an other very good example i have if the poor rainbow forest defenders in Brazil, savagely killed by business men because they want to stop the deforestation. In Brazil, most of the business men aren't jews, but they order these killing nonetheless.",
				"added": 1476827727
			},
			{
				"comment_id": 41,
				"body": "> [petro](#comment_2_16YW3WBnbLGnoaqqRwoeqNEQsKdGGmbqXS): ISIS Leader Admits: We Are Being Funded By The Obama Administration (Obama and Hillary)An ISIS leader named Yousef al-Salafi in Pakistan has admitted that ISIS is being funded by the USA, and thus, the Obama administration. This came from a statement done by the Pakistani government which interrogated Yousef and received this information from him. There was a news report done on this:http://shoebat.com/2015/02/20/isis-leader-admits-funded-obama-administration/\n\nIt was also revealed in the Assange leaks. Clinton admitted in one of these leaks that the US financed ISIS.",
				"added": 1476885809
			}
		],
		"4_1BFTNXtYQDMCurqyg45KLmsV6oJD7bQSsH": [
			{
				"comment_id": 39,
				"body": "Freenet FMS and Sone should be taken as examples.\n\nThere is a reputation system. You can rate people from -100 to +100. However, it's very democratic: you need to have a total of less than -1 to be censored, which never happen since most people will give you positive ratings.\n\nHowever, giving a -1 will supress the posts locally. So if someone gives -1, it doesn't really impact the average rating of a particular people, but suppress his post on his node.",
				"added": 1476876124
			},
			{
				"comment_id": 40,
				"body": "Freenet FMS and Sone should be taken as examples.\n\nThere is a reputation system. You can rate people from -100 to +100. However, it's very democratic: you need to have a total of less than -1 to be censored, which never happen since most people will give you positive ratings.\n\nHowever, giving a -1 will supress the posts locally. So if someone gives -1, it doesn't really impact the average rating of a particular people, but suppress his post on his node.",
				"added": 1476884198
			},
			{
				"comment_id": 50,
				"body": "> [kopykate](#comment_64_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4): ugh, I have mixed feelings about this, though maybe I'm unsure about what exactly you're proposing. ZeroNet is pretty good as it is right now, I don't feel any need to filter out any sites that I don't like .. if I don't like a site, I just don't visit it again. Just create a site where you can review and rate other sites.\n\nYou don't understand. You should try Sone in Freenet. Even if some retards block you because they don't like you,  it won't impact your visibility for the others.\n\nFrom empirical experience , it's almost impossible to be banned by a democratic censorship system like the one in FMS or Sone.\n\nIn Sone, there are despised people, some even despised by the developer, but they are still posting. \n\nTo be banned, you should need half the people rating you less than -75 (between -100 and +100) which clearly never happen except if you are the stupidest of the stupidest or a pure troll or spammer.",
				"added": 1477217015
			},
			{
				"comment_id": 51,
				"body": "Hi Ancap ;-)\n\nWhat ZeroNet needs more than a reputation system is a good captcha anouncing system. Less troublesome than in freenet with the super hard letter but something with multiple picture scheme to solve.\nThis alone put most of trolls and spammers at distance.\n\nAbout the SJWs, most of them don't even get in darknets. Fuckers are too stupid and too comfortable in their vertical mainstream medias. Further they get is facebook and twitter and official websites of SJW NGO.\n\nSome rare SJW in darknets, but they probably got lost and are a minority.\n\nHell even in youtube, they get put in their place, which is at the right side of Soros.",
				"added": 1477242129
			}
		],
		"8_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": [
			{
				"comment_id": 42,
				"body": "> [nutomic](#comment_24_1FEikAyxCNPJcW996B69r5UFg29yfq579m): Capitalism killed way more people than communism ever could. Just look at people in Africa starving, people dying in wars for oil and power, people dying because they can't afford medicine, ...\n\nGod dammit, i know you've lurked here so you have already seen my other posts.\n\nI'll repeat it again, just for you sweet-heart: BOLSHEVISM ISN'T COMMUNISM.\n\nCommunism existed from 160000 to 12000 BCE, and still exist in todays primitive tribes (Jarawas, Guayakis, Pigmees) but didn't existed in modern era. Bolshevism, URSS, is STATE CAPITALISM. Cuba, China (Mao), and North Korea are NOT communists countries. They have a society organized around money, and have a state. Thus it's not communism.\n\nAbout modern communism, it only existed during a tiny fraction of time, during the Paris commune (1872), the barcelona commune (1937), and the Budapest commune.\n\nEach of these communes were crushed by the capitalist state, the republic (Paris, Barcelona), and even by the capitalist state regime aka bolshevism (Budapest).\n\n\n\n\nAbout the main subject.\n\nBasic income seems seductive, but it could lead to a 3 class society, instead of 2 currently (working class, owners of the means of production). You'll have a thrid class: the basic income people.\n\nZbigniev Brezinsky said that, soon, only 20% of the people could make the whole system work. What is to be done with the rest? Tittytainment.\n\nA basic income seem a nice idea, but if the ultra rich still own most of the mean of production, the 80% basic income people will still be fucked.\n\nIf you have a PS4, an iphone 7, a car, a warm house, you can still be fucked. \n\nBeing fucked have nothing to do with the standard of living. A worker in the 19th century had a far lower standard of living than a current worker, but he was PROPORTIONALLY better paid for a particular amount of work he did.\n\nThe wages didn't followed the increase of production during the last century. Machines, helping the workers, produce far more today, but the wages didn't follow the amount of production. \n\nGoods are cheaper then half a century ago, so people live under the illusion than life is better, and that they are less exploited. In fact, they are more exploited. They produce the same amount of work than there ancestors, but they are proportionally less paid for the wealth they create.\n\n\n\n\n\nAbout \"film, video games, music, programs\". \n\nPeople never had to pay for this shit during 99.99999% of human history.\n\nCopyright only exist for about 150 years, and it's a scam. Since when do humans have to give something to see lightwaves or heard soundwaves? Fuck this shit.\n\nAs someone said, humans shouldn't have to expect something in return in order to create. The example given: Deviantart, summarizes it.\n\nAnyway you'll say that i profit from the system, but i don't watch TVshows, listen music or play closed source video-games anymore. Not because of copyright, but because most of them are just brainwashing tools, with lots of feminism, glorification of goods, depraved sexuality etc... \nPropaganda for a decaying Hegemon: the west. \nI only watch a handful movies each year for the externalization of some truths they put in.",
				"added": 1477005793
			},
			{
				"comment_id": 43,
				"body": "> [kosherx](#comment_30_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): This way of thinking killed hundreads of millions, but why not? Let's try it again and kill billions this time? Stupid people never learn anything.\n\nGod dammit, i know you've lurked here so you have already seen my other posts.\n\nI'll repeat it again, just for you sweet-heart: BOLSHEVISM ISN'T COMMUNISM.\n\nCommunism existed from 160000 to 12000 BCE, and still exist in todays primitive tribes (Jarawas, Guayakis, Pigmees) but didn't existed in modern era. Bolshevism, URSS, is STATE CAPITALISM. Cuba, China (Mao), and North Korea are NOT communists countries. They have a society organized around money, and have a state. Thus it's not communism.\n\nAbout modern communism, it only existed during a tiny fraction of time, during the Paris commune (1872), the barcelona commune (1937), and the Budapest commune.\n\nEach of these communes were crushed by the capitalist state, the republic (Paris, Barcelona), and even by the capitalist state regime aka bolshevism (Budapest).\n\nAbout the main subject.\n\nBasic income seems seductive, but it could lead to a 3 class society, instead of 2 currently (working class, owners of the means of production). You'll have a thrid class: the basic income people.\n\nZbigniev Brezinsky said that, soon, only 20% of the people could make the whole system work. What is to be done with the rest? Tittytainment.\n\nA basic income seem a nice idea, but if the ultra rich still own most of the mean of production, the 80% basic income people will still be fucked.\n\nIf you have a PS4, an iphone 7, a car, a warm house, you can still be fucked.\n\nBeing fucked have nothing to do with the standard of living. A worker in the 19th century had a far lower standard of living than a current worker, but he was PROPORTIONALLY better paid for a particular amount of work he did.\n\nThe wages didn't followed the increase of production during the last century. Machines, helping the workers, produce far more today, but the wages didn't follow the amount of production.\n\nGoods are cheaper then half a century ago, so people live under the illusion than life is better, and that they are less exploited. In fact, they are more exploited. They produce the same amount of work than there ancestors, but they are proportionally less paid for the wealth they create.\n\nAbout \"film, video games, music, programs\".\n\nPeople never had to pay for this shit during 99.99999% of human history.\n\nCopyright only exist for about 150 years, and it's a scam. Since when do humans have to give something to see lightwaves or heard soundwaves? Fuck this shit.\n\nAs someone said, humans shouldn't have to expect something in return in order to create. The example given: Deviantart, summarizes it.\n\nAnyway you'll say that i profit from the system, but i don't watch TVshows, listen music or play closed source video-games anymore. Not because of copyright, but because most of them are just brainwashing tools, with lots of feminism, glorification of goods, depraved sexuality etc...\nPropaganda for a decaying Hegemon: the west.\nI only watch a handful movies each year for the externalization of some truths they put in.",
				"added": 1477005911
			},
			{
				"comment_id": 44,
				"body": "> [kosherx](#comment_32_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): tl, dr\n\nAnd you expect to be taken seriously after that?\n\nYour either a troll or some stupid, narrow minded westerner.\n\nLeftists (i'm not leftist i'm radical marxist) are not the only one narrow minded unfortunately.\n\nEven if most of the time right-wing people are more open minded in this day and age, it's not the case for you.",
				"added": 1477049095
			},
			{
				"comment_id": 45,
				"body": "> [pzmw](#comment_9_1ALXyaQsvvCQ3R5WBrPbe4dXsqnLCLEkB7): What do you think about anarcho-communism?\n\nI didn't knew about it. I'm new to radical marxism. Only 2 year ago i was a nationalist like this kosherx, but i was more open minded than him.\n\nI just read quickly about it, and it seems to be one of the best way to organize society for it to be a modern version of the primitive tribe organization, thus being closer to our true nature as homo sapiens than is this shitty capitalist mode of production based on money and private property of the means of production.\n\nOf course we should adapt it to our current technology (networks and heavy mechanization).",
				"added": 1477049731
			}
		],
		"1_1AhXDbKvcLap7TcS2542J7bFYzKHM3xeRU": [
			{
				"comment_id": 46,
				"body": "> [kosherx](#comment_33_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): Anarcho-capitalism is the only moral form of anarchism because it does not deny reality and respects private property. All other forms of pseudo-anarchism are morally and logically wrong, therefore can't be applied in the real world.\n\nYou know what you are? Upside down. For real.\n\nSince when private property is moral? Oh right about 12000 BCE (Neolotic revolution).\n\nFor how long did homo sapiens existed? 160000 years.\n\nSome fucker, a very long time ago, when humans for the first time began to stock food, decided that owning what others produce is legit. Because he had authority and physical coercion over them, he told them it's moral. In fact, they didn't even have a real choice. It was this, or being banned, or killed.\n\nThousands of years later, in a far distant future,  in one of the first decentralized networks, Zeronet, he still has believers, like you.",
				"added": 1477089219
			},
			{
				"comment_id": 47,
				"body": "> [zerowe](#comment_4_1Nx78TLGjBT18krMD175Mr1JwFwnxURRLb): The problem is that anarchism can be easily controlled by some hidden powers if don't exist clearly defined rules.Didn't started the communism as anarchy ?We are already living in an anarchy and we don't even know who controls us and what is their goal.Is the justice system not a full anarchy?  You can get 20 million $ compensation for putting your cat in a microwave and you get nothing if the police or the army kills your child as mistake.Who decides who get the billions and who must die of hunger ?\n\nYes you touched a sore point.\n\nIt's the money game society. A mad game we began to play thousands of years ago.\n\nThere is no invincible great conspiracy, no jew super plot. Only 7 billions retards who still want to play the same game again and again, never wanting to really change or even understand what an awful mode of production we have.\n\nEven if there is a conspiracy (most guys here know what i'm talking about, but only a handful know about the probable conspiracy behind the conspiracy), it is only possible because everybody continue to play the money game.",
				"added": 1477089719
			},
			{
				"comment_id": 48,
				"body": "> [kopykate](#comment_66_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4): In my opinion, leadership is hard-wired in human nature. Is it any surprise that even the hard-core libertarians and anarcho-capitalists have come out in support of Trump? I think not.. we all want our leaders, we just want leaders whose policies suit us.\n\nIt's good to precise, IN YOU OPINION.\n\nANY mainstream scientific research, from the beginning of the 20th century, first time serious anthropological studies were done, until today were you can found in the internet the last researches, will confirm:\n\nhunter-gatherers in primitive societies were (and still are for the last tribes) peaceful egalitarians.\n\nIn our alienated civilization, we function with two awful thing.\n\nFirst: money.\n\nSecond: we delegate power.\n\nAbout delegation of power, it's awful, because most of the time, and especially you delegate an enormous power like for the presidential election, the delegate do not necessarily act in you best interests.\n\nOnly way to be sure you'll exert real power is to directly exert it. Not exerting it by delegating it. \n\nIn the primitive tribe, everything was immanent, so there was no need for complex mechanisms.\n\nHowever, today, our societies are indeed more complex. \n\nThus the closest organization to immanent power over our lives, were all the people exert power, is direct democracy. In the internet era, it's possible. The citizens should be able to write the law, discuss it,  and vote it. \n\nExecutive power (government) should be, in an ideal system,  randomly drawn among the citizens.\n\nSince it's not realistic in today society to randomly drawn executives, they should at least be all elected, and the people should have the power to remove then from their functions at any time without any motives. Real power over the representative. If they act badly, they shouldn't be immune (like G.W Bush), but the people should be able to judge them, and punish them if necessary.\n\nNo, we do not all want our leader. And i feel their is a trend, (mostly on the internet but heh aren't we all geeks and tomorrow society), more and more people believe all these presidential elections in the west are jokes. Bad theater. And they want an other political system.",
				"added": 1477130500
			},
			{
				"comment_id": 52,
				"body": "> [thisweb11](#comment_1_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Absolutely right comrade!.   Also Anarcho_capitalsim is an oxymoron, its grammatically nonsensical as much as philosophically so.  \n\nYes. You cannot make co-exist anarchism and money, -which is fungible power over others, seriously accentuates greed, and end up like virtual chains: debt (usury, and disguised usury if you forbid usury).\n\nAnarcho-communism seems fashionable these days, and it seduce people who think the money-game got corrupted. But here is were they are wrong: the money-game didn't get corrupted: it is a corrupting game.\n\nWhen money was introduced, humans got sick.\n\nHowever, we shouldn't antagonize anarcho capitalists. Most are good guys and just want a better live for them and the others. And the system just want that: horizontal struggle. \n\nIt will take time, but they'll understand that you cannot control money. In the end, money always controls you.",
				"added": 1477250685
			},
			{
				"comment_id": 53,
				"body": "An other contradiction would be the dual class society capitalism necessarily induce.\n\nTo be simple, capitalism relies on the separation of society in 2 class.\n\nFist, the owners of the means of production. These are major shareholders, property owners, and even the owner of a small business.\n\nSecond, the working-class. Those sell their working abilities and their time in exchange of a salary to the owners of the means of production. Of course, they are paid less than the wealth their labor creates. An they are proportionnally far less paid today than a century ago for a particular amount of work. The wages didn't follow the increase of production due to mechanization. Thus, they are, and it's not subjective, but mathematical, more exploited today than in the past.\n\nAnarcho capitalism want to perpetrate this separation of humans in 2 classes.\n\nEven if their system work (which i seriously doubt), there could be less ultra rich, and also less poor, but the separation will stay.\n\nIn the primitive tribe, there is no separation. They aren't 2, or many, but one.\n\n\n\nAnarcho-capitalism is the state of society when it is somewhere between a sharing society (primitive tribe) and a modern capitalistic state. It only last during the transition from sharing society to modern capitalistic state. And even during this short period, life is far from being perfect: there is necessarily tensions created by money and private property of the means of production.\n\nSince it seem to be the subject, i'll give an example. During the end of the 19th century, there were many independent oil producers in the old west. This, for anarcho-capitalist, represent a regretted dream, which they want to make today reality again.\nDo you know what happened in this (supposedly), dreamed, competitive economy?\n\nRockefeller bought all the little independant exploitation. Threatened to lower the prices (because he was in control of the majority of oil and thrusts make economy of scale). For those little oil drill owners who didn't want to sell, Rockefeller just hired thugs to break their bones. After that, they sold their little exploitation. \nThis is how anarcho-capitalism end. Being absorbed by thrusts which crush them because a big company has far less daily expenses proportionnally to their sizes than small companies. A small company use many of it's ressource just to function day after day. A giant company use less, thus it's far more competitive. An economy of small companies in competition could just not function. The bigger would absorb them all an become a giant.\n\nThat's why mustn't rearrange the mode of production once again. We must change our mode of production. Create a new mode of production. A money-less mode of production. A classless society.",
				"added": 1477266238
			},
			{
				"comment_id": 57,
				"body": "> [enoch](#comment_2_1QH1N2BcCN6bQu1J98yUovsnnkvHn8TKhC): I wonder how many of you discussing anarchy (and arguing against it) realize what you are doing on ZeroNet. This. Right. Here. This is anarchy. No rulers.\n\n\nI agree. That why i'm a P2P user. Even since the begining i didn't trusted the clearnet, because it relies on central servers and have moderators submitted to hierarchy. \n\nThis is my vision of anarchy and a money less society.\n\nWe must use the network technology, create algorythms to share the production of good equally, and take advantage of the 5000 energy slaves we all have at our disposal (today, probably more tommorrow), to create a society were no one have to work if he doesn't want to.\n\nBut first, the majority has to understand that the very mode of production: capitalism, is a problem. \n\nMaybe such a world wasn't possible just 50 years ago, but in the decades to come, it could very well be possible. \n\nHowever it doesn't make sense if just a tiny fraction own the vast majority of the means of production. If so, the majority who doesn't owe anything will always be in the capitalistic ruling class hand, and will have to beg for this or that, like today.",
				"added": 1477391246
			},
			{
				"comment_id": 59,
				"body": "> [enoch](#comment_3_1QH1N2BcCN6bQu1J98yUovsnnkvHn8TKhC): Just to be clear. I am a dirty little capitalist and an anarchist.\n\nThe very software you are using in this moment isn't capitalist. Open source is the first stone of a non capitalist world.\n\n> However, freedom of association is great. If you want a money-free society, go ahead. Do not use force/coercion. If it works for you, great.\n\nYou mean don't use force/coercion, like the state capitalists aka Bolsheviks used from 1918 to 1991? It can never be repeated enough. Bolshevism, Mao, North Korea, Cuba, are not communists, but state capitalists. They use, money, they have a state, they even have economy plans (Lenins new politic economy (1921)), thus they are capitalists. If you want real communists in action, take the Paris commune, the Barcelona commune, and the Budapest commune (which were crushed by the bolsheviks).\n\nWhat's more, current capitalists states use force. Nazi germany was capitalist. More recently, the US hegemon going to Irak, Afghanistan, Libya and more recently trying to take control of Syria for they fucking Saudia arabian to Europe pipeline. All of this is the use of force. Same for Russia defending it's interests and not wanting a western pipeline crossing Syria when they have their own project (Turkish stream).\n\nMarx himself said that for communism to prevail, most people must be convinced of its benefits. Otherwise, nothing could happen. It must come from the bottom. From the masses. Debord as well said that the working class must be more educated, and more aware of the basic of the mode of production. \n\n> I think economics (or human action given scarce resources) will keep trade (and mediums of exchanges) going.\n\nThere is no real scarce ressources. With thorium energy (yet mastered see THTR-300 and current HTR-10, also HTR-PM (2017), HTTR (japan)...), we already have at least centuries of clean energy available. And in centuries, fusion would most likely have been mastered.\n\nAbout metals, it's quite easy to find substitutes. Carbon fiber to replace steel, already existing alloys to replace copper. And the bottom of the oceans are full of resources, and we already have the energy (thorium), to extract them.\n\n> The important thing is to go ahead and just do it.\n\nOpen source is the first stone, but it is necessary to push toward everything that doesn't cost a lot, and is easy to mass produce. 3d printing, 3d home building, robotics. But in the end, it's no use if only 0.00001% owns most of these devices.\nZbrezinsky said that only 20% of the population could make the whole system work. For the others, he proposed tittytainment. What about telling him to fuck himself and making these mean of production ownerless?\n\n> There can be many varieties and only time (and ingenuity) will show what works (whether it be 1000s of Ancapistans and Ancomsgrads).\n\nAnarcho-capitalist and anarcho-communist shouldn't fight each other indeed.\n\nHowever, the fall of capitalism is inevitable. This is the law of the falling rate of profit, which is inevitable with mechanization.\n\nAgain, take a look at this: https://thenextrecession.files.wordpress.com/2015/03/maito.png\n\nNo need to be a genius to understand that this mode of production is doomed. Anarcho-capitalism could solve many things about current capitalism, but it cannot solve the falling rate of profit. Oh yes, there is a solution, as you see in the chart: massive war. When will this masochism stop?\n\nAnyway, capitalism is just a mode of production. There were other mode of production before (primitive communism, slavery, feudalism), and there will be other mode of production after, and after the next one.",
				"added": 1477426915
			},
			{
				"comment_id": 60,
				"body": "Edit: (the Budapest commune was crushed by the bolsheviks. The Paris commune by the republic and the Barcelona commune by the republic as well).",
				"added": 1477427221
			},
			{
				"comment_id": 61,
				"body": "> [combustion](#comment_3_1F77xFSkr5vGCikW8QaHwGZk15Wg6sPxZY): http://marx2mao.com/Lenin/SR17.html#c4s2Give that a read.\n> I used to be an ancap, found out about ancom and moved over to that... the glaring problem with it for me was that there is no framework in place to suppress the bourgeoisie from regrouping and taking power, hence the need for a proletarian state, the liquidation of classes (everyone becoming proletarianized removes the primary contradiction: proletariat - bourgeoisie), followed by a withering away of the state.\n> You often see the socialist state become more authoritarian, that's true, but it's precisely because the hostile forces from within and without have ramped up their aggression to the proletarian state. For attacks from without, look at Russia for example, during the Russian civil war all the big world powers jumped in to help the white army. For attacks from within, look at Khrushchev and Gorbachev.\n\nYou sound a little extreme. \n\nThe capitalist class it also a victim from the system. They have all the wealth, all the women they want. But are they happy? Many of them are depressed. Worshiping money and making it the center of their lives. Every friend they have, every romantic relationship, is linked to the fact they are rich. In a way, i prefer to be in the proletariat (however not miserable), than in the capitalistic class. What's more they fear every day that they'll lose their wealth. Which isn't a proletarian issue.\n\nThe capitalistic class are also the slaves of the system. \n\nA change in the mode of production can only happen when a vast majority (80%?) is convinced that we must change this mode of production. When it happens, no capitalistic class will be able to force a mode of production if the people don't want it. Forcing something on the people could work for years, even decades, but in the end the system fall on it's own weight (see what happened in USSR).\n\nWhat's more, it mustn't be limited to a country, or even the west, but it must be a worlwide williness. Yes, it is not for tommorrow. I'm young and i don't know if i'll see it during my life (if i have the chance to grow old anyway). But as Elon Musk said: internet is the nervous system of humanity. With this new technololgy, there's hope that things will accelerate, especially in the new generations.\n\nPS: I was writing this message when i saw the last enoch message popping. I think it answer the coercion issue.",
				"added": 1477438516
			},
			{
				"comment_id": 63,
				"body": "> [stairskeeper](#comment_1_1FiMS3zmuGDUicGZnLDie4hBvVG47dTvtK): In a true anarchist society self defense is duty, not right - it can't be else, as by refusing to defend yourself you are attacking directly any and all other members of the society and force them to defend themselves from you. Something more - if anarchists actually form a stable society they will have to have working set of mutual self defense rules. And self defense is unlimited - no distinction between physical, economical, humanitarian (self defense against attacks that use humanitarian technologies like religion, morale, ideology, etc.), etc. and bans on specific types as in state system based societies.\n> This means in anarchist society there can be no \"holding gun to the head\". Pull out your gun to use it as a threat and any member of the society is obligated to kill you on spot.\n\nSelf defense is pointless if there is no private property. Maybe just to prevent rape or bullying but other than that i don't see the need to use force in a society were there is nothing to steal. Most of the crime worldwide have material motives.\n\nI think many ancaps have a problem. They try to theorize some society with no central power, but still with money. Thus it's like mental gymnastic to imagine what a a society like this would be like, since money always came with a state to punish theft, collect taxes and enforce contracts.\n\n\nThe idea of superior communism is, paradoxically, far simpler. It's just the primitive tribe organization: no hierarchy, no money, but with modern technology. \n\nThe \"only\" difficult thing is to create a money less mode of production. But when this \"little detail\" is solved, everything else will come naturally.",
				"added": 1477505347
			},
			{
				"comment_id": 64,
				"body": "> [enoch](#comment_4_1QH1N2BcCN6bQu1J98yUovsnnkvHn8TKhC): Okay, if you say so.\n\n> Forget your theory, just go do it already\n\n\nFor example, one can stop using too much resources take public transports, stop to consume things not needed (and there are lots), be self sufficient regarding food, (growing vegetables), create a social network were people don't exchange services and good for money but for free. Making our own cosmetics, clothes etc...\nAll of this is good.\n\nEscaping capitalism however is only a half measure.\n\nChanging the whole mode of production is far more ambitious, and could require lot's of intelligence and dedication. It's not something you improvise: october 1918 and the bolshevik disaster is a solid proof. It could take decades of   brainstorming and theoretical researches.\nHowever, what surprise me is that we are doing researches for every possible existing field of human knowledge, but almost nothing for mode of production theory. It's super paradoxical because the mode of production is one of the most important structure of human life. Even more important than energy.  We are splitting the atom, but (almost) nobody is using his brain-cells to theorize an other mode of production. \nWorking class councils as a way to organize production worked (during the Barcelona commune) but are a little outdated today.\n\nBut for it to be changed, people must be convinced of the potential benefits. Otherwise it's no use. And i agree, better a good capitalist system than a bad communist one.\n\nHowever as i said earlier, the clock is ticking: we cannot escape the law of the tendency of the rate of profit to fall. We need something ready for capitalism final crisis, which is inevitable.",
				"added": 1477507726
			},
			{
				"comment_id": 66,
				"body": "> [thisweb11](#comment_18_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): \n>  Trouble is   the people who come to claim your space as THEIR property have a motive to threaten you if you don't leave.   Regardless of whether you only want temporary or shared use of that land.\n\nThat is the crucial point. Superior communism could only happen when there is no racial, ethnic, religious antagonism left. There are three scenarios:\n\n1/Capitalism is currently liquidating all the identities. Whether these identifies are the feeling of being part of a country, a race, an ethnic group, a religion. Capitalism digest everything and transform all humans in generic consumers. Drinking Coca-Cola, eating junk food, watching the same shit on TV. Capitalism is creating a generic human, cut off from all his roots.\n\nWhen the final crisis of capitalism will happen (decades from now), there probably won't be much antagonism left. The humans will suffocate so much in a world ruled by money (it'll get worse and worse), that they'll finally make the jump and accept a new mode of production. It'll come from the base of society. \n\nThis seems like a messianic vision, but it is plausible.\n\n2/An other possibility is that, with the formidable accelerator of events the internet constitute, we will gradually enter in a non proprietary world. The first step was the open source, but open patents, 3d printing, thorium energy, V2G, crowd-sourcing (currently with money but at this point giving a few dollars for a project seems like voting in favor for it), and   direct democracy are concepts which could gradually change the mode of production, without dramatic changes in a short period of time. I'll prefer this solution. We could have an half communist mode of production by 2050.\n\n3/There is also the possibility that an extreme  capitalist mode of production in the future is no much less than communism. I'm not against this theory. It's a kind of weird theory, and it's far fetched, but quantitative easing (money printing),  looks in a way, as a form of communism. Same for requiring insurances for anything and everything. At one point it won't require money anymore. It would just be an obligation to assist some victim of a sinister.  Mass production are more and more mechanized to a point were it could produce without any human assistance. Money itself don't mean much when it's printed out of thin air, and soon, only digits in a RAM. \nAgain it's far fetched but it must be taken into consideration.",
				"added": 1477523403
			},
			{
				"comment_id": 85,
				"body": "Exactly. You have it right.\n\nThat's why communism cannot happen tomorrow.\n\nFor it to happen, there must be no human antagonism left. \n\nBut here is the good news: the only real quality of capitalism is that it liquefies humans identities, and replace them by a generic one. \n\nThe more capitalism develop itself (there is still margin) the more humans will look alike: the universal consumer.\n\nThen, 2 things will happen.\n\n Firsty, humans will begin to suffocate, due to the pressure of capitalism on life itself. Humans today are weak, in the future, they will be weaker, but survival instinct is a real thing. Even the weakest man start to fight back if you push deliberately his head under water until he can't breath. \n\nSecondly, the capitalism final crisis will happen (it's inevitable: tendency of the rate of profit to fall). \n\nIn the end, it's not a choice. It's this or rebooting everything (which would be something very stupid to do).",
				"added": 1478304694
			},
			{
				"comment_id": 86,
				"body": "> [binero](#comment_7_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): That's not possible due to natural selection. Even if everyone went along in a fair way, it only takes one person to corrupt it. That person can profit of the others like a parasite, and they will only survive if they work in their own self interest. Everyone will start forming groups, conquering other groups...\n\nSomeone called Arminius did this in the German tribes. See what happened to him. \n\nYou are projecting our money and hierarchical society logic in a superior communism future.\n\nWithout money and hierarchy, i don't see how corruption works. \n\nYou seem smart, but you see the world from the cell you were born in: the money game society. Thus you cannot imagine how it would be outside.",
				"added": 1478309020
			},
			{
				"comment_id": 89,
				"body": "> [binero](#comment_10_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): You cannot defeat nature. Nature rules everything.\n\nHere we go. Another one who think that our ancestor in primitive tribes were super hierarchical being, ruling without mercy on poor subordinates. \n\nIt's just the opposite. \n\nIt turned to shit when money and delegation of power was introduced.\n\nAbout the argument that a complex civilization need a fungible value of exchange: money, and hierarchy, that's wrong, and the German tribes, which were pretty developed, perfectly demonstrate it.",
				"added": 1478348904
			},
			{
				"comment_id": 91,
				"body": "> [binero](#comment_13_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): You don't understand the argument I am making. As soon as you create anarchy, some people will just not agree, they'll form nations, and they'll conquer the anarchists. Anarchy doesn't work. Even if every human on earth believed in anarchy, it just takes one person to create the first nation, and all others will have to follow, or they'll get conquered.\n\nI see what you mean. \n\nI the current state of the world society, it's 100% accurate. \n\nHowever, in a future society were there is no money, no private property, no hierarchy, no borders (not the Soros version of no borders, but a world commonly accepted as this), there wouldn't be any sense to conquer an other living space. \n\nWhy conquer something that already belong to you, and the others around you? \n\nJust to give you an example, and it's a little abstract, do you want to take over the Linux kernel? Or Debian? For what? it is already open source, if you do this, maybe you'll have control of it, but other will just fork the previous version, and those working for you will flee you or fight you if they just have a touch of manliness. \n\nIn a world were everything is property-less, going back just doesn't make any sense. \n\nIn about 15 years, i predict that linux desktop will represent 80% of the market share. Will it be possible for others to begin to sell windows again? I seriously doubt it. \n\nI believe the trend toward a non proprietary world can be like a one direction mechanism, more and more and more until it reach it's contradiction and we find something else. \n\nFeudalism give way to capitalism when it was confronted to it's own contradictions. \n\nSame for capitalism, we will have more and more of it,  and once the process of a money less society is induced (simultaneously), and it already has, with open source and open patent, it will just follow it's course until it become the whole of the world. \n\nBy then, when humans will have reached this point, this new mode of production will be confronted to it's own contradiction. But instead of going back,  an other mode of production will be found, a new one, which we cannot even foresee yet.\n\nHumans rarely go backwards. We are creature designed (by nature or by God, your choice), to constantly push forward. Going backward is too embarrassing to be considered, except if you try to wipe the memory of all, which is, in this day and age, almost impossible (too much books and data optical support around the world, destroying everything is almost impossible).",
				"added": 1478354390
			},
			{
				"comment_id": 92,
				"body": "> [binero](#comment_16_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Humans go backwards a lot of times. Democracy was invented in ancient Greece, yet it took till a couple of centuries back to re-emerge. Just when you think xenophobia has become a niche, you have president Trump on the horizon. \n> Humans want to be organised. They need strict rules on what they can and cannot do. If there are none, they'll make some. Living in an anarchy is also dangerous to the weakest in society, because they need protection.\n\nDemocracy didn't re-emerge. Representative democracy isn't democracy.\n\nIn superior communism, rule can be made, but it will have to be made by pure direct democracy. \n\nHumans wants to be organized only in a money society (since 12000 BCE), which was never a choice, but was forced on people by lords who were also the one to print the money they imposed on people, and the one to collect the taxes with the very money they printed. \n\nHumans need protection from thieves in a money society. In a money less society, they don't need it: there is nothing to steal.  \n\nAlso there are many documented examples of protection of the weak and disabled in primitive tribes. If some had to loose an arm or become hemiplegic, they were taken care of. \n\nYou're seriously infected by the money game.\n\nTry to heal yourself.",
				"added": 1478370279
			},
			{
				"comment_id": 93,
				"body": "> [binero](#comment_21_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Because quite honestly, life sucked in those times. Death rates where high, people were starving to death.\n\nAre you, by any chance, Adilson Lanpo from freenet? (you have quite his rethoric).\n\nLike some other here and in society in general, you have absolutely no clue of how our ancestors, and how the last primitive tribes on earth lived/live. \n\nI highly suggest you to  watch -even mainstream- documentaries and/or read a bit of studies about the social organization of homo sapiens in it's natural state (primitive tribe). \n\nBegin with this, about hierarchy: https://www.psychologytoday.com/blog/freedom-learn/201105/how-hunter-gatherers-maintained-their-egalitarian-ways\n\n>In every single year in those 8000 people have lived in organised structures.\n\nThis demonstrate you have no real knowledge about the subject. The german tribes even during the roman empire were a complex civilization, but they had no money and no hierarchy (war chiefs were collectively designated, temporary, and symbolic).\n\n>I was born in a hierarchy. So were you.\n\nI you were born in the last primitive tribes around the world, like the Jarawas, the Pigmees, or the Guayakis, you wouldn't be. \nI was born in hierarchy, but my (probably) german ancestors were born in anarchy just 1500 years ago (money appeared in the german tribes around the 5-6 century, mostly due to the necessity to exchange with other countries already having money).\n\n>Those circumstances aren't artificial. It's unavoidable. If one person stops caring, he has an advantage, and by natural selection he'll be more successful and become dominant.\n\nIn the primitive tribe, if one begins to act as an asshole, he begins to be mocked by the others (mostly the elders), and if he persist, he'll be shunned. Then he cannot be more successful or dominant.  That was/is social mechanisms to ensure that everybody contribute to the interest of the group. \n\n>Organised systems need to be imposed.\n\nBy who exactly? The richest? The technocrats? Goldman Sachs? \n\nYou just project your own alienation on others.  It confirm your quote \"I was born in a hierarchy\".",
				"added": 1478390557
			},
			{
				"comment_id": 95,
				"body": "> [binero](#comment_23_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): All your utopias have one thing in common. They were not developped. \n> No, I oppose unfair rule, I propose fair democracy and I impose the majority rule.\n\nOf course they were not developed. The paris commune (anarcho-communists, 1871) was crushed by the french republic (about 30000 death). \nSame for the Barcelona commune (1937): about 8352 deaths.\n\nAs for the Budapest commune (1956), it was crushed by the Bolsheviks (who were state capitalists). 2500  deaths and 13000 injured. ",
				"added": 1478393229
			},
			{
				"comment_id": 96,
				"body": "> [binero](#comment_26_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): That was a point I made earlier though. Even your beloved German tribes had to adapt to the society. Anarchy cannot survive.\n\nBecause capitalism is more efficient. It is a design made to conquer and transform humans and biodiversity. \n\nIt will devour anything until the breaking point of human tolerance is reached. \n\nYou seem to enjoy this mode of production. Good for you. I don't blame you but i'm sure that even you feel that something is wrong. Not in the political organization, but in  the current mode of production itself. \n\nThe more capitalism tighten it's grasp on humanity, the more people will think about changing our mode of production. \n\nI don't want bad things to happen, but if we don't switch gradually to an other one mode of production, we will hit the ground without any parachute. \n\nThe tendency of the rate of profit to fall hasn't been solved, so the final crisis is inevitable. (Although the mode of production could potentially morph gradually with open source, open patent, crowd-sourcing, direct democracy...).",
				"added": 1478396427
			},
			{
				"comment_id": 97,
				"body": "> [binero](#comment_27_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): You're an absolutist. No person in the world who knows me will describe me as a capitalist. I do believe in capitalism. It insentives people to make other people their lives better. I don't believe in a complete liberal society runned by capitalism for the exact same reasons I don't believe in anarchy. People aren't good. People exploit other people. There needs to be a clear organised system to protect everyone equally to make sure everyone can live a good life.\n\nPeople aren't good in a capitalist society. People exploit other in a capitalist society. You read but you don't understand. \n\nThat's what i keep trying to tell you. \n\nThere is no half way with capitalism. You cannot control it. You think you can, but you cannot. \n\nThey is no liberal capitalism or social capitalism. It is one and the same system. And there isn't difference for the people in both of those systems. After 50 years of trying those systems you should know. Did you see a difference between Tatcher politic (liberal capitalist) for people and Mitterand (french president from 82 to 95) during the same period? Of course not. Supposedly they were opposites, but the lives of people in England and France were approximately the same during this period. All the scam is to make you believe that there is a difference between liberal capitalism and social capitalism when it's the same. \n\nAnd about people exploiting people, apparently a good night sleep haven't help you to understand: there is no exploitation in the primitive tribe. Only money and hierarchy: the core of the capitalism mode of production, allows to exploit.\n\n\n>Let's also not forget that systems like open source, open patent, crowd sourcing and democracy all fit in nicely with capitalism.\n\n\nYes they do because they are just drops in an ocean of capitalism. If you're an open source developer, you need to buy food at a supermarket, thus you need to be paid. Thus there is a paradox were you produce something that is non proprietary (gnu software), when you still need money to buy you property and food.",
				"added": 1478453197
			},
			{
				"comment_id": 98,
				"body": "> [binero](#comment_29_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Exploitation always happened. Slavery existed before currency existed. \n\n\nWith all respect, you should study the 4 types of modes of production, and their respective dates.\n\nFor the last time, i'll do it for you but you should just read the wikipedia pages about it. \n\nSlavery didn't existed at all before 12000 BCE. From 160000 BCE to 12000 BCE, it was a primitive communist organizatin, without money and hierarchy.\n\nAbout the 4 modes of production:\n\nPrimitive communism (160000 BCE-12000 BCE).\n\nSlavery: occured in diverse area and in diverse dates since 12000 BCE. But mostly during the roman empire, which was an entire mode of production based on slavery.\n\nFeudalism: division of society in 3. Laboratores, oratores and bellatores. Laboratores worked for bellatores who protected them. \n\nCapitalism: current system of production with the separation of humans in 2: the owners of the means of production, and those working for them (employees).",
				"added": 1478460762
			},
			{
				"comment_id": 99,
				"body": "> [binero](#comment_31_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): That's an absolutist view. I don't believe in communism. In a communist society it's in people their interest to not care about others. It just takes one bad person to ruin it for the others.\n\nThat's because you're brainwashed by the system to think like that. It's completely false, and the primitive tribes, still existing (you can go visit Pigmee or rainbow forest tribes if you want), prooves it. You'll see that they don't exploit each others.",
				"added": 1478460896
			},
			{
				"comment_id": 100,
				"body": "> [binero](#comment_32_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Capitalism doesn't have to be seperated. Cooperatives are also capitalist. Crowd funding is also capitalist. Those are all capitalist by nature. You don't need to get rid of something that has proven to work to work together. Capitalism doesn't require there to be seperation. \n> If anyone has been brainwashed it's you. You do not understand what capitalism actually is anymore.\n\nComplete bullshit. Do a google (i just did it to be 100% sure) and the definition of capitalism is a mode of production with 2 class: the owners of the means of production and the ones working for the owners of the means of production (employees).",
				"added": 1478461127
			},
			{
				"comment_id": 101,
				"body": "> [binero](#comment_34_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Every example you guys listed for anarchy sounds horrible and I definitely do not want to live like that. They're all stuch in even before the dark ages.\n\nGreat vision you have from your ancestors.\n\nThey were living in harmony with nature, with each other, weren't scared about death, were highly spiritual, didn't have mental illnesses, were able to heal with about 3000 medicinal plants, and you think they were horrible.",
				"added": 1478461309
			},
			{
				"comment_id": 102,
				"body": "> [binero](#comment_36_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): You don't need growth in capitalism at all if you do proper redistribution.\n\nComplete nonsense. Many here (ancap and even Jew critics) know that the money creation need growth. If there isn't growth, the system collapse. Money creation is a ponzi scheme and constantly need growth in order to reimburses the credits made.\n\nAlthough, even if the money creation was solved, there is the tendency of the profit rate to fall. No one has already solved this and it's the reason why the fall of capitalism is inevitable.",
				"added": 1478462671
			},
			{
				"comment_id": 103,
				"body": "> [binero](#comment_37_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Their healthcare sucked, they lived horrible and short lives and there is literally no evidence to suggest they didn't have mental illnesses. Usually the statistics saying we used to have less metally ill don't take into account the fact that we got better at diagnosing.\n\n\nTheir longevity were about 70 years old. Their healthcare was better than current one with bigpharma, and it's capitalism and it's alienation that creates most mental diseases. \n\nA 3 second google search about longevity in old times: http://www.ancient-origins.net/news-evolution-human-origins/life-expectancy-myth-and-why-many-ancient-humans-lived-long-077889\n\nGod dammit what's your problem you watched too much TV?\n\n> If we were to go back to the point we where back then, people would just form states again and everything will start over. Some people just love to see history repeat itself.\n\nThere you fail to understand an other concept: superior communism: the primitive tribe organization (a system which aim to organize society in conformity with our ancestor way of life) but with modern technology.",
				"added": 1478462970
			},
			{
				"comment_id": 104,
				"body": "> [binero](#comment_38_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Bigpharma isn't an issue in every country. Their healthcare was horrible with an average age of death of 25. Death during childbearth was through the roof! \n> Also, your technology point doesn't make any sense. Modern technology only came about with capitalism, and capitalist nations have had more technological advances (PER CAPITA!) then non-capitalist states. Why aren't your favourite tribes designing the next microchip? Because they aren't capable.\n\nhttp://www.ancient-origins.net/news-evolution-human-origins/life-expectancy-myth-and-why-many-ancient-humans-lived-long-077889\n\n\" It was found that once infant mortality rates were removed, life span was calculated to between 70 and 80 years\"\n\nTechnology was something present in the german tribes. I suggest that you take an interest about they skills in metal forging, architecture, astronomy, arts, architecture.\n\nI debate in good faith, so i admit that capitalism accelerate technology. But it doesn't create it. Romans created the colyseum with an other mode of production (slavory which was also bad), and Vikings visited america with the feudalism mode of production. http://www.bbc.com/news/magazine-35935725\n\nCapitalism doesn't create technology. Since capitalism is a system which has no choice than to constantly race forward (see previous post about money creation), it's logic that it accelerate technological progress. \n\nHowever, even technology enthusiast like H.G Wells admitted that technology is increasing far too fast. \n\nWe create technologies but we don't master all it's aspects.\n\nAnyway, the better example to proove you are wrong is again open source. Some open source softwares, even not integrated in capitalism, making 0 profit, are just the best thing you can find in a particular domain. However, they appeared without any profit made, or necessity to make profit.",
				"added": 1478463953
			},
			{
				"comment_id": 105,
				"body": "> [binero](#comment_39_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Open source exists within capitalism and thus your point is defeated.\n\nMode of production do not change overnight. The first step of a new mode of production always happen within the previous one. \n\nThe beginning of capitalism happened during feudalism. When bankers started to take over (medicis) and serf were enticed away by rival lords.\n\nSame could be happening for capitalism with open source. The very first steps but it'll grow more and more. The more it grows, the less money will be made in the particular area of software and OSes.\n\nMoney regarding open source software isn't made by selling the programs, but indirectly with advertisement (amazon in Ubuntu),  data mining, and support (E.G red hat). The open source concept itself, doesn't generate money, in opposition to closed source software (E.G Microsoft), which very nature is to be sold in exchange of money.",
				"added": 1478478096
			},
			{
				"comment_id": 106,
				"body": "> [binero](#comment_40_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Cooperations can exist within capitalism. It doesn't have to replace it.\n\nYou repeat again and again that human nature is to exploit each other (which isn't true: primitive organization). \n\nHowever you promote cooperation in the very system which consist to make the most profit for oneself on the detriment of others: capitalism.\n\nSo in short you say: \"exploitation is inevitable, it's our nature. Let's be capitalists. But heh, we still good guys from time to time,  within this capitalist system, we can still cooperate\".\n\nThat looks like  dual personality traits.\n\nIn a capitalist system, we fuck up everything, and then we distribute bandages to the one who paid the price. Whether it to be the poor, unemployed, the biodiversity, the atmosphere, the soil (shale gas), the planet herself.\n\nThat's how we buy (again) us a good conscience. It's 90% pain and 10% reassurance. Looks like you love your 10%.",
				"added": 1478521890
			},
			{
				"comment_id": 107,
				"body": "> [binero](#comment_41_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): I don't say exploitation is human nature. I say it merely takes one person to exploit it to force all others into doing the same. \n> You are actually using a strawman argument regarding capitalism. Capitalism can be regulated. Demand and supply can be influenced. For instance, a tax could be applied on greenhouse gasses or they could even be directly controlled by the people.\n\nNo capitalism cannot be regulated. Because when you are the owner of the means of production, the rule is \"make profit or die\". Thus it's only comprehensible that companies fuck the planet, destroy the rainforest, corrupt the representatives,  exploit the employees, make children work for your shoes. It's this, or an other will do it, and your companies will go bankrupt. \nIn fact, regulating capitalism, say in some western countries, only encourages companies to relocate. \n\nIn theory, it could work in a 100% unified world since if the legislation applies everywhere, there won't be anywhere to relocate in order to benefit from less constraining legislation. \n\nHowever,  at this point, in a unified world, it would be far better to have an other mode of production, less predatory, since if there is no antagonism left, cooperation without money, competition and predation will be possible.",
				"added": 1478524891
			},
			{
				"comment_id": 108,
				"body": "> [thisweb13](#comment_20_1NLj8uWHVf68dt53Wuz5HRqQvX7fScCXpD): http://strikemag.org/bullshit-jobs/\n\nCompletely true, i've noticed it.\n\nMost of the jobs are indeed useless, and some even degrading. \n\nThat's why i decided about a couple years ago to not buy goods or services that make a useless emplyee work and hate his job. Some will say that in doing that i'm partly responsible for unemployment if there is lay-offs in those sectors but in fact buying thing you don't need is just perpetrating an obsolete mode of production. \n\nFor example i don't order home delivery meals, or go in restaurants, because it's useless (and the food is expensive and bad anyway): everyone can cook himself. \nI don't buy new cell-phones, because they are all the same device with different brands and the powerful hardware in them is useless for most of the people.  Foxconn scandal demonstrated that these useless jobs lead to suicide. That is the very definition of Marx alienation. Being, doing, something other than you really are as a human. \n\nIn the future, it'll become far worse. Taxi, trains, subways, planes, will soon be all autonomous. Same for manual workers in factories.  Cleaning jobs will a little later be replaced by robots. Construction workers will be replaced with 3d printing (houses have been successfully printed in China). And administrative tasks will shrink again and again due to computers and clouds. \n\nZbigniew Zbrezinsky, even if he is a capitalist and the hand of the Rockefellers, is right. In the near future, 20% of the population will be enough to make the whole society function. What to do with the 80%? He propose tittytainment. Is that realist or faithful to human nature?\n\nThere is a major problem with this automated society: we didn't even begin to think about changing our mode of production. \n\nSo we'll have a mode of production (capitalism) supposed to function with almost everyone working, doing \"jobs\", when in fact 80% will have no task to complete.\n\nTittytainment could work, but is this what we want as humanity? 80% useless, brainwashed, and 19% working for the 1%?\n\nIf we changed our mode of production, people could do everyday what they really want. And those motivated to do hard stuff -engineering, computer programming, architecture-, will do it anyway. It has been proved with open source softwares. Genius programmers voluntarily work for nothing. And it would probably be the same for most of the people. There would be some who won't do anything and play (open source ;-) video games all day, but they'll probably be a minority. \n\nWhy do you type on your keyboard know, do you love typing so much? Or do you like debates so much that you engage them just for the fun of it? \nNo. You do it altruistically. Because you think your point of view is the best for all humanity. \n\nI think we have reached the technological point, or at least we're not far from it,  were we could have all our needs covered without needing to work. The hardest part, the technology, is achieved. Now, all we have to do is change the mode of production. Primitive communism, slavery, feudalism, capitalism, superior communism, the circle comes back. \n\nThe only thing we need to accept, is that we must  stop wanting shit we don't need. In exchange we won't have to work anymore, and will be able to do what we really want, not what the labor market (in the current mode of production) offer us.",
				"added": 1478568901
			},
			{
				"comment_id": 109,
				"body": "> [binero](#comment_77_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): I do believe leadership is needed because some things are impractical to organise otherwise. Try to launch a rocket in a cooperative way. This is next to impossible. You cannot have thousands of people who build the rocket vote on every decision that has to be made. You have to do it in smaller groups and send representatives. There will be management involved as well.\n\nYes, leadership is needed (today anyway, maybe not in the future), as in the primitive tribes, hunting chiefs were designated, but they should be dismissible at any moment. \n\nTake the Debian organization. It's close to a worker council (revolutionary Catalonia 1937). It works without money (like shareholders in commercial companies) and without non-chosen hierarchy (in a commercial company, workers don't choose the CEO). \n\nhttp://debiananwenderhandbuch.de/bilder/allgemein/debian-constitution.png\n\nAs you can see, the developers, who are volunteers, elect or recall the project leader. \n\nAlso in revolutionary Catalonia, production increased after the collectivization. Decisions were made through councils of ordinary citizens (check wikipedia, for once it's well documented). Those who wanted to keep their lands were allowed to, but only as much as they could use on their own. And they weren't allowed to use workers. \nIt worked wonderfully and production even increased.\n\nFor a short time, in the 20th century, in Catalonia, humans lived for a few months as they were supposed to live. Until the Republic crushed them all.",
				"added": 1479509967
			},
			{
				"comment_id": 110,
				"body": "> [binero](#comment_78_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Ironically enough I would oppose such a structure for not being democratic enough. Furthermore, this is just a representative demoracy.\n\nNot really a representative democracy since they can recall the project leader and override him. \n\nSeems the project leader take the decisions, but if the developers don't agree, they can override him, or even recall him.  \n\nThe Debian project (i indirectly benefit from it since i use one of the forks of Debian) should inspire way more other organizations than it currently does. \n\nThis is a very technical project (OSes are  complex systems) but working in a very democratic way.",
				"added": 1479512273
			},
			{
				"comment_id": 111,
				"body": "> [binero](#comment_79_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): \n> I don't see a structure like this resolving any issues compared to the structure we have today. In fact, I don't think this is much different from a regular representative democracy, although admitidly more democratic. I know quite some people who run bussiness in a similar way to this.\n\nIn a traditional commercial company, it's the shareholders who have the power. It is them who decide to nominate or revoke the members of the boards of directors. \n\nIn a structure like Debian, it's the developers (thus the workers in a sense, however since they are volunteers they aren't really workers) who decide to nominate, or revoke the project leader. \n\nSo it's still an evolution from the traditional commercial company since it's the base of the pyramid, the majority,  which decide, not the owners of the capital.",
				"added": 1479595713
			},
			{
				"comment_id": 112,
				"body": "> [thisweb11](#comment_80_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM):   And im guessing one of the reasons we both like zeronet is precisely because neither of us likes the idea of management and hierarchy dictating the terms of a discussion or idea.  And, well, isnt that what we have  here?  Anarchy.\n\nYes i can't stand central servers especially for forum talking. Even before darknets were available.\n\nI was never the target from censorship on the clearnet but the only idea that posts can be deleted by a moderator for some vain reasons upset me.  \n\nI'm still on freenet (Sone and FMS) which is truly impossible to censor, even for the developers.",
				"added": 1479770725
			},
			{
				"comment_id": 113,
				"body": "> [binero](#comment_187_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): You attribute human indecency to civilization, but I see literally no evidence for that.\n\nWith specialization came alienation. Humans not doing what they want, but what society let them do in order for them to pay for their food and shelter. \nIt still on today. People saying that it's not their fault if they are soldiers hired to kill people for higher interests.  They'll say they don't have a choice: it's for the wife and kids at home. \n\nLearned recently that in native Indians tribes, you weren't obliged to fight if you didn't agree with the conflict.",
				"added": 1482107570
			},
			{
				"comment_id": 114,
				"body": "> [binero](#comment_191_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): It's not with specialization but rather with private ownership of production that came alienation. People feel disconnected from their labour as they cannot see who benefits from it.\n\n\nI understood (in the manuscripts of 1844) that it's not because workers cannot see who benefits from their work, but rather the fact that when they work, they are not, and do not do, what they are supposed to be/do as humans. Rather, they are something else, thus the word alienation.  Especially in factories. Who wants to be an assembly line worker?\n\nSpecialization increase alienation, and specialization is one of the element of capitalism. Capitalism began in the 13th century with the textile mills. Capitalism is clearly linked to more and more  division of labor, specialization, which tend to increase alienation.",
				"added": 1482184306
			},
			{
				"comment_id": 117,
				"body": "> [binero](#comment_192_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): See, I disagree. Furthermore, I capitalism is one pushing the hardest to get rid of the assembly lines atm.\n\nCapitalism was born in the 13th with the first assembly lines. However  as the other mode of productions, it contains it's own contradictions. It doesn't push hard because it his gentle toward humans, but because it is more profitable. Good, because it dig it's own grave, and the next mode of production, whatever it is, might be better. Probably no more work.",
				"added": 1482359212
			},
			{
				"comment_id": 118,
				"body": "About the state, it was born after the neolitic revolution, when human cohesion inside a group exploded because of the separation of society in 2 classes: working class  and owners of the means of production.\n\nTo maintain the cohesion in this exploded society with strong antagonism (the interest of the 2 classes do not converge), the state was created. With laws and coercion, the state force the 2 classes to coexist without destroying themselves. Sometime, the state is not enough to cement the 2 classes, and revolts happen. \nThat's what happened with the peasants revolts in the late middle age, but also during the paris commune (1871), the barcelona commune (1937) and the Budapest commune (1956). \n\nIt is possible that if capitalism doesn't die out progressively, a final global revolt during capitalism final crisis will happen, crushing it once and for all. \n\nHowever, i think it will die out progressively, with open source (software but hopefully also hardware) and mechanization.  The sooner the better.",
				"added": 1482360120
			}
		],
		"1_1L14vSk76tujfNoqrcRuFk2tBBZgUPy92t": [
			{
				"comment_id": 49,
				"body": "I never believe in Assange. \n\nHowever is it somehow related to the recent dead people  (6) criticizing Clinton?\n\nIs Assange the last one of them?",
				"added": 1477136416
			}
		],
		"1_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": [
			{
				"comment_id": 54,
				"body": "Unfortunately, nofish have power over what we post.\nIf you really want something impossible to censor/modify, use Sone in Freenet. Nobody can alter the posts there.",
				"added": 1477266346
			}
		],
		"5_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": [
			{
				"comment_id": 55,
				"body": "> [ancap](#comment_76_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz): Except that they can't call it that.And they steal from the people through state subsidies.\n\nMaybe, but Tesla and Solarcity (now merged) are one of the best proponent of V2G/ Solar-wind synergy.\n\nAnd Tesla is fundamental in that it makes the masses dream for an electric car, thus adopting the technology faster.\n\nTesla at least make the EV vehicle gain a few years in term of adoption by the masses.\n\nPeople don't dream about the Nissan leaf, but the model S. \n\nWhen EV will have good range and be affordable just a year from now (Bolt, model 3), they'll make a psychological transfer from the model S to these models and EVs will take off.",
				"added": 1477312508
			},
			{
				"comment_id": 62,
				"body": "> [ancap](#comment_79_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz): Really? How's that?http://www.latimes.com/business/la-fi-hy-musk-subsidies-20150531-story.html\n\nTrue, but there are far worse way to spend tax money than the future of automotive and energy (V2G).\n\nTesla is inherently a good thing, for once.",
				"added": 1477503718
			},
			{
				"comment_id": 69,
				"body": "Tesla is doing a fast moving race. It's moving ahead of it's financial possibilities. Same for the gigafactory. That could be view as  strategical : if in five year Tesla win it's gamble and is the biggest battery manufacturer worldwide, producing less than the demand ask, it will be a good thing for the US, and even for US citizens, in terms of jobs and wealth created.\n\nMaking batteries was always the point. The nice cars and open source patents are just an indirect way to sell batteries.",
				"added": 1477651009
			},
			{
				"comment_id": 74,
				"body": "> [starbit](#comment_1_1MaFsTn4XatXpbJVcAUWaeW8qDuxptvXFk): Yea or at least everyone has to have self driving safety measures like automatic braking. Throw a 500 piece of equipment on every car/truck and drop the mortality rate by 5 times in one year. Just make it mandatory and give everyone the equivalent break in taxes. Win/Win.\n\nI thougt about the same thing. On toyotas, anti-collision cost about 400 euros, and could avoid many pedestrian hit.",
				"added": 1477782568
			}
		],
		"3_19arYgVKguUamTqtYGu6T9FSUsr19CyEcG": [
			{
				"comment_id": 65,
				"body": "In fact from empirical experience from freenet Sone, captchas also take human trolls at distance. Most of them anyway.",
				"added": 1477521297
			}
		],
		"2_1MdwjTFbwpWCLfyo2ZjeXzB7DbL7euNPBi": [
			{
				"comment_id": 71,
				"body": "Why making an other currency? \n\nCan't you imagine a world without money? \n\nIf you have time and braincells to dedicate to a knew currency, supposedly flawless (but that's the point: currency is power over others by essence), then you could think about making a money less society.",
				"added": 1477688123
			},
			{
				"comment_id": 75,
				"body": "> [vwsf](#comment_7_1MdwjTFbwpWCLfyo2ZjeXzB7DbL7euNPBi): Greatly appreciate your response.\n> \"Can't you imagine a world without money? \"I can imagine a world without money.  It's called heaven.  Unfortunately, I'm a vile sinner, on this side of life.  Means I have to choose make the most out of the circumstances for myself, family, community and state. \n> \"if you have time and braincells...\", Are you saying that I should spend my time making society better, rather than create new currency?\n\nNo, but that you should try to create an algorythm to allocate the goods equally without money needed and with taking resources scarcity into consideration. \n\n> Currently, I lean toward the belief that developing better \"money\", will have the greatest return and impact on society than any other subject, for those of us with \"brain cells\" can put our minds to.   Global poverty, disease, hunger, famine, pain and suffering can all be linked back to money. An accountable, traceable, honest, interest free, demurrage money system, has the greatest potential to address these problem at one the root causes for all these issues.\n\nWhen you have a fungible asset, and money is the ultimate fungible asset, the ultimate mean of exchange, you'll necessarily have interest. There will always be someone who wants 100 and somebody to give him his 100 but on the condition that he'll give back 110. Usury is consubstantial to money. \n\n> My appeal.  \n> \n> Money is a medium of exchange.  \n\nYes, but we don't need exchange. We need everyone to have their needs covered, but not necessarily to do it with exchanges. \n\n> If one is self sufficient, one has no need for money.(While I love the idea of rugged individualism, i.e. in the wilderness, being a prepper, growing my own food,  being self sufficient, being off the grid on my own land, but there are too many genius people with great ideas, services and products, which I'd love to exchange my services and goods for.  To do this one needs an easy medium of exchange.)\n\nI don't want to grow all my food and live in simplicity either. We can indeed live without money in our capitalistic system but then it's a live  without computers, hi-tech etc...\n\nIn order to have everything we have, we need to function as a society as a whole. Nobody on the planet earth could build a PC from nothing alone (build all the different component himself. it's impossible, especially for the CPU and GPU, and even the SSD).\n\nHowever, functioning as a whole, together, doesn't mean that we have to do it with money. There were other modes of production before capitalism (primitive communism, roman slavery, feudalism). Changing a mode of production doesn't mean going back to live in caves or even scrap the ground all day to grown vegetables. Changing the mode of production doesn't mean stopping the production, but changing the way goods are produced and distributed. \n\n> Most people are not self sufficient, \n> Therefore we need money. (At least on this side of heaven and life)\n\nNo, we don't need money. Humans existed from 160000 BCE to 12000 BCE without money. More recently, the german tribes, who fought the roman empire, and were a great civilization,  didn't use money. Same for other civilizations like the Anasazis indians (puebloan indians).\n\nWe need to create an alternative system to produce and share goods without the needs of an universal value of exchange: money. Producing and giving directly to the final user without exchanging it for something. It already exist in a form: open source. But we need to transfer this principle into the material world.  \n\n\n> As for \"flawless\" currency,  don't know if it's possible, but the focus is on the upward spiral, understanding, improving, addressing known weaknesses in current system to make it better and better. A lot of what crypto currency  has to offer is good. If philosophically, more \"freedom\" for the masses is the goal, then we make it better. \n\nI use cypto currencies. And it offer advantages over usual currency exchanges,  like bank wiring,  in rapidity, anonymity, flexibility. But it is exactly the same fundamental principal. It's a currency. It's something that makes human other than they really are: a sharing species (primitive tribe organization). Scientific made an experiment with monkeys and money. They taught these monkeys to use money. Soon the monkeys began to prostitute themselves, to steal. Money is inherently a bad thing. Human living in it's natural state, the primitive tribe, don't use money. And didn't use money for 95% of human known history. Money only appeared recently, about 12000 years ago. \n\n> As for \"currency is power over the others\", while it seems true now with our current system, this does not have to be.  This is why I pose the question; to engage in conversation to learn and improve our current system for myself, family, community and state. While I'm better off than others under this current system, I recognize that it is rigged. Is there not an obligation by those who are capable, to serve and be served by our fellow man?  \n\nThose who are capable are enslaving you. Money are chains. By the way, people never choose to use money. Before that, there were a system called recognition of claims and liabilities. People offer their goods and services, but without money. When you had a liability to someone, you'll pay him with what you can do. The claim and liabilities were registered in temples. \nIt is the powerful who imposed money. Because they already controlled coin printing. And money was a very convenient way to collect taxes and also to make possible their soldiers to buy stuff to the people with this money. They printed money, and collected it later. Like today, a scam, from the beginning. \n\nThose who are capable regard you as a serf. I saw from you text that you believe in god (i'm agnostic), well, these capable serve Satan (many here on Zeronet post about it). \n\nMoney, by essence, is chains. It always has been.  There will always be someone richer than some other. Whether because he is smarter or more talented, but more oftenly because he inherited it, or was simply lucky, or didn't have health problems. \n\nCapitalism will absorb anything and everything. Soon children will be for sale everywhere. You'll have a chip under your skin to buy stuffs (or that what they want). \n\nCapitalism doesn't care about the well being. It only cares about making a profit. Thus having poor health people isn't a problem if you can make a profit about it. Destroying the environment and making species disappear isn't a problem if there is a business in environmental protection. \nCapitalism doesn't care about truth, well-being or about the environment. It only cares about making more profit. \n\nYou cannot expect well-being in such a system. It needs to grow (money creation) or it will collapse.\n\nAnyway the most striking argument is the tendency of the rate of profit to fall: http://cpgb.org.uk/assets/wwtemp/FIG3.png\n\nThe capitalist mode of production will fall. It's inevitable.  That's why we must think about an other mode of production, money less.",
				"added": 1477785682
			},
			{
				"comment_id": 76,
				"body": "> [ancap](#comment_92_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz): So because people aren't the same, money is chains.\n\nIf i was a billionaire, i would probably act like them. Creating wars, making false flags, decimating the environment. There is no good capitalist or bad capitalist. Once you are confronted to the obligation of making profit, or going bankrupt, all your morality will go off.\n\nThinking that if the capitalistic elite weren't Kabalist jew, Frankist or Satanist, all will be nice is nonsense. \n\nIt is not a problem of a particular person, a particular state, a particular religion, ethnic group, race etc...\n\nIt is a systemic problem. A system which devour anything and everything, and finally will devour the very essence of homo sapiens. It has started thousands of years ago and as already severely alienated our nature. \n\nThinking that there are good capitalists and bad ones is nonsense. If you play a particular game, you play by the rules. Even if the game is unfair by nature. I you do a MMA fight, don't expect it to be unfair if you got hit on the head while being on the ground. Same for capitalism. Every country, every billionair, whether they are US, Chineese, or Brezilian (especially Bresilian, who are ruined the most precious thing we have: the rainforest) act the same: they transform everything the possibly can into money. They make profit at whatever cost there is. \n\n >What nonsense \"logic\" is that?You don't need any money if you don't want something that belongs to others.Problem is, socialists want handouts, but they don't want to pay.So, money is chains. Very deep!\n\nFirst, it's not socialism, but radical marxism.  Socialism still want a state, and money. At least in the western europe conception of socialism. \n\nI absolutely don't want anything that belongs to other. I want that everybody have everything he needs (without luxury bullshit and shiny garbage) covered. \n\nYou don't understand. It is not handouts i'm talking about. In a handout, society still need to be organized around money in a way that you must take something from the people (like tax), and give it to others.\n\nIn a money less society, there is no exchanges. The production is shared, but no natural or legal person will take from you and give to others. \n\nOf course, people will have to organize themselves, and stop relying on others (delegation of power), in order to function as a society. \n\nIn the futur, if i'm frustrated because i need a particular object, i won't have some capitalist making a market study finding out that i'm not the only one needing this particular thing, and creating it then selling it to me, mobilizing the workforce under his control. \nIn this example, i'll have to organize (systems of organization will probably be created), with other, in a way to share knowledge and ressources in order to make the stuff i need. \nIt's more responsability, but it comes with freedom.  \n\n\n> You may end up having a chip under your skin because you want free handouts by the state.If you're a freeloader, yes, you have to accept to be a state serf. Enjoy your handouts.\n\nI don't want handouts. I'm against UBI because i think it'll create a third class of people (capitalistic class, proletariat, and UBI people, the third class). \n\nI don't want a state. Radical Marxism (which relates to anarcho-communism) want to abolish money and the state.\n\nI think you don't see the concept, or you refuse to see it. \n\nHow did the german tribes organize themselves, were they a bunch of freeloader? \n\nYou seem to be frustrated by the people who won't work and will have everything without doing anything. That's the trap of capitalism: making us fear that we will work for other. It's already the case, we don't work for the lazies, but for the ultra-rich. \n\nAnyway, in such a system, there will be people which won't work and profit. But there is also a category of people, even worse, in our current system: annuitant. Annuitants do not contribute to anything, but take the money (the work) of others, and the system guarantees it, with the laws that sacralize, constitutionalize, private property (of the means of production).\n\nIn a sharing society, there will be lazy people, but they will be subjected to social pressure. After all even if we change the mode of production, we will remain humans, and social mechanisms like social pressure will put pressure on them in order to make them do something for the society. \n\nAnd there will probably be a place for everybody. From the one making vegetables grow to the highly intellectual computer scientist, with teachers and healers in the middle. \nThere will still exist some sort of hierarchy, some will be more respected than others, because they are talented or intelligent, but all will have all their needs covered, in harmony with the ecosystems, and human health.",
				"added": 1477831099
			},
			{
				"comment_id": 79,
				"body": "> [ancap](#comment_94_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz): How can you make a profit if you destroy your field, or factory? You can't.You misunderstand the problem and you don't even know why.\n\nSo for you capitalism isn't responsible of the 9/11,  or the blatant lies about Gaddafi or Assad, spoken in order to conquer those countries? \n \n> Again, your comprehension of \"rules\" is incomplete. First off, in almost all of MMA only kicks (including knees) to the head of a grounded opponent are forbidden. And second, you based your misstated comparison on the UFC rules, apparently unaware of the fact that kicks to the head are allowed in some rules (e.g. PRIDE).Now I'm nitpicking on this unrelated stuff, but it's symptomatic - you simply don't have the knowledge required to debate this stuff.\n\nI think you're projecting. I have enough knowledge to debate about capitalism (it's basics anyway). But you don't seem to have a clue about how your ancestors lived. You think history began with the American old west. Ancap dream (even if it was shitty if you're realist and accept the truth). \n\nYou didn't understand the example. I was trying to explain that in a capitalist society, everyone, even me,  have to act has a capitalist, thus exploit people and environment. If you play monopoly, you'll play according monopoly rules. If you play poker, you'll play by poker rules. If you play capitalism, you'll play by it's (corrupted by essence) rules. \n\nIn an other mode of production, it could be different. It was different before 12000 BCE, and it will be again (the sooner the better).  \n\nThat's all i wanted to explain with this example. \n\n \n> Who decides what is \"luxury bullshit\"? Chairman Mao?What if someone is too poor to get a a \"reasonable\" mobile phone but he can't afford it? How does he get one?\n\nNow you slip into caricature. Radical marxist are against all hierarchy. Hence chairman Mao doesn't even exist to a radical marxist point of view.  You really should take an interest about how the primitive tribes and the more recent german tribes worked as a society in order to help you to understand. \nAbout the mobile phone,  in a money less society, he doesn't have to afford it. Production is shared.\n\nDo you even know how our ancestor from 160000 BCE to 12000 BCE lived? Apparently you have no idea. That's why even if you have an accurate vision of what happens in the current geopolitical context, you cannot even have the slighest idea of what homo sapiens organization in it's natural state is. Any good faith people here will agree, it's not a money centered organization. \n\n About the phone example, stop with your bolshevik allusion. Just stop. I said again and again (and all ancoms or radical marxist think likewise), that we need direct democracy. In this capitalist mode of production, but also in the mode of production that comes after. Mao wasn't an Ancom (radical Marxist). He was a state capitalist. \n\n> Not everyone wants to live in Potemkin villages. Some people want to organize and live according to their own rules and values.But the old problem with all communisms is that they are doomed to fail as long as people can go across the street.As the greedy and competent leave your commune and sick and unable to compete join it, guess what happens? Obamacare happens. And then you need a chairman Mao to set quotas and micromanage phone manufacturing, etc.\n\nMy commune? Who said it's mine. Who said i want to force anybody.\n\nWhat are your values, just say it for once, a money organized society? This is your values? You chose a path, anarcho-capitalism, but now you are in an impasse. There is no anarchy in a capitalist society. It has never, ever existed. Capitalism comes necessary with a fucking strong state.\n\nHowever, i have plenty of example (i won't get tired of repeating them) of anarcho communism organization. Our ancestors from 160000 BCE to 12000 BCE. The german tribes. Anasazis indians. The last primitive tribes (Guayakis, Jarawas, Pigmees), still living currently on planet earth. Also the Paris commune, (1871), the Barcelona commune (1937), the Budapest commune (1956).\n\nJust give me an example of real ancap society? None. It doesn't exist. The examples given by Ancaps (free cities of mediaval europe, old west, Yurok indians), are paradoxically ancoms, or in a state between primitive organization and capitalism. \n\nWhen a society is in a state of organization between a primitive tribe or a capitalist society (in it's development toward capitalism), you guys call it Anarcho capitalism. In fact, anarcho capitalism is only an intermediary state between primitive organization and capitalism. \n\nBut in a way you're right. Communism can only happens when capitalism has become the whole of the world. When it has conquered any available space, whether it to be territorial space, biodiversity, or human nature. Because communism is less efficient than capitalism. So if there is any capitalistic entity left, it will devour any new emerging sharing society. To help you understand, take native Americans. They didn't ask anything, but capitalism took everything from them.  Communism can only emerge when 100% of the world is full capitalism, because by then, capitalism will not have any antagonist left. It will have become the whole world. It will be not many, but one. Only then, without any distraction, economical space to conquer, enemy to crush,  will it be possible for it to contemplate it's own ugly nature and then morph into something else. \n\nBy then we'll all suffocate. You'll suffocate. Anything and everything will be for sale. Life itself will have a price.\n\n In this case i just hope we'll go toward a sharing society gradually with processes like open source, open patents, mechanization and direct democracy. Because if we go full capitalism, we'll suffer.\n\n I understood you like movies (even if you tend to not perceive the deepest level of interpretation in them, what message the director really wanted to share,  like in fight club, otherwise your alias would be ancom and not ancap).\n\nHave seen cloud Atlas? The Fall. That's what will happen if we continue with this mode of production. The Wachowskis, as crazy as they are, have understood. \n\nApocalypse. This time not made by a natural event, but 100% man made.",
				"added": 1477877629
			}
		],
		"1_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": [
			{
				"comment_id": 77,
				"body": "> [7h](#comment_2_1B5iUj9wVHFvsujUy7e9yt1Q6t2RTJ77yt): Blood has a special meaning for Jews. In the Jewish teaching the blood is the center of soul.In the Kabbalah, the secret Jewish teaching, God has 10 properties. (like an RPG character)The Yesod (Connection) is Gods property. It signifies also the male sex organ on the Tree of Life from the Kabbalah.When the rabbi sucks the blood from the penis of the baby it has a symbolic meaning.It makes connection to God for the spirit of the child through the rabbi.Metzitzah b’peh is a holly sucking for Jews and essential for their religion.\n\nThe jews god is Satan. \n\nIt's pretty obvious if you read the Torah. \n\nThey are Satan chosen people. \n\nI must add that the vast majority of jews aren't conscious of this, and believe they are making good.\n\nAlso, Free-Masons are Atheists Satanists. \n\nThe materialistic modern philosophy, making us believe there is no god, or at least no power over us, serve Satan, because he want to disconnect us from the Source: God. \n\nIf we are disconnected from the source, then we will be his.",
				"added": 1477832637
			},
			{
				"comment_id": 80,
				"body": "> [phr34kz](#comment_30_1NGTMtN8816KeCtNqy6W4fCQduU4P8iwty): Now i know who to go if i want my penis sucked\n\nLol. \n\nYou'll have to give your foreskin if you still have it. \n\nAnyway those things happen in the 8th day of the child.",
				"added": 1477956023
			}
		],
		"2_1Cxt2k3farSSee7HTkJKJ7eCTKxfFGNXe6": [
			{
				"comment_id": 78,
				"body": "> [ancap](#comment_90_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz): Of course she won't, because then it becomes more likely that she ends up where she deserves to be.\n> This week Assange said the next leak will get her arrested. \n> We can only hope he's right. So far it did't have much effect and I've lost count of the criminal acts leaked in recent months - I think at least 20-30 different things that the corrupt FBI failed to investigate and recommend to prosecution.\n\nEven if she is elected, there is enough content and proofs about her low morality that it will stain her electoral \"mandate\" (i put parenthesis because in a real mandate in civil law you have power over the representative, which isn't the case regarding elected Representatives in western politics). Then the one who have voted for her will realize what a bad choice they have made, but it'll be too late. They'll already consider voting for the next puppet anyway. \n\nWhat sickens me is that most people aren't even aware of these proofs, if they were they wouldn't even consider voting for her. That is the result of a society were opinion is made by vertical mainstream medias. \n\nWe are in a system were the consent is fabricated (Edward Bernays), and the masses are nurtured with tittytainment, and submitted by social pressure directly created by vertical mainstream medias. \nWhat other should we expect from such a system? \n\nPeople often realize when it's too late. \n\nAlso, even if the bitch isn't elected, she will still have lots of power (provided she isn't dead by then) in the US politic, like the Zionist McCain have even if he lost the 2008 election. Of course, it's not power she exert on her own, but for the ones pulling her strings.",
				"added": 1477836363
			},
			{
				"comment_id": 81,
				"body": "> [aoi](#comment_4_13NJuU9nw3cFSVoETCkN6BCv5s5v5V2ngA): The same or even worse happened with George W. Bush and then came 9/11. This time I expect something similar.\n\nNuclear false flag? I dreamed about it this night.",
				"added": 1477998878
			}
		],
		"1_11pADbvn3XmFZ5sbM9ZANRb5Gv9igHLCF": [
			{
				"comment_id": 88,
				"body": "> [binero](#comment_1_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Easier said than done. There is no exploring to do. Everything seems pretty dead and empty.\n\nIt is not dead, it's just new.\n\nP2P internet will take off. Maybe Zeronet, maybe an other network in the future. We just have to use them in order to accelerate the process a little bit. \n\nI don't like to post on a privately owned central server (most likely owned by some of the 0.1%) prone to censorship anyway.",
				"added": 1478309517
			},
			{
				"comment_id": 90,
				"body": "> [binero](#comment_11_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): I don't mind censorship of your own platform. You have a right to free speech but others arent required to give you a platform.\n\nYes but in some countries, even in the west,  the state can punish \"hate speech\", and \"terrorism\", which is in fact everything this state doesn't like. In France for example, many people were convicted for just some posts on twitter. \n\nAnonymity and censorship resistance are important in order to be safe and if we do not want to hesitate before we add content.",
				"added": 1478352875
			},
			{
				"comment_id": 94,
				"body": "> [binero](#comment_14_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): That's a totally different issue. I do agree the state shouldn't punish people for what they say, unless it's slander. It's different in the private industry though. Facebook, Google, Microsoft, Twitter should be able to censor their platforms. If people feel they are being censored, they should always be allowed to create their own platform though.\n\nI never said that they shouldn't be able to censor their platforms, just that i don't like to use these platforms if they do this. \nHere if nofish starts to censor too much, people will flee and migrate to an other Zerosite without censorship (some already mentioned 0chan).\n\nAlso in Freenet, the plugins Sone and FMS are 100% without censorship (it's not possible to suppress a post) and everything is fine. You can block people locally if you don't want to see them.",
				"added": 1478391376
			}
		],
		"1_1MxX4JMJ71sfYS1Lo3jL8Ja5u811nySEJJ": [
			{
				"comment_id": 115,
				"body": "> [sthetz](#comment_22_1BNmjz9tBLY3M1tq2z7DKvA1LjFXYsmLd9): Well actually I'm big for freedom of information and speech. On the political compass my views are \"authoritarian right\": extreme economical right but only a little bit authoritarian (light restrictions on culture). \n> It's just when I see some SJW speech or some other extreme leftist bullshit (\"muh racism/sexism/homophobia/transphobia/etc\") I immediately go full 1488. If your contribution to political discussion is accusing someone of being \"fascist, racist and sexist swine\" — well then, heil fucking Hitler.\n\nRight. You still believe in political economy, and politic in general.\n\nI hope you'll realize (quite soon) it is, and it has always been, a scam. Same for your adversaries here.",
				"added": 1482236455
			},
			{
				"comment_id": 116,
				"body": "> [sthetz](#comment_23_1BNmjz9tBLY3M1tq2z7DKvA1LjFXYsmLd9): Care to elaborate? What do you mean by \"political economy\" and what would be its alternative?\n\nPolitical economy: every ideas, linked directly or indirectly to \"economy\",  you, others, or (puppet) politics have, supposed to make things better, to have a better life.\n\nWhat alternative?\n\nWhat determines everything is the mode of production. Any other stuff is babbling, bandages to cure a dying person.",
				"added": 1482241194
			}
		],
		"1_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": [
			{
				"comment_id": 119,
				"body": "If it's true that's some scary shit. \n\nWe always suspected they were crazy, dangerous and powerful, but now, we have more and more proof.\n\nWith tools like P2P internet, or even the clear, we must put an end to this madness, once and for all.",
				"added": 1482507084
			}
		],
		"1_1LogBQ7aRYS9KNPZx2nrNKserBBAL5XhyD": [
			{
				"comment_id": 120,
				"body": "Seems credible.\n\nHowever, just wanted to add for ZeroNet users that they can create almost perfect CGI now in order to deceive us. One of the last Assange video was probably a CGI from him, not the real one. \n\nFor those who'll say it's conspiracy material, i invite them to see the CGI of deceased actor Peter Cushing in the last star wars movie (rogue one).\n\nIt's completely doable, thus they are doing it.\n\nPS: Also, i think i know what you mean by war agains the \"machines\". And if it is what i think it is, indeed, it's scary. ",
				"added": 1482673133
			},
			{
				"comment_id": 126,
				"body": "> [shellbound](#comment_27_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9): You are right that we see an increasing polarization in the world... but to proclaim that and what you write above is lightyears apart. It is always difficult to dismiss a conspiracy theory completely as it is devised in such a way to make it hard. First of all. The above post are lacking credible sources.  In fact it is not containing any sources at all..So to me.. the above post is just a fancy story. A story to spread fear and to further the polarization.\n\nSure, there is no source, but it seems very accurate and plausible. \n\nIt connects directly with most of the informations we recently have about Trump, the Clintons, the Pizzagate, the link with the FBI, Assange, and a possible powerstruggle inside the deepstate in the US.\n\nI think it might be legit. \n\nIf you were an insider, especially a low rank one (no offense intended), wouldn't you sometime rebel against this garbage system? \n\nNot 100% of the elite is convinced satanists or pedophiles. And even those who are can repent sometimes. \n\nIf i were an insider an wanted to publish about what happen from the inside, i certainly wouldn't use the clear, since it's so easy for any post to be deleted or traced.\n\nFreenet is super anonymous, but deserted... \n\nSo Zeronet seems a good choice, if one can anonymize his computer correctly (Linux, Tor/I2P,  good VPN, opensource flashed bios, older computer, solid webbroswer).\n\nEven if he didn't do this, they couldn't off every people who open their mouth. Thousands might work for them, some just having a hint of what's happening. ",
				"added": 1482840246
			},
			{
				"comment_id": 128,
				"body": "> [elspru](#comment_5_1A3XsuLB6P7LQPCw1QWASG7RGSwrCv6Xib): I honestly can't believe people are talking about pizzagate like it was anything other than discussion about pizza.Once you lend credence to something so far out an thoroughly debunked, you are obviously not interested in reality.\n\nYou're either stupid or a pedophile.\n\nhttps://www.youtube.com/watch?v=oHXBrEXmowo\n\nhttps://www.youtube.com/watch?v=vlhBn_zSIro",
				"added": 1482850128
			},
			{
				"comment_id": 130,
				"body": "> [elspru](#comment_6_1A3XsuLB6P7LQPCw1QWASG7RGSwrCv6Xib): \"suggest evidence\"? that's not evidence .\n> \n> Sorry I don't waste time with conspiracy videos.I'm willing to skim some text if you give me links. \n> \n> \"suggestive evidence\" is not evidence, it is just conjecture.\n\nSince naive people don't tend to use ZeroNet but are rather in front of their TV, i think you're the latter: pedophile.\n\nAt least you should have the courage to admit it.",
				"added": 1482852079
			},
			{
				"comment_id": 131,
				"body": "> [shellbound](#comment_28_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9): @planespherev2: You are right that they can sound plausible but that is also the whole point with conspiracy theories. They are built up on assumptions. It is important to talk about them as just that. Assumptions. The proclaimed testis must always be valued and if like above it comes from someone anonymous and without sources it is really hard to put any greater such in it. And there aren't really much substance in what was said above..What happened with Trump and Brexit where lies could take such a hold and influenced the outcome made it crystal clear for me. We have to do better.\n\n\nSo you're a source guy. I've heard this speech again and again. \n\nHe who control the source, control the information. \n\nWhat is your preferred source. Do you prefer AFP or Reuters?\n\nI know, it's hard to choose, since they are so equally    i̶n̶dependent of the core of the system.",
				"added": 1483011374
			},
			{
				"comment_id": 132,
				"body": "> [shellbound](#comment_29_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9): . I prefer original data. Like what we saw with Snowden.\n\nHow can you know that Snowden isn't a US agent himself? Because the AFP and Reuters sources say so? \n\nI don't think he is (because his revelations made billions of dollars loss for the US economy, so even if the agencies manipulate opinion, this was too much), but how can you be so sure?\n\nI prefer to trust what my own eyes or own mind think as true rather than something which come from a central media/agency.\n\nAlso, if someone appear to me as really altruist, i tend to believe him. \n\nThose are my criterias, more than something which come from high perceived hierarchy, or so-called science. Science might not even exist, and could just be (false) projections of our minds. Even if such thing as pure science really exist, most of our current science might just be plain false, biased by what we want to see, as humans, instead of what really is. ",
				"added": 1483056490
			},
			{
				"comment_id": 133,
				"body": "> [shellbound](#comment_30_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9): I can't. There no such thing as an objective truth. Everything written is done so with bias. With Snowden you have to be careful for what they in psychology call \"the halo effect\" too. But as you said... the evidence suggests he did it because of the common good. \n> \n> There is no doubt that science exist.. It is a method so isn't really something that can not exist.. but as you say it can at times be falsified and biased. The difference between science and conspiracy or for that matter theology is that it can be tested. Which is an important distinction. You can for instance read the original data yourself (which I do at times). Not sure how you think when you say science is a \"high perceived hierarchy\" when it really is decentralized. Science does not happen at one place but at many disconnected from each other..When you say \"I prefer to trust what my own eyes or own mind think as true\" how do you do that? Is your values or ideology more important than facts?\n\nAbout the Darwin theory (i was myself a devot darwinist years back), it cannot be tested, but it's what science say about the subject.\n\nSure you have access the data, but the \"scientific\" explanation is sometime an approximation, or even a false explanation, like the phlogiston theory explain combustion, but had good practical results. How can be be so sure that the current oxidation theory isn't again false? \n\nPhlogiston was scientific, but it was false. \n\nIt's not so much decentralized, since, there are not so much universities around the world, and they are all funded by the same people. However, it tends to get better with the internet were everyone can do science and exchange date or theories with anyone. That's why i think many scientific dogmas will be superseded in the following decades.",
				"added": 1483187583
			}
		],
		"1_1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA": [
			{
				"comment_id": 121,
				"body": "> [joeguy](#comment_2_1Lro3X1aER7i2saQWufjCr5sDyunKe11Gs): Yes we need a way to totally block anyone dealing in cp for sure.\n\nNo. \n\nAs much as i hate pedophilia (and you can see my most recent posts), the problem with blocking someone is: when to stop? First it's CP, everybody says ok, then it's shocking material, then it's torrent, and finally it just talk. \n\nIf we need to deal with CP, there are ways without blocking totally it. A system with democratic reviews of sites, or a list system like adblock, which can be disabled (in case the content is not CP, but something else). \n\nI repeat, the problem with CP is not the network which contain it, but the psychopaths in real life doing such things. Those are the target we need to aim, not the networks. You have lots of CP in the clear anyway. Even IRL (comet Pizza).",
				"added": 1482690285
			}
		],
		"1_1BNmjz9tBLY3M1tq2z7DKvA1LjFXYsmLd9": [
			{
				"comment_id": 122,
				"body": "> [vlad20012](#comment_7_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Spam is coming\n\nTo avoid spam, he need captchas in order to create an identity.",
				"added": 1482745947
			},
			{
				"comment_id": 123,
				"body": "> [sthetz](#comment_25_1BNmjz9tBLY3M1tq2z7DKvA1LjFXYsmLd9): Having a centralised server completely defeats the purpose of decentralisation. If something happens to that server, no one can use the whole service (apart from those who already have identities). It's not a good solution.\n\nI'm no computer scientist, but this is the main problem of ZeroNet currently. \n\nIt's not as it is not possible to do without central server: freenet manages it for FMS and Sone.",
				"added": 1482759915
			},
			{
				"comment_id": 124,
				"body": "> [sthetz](#comment_26_1BNmjz9tBLY3M1tq2z7DKvA1LjFXYsmLd9): To my understanding, things like that are technically possible, but just not possible to implement with ZeroNet functionality right now. It's designed in a way that prevents you from controlling user-submitted content at all. It's unreliable by design.\n\nIn don't think it's unreliable by design. \n\nI'm sure you have tested Sone and FMS. It works fine. The only problems with Sone is that it's slow (it takes hours to download all the posts the first time you install it). But other than that it's fine. \n\nIt's frustrating that Freenet is super anonymous, totally censorship and spam resistant but not user friendly and slow, and Zeronet is fast and easy to use, but still not 100% censorship or spam resistant (Zeroid on central server).\n\nCombine the two advantages of both, and you'll have one powerful decentralized network.",
				"added": 1482760478
			},
			{
				"comment_id": 125,
				"body": "> [arkre](#comment_1_17Xo25emK8WXkrWouD5DsuLrcRnkrREfTa): so ideally there should be some captcha-based proof-of-work. It seems there are currently no blockchain technology like this at all, maybe it's an open problem for current state of research.\n\nYes, captchas. In freenet, it's currently a pain, because it's the old captchas with the bizarre letters. \n\nBut the new captchas with the images are fast and easy to solve, and even more secure than the letters.\n\nCaptchas are an efficient solution against spam and trolls. Also, an option for the users to block locally a spammer (if he decide to solve the captchas but still troll), is a solution. He doesn't disappear, but you won't see it locally. Shadow banning, but just for the individual user. \n\nAgain, FMS and Sone (freenet) systems are so good (captchas + local censorship + democratic global censorship), i don't see why it shouldn't be copied for ZeroNet or future decentralized networks.",
				"added": 1482765718
			}
		],
		"1_14DujeMmUQr14gCcg6ZUVcdU1DA5GphYvG": [
			{
				"comment_id": 127,
				"body": "> [stman](#comment_1_13bJpDYmLnZMLWy696GAxHA9mdizyZW2PK): The truth is that nobody can answer this question the way you are doing it. Most technologies involved in the cyber space are tainted, if not to say, all of them. To answer this interesting question, there is only on scientific way of doing it : One must enumerate the whole technological stack involved in ZeroNet, layer by layer, module by module, protocol by protocol, standard by standard, and then start drawing this stack, that will mostly look like a tree, and then analyze the taint of each of its elements. The taint of the root elements being the most important one, because all the others are dependent of it.\n> Once the graph is built, once the \"taint\" of each of its elements has been determined, it is possible to start having a conclusion about the average taint of the stack. \n> What I mean here by the so called \"taint\" being the agencies or the nations that could take a strategical advantage of the specific implementation of each element.\n> Geopolitics is everywhere in the current technologies we use daily. Not a single thing that has been implemented and became a \"standard\" has no geopolitical incidence. The \"Standards\" wars are geopolitics, and this is not new. European countries, Russia, China and US have been fighting for years on the \"standards\". Tightly coupled with patents wars, the standards war is indeed tainting all technologies.\n> Crypto-Anarchists like me have dedicated an important part their lives and time to analyze those standards, that in the end define all the architectures, at all the existing technological layers, that compose all our systems. Our work is mainly focused in analyzing, in those standards, what will \"create\" cyber powers that can be exploited \"privately\" by some nations in order to take a strategical advantage on other nations when using such standards. We, Crypto-Anarchists, demonstrate rather easily that it is possible to re-engineer all technological layer architectures in a way that do not create any form of cyber powers that can be further exploited for selfish interests of a few nations to cyber dominate the rest of the world.\n> I have for example analyzed TOR and TAILS, but my analysis did not started and ended to analyzing TOR source code and protocol, it took in consideration the whole technological stack, including the integrated circuits and their architectures we use to build current computers, the architectures and standards that are used to create motherboards with those integrated circuits, then I analyzed the architecture of the operating systems running on our computers, the languages that were used to program those operating systems (Mainly Assembly language and C, C++), and then analyzed TOR source code, and the protocols like TCP/IP, and others like SSL it is using to implement TOR.\n> The conclusions of this study that took me more than 3 years lead to the conclusion that only the NSA has the ability to break the anonymity of 100% of TOR sessions. But what was rather funny, is that the way they do it is not directly dependent of TOR itself, but rather lies in surrounding elements of TOR like FireFox, and other stuff related to the integrated circuits that are composing our computers. In the specific case of the geopolitical study of TOR, I concluded that TOR by itself was the best IP anonymizing solution available, but that the elements that made of TOR a strategical weapon for the NSA were not directly in TOR itself, but in other components on which TOR relies on. TOR being what I called a kind of diversion, driving most security researcher attention only on TOR code, while the most important things were lying in other layers.\n> There is still a specific thing that makes TOR a strategical weapon that can, for the moment, be only exploited by the NSA, and it lies in TOR network architecture, in the fact that it is fully decentralized. It's this characteristic that allows me to conclude that only the NSA can exploit the anonymity breach I discovered, but the \"breach\" themselves are not located into TOR code itself, but in FireFox, the standards a webbrowser implements, like HTML, but also the underlying operating systems architectures, and in the end, the motherboard architectures, the languages used, and mostly, the characteristics and architecture of the integrated circuits used in our computers.\n> The estimation of the taint of ZeroNet would need you guys to do the same work as I did for TOR, meaning that you could reasonably conclude to a taint only if you analyze the whole technological stacks involved in ZeroNet.\n> The good news is that most of the work I did to analyze TOR could be reused to analyze the taint of ZeroNet.\n> Kind regards,\n> Stman,\n> Electronician, Network, Telecom, and embedded system engineer,Crypto-Anarchist Hacker.Specialized in microprocessor architectures and microprocessor based systems hardware architectures, and low level programming (Assembly language and C) expert.\n\nExcellent post. You are right in believing in crypto anarchy. This will free us at last. Will take decades.\n\nYes, Tor might be anonymous, but we all have NSA (or US airforce/navy which are more powerful than the NSA) backdoors in our bios motherboard.\n\nI still use clients like freenet or Zeronet because i live in France were the local intelligence agencies (DGSI) might not be able to track it's citizens if they use such clients. They collaborate with the NSA but they don't have access to all the informations i guess (not in the interest of the NSA to share everything... ).",
				"added": 1482841355
			}
		]
	},
	"comment_vote": {
		"16_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9": 1,
		"1_17a8xsj4Ds61C9wcox4Yqjp4GKD3qNdmdf": 1,
		"24_1FEikAyxCNPJcW996B69r5UFg29yfq579m": 1,
		"20_1FEikAyxCNPJcW996B69r5UFg29yfq579m": 1,
		"6_1Nx78TLGjBT18krMD175Mr1JwFwnxURRLb": 1,
		"1_1GH94Lq5MZgEsfXghRNJUwzoYhBJp7Yvk": 1,
		"9_1Nx78TLGjBT18krMD175Mr1JwFwnxURRLb": 1,
		"1_1QH1N2BcCN6bQu1J98yUovsnnkvHn8TKhC": 1,
		"2_1DTxoqZ9rPsyszjMC1mKKvrcSbRm63EarS": 1
	}
}