{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1_19dfuqqdasCxD56Yn8KGcgcckbdkV9SZi4": [
			{
				"comment_id": 1,
				"body": "Encrypting your locally seeded files like freenet does would not only protect you in the above scenarios but also from LEA hackers (yea, the new #Rule41 means the feds can hack you and dl files, etc. and use it against you, all without ever seeing your pc) and situations where the feds swarm you before you can turn your pc off, thus allowing them to extract your encryption keys from memory (I.E. SilkRoad \"Creator\" Ross Ulbricht takedown). Implementing Freenet style encryption would provide ZeroNet users with legal plausible deniability as well as protection from would-be attackers and hackers, moreover, it would mean that ZeroNet would have the anonymity of Tor, the encryption of Freenet, the decentralization and flexibility of BitTorrent and Bitcoin, all combined to create the ultimate anonymity network.",
				"added": 1491625685
			},
			{
				"comment_id": 2,
				"body": "If just one of those hundreds of images from that cool new site you're seeding was Child Porn, you've committed a federal crime with a 10 year sentence and all it takes is an agent deciding to tap a backdoor and DL that file to arrest you (#Rule41), they'll then use ZeroNet's own claim that 'you have full control of the files you share' to bury you. All this could have been avoided if ZeroNet was using freenet style encryption. The best of all worlds, bitcoin, bittorrent, Tor, and Freenet, addressing all current threat models + having a ton of other badass features that blows the competition away.",
				"added": 1491626807
			}
		],
		"2_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE": [
			{
				"comment_id": 3,
				"body": "No, you shouldn't encounter any issues.",
				"added": 1491634960
			}
		],
		"1_14aBVs7naxTC3Vs9N2yoYod6iwoRP6xfV2": [
			{
				"comment_id": 4,
				"body": "YEA! let's just forget about false flag cia chemical attacks that would legally allow nato to intervene, chemical attacks that happen to occur while assad's army has IS on a full retreat claiming weeks worth of ground daily with a foreseeable victory (aside from sporadic guerilla fighting) within 9-12 weeks (they won't tell you the real facts on MSM). Obviously the use of chemical weapons (crossing 'red line', allowing legal nato regime change) on civilians in full view of the white helmets (soros funded) and countless cameras was because assad's secret fantasy is to watch his country burn from a cell in the Hague, duh     -_______- OP is 100% on welfare, food stamps, something, bitching at immigrants, having no clue that he's playing right into the real enemy's hands, the bankers, those globalist elite fucks at the CFR, TLC, etc. that wrote  those immigration policies and push said policies to the limit.\n\n The more integrated countries are, the less nationalistic the citizens are. Making the destruction of sovereignty and the creation of a one world totalitarian government that much easier. They want the west to hate muslims, dehumanize them, 'other' them, that way people pay  less attention while we pave over their sovereignty with US troops (sprinkle in a few brits, etc. for appearances) and throw up a quick bs democracy,. The more corrupt the the new government is, the cheaper it is for the corporations/elite to de-nationalize and acquire that nations natural resources (bribery, etc.) and begin exporting them at massive profit, typically regaining the initial investment in just a few years, even less if they get lucky and score a good deal via blackmail, threats, and bribery, and so, all that oil money from  that used to go right back to their people (definition of a nationalized industry, the nation profits) now goes into the pockets of people making, literally, tens of billions a year, meanwhile that poor 'insert middle eastern country' is essentially forced to accept their small stipend from the oil company's use of their land/resources, all thanks to a few corrupt politicians. Couldn't they just re-nationalize the oil/etc once they realize the corruption that caused their nations resources  to be essentially stolen from them? Sure, but they better have a big enough army to deal with the US and (tiny lolworthy amount) of NATO troops that will step in to prevent the company's \"democratically & legally acquired\" resources from being \"unlawfully and against international law\" seized by foreign forces, whether they be those of the country itself or otherwise (although it appears ISIL is an exception....wonder why.....). Yes, most politicians seem almost controlled, from the top down by the corporate-elite, made evident by their consistent, innumerable, and virtually beyond chance, amount of decisions made by them that are solely beneficial to the corporate elite (follow the money) and through the influence of these government officials, via bribes, blackmail, ideology, etc. they control government but a government needs either support or the apathy of their citizenry towards the decisions it makes and policies it sets.\n\n How do citizens learn about their government, world events, etc.? The media of course, of which, 90% of ALL (Print, TV, internet, etc. is owned by 6 corporations, making it relatively easy to shape a given population's opinions regarding events, people, etc. by manipulating the presented narrative through lies, omissions, suggestive thinking and other physiological manipulations, and more, to ultimately steer the populace towards a false conclusion and because this conclusion was reached by them of their own free-though (or so they think) their physce will only reinforce this corporate manufactured idea when faced with a contrary idea or conclusion regarding the same topic. \n\nAs is often the case, narratives are created for opposing sides, with the sole purpose of creating division and sewing confusion between them  (Divide and conquer) .or those behind the media's narrative, regarding a given subject. desired for them by those creating the narrative.regarding key events by presenting narratives to them that frame and that fits the way you want them to perceive events, fictional or otherwise, 'truth is inconsequential when you control the \"truth\" that drives their   whose boards share some of the same members, some of whom are also regular Bilderberg attendees and CFR members, organizations that are openly globalist, openly pro-population control (with many key members even have been involved with the eugenics movement), and, based on statements and sentiments held by members, out to create a new world order no matter the cost, fully embodying the statement \"the ends justify the means\" in everything action they take. the  the control they control NATO (Including the US Army) appear, solely based on their actions, to be working for the corporations,",
				"added": 1492333912
			}
		]
	},
	"comment_vote": {}
}