{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "First ZeroNet Gambling Site is Up! having a zero-trust model",
			"body": "Visit http://127.0.0.1:43110/1JyHMv8kuJWnbWLEWNV2xoCwfFwdmWoBrG/ watch zeroPyrmid play with the Demo. then play with Bitcoins (warning: is not a cheapo micro bet game, its for low volume high value bets, from 0.125btc now -bigger bets will be enabled as leaves beta- )\n\nThe Game follows Strict Zero-Trust guidelines, allows Fully Annonymous Gambling Open to Everyone 24/7 given its available for eveybody it discourages using the game for money laundering, so your bets are safe at a Hardware Wallet (the safest cold storage yet).\n\ncontact zeroPyramid Owner/Operator at http://127.0.0.1:43110/1HWeFUkjtQo9BuSmygbwajcX32RMKpGXF2/\n\nevery comment is welcome.\n\nIf you decide to play a public tracking of the game evolution will be available ar /r.BitcoinGambling/ /r/ZeroNet and at BitcoinTalk https://bitcointalk.org/index.php?topic=1669292.0 also at K7's blog, fell free to announce your bets and help us to track it at the blockChain",
			"added": 1478196079
		},
		{
			"topic_id": 2,
			"title": "zeroPyamid now available for franchise/partnership or sale",
			"body": "I had to announce zeroPyamid is on the market now:\n\nThe game is now available for Franchise, Partnership or Sale on Exclusive Agreement.\n\nAssets Included: \n\n* zeroPyramid's ZeroNet keys.\n* zeroPyramid's control server (a python 2.7 host script easy to audit capable to monitor and validate multiple zeroPyramid instances, and publish the game simultaneously on zeroNet tor.Onion and ClearNet NGNIX/Lighttpd/other tech on request).\n* 90 Day deployment support (extensible for life).\n* re-branding related customizations.\n\n\nNot Included (but required) Offshore 'umbrella' corporation, future zeroPyramid Owner/operator should have registered a 'casino' like corporation either at Panama, Seychelles or Chipre, or where ever this kind of business is legal.\n\nLinux based server either a centos VPS, Docker or a dedicated in-house controlled server (any linux version) if full automatization -automated prize payment - is required.\n\nWe accept btc, monero etc any criptocurrency, Credit Card and scrow service.\n\ncontact me thru DM or thru ZeroNet's zeroMail as k7@zeroid.bit.",
			"added": 1480476416
		}
	],
	"topic_vote": {
		"1_19y3b3y2y8NCJZZtG2oRQVezXk9ynvd3xK": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1_19y3b3y2y8NCJZZtG2oRQVezXk9ynvd3xK": [
			{
				"comment_id": 1,
				"body": "Now I Have Activated ZeroMail, of course my address is K7@zeroid.bit waiting for your comments., Also pre-anouncing zeroBet a classig bet service, available from 100 Satoshi each bet token",
				"added": 1478455621
			}
		],
		"2_19y3b3y2y8NCJZZtG2oRQVezXk9ynvd3xK": [
			{
				"comment_id": 5,
				"body": "Clarifications\n\n1st Actually zeroPyramid it's an anti-pyramid fraud game, take your time to read it and how it works on bitcoin with mathematic transparency.\n\n2nd I'm not selling a share on a pyramid-fraud scheme, I'm selling or offering partnering a Gaming Platform, for serious and legitimate gambling operators.\n\n3rd I Don't know if everybody considers this a Scam site, I don't care about, serious investor with experience and capital will reach me here or wherever as long they where aware my offering: A Gaming platform.\n\n4th Any contract served by me is ruled by scrow arbitration and payment service, If you understand whats its a Scrow service, its an 3rd which manages a multisig wallet which only with 2/3 signatures can transfer funds to another wallet, they require proof of delivery or satisfaction before sign any payment or refund.",
				"added": 1480544097
			}
		]
	},
	"comment_vote": {}
}