{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "InterReflections, Film Trailer (Extended), by Peter Joseph",
			"body": "-----------------------------------------------------------------------------------------------------------------------------------------------------------------\nvideo:    https://www.youtube.com/watch?v=Sy7MNkKDjvA\n-----------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nInterReflections is an experimental, mixed genre narrative feature film by Peter Joseph, adapted from his book The New Human Rights Movement.\n\nThis is the first of a trilogy series about a fictional global revolution. Taking place in three time frames, the through-line is connected by the story of Concordia - a hacktivist origination comprised of high-ranking military defectors from around the world. They seek to stop further destabilization of the world in the mid 21st century by strategically shifting technological focus from “weaponry” to “livingry”. Over the course of the three films, the audience will be taken on a journey of global (and intellectual) transformation, while highlighting the real world social potentials (and problems) we have or are on pace to having as time unfolds.\n\nTo continue support for this project, you may contribute to the existing IndieGogo campaign here:\nhttps://www.indiegogo.com/projects/interreflections-by-peter-joseph#/\n\nYou can also pre-order the book the film trilogy’s social theory is based upon:\nhttps://www.amazon.com/New-Human-Rights-Movement-Reinventing/dp/1942952651\n\nQ: Why is this film taking so long?\n\nThe technical requirements for this production are extensive. To work within the existing budget, labor resources can only be distributed so far. While volunteers help, this kind of work requires full time attention. This means a small number of people do the work of many and hence the process is slower than it would be with a more traditional pre/post production crew. For this kind of feature, a traditional approach would cost millions of dollars. Rather, the film is being made with a budget in the very low six figure range and to do so means time loss. I hope people in support of this work can be patient, while any further financial support will certainly help.",
			"added": 1488192671
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}