{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 24,
	"comment": {
		"2_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": [
			{
				"comment_id": 1,
				"body": "Over the years I have snuck into various hospitals and stolen the foreskins from the nurseries of said hospitals. Circumcision is a Jewish trick to demoralize the body and mind of mankind. I have read the comunist manifesto. I have read the Karma Sutra. I know all the secrets that they dont want me to know. To rebalance the purity of the globe, I have taken, and continue to take theese foreskins and place them in the grasses and grains that livestock are fed from. I specifically target those animals that are to be sent to a kosher slaughterhouse. Thus, the Jews atempt to remove the foreskin from their bodies, only to have it reintroduced through their diet by my hand. I am one of the few people who are trying to rebalance the globe in oposition to the jewish menance",
				"added": 1490839188
			},
			{
				"comment_id": 2,
				"body": "> [opisafaggot](#comment_1_12p3yAJYYbtSY226FLMaxXLMtFkBaLxu9a): You belong on reddit fucking faggot OP\n\nbut this is reddit",
				"added": 1490840875
			},
			{
				"comment_id": 3,
				"body": "> [swagstika](#comment_1_1EgqAT7i9ipPjsMa5axHKjmLGbdttKd4E1): Over the years I have snuck into various hospitals and stolen the foreskins from the nurseries of said hospitals. Circumcision is a Jewish trick to demoralize the body and mind of mankind. I have read the comunist manifesto. I have read the Karma Sutra. I know all the secrets that they dont want me to know. To rebalance the purity of the globe, I have taken, and continue to take theese foreskins and place them in the grasses and grains that livestock are fed from. I specifically target those animals that are to be sent to a kosher slaughterhouse. Thus, the Jews atempt to remove the foreskin from their bodies, only to have it reintroduced through their diet by my hand. I am one of the few people who are trying to rebalance the globe in oposition to the jewish menance\n\nI feel as if the zeronet technology could be used to recruit more individuals towards my noble cause. I would like to ask anyone reading this to consider mimicking my actions and joining the fight to rebalance the natural order of the globe",
				"added": 1490848354
			},
			{
				"comment_id": 8,
				"body": "> [border0464fred](#comment_94_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): patriotism is just an other kind of religious delirium that ask you sacrifice for abstract concepts. \n> Baiting for imaginary fairy tails is edgy to me.\n\nm'lady",
				"added": 1490914680
			},
			{
				"comment_id": 10,
				"body": "> [border0464fred](#comment_112_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): I think there is a gap between censoring as banning/muting/deleting and asking nazi to not spam the main with  irrational bullshit. \n> From what I read, i think most of people seem to agree that swagstika, opsiafaggot and others have their right to say the crap they want.(if all this is not about one guy with 10 ID) \n> But they endup spamming tons of non-constructive shitposting that ultimatly prevent any logical debate and kill the place.  Main looks like if /pol/ was on Facebook. It make no fucking sense.   \n> Problem would be the same if it would be SJW , durr durrr smash window anarchist ....or fucking furries.   \n> Trowing the censorship card on the table to avoid the problem is just too easy.\n\nwhat?! how are you accusing me of being  nazi?!! when have I ever posted a nazi shitpost??!!\nHow dare you slander me!",
				"added": 1491109700
			},
			{
				"comment_id": 11,
				"body": "> [border0464fred](#comment_115_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): How could I ? you shared the windmill of friend ship with me. We are friend now.  [...]\n\nI am very loose  (   Í¡Â° ÍœÊ– Í¡Â° )\npls be friends with me",
				"added": 1491279115
			},
			{
				"comment_id": 12,
				"body": "> [border0464fred](#comment_114_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): Im not doing it,  I feel like the main should be for common interest things.Even tho I don't dislike going on /pol/ calling some bullshit for a good fight. Lets not do it on the front door.\n\ndon't go on /pol/ its full of closeted cuckhold fetishists",
				"added": 1491279216
			}
		],
		"1_19Z8aJ32x4pE2iGvVssPJazJgpGe5L32rq": [
			{
				"comment_id": 4,
				"body": "there are no racists here, only friends\nâ–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–„â–€â–„â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘\nâ–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–„â–€â–‘â–‘â–‘â–€â–„â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘\nâ–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–„â–€( Í¡Â° ÍœÊ– Í¡Â°)â–„â–€â–ˆâ–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘\nâ–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–„â–€( Í¡Â° ÍœÊ– Í¡Â°)â–„â–€â–‘â–„â–€â–‘â–„â–€â–„â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘\nâ–‘â–‘â–‘â–‘â–‘â–‘â–‘â–„â–€( Í¡Â° ÍœÊ– Í¡Â°)â–„â–€â–‘â–„â–€â–‘â–„â–€( Í¡Â° ÍœÊ– Í¡Â°â–€â–„â–‘â–‘â–‘â–‘â–‘â–‘â–‘\nâ–‘â–‘â–‘â–‘â–‘â–‘â–‘â–ˆâ–€â–„( Í¡Â° ÍœÊ– Í¡Â°)â–€â–ˆâ–‘â–„â–€( Í¡Â° ÍœÊ– Í¡Â°)( Í¡Â° ÍœÊ– Í¡Â°â–€â–„â–‘â–‘â–‘â–‘â–‘\nâ–‘â–‘â–‘â–„â–€â–„â–‘â–€â–„â–‘â–€â–„( Í¡Â° ÍœÊ– Í¡Â°)â–€( Í¡Â° ÍœÊ– Í¡Â°)â–„â–ˆâ–„( Í¡Â° ÍœÊ– Í¡Â°)â–€â–„â–‘â–‘â–‘\nâ–‘â–„â–€â–‘â–‘â–‘â–€â–„â–‘â–€â–„â–‘â–€â–„â–‘( Í¡Â° ÍœÊ– Í¡Â°)â–„â–€â–‘â–ˆâ–‘â–€â–„( Í¡Â° ÍœÊ– Í¡Â°)â–€â–„â–‘\nâ–‘â–ˆâ–€â–„( Í¡Â° ÍœÊ– Í¡Â°)â–€â–„â–‘â–ˆâ–€ Í¡Â° ÍœÊ– Í¡Â°)( Í¡Â° ÍœÊ– Í¡Â°)â–€â–ˆâ–‘â–€â–„â–‘â–€â–„â–‘â–„â–€â–ˆâ–‘\nâ–‘â–€â–„â–‘â–€â–„( Í¡Â° ÍœÊ– Í¡Â°)â–€( Í¡Â° ÍœÊ– Í¡Â°)â–„â–ˆâ–„( Í¡Â° ÍœÊ– Í¡Â°)â–€â–„â–‘â–€â–„â–‘â–ˆâ–‘â–„â–€â–‘\nâ–‘â–‘â–‘â–€â–„â–‘â–€â–„â–‘( Í¡Â° ÍœÊ– Í¡Â°)â–„â–€â–‘â–ˆâ–‘â–€â–„( Í¡Â° ÍœÊ– Í¡Â°)â–€â–„â–‘â–€â–ˆâ–€â–‘â–‘â–‘\nâ–‘â–‘â–‘â–‘â–‘â–€â–„â–‘â–€â–„â–‘â–„â–€â–‘â–„â–€â–‘â–ˆâ–€( Í¡Â° ÍœÊ– Í¡Â°)â–„â–€â–ˆâ–‘â–‘â–‘â–‘â–‘â–‘â–‘\nâ–‘â–‘â–‘â–‘â–‘â–‘â–‘â–€â–„â–‘â–ˆâ–‘â–„â–€â–‘â–„â–€( Í¡Â° ÍœÊ– Í¡Â°)â–„â–€â–‘â–„â–€â–‘â–‘â–‘â–‘â–‘â–‘â–‘\nâ–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–€â–ˆâ–€â–‘â–„â–€( Í¡Â° ÍœÊ– Í¡Â°)â–„â–€â–‘â–„â–€â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘\nâ–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–ˆâ–€â–„â–‘â–„â–€â–‘â–„â–€â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘\nâ–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–€â–„â–‘â–ˆâ–‘â–„â–€â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘\nâ–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–€â–ˆâ–€â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘\nå This is the windmill of friendship å Repost if you also love your friends å",
				"added": 1490848512
			},
			{
				"comment_id": 5,
				"body": "> [123a](#comment_1_1WJkjWDMPrMTuWPEvBnqtbrSKA7qTL6o3): Wo is the racist ?\"The Jews are called human beings, but the non-Jews are not humans. They are beasts.\" (Jewish Talmud: Baba Mezia 114b)\"The Akum (Negro) is like a dog. Yes, the scripture teaches to honor the dog more than the Akum.\" (Jewish Talmud: Ereget Raschi Erod. 22 30)\"A pregnant non-Jew is no better than a pregnant animal.\" (Jewish Talmud: Coschen Hamischpat 405)\"Sexual intercoms between non-Jews is like intercourse between animals.\" (Sanhedrin 74b, Sanhedrin is the religious court for Jews)\"It is permitted to take the body and the life of a non-Jew.\" (Jewish Talmud: Sepher Ikkarim IIIc, 25)\n\nbut how many jews actually follow these teachings? compare that to the percent of radical muslims",
				"added": 1490848653
			},
			{
				"comment_id": 7,
				"body": "> [5j](#comment_1_14kjkApeNGNJG22JVQVTiMg4PiGBnLZzGn): Good idea. Lets compare. Maybe hundredthousand nonmoslems killed by jihadists by over one billion Moslems.Jewish created and run bolshevism and communism killed at least 20 million Gentiles only in Russia and China.If we calculate unborn children also killed by Jewish abortion facilities then 50 million children only in the USA.http://www.realjewnews.com/?p=71By 18 million Jews.\n\nIm pretty sure that religious jews dont believe in abortion. And how are the jews responsible for communisim?",
				"added": 1490913456
			}
		],
		"1_12p3yAJYYbtSY226FLMaxXLMtFkBaLxu9a": [
			{
				"comment_id": 6,
				"body": "why the fuck would you take a gender and sexuality course?",
				"added": 1490849808
			}
		],
		"1_1DoE2oLDwVmMgdk56QaNB7khXJWuyZstnU": [
			{
				"comment_id": 9,
				"body": "> [mynameislegion](#comment_27_1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV): That's what Hitler did, deep in the bunker after Stauffenberg missed him. Clone this page, call it ZeroEndSieg and disappear please.\n\nyea but hilter was a mean person",
				"added": 1491091596
			},
			{
				"comment_id": 16,
				"body": "> [mynameislegion](#comment_27_1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV): That's what Hitler did, deep in the bunker after Stauffenberg missed him. Clone this page, call it ZeroEndSieg and disappear please.\n\nyou know, that kind of turns me on.\njust a little bit.\nespecially with the honey.\nit would probably be very sticky.",
				"added": 1491366478
			}
		],
		"1_172ALy9XgaQ3gJUx5zVzgeqp2oLsAoqo6m": [
			{
				"comment_id": 13,
				"body": "thats really terrible, you know you should post the link where you saw this terrible content, just so everyone here knows not to go to that zite.",
				"added": 1491365253
			},
			{
				"comment_id": 17,
				"body": "> [13lucifer23](#comment_3_19dfuqqdasCxD56Yn8KGcgcckbdkV9SZi4): LMAO, stop looking for it, else 10yrs from now the only way you'll be able to get off is if it's your night to babysit your niece.\n\nwhat? how am I looking for it? I just want to know which zite it is so I know not to click on that zeronet link. There just so many links on zeronet, and I dont want to click on the wrong one.",
				"added": 1491413903
			},
			{
				"comment_id": 18,
				"body": "> [kw](#comment_4_1NbWEYaqzV7f2KRsayU2wGqjM17m9XyWCi): The best protection is not to know about it. That said, no one here will willingly advertise bad stuff. Just do a \"bouncing tits\" search on youtube and be done with curiosity.\n\nI am not curious, I just want to know the link so I know not to click it if I see it again.",
				"added": 1491422196
			},
			{
				"comment_id": 19,
				"body": "> [13lucifer23](#comment_6_19dfuqqdasCxD56Yn8KGcgcckbdkV9SZi4): LOL #Prison\n\nwhat does this hav to do with prison? like the title says, I am just trying to keep safe.",
				"added": 1491422451
			},
			{
				"comment_id": 20,
				"body": "> [13lucifer23](#comment_7_19dfuqqdasCxD56Yn8KGcgcckbdkV9SZi4): Bro, you are literally asking for a link to CP.......Just search grams helix/tor search for Childs Play forum...... Mr Podesta.....\n\nCP? what is that? i just want to know what links not to click.",
				"added": 1491423681
			}
		],
		"1_1NmT7R64j1uMJ9qs3Bfgda5cGczFqNmCBL": [
			{
				"comment_id": 14,
				"body": "if you are begining start with python, then java, then c++, then c, then you can learn the crazy shit like haskell and lisp/clojure",
				"added": 1491365997
			}
		],
		"1_1EWcSH8L4VBXvQVn4NB4s8HsJuJzNwATYD": [
			{
				"comment_id": 15,
				"body": "> [faustianspirit1](#comment_2_1DCTA8rrSFeKX7CzieU3CYwCjGZ2hYvamb): If you could would you fight to take the holy Land back for the real Jews?\n\ndepends, is there any oil in the holy land?",
				"added": 1491366174
			},
			{
				"comment_id": 21,
				"body": "ðŸ’©",
				"added": 1491528300
			}
		],
		"1_14aBVs7naxTC3Vs9N2yoYod6iwoRP6xfV2": [
			{
				"comment_id": 22,
				"body": "thats a dumb idea. I mean there are dumb ideas, but this is a really dumb idea. this is some shit I would have come up with when I was 12",
				"added": 1492407215
			}
		],
		"1_1H7K8A2z57cN6Hc2X37yYjUYX5v9LkMrtU": [
			{
				"comment_id": 23,
				"body": "hey dont talk about my waifu erdogan like that",
				"added": 1492407276
			}
		]
	},
	"comment_vote": {
		"1_1EgqAT7i9ipPjsMa5axHKjmLGbdttKd4E1": 1,
		"3_1Koe97YQ3wR5oFauQoGuUCBNqZ73SMTrKi": 1
	}
}