{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Crowd Funded New Internet?",
			"body": "The problem I see with \"Web 3.0\" Decentralized methods (IPFS, ZeroNet, Blockchain etc....) is they rely on the pipes and last miles.",
			"added": 1476266061
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "How do we know this isn't a joint effort project prism  like honeypot project?",
				"added": 1475576406
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 2,
				"body": "https://www.theguardian.com/world/2013/sep/11/nsa-americans-personal-data-israel-documents\n\nMost important Info that Snowden revealed IMO, with this \"RAW\" data, Israel has ability to blackmail politicians and inside trade n Wall Street, unlimited black funding.....",
				"added": 1475578749
			}
		],
		"5_1CoVAt2jBzV4Na6nX3VG1JSfjS8fwse1Z9": [
			{
				"comment_id": 3,
				"body": "https://www.theguardian.com/world/2013/sep/11/nsa-americans-personal-data-israel-documents\n\nMost important Info that Snowden revealed IMO, with this \"RAW\" data, Israel has ability to blackmail politicians and inside trade n Wall Street, unlimited black funding.....",
				"added": 1476265033
			}
		],
		"2_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 4,
				"body": "> [kosherx](#comment_14_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): I'm gonna start going chutzpah on your anti-semitic ass, chaver.\n\n\"The Audacity of Chutzpah\" will be \"their\" un-doing.....",
				"added": 1476265477
			}
		],
		"1_1HRqipL1thbTsztjAvhN76qkzQBZ1k93nJ": [
			{
				"comment_id": 5,
				"body": "Could someone start a crowd fund campaign for Raspberry Pi Gateway/Mesh/Routers that could perhaps achieve long distance hops via SDR and Ham frequencies? Mesh WiFi at short distances. Start low speed, data only. Let in gain in momentum enough to get right of way laws etc.. on our side to crowd fund real fiber networks etc.....\n\nPerhaps this is already being done?",
				"added": 1476266279
			},
			{
				"comment_id": 6,
				"body": "> [mostlikely](#comment_2_1PXxt4z65p8H6xXh4zb7ahMtE7kfCRxgaq): how would you avoid using the pipes?\n\nMesh and Hardwire for cooperative entities within range. Old school optical links like \nhttp://ronja.twibright.com/\n\nThere has to (should?) be a modern version of ronja.twibright with 3d printing and SoC development....\n\nPerhaps in the beginning , adopt old school BBS methods like Fidonet, use Ham bands to transport messages to other unconnected nodes. The early adopters already understand the need for a decentralized network and should understand low speed performance.\n\nAll of this would have to be scalable, obviously, but that's way above my pay grade....\n\nFrom and organizational perspective, maybe it should look at 12 Step model that follows an upside-down pyramid approach. Maybe some type of self supporting non-profit where local meetings could be held @ maker groups etc....\nAnyway, sorry for my disconnected flow of thoughts. I am serious ADD",
				"added": 1476356598
			}
		]
	},
	"comment_vote": {}
}