{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Introducing BitPay – Secure Bitcoin Wallet for Mobile and Desktop",
			"body": "https://blog.bitpay.com/introducing-bitpay-app/",
			"added": 1477422102,
			"parent_topic_uri": "1_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG"
		}
	],
	"topic_vote": {
		"8620_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1_1AhXDbKvcLap7TcS2542J7bFYzKHM3xeRU": [
			{
				"comment_id": 1,
				"body": "Anarchism is bourgeois.",
				"added": 1477332287
			},
			{
				"comment_id": 3,
				"body": "> [thisweb11](#comment_8_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Ha!  How is that?\n\nhttp://marx2mao.com/Lenin/SR17.html#c4s2\nGive that a read.\n\nI used to be an ancap, found out about ancom and moved over to that... the glaring problem with it for me was that there is no framework in place to suppress the bourgeoisie from regrouping and taking power, hence the need for a proletarian state, the liquidation of classes (everyone becoming proletarianized removes the primary contradiction: proletariat - bourgeoisie), followed by a withering away of the state.\n\nYou often see the socialist state become more authoritarian, that's true, but it's precisely because the hostile forces from within and without have ramped up their aggression to the proletarian state. For attacks from without, look at Russia for example, during the Russian civil war all the big world powers jumped in to help the white army. For attacks from within, look at Khrushchev and Gorbachev.",
				"added": 1477437662
			},
			{
				"comment_id": 4,
				"body": "> [enoch](#comment_5_1QH1N2BcCN6bQu1J98yUovsnnkvHn8TKhC): this is so much hog wash. You haven't eliminated force or coercion. you require force to stop people from doing what they will to do.\n\nThere is force everywhere... for example, when I wake up in a morning and don't want to get up, but because I need a piss I have to get up. That's a force... shall we abolish it too? Or maybe gravity. ABOLISH GRAVITY!\n\nRead the link I've posted.",
				"added": 1477442653
			},
			{
				"comment_id": 5,
				"body": "> [planespherev2](#comment_61_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): You sound a little extreme. \n> The capitalist class it also a victim from the system. They have all the wealth, all the women they want. But are they happy? Many of them are depressed. Worshiping money and making it the center of their lives. Every friend they have, every romantic relationship, is linked to the fact they are rich. In a way, i prefer to be in the proletariat (however not miserable), than in the capitalistic class. What's more they fear every day that they'll lose their wealth. Which isn't a proletarian issue.\n> The capitalistic class are also the slaves of the system. \n> A change in the mode of production can only happen when a vast majority (80%?) is convinced that we must change this mode of production. When it happens, no capitalistic class will be able to force a mode of production if the people don't want it. Forcing something on the people could work for years, even decades, but in the end the system fall on it's own weight (see what happened in USSR).\n> What's more, it mustn't be limited to a country, or even the west, but it must be a worlwide williness. Yes, it is not for tommorrow. I'm young and i don't know if i'll see it during my life (if i have the chance to grow old anyway). But as Elon Musk said: internet is the nervous system of humanity. With this new technololgy, there's hope that things will accelerate, especially in the new generations.\n> PS: I was writing this message when i saw the last enoch message popping. I think it answer the coercion issue.\n\nWhat you're talking about is idealism. Nobody in the world wants to have half or more of their day's labour to make up the profits of a capitalist. The vast majority want this money to help provide things like healthcare, housing and so on. The vast majority do want this. Unfortunately, many of them are absorbed in moralising, ie \"one person dying is one too many... therefore a revolution is off the table\", meanwhile people alienated by capitalism are dying all the time, worldwide.\n\nAs a Marxist-Leninist, I say if the bourgeoisie are willing to give up control of the state (they currently have a dictatorship of the bourgeoisie, where all the state apparatus is there to serve capitalists ie courts that are expensive, or police vans parked near big shopping malls) then we would peacefully take over and establish a dictatorship of the proletariat, or a state that is set up in the interest of workers (free/cheap housing, cheap transport, free healthcare etc). Unfortunately for us, our demands are usually always met with force, hence the need for a revolution.",
				"added": 1477443221
			},
			{
				"comment_id": 6,
				"body": "> [enoch](#comment_6_1QH1N2BcCN6bQu1J98yUovsnnkvHn8TKhC): Do you want everyone to know you don't understand the difference between the definition of force in physics and force in human relationships? Force refers to aggression in this context.\n\nThe two aren't different. A force compels something to do something. I could hold a gun to your head and told you to dance like a chicken, you'd do so if you wanted to live. Because of the Sun's gravity the Earth is compelled to orbit the Sun. In the stage of socialism, yes there will be coercion against bourgeois forces who try to undermine the proletarian state. The point is to shape society so that you are just left with one, working class. A state is a tool for one class to hold power over the other, with only one class there is nobody to hold power over and therefore the state would stop existing.",
				"added": 1477455422
			},
			{
				"comment_id": 7,
				"body": "> [enoch](#comment_7_1QH1N2BcCN6bQu1J98yUovsnnkvHn8TKhC): So you are saying that holding a gun to my head is the same thing as earth spinning and keeping me earth-bound? Well, I'm glad we could get your thought processes out in the open. Why would anyone follow your logic?\n\nIt's the same in that they're both forces... force just takes different shapes.",
				"added": 1477524877
			}
		],
		"5_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": [
			{
				"comment_id": 2,
				"body": "> [ancap](#comment_76_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz): Except that they can't call it that.And they steal from the people through state subsidies.\n\nhttps://marxistleninist.files.wordpress.com/2010/03/1936_political-economy-_a-beginners-course_a-leontiev_1936.pdf give that a read",
				"added": 1477332815
			}
		]
	},
	"comment_vote": {}
}