{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": 1,
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"2_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": 1,
		"1_1AQwGx5xyBi5Fvv9WHJFMCMNtQhUc8UhQF": 1,
		"1_12Xj1w5HYu6w5xtEwwLyEiMYGuCqvYKL2q": 1,
		"1_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": 1,
		"2_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": [
			{
				"comment_id": 1,
				"body": "Why the official history writing is trying to hide that more than about 150 000 full-Jews or half-Jews fought in Hitler's army?\nDid they want to exterminate their own people in Europe to fulfill the six million prophecy or it was the biggest scam in the history?\nWas Hitler the Jews best friend?\nWhatever the answer is they tried to hide something.\nThousands of men of Jewish descent and hundreds of what the Nazis called 'full Jews' served in the German military with Adolf Hitler's knowledge and approval.\n\nCambridge University researcher Bryan Rigg has traced the Jewish ancestry of more than 1,200 of Hitler's soldiers, including\n   Two field marshals, (God knows how many Jews they killed)\n   Fifteen generals, (God knows how many Jews they killed)\n   Two full generals, (God knows how many Jews they killed)\nEight lieutenant generals, (God knows how many Jews they killed)\n   Five major generals, \"commanding up to 100,000 troops. (God only knows how many Jews they killed) \"\nIn approximately 20 cases, Jewish soldiers in the Nazi army were awarded Germany's highest military honor, the Knight's Cross.\n   One of these Jewish veterans is today an 82 year old resident of northern Germany, an observant Jew who served as a captain and practiced his religion within the Wehrmacht throughout the war.\n   One of the Jewish field marshals was Erhard Milch, deputy to Luftwaffe Chief Hermann Goering. Rumors of Milch's Jewish identity circulated widely in Germany in the 1930s.\nhttps://en.wikipedia.org/wiki/Erhard_Milch\nhttps://pictureshistory.blogspot.com/2009/11/jews-in-hitlers-army.html\nhttps://rafzen.wordpress.com/2013/02/16/jewish-senior-officers-in-hitlers-army-erhard-milch-wilhelm-keitel-walther-von-brauchitsch-erich-raeder-and-maximilian-von-weichs/",
				"added": 1481969837
			}
		]
	},
	"comment_vote": {}
}