{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_16urzDUk5S1EYSaL8XGaJav7BicYSnsxe3": 1,
		"7_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"2_1AZjDLkfYwSmjM7ZJUf7HHnrF778augRMa": 1,
		"10_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": 1,
		"3_17Cs2auSHSVjKaYMXqbNMApRQrgXcwJUpL": 1,
		"3_1AZjDLkfYwSmjM7ZJUf7HHnrF778augRMa": 1,
		"2_1DcE9QfZbfLZhXxgtQ8Ui3oMZvs9NVjqZB": 1,
		"1_1JgHfDK4eojCkVZHKey9hiMAcAc9mxMUK2": 1,
		"1_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": 1,
		"19_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"3_19M1DT5vruSATEcbEczYRwCk2uPuLcATBa": 1,
		"2_16YP1ZeHrKq3KB3DdBWHec984oQAfVPT9d": 1,
		"4_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": 1,
		"2_1FEikAyxCNPJcW996B69r5UFg29yfq579m": 1,
		"4_1CHcEy3SYsQvrW9uskKTZxUWj97BmZmvfa": 1,
		"29_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"2_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp": 1,
		"1_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h": 1,
		"4_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp": 1,
		"3_1JoKQwXPzK8uyvMCRcwvMSAJPD5S4aH5Vt": 1,
		"3_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": 1,
		"10_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp": 1
	},
	"next_comment_id": 41,
	"comment": {
		"1_16urzDUk5S1EYSaL8XGaJav7BicYSnsxe3": [
			{
				"comment_id": 1,
				"body": "Maybe.. I am a fan of Minetest but I couldn't find the license for Magichet. I am not a fan of someone taking open source and then closes it. I would gladly pay if it is still open source.",
				"added": 1470512797
			},
			{
				"comment_id": 2,
				"body": "Seems like the author say it is LGPL and that they intend to release the sources of the code. They will however copyright some of the textures. I am alright with that. \n\nThe saddest part (like always) is how many idiots there are in the comments section. Are people just unaware of Minetest. Do they not know what Open Source is? Calling it Minecraft and a clone is just making a fool of themselves.",
				"added": 1470518642
			},
			{
				"comment_id": 3,
				"body": "Minecraft is a so called voxel-based sandbox mining game. Kinda like how RPG is describing another type of games. You wouldn't call one RPG game a clone of another RPG game just because they have the same basics. Minetest is only inspired by Minecraft. They still have their differences. Minetest is also open-source which means everyone can improve upon it and that it is free to play. Look up Infiniminer which inspired Notch to make Minecraft. Minecraft was not first in this genre.",
				"added": 1470524883
			},
			{
				"comment_id": 4,
				"body": "@quadrangle: If you didn't grasp my last post I don't know how to break it down for you any further.. Do you call Minecraft a Infiniminer clone? No, you don't. Would you call Asphalt a clone of NeedForSpeed just because they both have cars following a track? I'm betting you aren't. You shouldn't for Minetest neither. They are simply only in the same genre.",
				"added": 1470530210
			}
		],
		"1_15JuC9Nz1ua8s7M7tUemvJN1r6NZhffCVq": [
			{
				"comment_id": 5,
				"body": "You mean like this...\n\n...it is with shift+enter",
				"added": 1471904750
			}
		],
		"1_1Gb4DzrdjGBCiTnVyZRB2CHfdSnBfb4FY1": [
			{
				"comment_id": 6,
				"body": "Wouldn't trust TrueCrypt and full disc encryption only protects while the machine is off... `shred` is a good tip though.",
				"added": 1472034132
			}
		],
		"3_1AZjDLkfYwSmjM7ZJUf7HHnrF778augRMa": [
			{
				"comment_id": 7,
				"body": "How about setting up a poll about it http://127.0.0.1:43110/ZeroPolls.bit/",
				"added": 1472040094
			}
		],
		"7_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp": [
			{
				"comment_id": 8,
				"body": "This might help you... [How to change your ZeroMe Hub](http://127.0.0.1:43110/blog.kaffie.bit/?Post:25:How+to+change+your+ZeroMe+Hub)",
				"added": 1472158998
			}
		],
		"2_1DcE9QfZbfLZhXxgtQ8Ui3oMZvs9NVjqZB": [
			{
				"comment_id": 9,
				"body": "Compared to the psychos of Trump and Hillary.. Jill is the sane choice.",
				"added": 1472887712
			},
			{
				"comment_id": 10,
				"body": "Compared to the psychos of Trump and Hillary.. Jill is the sane choice.",
				"added": 1472887755
			},
			{
				"comment_id": 12,
				"body": "> dldx: If I lived in the US, I would as she's the only sensible candidate although I wish she'd stop talking about anti-vaccine crap.\n\ndldx: She is not anti-vax... she just want to investigate big corps influence over the FDA. She has refuted it many times. It is basically just a lie.",
				"added": 1473282797
			},
			{
				"comment_id": 13,
				"body": "A bit sad to see some of the comments in here.. wished people could behave a bit more grown up.",
				"added": 1473282944
			}
		],
		"1_1JgHfDK4eojCkVZHKey9hiMAcAc9mxMUK2": [
			{
				"comment_id": 11,
				"body": "An image paste zite maybe.. one that have support for a client. So that I for instance could post a screenshot from the command-line and it would give me a url to share.",
				"added": 1473191671
			}
		],
		"5_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": [
			{
				"comment_id": 14,
				"body": "I do torrents because it is more convenient for me.. the low cost is just a plus. I did Netflix but it was lacking too much content to be worth it for me.",
				"added": 1474972307
			}
		],
		"10_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": [
			{
				"comment_id": 15,
				"body": "I don't know if a \"Kickstarter\" without funds as that is really needed or would help much except maybe in promotion. However something I do think people could find interesting is donating storage. Not sure how that would work but basically you allow for extra space to be used on your machine. Like a storage credit kind of system.",
				"added": 1475259122
			}
		],
		"3_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": [
			{
				"comment_id": 16,
				"body": "@kosherx: Yeah, Karl Marx predicted this centuries ago... this is an inbuilt flaw in capitalism. Deuche Bank is in trouble too and if it goes down things will be pretty dire. It would probably be a worse crash than Lehman Brothers of 2008. Also there is no wrong in having private property. You seem to shrouded in faulty propaganda. The libertarian policy didn't go so well in Honduras did it?\n\n@planesphere: You are right. It was not communism. Communism is the state when no classes exist. Which surely it did in those systems.",
				"added": 1475845596
			},
			{
				"comment_id": 17,
				"body": "> [kosherx](#comment_8_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): First, I find it quite funny someone who comes with marxism mumbo-jumbo claiming that I'm into faulty propaganda, since Marx didn't predict this and even didn't live by his own words being supported by his wife and later by Engels, never working in his whole life. Anyone can predict economic crisis, but Marx never admitted that his claims against capitalism were responsible for them, exactly like Deutsche Bank, exactly like BOJ and exactly like the 2008 USA subprime crises caused by the socialist big government.Second, I never saw a libertarian claiming Honduras is \"a libertarian paradise\", quite the contrary.https://mises.ca/since-when-is-honduras-a-libertarian-paradise\n.\nMy point with Honduras was to show you that what other people proclaim about something (like Libertarianism or Communism) does not necessarily have to be true. I would view Honduras as big of libertarian dream as I see USSR a Communist one. None of them are really true for either ideology. Honduras did however do experiment with neoliberal reform that did pretty much explode in their face. This was partly behind the reasons for the coup.... The elected president didn't want these reforms and was therefore dethroned.\n.\n...and when it comes to Karl Marx. Many national economics admit he did explain the issues of capitalism pretty well today. While he looked dead wrong in the 80's he today 2016 looks much more in line. Stuff like the income gap and increasing inequality. Like that the 1% owning more than half of all the wealth, the disappearing middle class, crashing economy e.t.c.. Things which simply can be said is very much true today. We have an enormous gap and it is increasing. Greed is making the economy crash. Same inequality existed during the industrial capitalism he lived under as with the financial capitalism which we lives in. The big destruction of capital of the world wars hid a 30 year anomaly that made it look like Marx was wrong.. but it has corrected itself today. \n.\nFor the record.. I don't see myself as an Marxists. Yes, I have an egalitarian leaning but rather think of a mixed economy than a pure socialist or capitalist one. The current paradigm shift driven by automation is of particular interest of mine.",
				"added": 1475878048
			},
			{
				"comment_id": 18,
				"body": "> [tempcom](#comment_1_1KY97qn2wAVxSVTJ3fg8HvxwcJ7rwrPmt4): I think you have fallen prey to thinking of socialism as state ownership or intervention.Socialism is the democratic control over the means of production.Socialism and Capitalism cannot coexist.\n\nAs an egalitarian I am not signing up on a specific ideology in the sense that I swallow it fully. For me it's rather about equality and more specifically equity. I think Marx was somewhat right when he talked about Dialectical (Historical) Materialism. With the addition that I think we will rather evolve into a kind of slave economy where the slaves would be machines instead of workers. When the machines are capable to supply all of our human basic needs they could be made to do it gratis. The means of production will become autonomous. Work would be defined differently from today. If our basic needs are accounted for we don't really need to work... but still will. I envision a universal basic income that ensures people with what they need and a capitalistic layer above that ensures competition and pushes development forward. Poverty as such would be exterminated.\n\nA problem with basic income is that it is not really equity but do simplify bureaucracy and would remove the ability for employers to push salaries down. If you have a bitch employer you could always just take the basic income in the mean time and find another employer that respects you better. You could also use it in cases like if you want to care for your elderly mother, get an education e.t.c.. A progressive taxation would ensure the equity. With time we would be less and less dependent on the state and more and more able to live decentralized and off-grid. We would as such be untangled from the grasp of class. It would in a sense be optional. \n\nI am not sure if we ever can live state-less as we would always need some sort of law. People will always find ways and become in dispute with each other. It's part of our natural being. With laws you will need some way of enforcing them and that means you will need some sort of a state. This can't be shunned by simply getting rid of money. People will even in abundance still trade because it can never be absolute. You will always find scarcity. I don't see a point with removing a very effective way of exchange. I rather give someone \"money\" instead of dragging my cow to the market and trade it for the item I need to be able to get the item I want. Money doesn't have to be dollar it could just as well be a cryptocurrency.\n\n@planespherev2: Direct democracy sound good in theory but in practice it is always the one who shout the loudest that win. Which means the minority will always be oppressed. Those with a weaker voice will thus have it harder to be heard. Also, do not apply US politics as a generalization. In my (and I believe most other) countries the politicians are paid by the state. So the \"owners of the means of production\" can't really pay the political campaigns. The representation is as such selected by those who vote. Also, most are not full time politicians but have regular jobs. They attend a committee a couple of times a year/month.",
				"added": 1476221386
			},
			{
				"comment_id": 19,
				"body": "> [planespherev2](#comment_17_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): I also see this king of full automatization. However the problem is the same: who will be the owners of these slave machines? Everybody or a handful of ultra-rich?\n\nI think it will land on everybody eventually but it might need a revolution. I think we will see more extreme inequality before it can turn to the better but there is no escape that it will in the end. There is of course also the reformism way which should not be disregarded.\n\n> I think basic income, if it is seducing at first, will create a third class of people. Today we have 2 classes. The capitalistic class: owners of the means of production, and the proletarians: the salaried workers.\n> Zbrezinsky Zbigniew wrote a few decades ago that only 20% of the population could make the whole system work. These 20% would be engineers, computer scientist, reserchers, and generally the people in intellectuals fields. For the 80% left, he proposed Tittytainment. \n> A basic income would very well create a third class of people. So we will have the owners of the means of production (1%), the salaried workers: these 20% who'll make the system work, and the rest (about 80%) will be the basic income people. \n> I don't know what you think about it, but for me it looks like this. \n\nThat was an interesting take about it and it is definitely plausible. At least in the beginning it is very likely to be as that. Class are not determined after income though so salaries doesn't really matter in that sense. It is determined in influence over your own time or control over your situation. In that sense UBI will remove classes as you will no longer be controlled. You will however not necessary own the means of the production either. For that we will have the open source and open hardware movement. An issue for open source today is that is very difficult to find a funding model that work. With UBI that will be solved. With time the means will have transferred to the public domain.\n\n> We lived, as homo sapiens, 148000 years without money. \n> The state emerged when the primitive harmony was broken due to the Neolithic revolution. When humans began to store goods and keep it for themselves,  and not just take them from nature in immediately use/ eat them.With all these new stocks, for the first time appeared (inside the tribe, not between rival tribes), theft. A society with such differences in wealth couldn't exist anymore in harmony. So written law was created, juridisdictions and police to enforce decisions rules by the judge. \n> Again, the german tribes, which were pretty evolve didn't use money until the 5 century A.D. Same examples with an other evolved civilization the Anasazis indians (puebloan indians): they didn't use money. \n> Scarcity is only in our heads. It's some kind of disease. The ones who want the most expensive car, or even computer or smartphone are retards anyway. They are alienated. They are others than what they really are, as humans. There isn't scarcity. Give me one example of something scarce really needed for a particular individual (except for health problems), which isn't greed.Nature give us everything we need, and other stuffs, we have our brains to create it and then share it. \n\nArtificial scarcity as well as natural scarcity will continue to exist. Things people will continue to be prepared to trade for. It has not with basic human needs as those will be fulfilled by the automation and UBI. People will continue to want that specific book or that vintage vinyl. Things that have emotional value. \n\n> Do you know how many different smartphones there is currently on the market? Thousands. This is madness. Only half a dozen different smartphone models would cover the need of every human on this earth. But greed, ego, want us to have the latest shiny shit.  What's more, with only a handful model, we could produce with enormous economy of scale, needing less people working for jobs they don't like (who like to built smartphones?).\n\nThis is an argument I believe came up as a response to the inability of USSR. Choice is never bad.. as long as it can be made environmentally friendly. It is very important when it comes to innovation. This is very apparent in the open source world for instance. With 3d-printing this will only grow.\n\n> In a particular western europe country were i live, most know that the politics are in the pocket of the banks and the industry.  Maybe in small countries it's different. I heard Scandinavians country are pretty upright. But in this big western europe country were i am? Certainly not. They even have a \"club\" (like the bilderberg or the CFR) were all the politicians, industrials and journalists regularily meet and have wrotten guidelines in a fascimile. \n> Direct democracy worked for more than a century in Athenes (5-6 century BCE).\n> Also, in Switzerland, there is an imperfect direct democracy: they have referendum based on poplar initiative. It works pretty well.\n\nWhat has this with representative and direct democracy to do? Switzerland in particular is known for this informal power use thanks in part to their banking industry. Clubs like that existed before modern politics and direct democracy is no real deterrent... rather the opposite. Transparency is probably the best tool to fight this sort of thing.",
				"added": 1476299238
			},
			{
				"comment_id": 20,
				"body": "> [planespherev2](#comment_21_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): Or it will be a tool to have even more control over the population.\n> E.G: put that R.F.I.D chip under your skin or the state will cut off your basic income. \n> The hand that gives is always over the hand that receives (Napoleon).\n\nI don't see how that really relates... it could be done for any circumstance. It has nothing with UBI to do. \n\n> No emotional value towards goods in a true human society. This is alienation.  Primitive tribe don't fetishize goods.\n> Best thing we could do with those things is to put them into museums. \n\nThey actually did.. but back then it was maybe a piece of bone rather than a record. They where nomadic and couldn't easily carry with them stuff. We will probably never be nomadic again. So that argument doesn't really hold.\n\n> About representative democracy, it is a scam because people don't have any sort of control over their representatives. In a commercial society, for example, the board of directors can be removed at any moment by the shareholder. What's more, the company manager is responsible toward the shareholders if he doesn't manage the society well or does mistakes. \n> On the contrary,  in our representative democracies, representatives are totally immune. So they can serve the power that is (capitalistic class), without any trouble, they aren't responsible toward the people. \n>\n> During the Budapest commune (1956), workers took over the means of production, and the boards of directors were replaced with \"workers concils\". The representatives in these workers concils were responsible towards the workers, and the workers could also fire them up and replace them at any time, without any justification.That, is exerting power towards a representative. \n> Today, the workers concils concept is a little outdated,  with the possibility of direct democracy and liquid democracy in the internet era. However, you get the point. Total control over the representatives, or they can fuck themselves with their representative democracy.\n\nehrm... What? That is exactly what they are. A politician can pretty much be dethroned at any time. It happens all the time. You could even dethrone a whole political party and if necessary enforce a re-election.",
				"added": 1476391995
			},
			{
				"comment_id": 21,
				"body": "> [planespherev2](#comment_22_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): Because the ultimate leverage of the working class is  strike which can put the whole system down. When people are feed and entertained with a basic they don't have any leverage.\n\nThat is an option which is always there. UBI won't change it. What makes you think that will happen?\n \n> The Jarawas indians, the Guayakis or the pigmees, one the last primitive tribes currently, aren't really nomadic. They can stay in one place for generations. And really, they don't fetishize objects like us. \n\nThey do... look at their necklaces e.t.c... \n\n> When he is dethroned, the misdeed is done, and he doesn't pay the price. Not being re-elected isn't a price high enough. He must have to pay sometimes a severe fine, or be put into jail if the misdeed are serious.\n> For example, Georges W. Bush should have been put to jail for war crimes. \n> Same for Nicolas Sarkozy for having bombed Libya and killed tens of thousands of civilians. \n> I have other example, of minister in a western countries order tens of millions of vaccines during the H1N1 period in the media. This alone costed billions of euros. Even the medical community agreed that this minister was corrupted. Did she pay? Not at all. She should have been prosecuted. But representatives are immune. Not being re-elected isn't a sanction strong enough when they consciously did wrong to millions of people.\n\nThat has nothing with representative or direct democracy to do.. i.e. it wouldn't change having direct democracy. That is primarily a judicial issue.",
				"added": 1476465444
			}
		],
		"2_1HVJvkzPdXDEtsjBSzFLyx6KsG8Tg2nnr5": [
			{
				"comment_id": 22,
				"body": "That is usually how a service start.. with root that is. Also.. does not ```sudo systemctl enable tor``` work? I mean... aren't Mint using systemd nowadays?",
				"added": 1477070131
			}
		],
		"3_1AeoDwzudke45NR3b6LfU4LsmPFs8AXUvi": [
			{
				"comment_id": 23,
				"body": "Not an answer but have you considered the open source [Darktable](http://www.darktable.org/)?",
				"added": 1481544723
			}
		],
		"1_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h": [
			{
				"comment_id": 24,
				"body": "Has some issues on [ZeroMePlus](http://127.0.0.1:43110/1Lj1oPcN7oZQL8HkS5KbkzQuKqs42zQWY6/) but seems to work well otherwise... thanks ;)",
				"added": 1481869672
			},
			{
				"comment_id": 25,
				"body": "Ahh, there we go.. awesome job! ;)",
				"added": 1481933019
			}
		],
		"2_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt": [
			{
				"comment_id": 26,
				"body": "Maybe [riot.im](https://riot.im) is what you looking for? It got end-to-end and is quite modular. You can connect IRC, Slack or whatever you fancy to it.",
				"added": 1482369196
			}
		],
		"1_1LogBQ7aRYS9KNPZx2nrNKserBBAL5XhyD": [
			{
				"comment_id": 27,
				"body": "You are right that we see an increasing polarization in the world... but to proclaim that and what you write above is lightyears apart. It is always difficult to dismiss a conspiracy theory completely as it is devised in such a way to make it hard. First of all. The above post are lacking credible sources.  In fact it is not containing any sources at all. \n.\nSo to me.. the above post is just a fancy story. A story to spread fear and to further the polarization.",
				"added": 1482799954
			},
			{
				"comment_id": 28,
				"body": "@planespherev2: There is no need for such accusations. A discussion is much more productive without them. Just because elspru was critical doesn't make him a pedo.\n...\nYou are right that they can sound plausible but that is also the whole point with conspiracy theories. They are built up on assumptions. It is important to talk about them as just that. Assumptions. The proclaimed testis must always be valued and if like above it comes from someone anonymous and without sources it is really hard to put any greater such in it. If there were any truth in what zerorunner said it would have came with at least a document. It didn't and as he/she is anonymous I doubt it is from an \"insider\" too. The correct way of doing it would be to do like Snowden. So the whole point (for me) with the above is to spread fear not insight. Having the ability to be critical against the critic is extremely important. Especially today when services like Google reinforces one-selves beliefs. I know. It is extremely hard to be so when it align with your own belief but that only means you will have to be extra careful when viewing such claims. And there aren't really much substance in what was said above. \n.\nWhat happened with Trump and Brexit where lies could take such a hold and influenced the outcome made it crystal clear for me. We have to do better.",
				"added": 1482975150
			},
			{
				"comment_id": 29,
				"body": "@planespherev2: Well, of course I am. Anything else would be mysticism. Similar to why I am found of the scientific model. Theories have to be trialed before anything can be considered a truth. Conspiracy theories are in that sense very theological in essence. I prefer original data. Like what we saw with Snowden. I have no preference on any specific news bureau. I often build up my opinion from a variety of sources. Information want to be free. Anything of note is almost impossible to hide. Sooner or later it will become known.",
				"added": 1483054925
			},
			{
				"comment_id": 30,
				"body": "> [planespherev2](#comment_132_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): How can you know that Snowden isn't a US agent himself? Because the AFP and Reuters sources say so? \nI can't. There no such thing as an objective truth. Everything written is done so with bias. With Snowden you have to be careful for what they in psychology call \"the halo effect\" too. But as you said... the evidence suggests he did it because of the common good. \n> Those are my criterias, more than something which come from high perceived hierarchy, or so-called science. Science might not even exist, and could just be (false) projections of our minds. Even if such thing as pure science really exist, most of our current science might just be plain false, biased by what we want to see, as humans, instead of what really is.\nThere is no doubt that science exist.. It is a method so isn't really something that can not exist.. but as you say it can at times be falsified and biased. The difference between science and conspiracy or for that matter theology is that it can be tested. Which is an important distinction. You can for instance read the original data yourself (which I do at times). Not sure how you think when you say science is a \"high perceived hierarchy\" when it really is decentralized. Science does not happen at one place but at many disconnected from each other.\n.\nWhen you say \"I prefer to trust what my own eyes or own mind think as true\" how do you do that? Is your values or ideology more important than facts?",
				"added": 1483149215
			},
			{
				"comment_id": 31,
				"body": "> [planespherev2](#comment_133_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): About the Darwin theory (i was myself a devot darwinist years back), it cannot be tested, but it's what science say about the subject.\n> Sure you have access the data, but the \"scientific\" explanation is sometime an approximation, or even a false explanation, like the phlogiston theory explain combustion, but had good practical results. How can be be so sure that the current oxidation theory isn't again false? \n> Phlogiston was scientific, but it was false. \n> It's not so much decentralized, since, there are not so much universities around the world, and they are all funded by the same people. However, it tends to get better with the internet were everyone can do science and exchange date or theories with anyone. That's why i think many scientific dogmas will be superseded in the following decades.\n\nYes, and that is the beauty with science. You can test it. It is reproducible. There are of course exceptions. When it comes to proving Darwin and evolution a simple test like the one with short lived fruit flies does it. There are also others. The credibility comes from how reproducible a test is. Which is quite opposite of a conspiracy. Which is only possible because you can't test it. With that said.. just because something is a conspiracy doesn't mean it automatically is false. It is just very unlikely to be true.\n.\nYou didn't answer my questions... When you say \"I prefer to trust what my own eyes or own mind think as true\" how do you do that? Is your values or ideology more important than facts?",
				"added": 1483307797
			},
			{
				"comment_id": 32,
				"body": "> [planespherev3](#comment_67_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): No. Everything done in labs about fruit flies or bacteria only use genes that were already here. Sometime suppress a gene a rearrange it. Never creates anything. \nWell, they can alter the body of the fly by changing it's DNA... What kind of smoking gun do you need? What do you btw mean with \"never creates anything\"? The point here is about transferring traits between generations.. and that is what you can do with flies. That is what happens in dog kennels and other breeder kind of business. You pick a specimen with a desired trait and then breed it. If the long beak of a bird is good for the natural selection it will develop. This is observable.\n\n>  When you say \"I prefer to trust what my own eyes or own mind think as true\" how do you do that? Is your values or ideology more important than facts?\n> What my own eyes saw is not ideology. \n> Science people always say they rely on facts. However, it's more like their own interpretation of those facts. \n\nYes, that is true... when something turns out the same even with multiple repetitions with different studies. It is eventually regarded as proven. \n\n> You'll see that the Darwin theory will probably fall in the coming decades.Darwin theory emerged in an era when people, especially in the scientific community, were more and more atheist. Thus they projected this atheism into biology. \n> I prefer to rely on my instinct. \n\nSo a \"feeling\" you have is higher valued than multiple years of studying a subject? I can see why you are open to conspiracies. Because they are masters at manipulating that feeling of yours. Which also is why I am critical of these.. I need more than a feeling. I need some facts. Not just any facts but fact that I deem objective enough. ;)\n\n> That doesn't mean i reject science, but i'll only believe it if anybody can verify. Which isn't the case for Darwinism or even the round earth.\n\nAre you seriously believing the earth is flat?\n\n> That's the same reason i don't believe 100% in God/gods. \n> Although i came to the point were i think God's existence is pretty plausible, i'm not 100% sure. \n> Our world might as well have been created by a demiurge.\n> In fact, i think that in 2017, we know pretty much nothing about our existence and why we are here. We have cool tools but that's it.\n\nThis is actually something I agree with you. We haven't come far enough. What we can do however is disproving the Bible. Stuff like how humans archeological finding predates the time the Bible suggest humans was created e.t.c...",
				"added": 1483409673
			},
			{
				"comment_id": 33,
				"body": "> [planespherev3](#comment_72_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): I think you didn't understand neo-darwinism. \n> What is done in fruit fly doesn't create a new gene or a new function. It just delete an old one or replicate an old one (hence the 4 wings in a fruit fly experiment), by replicating or displacing a gene. No new function are created, no new design.\n> About the long beak, how can you prove that it's the results of random mutations and not something else? The process is supposed to happen in Thousands of years, thus it's not possible to verify the facts.\n\nYes, true... but as I pointed out with the kennels. It has been observed and we can see traits transfer to next generations. We can even manipulate it to some degree. Especially in plants this is done which a bit simpler to handle. I guess you have heard of GMO and for instance the golden rice?\n\n> Multiple years of studying a subject by who? Paid by who? Belonging in which power center? Biased by which beliefs? And in the end, multiple year done by humans, which are psychological creature by essence, and more interested by their own interest and their close group than by the real common good. \n> \n> I don't know. NEVER was it prooven it is round. All theories and formulas begin with the assumption that it is round. The fact that you cannot see beyond 5 km on the see doesn't mean it's round. \n> \n> The fact the Bible is false doesn't prove humans weren't created.\n\nYes, humans are psychological creatures and can fail and be biased. That is why the documentation is so important. If it is biased it will be discovered eventually. Some things faster than other. \n.\nIt is possible to build a rocket yourself and send it up with your gopro to space.. so that earth is round it is a veeeeery proven fact. When ordinary people send up rockets and you can see it is round... then the conspiracy is very much dead. Or do you think there are some kind of Portal (the game) kind of apparatus surrounding the plate and send you back to the opposite side when you reach the edge? Because when you sail in one direction you will eventually come back to where you started. The assumption was actually that it was flat until we started to sail around the globe.",
				"added": 1483569714
			},
			{
				"comment_id": 34,
				"body": "Yes, it is.. it is about survival of the fittest and that doesn't necessary mean growing a never heard of new function. It is about growing an extra limb, being bigger or have a different color set. Small things that might improve your chances of survival. That we can do. We can also clone.... We can however not make a video of evolution having it course but that is not really needed. How do you know dogs are basically wolves?\n\nSo earth is flat... well, take a look [here](https://www.youtube.com/watch?v=d3GD9gXzUBk). I am guessing you will say it is fake. B.t.w.. I live close to a rocket launch site which isn't Nasa. I have personally seen a rocket go up to space.",
				"added": 1483676727
			},
			{
				"comment_id": 35,
				"body": "> I didn't say it's flat. I said i have doubt about NASA and what we are told about. \n> So you see rocket launching. Do you also see were they are going? You see a rocket going up, but were? Does it really goes into orbit or does it just travel a few thousands kilometers in the atmosphere and then crash somewhere in the ocean? Is it  reality or is it a story? \nYes, you can see them launch the rocket (or balloon) physically and at the same time live video.. They do not use fish eye lens but you can still see the curvature of earth. They send rockets and balloons that go between 100 km to 300 km altitude. Ohh... and they do not go straight up.. they start tilting as the earth spins.\n\n> [planespherev3](#comment_79_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Neo-Darwinism isn't about survival of the fittest. It's about random DNA mutation which lead to evolutionary advantages in a specific environment.\nYes, neo-darwinism have a \"survival of the fittest\" or a natural selection. It is as you said not based on the individual but on the gene pool... when a positive mutation help the species be more successful and thus have more offspring. That mutation are then spread... and as I said. Mutation is something we can do. \n\n> Dogs are wolves, is basic. What differenciate a race from a species, is that individuals from this particular species can repreduce with each other. Dogs can reproduce with wolves, hence, they are from the same species. \nNice to see you believe at least some science (i.e. the one about dogs and wolves). Why do you believe that part about science and not other?",
				"added": 1483749411
			}
		],
		"10_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp": [
			{
				"comment_id": 36,
				"body": "Zsh with out a doubt... it is pretty much Bash compatible but with more features. It can do Fish. It is pluggable. It is the ultimate shell! ;)",
				"added": 1487881980
			}
		],
		"1_1ATpj32EgvgApKTmBq1KiY62B5UjzfSRJS": [
			{
				"comment_id": 37,
				"body": "> [planespherev3](#comment_167_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Maybe he's a fake president, but you  1488312195 are a bobo (white upper middle class who lives around white upper middle class). \n> About Muslims, you don't seem to know exactly what is Islam. \n> I suggest you travel in arabic countries, alone, without a tour guide or a group.\n> Then, when you come back, you'll feel soooo happy that you're in a Laic/ Christian country again. \n> Traveling in an arabo-muslim country alone (although i made some westerner friends there), made me realize that most arabo-muslims are not our (we westerners) friends. Regarding westerners, muslims completely ignore the concept of fellow human beings. It applies to them, between muslims, but not to the non-muslims.\n\nIslam is a part as is Christianity of the Abrahamite religions. They have the same origin. Which tells. A lot between them is very similar. They are very unlike the Confucius based religions. Take Malta for instance... they do not allow for abortion. They will not even save the women if it threatens her life. In Arabic countries you can do abortion if it threatens the woman's life. They believe the spirit doesn't come to the fetus until after 4 month. Which makes the time before that not as important..... but there is cultural differences between countries, areas, families. You can not apply the Saudi Arabia filter on a more liberal country like Lebanon or Tunisia. They are very different. One Muslim is not the same as another Muslim. They are not homogeneous. They are individuals.\n.\nDisabled had it very though in Christian countries before. It was looked up on them as God's will. That they became disabled because of sins their parents had been made. Disabled was therefore hidden many times or killed. Luther saw for instance some of them as witches or taken by the devil. Stuff like this never happened in the Islamic countries. \n.\nI have been traveling alone in a North African country. They are very liberal. At least in the urban areas. I could almost say 50% European values. Islam never talk about musts. It talks about what you should... but never explicitly must. If it would save you life it would for instance be okay to eat a medicine made from pigs. Life is precious. If you are sick, travels, are a kid or too old. It is okay not to pray. Christianity is the one talking about musts. It is natural for humans to sin though. So in essence they are kinda similar. \n.\nWhat happened was the Enlightenment Movement. It changed the culture (including the religion) in Europe. Before that it could be argued that Islam was more humane than Christianity.",
				"added": 1488326928
			},
			{
				"comment_id": 38,
				"body": "> [planespherev3](#comment_169_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): You seem to conflate Christianity and the Catholic church/ Church of England. Jesus Christ, whether he is the son of god or a very famous man, never talked about musts. \n> Also, nice the example with the disabled, but what about the women who are stoned to death and forced to wear a complete veil? \n> Anyway i don't want to have a debate about Islam. I was in Islamic countries and i understood that they don't consider us as fellow human beings. It's enough for me for not willing to be friend with them.\n\nThen that is the problem and a reason why you would never be able to know them. So you shouldn't really talk about them as you did. How they treat women and their judicial system is primarily a matter of cultural difference and as I said differ a lot between Muslim countries, regions and families. Same as there are cultural differences between the English abortion laws and Malta's. Should probably also mention that both Ireland and Poland also have quite strict laws on abortion. Church of England is special but would say it is Protestant. Which broke out of Catholicism because Henry VIII wanted a divorce and the Protestants did the same as (Martin Luther) deemed the Bible of more literal importance.\n.\nChristianity is what you call all together.. Catholicism, Church of England, Greek Orthodox, Russian Orthodox, Protestantism e.t.c...... They all have Jesus and the Genesis (Adam and Eve) in high regard. You probably know how Adam ate of the apple of knowledge and that it is the origin of sin. So you must repent. You _must_ follow God's will or you will end up in hell... and this is not as true for Muslims. For them it is more that you _should_ follow God's will. If it is not healthy you should in fact not. Being healthy and hygienic is of big importance for them.",
				"added": 1488412137
			},
			{
				"comment_id": 39,
				"body": "Yes, as a religion Islam is quite nice. It has parts of the humanist perspective and is somewhat egalitarian. It has a \"freedom of religion\" clause which provided protection for Christians for instance.. Compared to Christianity it was very progressive. Culturally both religions is kinda similar. So the European origin is not really an issue here... b.t.w.. parts of Europe has also been and is Muslim.\n.\nThe difference that happened in Europe (as I said) was the Enlightenment and in it's foot steps normalization of the humanist perspective. This never happened in the Arabic countries. Not directly anyway. So you are right when you talk about a cultural difference. It is especially visible in war thorn, rural and poor areas. There is a big discrepancy from these areas and the urban areas. The colonization have done a great deal in affecting the culture. In many countries you need to understand French or British if you intend to work in the state administrative services. The globalization and Internet is doing it's part. Immigrants who move to other countries is also a way to harmonize the differences. So you can't really talk about Muslim's as a homogenic group. They all differ. Most who come here to Europe will adapt... and those who don't as much will adapt in their second generation.\n.\nAs we have talked about. Islam is not actually that bad. Culture is always changing.\n.\nIn Morocco where I have spent some time the common greeting phrase is \"Salam!\" and to say goodbye it is \"Bye Bye\"...",
				"added": 1488659107
			},
			{
				"comment_id": 40,
				"body": "> [planespherev3](#comment_175_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): About colonialism, it's not a good thing, contrary to the right of freedom of the people.\n> However, let's not forget that the Ottoman empire which controled most of arab-muslims countries for hundreds of  years,  before the english or french colonization, was a slaver empire. What's more it taxed very heavily the populations, and deported the populations if they didn't pay the taxes. \n> I'm not defending french colonization. But before it was way worse. Regarding Morocco, France colonized it in the 1830s, taking it from the Ottoman empire,  but abolished slavery in all it's territories in 1848. \n> So it's very true to say it's french colonization which abolished slavery in those territories.\n\nNot sure what you wanted to say with that. The point I tried to make was that colonization was before the globalization and that it too have led to a cultural harmonization. And slavery can be a tricky thing. Some say the American prison system is a kind of legalized slavery.",
				"added": 1488742756
			}
		]
	},
	"comment_vote": {
		"7_1AZjDLkfYwSmjM7ZJUf7HHnrF778augRMa": 1,
		"15_1JF3eQjW4voiKdcvCkMXvUx5bLmZAiVdyi": 1,
		"6_1PCPuVtFv8apVpXYbc46wHugNhFUVQ6KCv": 1,
		"133_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx": 1,
		"32_1HrRNH7KbdxMjwLmwrHmZqJrzVZVDKc9bF": 1,
		"12_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": 1,
		"11_17nphNHoGtz9EzvvTSSbZn7WHfM1ynpdsL": 1,
		"19_17nphNHoGtz9EzvvTSSbZn7WHfM1ynpdsL": 1,
		"21_17nphNHoGtz9EzvvTSSbZn7WHfM1ynpdsL": 1,
		"770_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"210_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1_17a8xsj4Ds61C9wcox4Yqjp4GKD3qNdmdf": 1,
		"16_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9": 1,
		"11_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C": 1,
		"1_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"2_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"2_17a8xsj4Ds61C9wcox4Yqjp4GKD3qNdmdf": 1,
		"19_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": 1,
		"1_1J5uFzQBpLpoyTZfH28Fv8KrThShewrF2d": 1,
		"47_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR": 1,
		"1_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h": 1,
		"1_1Mzjg3DjFFiUBz42zZa9w9oM2Lf4vHeLK3": 1,
		"69_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR": 1,
		"896_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1
	}
}