{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "The war against the machine - a message from an insider",
			"body": "The media is getting threatened and many service providers and blog owners are being threatened now.\n\nAlex Jones cannot talk about pizzagate because of lawsuit threats.\n\nThere are atleast two factions of the US government and they are fighting for power. The clinton/bush/soros/rockefeller/leftist group is trying to do a media purge of opposition media and is being pushed to greater lengths of deperation to stay in power.\n\nBoth of the groups are very powerful, control media outlets and have weapons. If the other group does a purge of the opposition media, then it wil be met by kinetic retaliation.\n\nExpect escalating levels of violence as the current group loses powers and takes increasingly reckless actions to stay in power.\n\nSeveral people have been assassinated over leading the Pizzagate investigation so far. \n\nWikileaks has been compromised. Some of the wikileaks admins have released a message, suggesting that their families have been captured and are under threat. No one has heard from Assange in over 90 days and the wikileaks organization will continue to go along with &#34;assange is alive, really but no proof&#34;, because their families are under threat.\n\nWe will not see the rest of the Podesta emails released from the wikileaks organization. They may released sanitized emails, to placate public, but we wont see the original emails they intended to continue releasing until the point that Assange was removed.\n\nThe FED is raising interest rates. They intend to pull money out of circulation and cause all the debts to become unpayable and to go into default, causing another finantial crisis that will enrich the elite, who will come in and buy out all the assets cheaply during the orchestrated crisis. They will attempt to blame Trump for the crisis.\n\nTrump&#39;s group will respond by\n- purging the FED board\n- 10% tax or tax free repatriation of off-shore US dollars. Resulting in a flood of new dollars into domestic economy from offshore, to pay down the debt\n- 50% dollar devaluation and debt negotiations\n- multi-trillion dollar domestic stimulus for domestic infrastructure investment\n- tax reductions, to increase money available for people to spend instead of money going to government blackhole\n- elimination of obama-care insurance cartel, to increase percentage of workers wages going to take home pay, instead of forcing the money going to insurance companies\n\nEvery one of Trump&#39;s (faction 2s) intended responses, will be fought tooth and nail and blocked by the Senate by both houses. Unless he can blackmail enough pedophiles to turning on their former masters, with promises of legal immunity. Its not clear how much pressure Pizzagate will put on them and how many of these people he is going to be able to turn to testify against the others using pizzagate and strategic leaks as blackmail.\n\nThe battle, will be fought in public. The FBI and US govt agencies are too compromised at every level. The battle will be fought in the court of public opinion, by strategic leaks and orchestrated media events. Whoever controls the media and the narrative, will be able to brainwash the public to their side and benefit\n\nWe will see many more limited hangout type operations. Wikileaks usefullness as an asset is now limited and we will see other operations arise.\n\nPeople will be judged, not by whether what they say is true, but by which faction they are supporting or opposing. If the second group wins, Assange will be hailed as a hero and Snowden as a traitor, because of their employment, faction and who their agenda benefits.\n\nThe groups that are in power, are in power through force. They cannot assassinate each other, because the other side would assassinate them back, proportionally. That is what is keeping the balance of power now.\n\nThe people without OPSEC or protection are easily eliminated, when necisary and with no consequence. In some European countries, several Pizzagate investigators and members of the media have been taken out by machine gun and sniper fire. No one is going to jail for this. This is how the establishment protects itself.\n\nWhen the threat is small, the establishment can safetly ignore it or use lesser measures. When a threat becomes serious, the gloves are off and the establishment moves directly to violence, poisoning and assassination.\n\nWe will see escalating levels of assassination and violence, that will spiral out of control as the current elite is destabilized and the new group comes into power.\n\nThe existing elite, needs a new crisis. A new pearl harbor. A new catalyzing event. A new 9/11. They need to create fear and terror in the public, so that people are willing to give up their freedoms and obey the masters who aspire to rule over them.  The existing power elite, believe that a large war would &#34;solve all their problems&#34;, expecially with respect to regulating and shutting down all opposition media and consolidating economic control over all key industries and then distributing the loot amonst their supporters, while stripping the economic power from opposition factions.\n\nHowever, the public is not buying the war with Russia narrative. The fish are not biting. Once the independent media is eliminated and they have a monopoly again, they may be easily able to shape public opinion again to benefit their plots, agenda and schemes.\n\nPizzagate is worst than any of the people investigating it can imagine. The Podesta email drops were ordered in terms of severity. The worst emails have not been released yet. The drops stopped at the same time Assange disappeared and the wikileaks staff had their families come under threat. We have only see the earlier batches of emails. The &#34;life insurance emails&#34; have not even been released yet.\n\nWhen the full evidence comes out, the credibility of the mainstream media and their pizzagate denials will be completely and irreversably shattered. The owners of the Washington Post, Twitter and Facebook, MSM and anyone who defended Hillary Clinton or people implicated in pizzagate will come under attack as &#34;pedophile supporters&#34;. The public will be ready to boycott them or burn them at the stake.\n\nI think it is increasingly unlikely that we will see a non-violent resolution as different factions of elites fight for power and control over the government. More is happening between the scenes than is happening in public.",
			"added": 1482644249
		}
	],
	"topic_vote": {
		"1_14DujeMmUQr14gCcg6ZUVcdU1DA5GphYvG": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1_14DujeMmUQr14gCcg6ZUVcdU1DA5GphYvG": [
			{
				"comment_id": 1,
				"body": "It's not really supposed to be anonymous, its very cool for what it is, uncensorable p2p websites (if decided by users)",
				"added": 1482644318
			}
		]
	},
	"comment_vote": {}
}