{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 36,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "Just the casual test :-o",
				"added": 1475622431
			},
			{
				"comment_id": 9,
				"body": "> [beard](#comment_1_1L6kM35jc1KwpPi8LpEsCJmgXw2RM3UW1W): isnt this fun?\n\nIt is indeed. Can you answer please i still didn't test.",
				"added": 1475680083
			}
		],
		"1_1HRrLnTaJwRCA24L45Sr3cYJ3nDmJmPabf": [
			{
				"comment_id": 2,
				"body": "Earth realm? Whatever it is...",
				"added": 1475622572
			}
		],
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 3,
				"body": "> [mrwhite](#comment_1_1NnciDBNk2s2o8ASCmXkhfvqR1qws6QNuq): Who do you mean by we?\n> Christians that aren't brainwashed with meh universal equality or judeo primacy bullshit are mostly fine. Moslems and Jews are not because they want to kill or enslave us all any way they can.\n> Who do you think the capitalist leaders are?\n> The same people own or control all the important business, institutions, media, and politicians, as well as all the money.\n> What better system are you referring to?\n> Capitalism is just the tails side of the shekel and communism is heads. Exchanging one for the other won't get us anywhere.\n> Is there a third alternative to communism and captialism?\n> Maybe you're under the illusion that THE PEOPLE know what's best for themselves?  Unfortunately they absolutely do not. Never have. I wish it wasn't true but it is. Accordingly the weak cannot be permitted to influence state policy directly because they will be exploited and manipulated at every turn by those seeking to gain power for their own ends at the expense of the common good. Only a strong leader with a vested interest in the welfare of his people can make the right decision when faced with a decision that requires a strong character to make.\n\nJust for you to know, there wasn't any real communism in the modern history, except the last existing primitive tribes. What you refer as communism, which i guess is URSS, Cuba and North Korea, isn't communism, but state capitalism. They have money as a mean of exchange. They have political economy. Thus what is commonly refered as communist is, in fact, state capitalism. \n\nOnce this is understood, people will open they mind to a new mode of production.",
				"added": 1475623051
			},
			{
				"comment_id": 4,
				"body": "> [jewish](#comment_2_1K92Q9FtzTWLQC6x5wUQBanNniZTb45wEH): Jewish know how to make money and how to use others.\n\nThat's the point. In a system without money, jews would be just like the others. The jews don't make the capitalistic mode of production, they are just the capital elite. Should all the jews disappear, there would be an other elite to take their place.",
				"added": 1475623817
			},
			{
				"comment_id": 7,
				"body": "> [becoming](#comment_8_1FwTZnDZJjs2epEtq9yLy7m2P5kZ4TYqAR): Communism, if it is ever to arise, won't arise out of a positive ambition for it. It will arise out of the refusal to accept that there is either: private property or currency.\n\n\nThe german tribes who fought the romans were communists (real ones not bolsheviks aka state capitalists). \n\nThey shares the land, the animals, the food, the tools. It's only around the 5-6 century that they began to use currency and private property. \n\nAlso during the middle age, which is presented by the mainstream system as dark age, many things were shared, like lands, tools etc...\n\nPrivate property doesn't exist in homo sapiens natural state. \n\nHomo sapiens lived from 160000 BC to 12000 BC without private property. \n\nI do no say that you shall not own your own computer or your own toothbrush, but the means of production (factories, lands, power stations), should be shared in a non monetary system.",
				"added": 1475664161
			}
		],
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": [
			{
				"comment_id": 5,
				"body": "> [teszt](#comment_53_1AdcxsExVKvxffQtEd72E5tckouzZHLEYC): \n> Hillary Clinton: “ ... if I'm the president, we will attack Iran \"https://www.youtube.com/watch?v=rTt-xhF02GgDo you really want that ?\n\nClinton is crazy and dangerous for sure.\n\nHowever, do we have such low ambitions they we contempt ourselves with this representative democracy scam? \n\nTrump is not Jesus. I re-watched the Devils advocate a few weeks ago and Donald Trump is refereed to in the movie (in the Gala scene).\n\nThen, like a flash in my mind, and even if before i was seduced by Trump personnality, i understood : they are the same.  \n\nRepresentative democracy is a scam. The infamous  Colonel House explained it in his book Philip Dru: administrator.  In a representative democracy, about half the population will want to vote for one candidate, and about half for the other. In the middle lies the indecisive. All the mass medias have to do is to push on the scale in one direction or the other to convince the weakest and stupidest people there is: the indecisive. Too stupid and weak to even have an objective opinion about a candidate. With this crowd psychology related mechanism, mass-medias control the election. \n\nThat why representative democracy is a scam in all context but in this one in particular. \n\nAbout one half for Clinton, one half for Trump, like always, and then in the middle, regarding the 5% of indecisives, the mass medias own by the elite and the spin doctors do their bidding. Regarding this 5%, the movement is almost what was wanted by the elite. In rare occasion, there are surprises, but anyway, Trump clearly represent the system in all it's aspects. Certainly he has some charism and a flavor which might appeal for many, but he'll only perpetrate the system. \nLike Robert Greene wrote in the 48 laws, in a political election, often the choice is between Charybdis and Scylla. \n\nIt's done like that since the beginning of the 20th century.",
				"added": 1475625285
			},
			{
				"comment_id": 6,
				"body": "> [jewish](#comment_3_1K92Q9FtzTWLQC6x5wUQBanNniZTb45wEH): Don't fool yourself. Both candidates have been approved by Israel.\n\nIf you want power as people, never delegate it. \n\nWhatever candidate run for presidential election, he will be approved by Israel and the financial system. \n\nDelegating power is the best way to no exercising it.",
				"added": 1475663541
			},
			{
				"comment_id": 8,
				"body": "> [teszt](#comment_54_1AdcxsExVKvxffQtEd72E5tckouzZHLEYC): The genetics have made huge discoveries during the last decades.There is no white race. All existing humans are a single race in biological taxonomic sense as they can have common children and have the same number of chromosomes.Homo sapiens and Homo neanderthal could be considered human sub-races. They are genetic evidences that an interbreeding between them occurred in the Middle-East 50 000 years ago.\n> \n> 100% Africans are 100% Homo sapiens with 0% Homo neanderthal blood.\n> non-Africans - Europeans, Asians, black people from India and black people from Papua are 1-4% Homo neanderthal and 96-99% Homo sapiens interbred.So genetically only this two human sub-races exists - with or without Neanderthal blood. All others are just sub-sub-races.\n\nWhat you say is true, and interesting.\n\nHowever, you know that regarding african americans, they are around 20% to 50% white. So when does a black people stop to be of african descent? When does he \"become\" white? Is the DNA related to abstract reasoning dominant or recessive characteristic? \n\nEven if we were to all mix ourselves in one race (i'm not  an advocate of this). Would we be stupidest than now? Or is the intelligence genes dominant, so it won't really matter in the end? By the way, mixing people don't make the gene disappear, even if it's recessive. E.G, if a blue eye (blue-blue alleles) have children with a brown eye (brown-brown alleles), the children will be brown eye, but the child, even can have blue eye children if he have children with a blue eye person or a brown blue allele person (1/4 chances).  However, if the gene become negligible in proportion, it could somehow disappear, but then the sexual selection intervene. Successful, thus most intelligent men (most of the time), will have more children, or at least enough children, so there genes will still be passed down future generations. \nSo no, in theory, there is no risk that the human intelligence disappear. Asian will probably be the most dominant ethnic group in a century anyway.",
				"added": 1475670477
			}
		],
		"2_18Sh2Z83C23xdd6pjCq6NGv7Y6svEBcUfb": [
			{
				"comment_id": 10,
				"body": "It's used to geo engineering, among other aims. Strontium, baryum, aluminium.... Healthy heavy metals.",
				"added": 1475704085
			}
		],
		"3_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": [
			{
				"comment_id": 11,
				"body": "Have to say something important, mostly for north american people. No offense, it's some remnant from the  Maccarthysme era so it's perfectly understandable: \n\nWhat you refer, still today, as communism, isn't in fact communism, but state capitalism. \n\nWhat was going on in URSS (bolcheviks), Cuba, China (Mao Zedung) and still today in North Korea, isn't communism.\n\nIt's planned economy; political economy; state capitalism.\n\nThey have/had a state, and they use currency. So it never was communism.\n\nIf you want to understand real communism, take an interest in the last primitive tribes around the world. Or easiest way, see the beginning of the movie Apocalypto (Mel Gibson).",
				"added": 1475778738
			},
			{
				"comment_id": 12,
				"body": "> [kosherx](#comment_5_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): A rat with his fancy computer - therefore PRIVATE PROPERTY - calling me a rat. Oh, the irony.\n\nA computer isn't a mean (most of the time anyway) of production. Private property of the means of production alienate humans (factories, power stations, lands etc...).",
				"added": 1475840171
			}
		],
		"1_17q6Zhf7PFjrY3ddySK2F78JhAH3FVhmWr": [
			{
				"comment_id": 13,
				"body": "> [deception](#comment_5_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o): Maybe. But you should read before this message from your ideological great-grandfather:On The Jewish Question - Karl MarxWe recognize in Judaism, therefore, a general anti-social element of the present timehttps://www.marxists.org/archive/marx/works/1844/jewish-question/\n\nJews are not plotting to impose capitalism on people. Jews are merely capitalism elite. \n\nWould the jews disappear, there would be an other elite to take their place, and they wouldn't be better.",
				"added": 1476723763
			}
		],
		"1_1AhXDbKvcLap7TcS2542J7bFYzKHM3xeRU": [
			{
				"comment_id": 14,
				"body": "> [binero](#comment_43_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Why is greed an issue? As you said, it's a feature, not a bug.\n\nIn the primitive tribe, when some begin to feel superior, he is first mocked, and if the persist, he is shunned.\n\nIn a primitive organization, there are social mechanisms to prevent greed.\n\nCapitalism, on the other hand, only pours oil on the fire, with a system were the one who have the most money have the most power. \n\nCapitalism is not a system which encourage the power of the wisest (the elders in the primitive tribe), but the richest, the most powerful. \n\n\nTake a dog, put him in a cage, 24H, in the dark, and strike him regularily (make me thing about the dog scene in snatch the movie). he'll become agressive.\n\nOn the other hand, take the same dog, take good care of him since his birth, and he'll be a nice dog. \n\nIf you think humans reflect greed, it's mostly due to the current mode of production we live in.",
				"added": 1478645446
			},
			{
				"comment_id": 15,
				"body": "> [binero](#comment_44_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): You didn't answer the question. Why is it a problem? In capitalism, greed is just an incentive to help others.\n\nNo. Greed, is what makes children make your shoes in Bangladesh.\n\nGreed is what makes bankers speculate on food and create famines in Africa.\n\nAnd most importantly, greed is at the origin of the rainforest deforestation and destruction.",
				"added": 1478688315
			},
			{
				"comment_id": 16,
				"body": "What you propose is patching a system which is inherently bad, because it's based on profit.\n\nYou can patch windows, install an anti-virus, which only make the whole system heavier, or you can switch to Linux.\n\nAnyway, this doesn't answer the tendency or the rate of profit to fall: https://thenextrecession.files.wordpress.com/2014/04/world-rate-simple-mean.png\n\n\nIt would be better to change the whole system, a mode of production based on the well being instead of profit. It's not even a choice in the end since this profit will fall and fall until it will be non-existent in the end, which will cause capitalism final crisis. At this point, when capitalism final crisis will happen,  we could switch to an other mode of production, even go back to slavery, or change for a new one, not based one property and the exchange of goods. \n\nIn order to realize that an other mode of production is possible, many must understand that well being doesn't necessarily mean making more money or having more new objects at our disposal.\nIf you think that your well-being is related to your buying power, then no change is possible.",
				"added": 1478693243
			},
			{
				"comment_id": 17,
				"body": "> [binero](#comment_47_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): That wouldn't be irrational if Windows was a better operating system overall. Capitalism is more efficient, faster and relies less on trust.\n\nIt is not clear if capitalism is more efficient than superior communism. It depends on what you mean about efficient. If it is producing more goods, capitalism is possibly more efficient. It you mean saving ressources or biodiversity (those which haven't been definitively destroyed like half of the wild animals during these last 40 years), superior communism will probably be more efficient. \n\nYes capitalism relies less on trust, capitalism relies on coercion. The whole capitalist mode of production relies on coercion.",
				"added": 1478713113
			},
			{
				"comment_id": 18,
				"body": ">I've never heard of violence committed to anyone because they couldn't pay their debt.\n\nHave you heard about the sub prime crisis, were people saw their houses confiscated and were (still are) obligated to live under camping tents?\n\n>Robbing something isn't something unique to capitalism. Long before capitalism existed thieves existed.\n\nTheft only exist on modes of production were there is money and/or property. Thus slavery, feudalism and capitalism. During the primitive communism, there wasn't theft inside the tribe. In superior communism, there won't be theft anymore. No need to steal when everybody have everything he need (not everything he wants, but everything he need).\n\n>All capitalism is, is a way to model the economy in a way which allows the most freedom yet guarontees resources are used in the most efficient way.\n\nSo, is planned obsolescence, something capitalism created, a guarantee that resources are used in the most efficient way? \n\nAnyway i just thought about it yesterday, and with the tendency of the rate of profit to fall, capitalism NEED planned obsolescence. Otherwise the final crisis will come sooner than later. If people don't buy again and again the same stuff, the economy crash and the system collapse. \n\nI just thought about it and it could be even worse in the future, lobbies could impose  laws which compels you to change you belonging regularly (with excuses like security, protection of the environment etc...) Even if, for example, buying a new car (which consume less) in exchange of the old one pollutes more because of the energy and resources used to build the new one).",
				"added": 1478779187
			},
			{
				"comment_id": 19,
				"body": "> [binero](#comment_53_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt):\n\n>Why would people not steal to get what they want? \n\nDo you steal inside your family? It happens but it's quite rare.\n\n>This is somewhat true. People need to keep spending their money instead of sitting on it, otherwise inflation will skyrocket. There's other ways to keep the economy going other than by making worse profits, like by making better products, or by inflating prices by cutting on maximum permitted work hours. \n\nIt's not only about inflation, but about the tendency of the rate of profit to fall. \n\nThe more mechanization happen, and we all agree there will be more and more mechanization in the future, the more the rate of profit fall. In the end, even selling non needed goods regularly won't be enough. Prices drop and drop but people don't need goods they already have, which are produced in a bigger and bigger quantity and at a cheaper and cheaper price. In the end, there won't be enough profit to make because there will be massive quantity of cheap good that won't sell and the system will crash. \n\nBetter product could answer partially the rate of the profit to fall but doesn't solve it. \n\nIn the end (about 50 years), it will be machines making machines for almost nothing to pay, and the system will crash because a system which produce goods without work and very massively (sell for a cheap price) cannot make profit.  Capitalism is based on profit. Thus it will inevitably crash when the total mechanization of all production lines will have been completed.",
				"added": 1478811836
			},
			{
				"comment_id": 20,
				"body": "> [binero](#comment_54_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): \n\n>You keep saying that but there is no evidence whatsoever for that hypothesis. Economists widly agree that it's not a thing. It doesn't make sense either.\n\nhttps://thenextrecession.files.wordpress.com/2014/04/world-rate-simple-mean.png\n\n>Mechanisation increases profit, not decreases it. Labour costs go down, profit goes up.\n\nHere is the abstract part. You should understand it yourself, but i'll help you.\n\nAt first, after some mechanization in a particular production line, profit go up because more goods are sold. This competitor has an advantage: he produce more for a lower price.  However, later, competitors do the same in order to keep up, and mechanize. More goods are sold on the market.  What happen then? Prices go down. Less profit is made for a particular item for all the competitors. Selling a particular item give less profit,  because more items of this kind are on the market.  You'd say: it's not a problem, we'll sell more of the stuff to compensate. At first, it'll work. And planned obsolescence will help. However,  here is the critical point: who need 200 pens, 15 cars, 18 laptops. No one.  At one point, goods will be cheaper and cheaper, profit will be compensated by selling more, but you can only sell as many as people want, or need.  At one point, less and less people will buy the particular good, until no one will buy it. This is capitalism final crisis. \n\nAlso, be realistic: take an abstract example: one production line: 100% automated, extremely energy efficient (In the future,  in 50- 80 years from now). Manufacturing goods in this particular production line will cost nothing. Same for the competitors. Thus the price of the goods will be nothing. Thus no profit. \n\nIt's quite simple but many are not conscious of this law of the rate of profit to fall.",
				"added": 1478868876
			},
			{
				"comment_id": 21,
				"body": "> [binero](#comment_60_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt):\n> You're paranoid. It's not that difficult to get capitalism out the political system, but it's the capitalists who made democracy happen in the first place, \n\nOur political system isn't a democracy. Representative democracy isn't democracy.\n\n> And then they stopped existing. That's my entire point. Good they did too, life is much better now.\n\nFirstly they didn't stopped existing. Secondly, the point of superior communism isn't to go back live in caves or in huts. \n\nThe point is to use modern technology, but within a system of organization close to how our ancestors lives. And for sure it wasn't a capitalistic organization. \n\nBeing the most efficient system doesn't mean it's the better. Well being doesn't relate to efficiency.\n\nI can make an analogy with coal energy. It's one of the cheapest, and we have at least 110 years of coal left. However, everyone agree that it's the worst. (check coal pollution china).  \n\n\nNo offense but sometimes i feel that guys like you (binero) are AIs. \n\nIt's super far -fetched and even here some will say i'm a conspiracy theorist, but it's not 100% impossible.\n\nYour name itself, binero, makes me doubt...\n\nIf you're a human, i suspect that you're paid to spread this propaganda. Even paid people can be convinced if the arguments are right. \n\n\nBut anyway, it's only doubts, and i must admit that you debate in calm (no insults). So i thank you for that.  ",
				"added": 1479154392
			},
			{
				"comment_id": 22,
				"body": "> [binero](#comment_62_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): \n> I have asked before, but what problem is there with the current system that it requires a change to something that radical that is anarchy? Capitalism has its problems, but those can be resolved. Current democracy also has its problems, but that's to be expected given it's still fresh, new and evolving.\n\nBecause it's not our fucking true nature as humans! It's not complicated you just don't want to understand it. \n\nAs lions are not meant to live in cages, humans are not meant to work for other humans.",
				"added": 1479159318
			},
			{
				"comment_id": 23,
				"body": "> [binero](#comment_62_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Now we're just arguing semantics. \n\nNot quite. \n\nWere have you been on the clearnet these last years if you haven't heard about direct democracy? \n\nQuote from Sieyes, one of the founding fathers of the french republic, about representative democracy:\n\n\"Citizens who call themselves representatives shall renounce and shall refrain from making the law themselves; They have no particular will to impose. If they dictated wishes, France would no longer be this representative state; It would be a democratic state. The people, I repeat, in a country which is not a democracy (and France can not be), the people can not speak, can only act by their representatives. (Speech of September 7, 1789, headed precisely: \"To say of the Abbe Sieyes, on the question of the royal veto: at the sitting of September 7, 1789)",
				"added": 1479159954
			},
			{
				"comment_id": 24,
				"body": "> [binero](#comment_65_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): I have heard about direct democracy. I'm a mild advocate, but I'm unsure the public really cares.\n\nIn a recent poll, 75% of the french people want poplar initiative referendums in the political decision process.",
				"added": 1479161167
			},
			{
				"comment_id": 26,
				"body": "> [binero](#comment_70_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Oh, I do think there is a connection between wealth and politics. After all, the wealthy designed the current political system. That's something that definitely needs to be addressed. That doesn't mean capitalism is the issue. That means a political system favouring top economic brackets  is an issue.\n\n\nHere we go again. Another one (dear binero) who think we can control capitalism. That politics can control the mode of production. It's the mode of production which defines the political system. Not the other way around. Most of the people think that politic has control over the mode of production. It hasn't. It's the mode of production which define the political system which suits it the best. In our case, liberal representative democracy.",
				"added": 1479339270
			},
			{
				"comment_id": 27,
				"body": "> [binero](#comment_71_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): It is politics which defines the economic model. There is no evidence saying capitalism cannot be controlled if attempted. There is evidence in the opposite direction. There are numerous studies which show which policies contribute to equality, working conditions, and so on.\n\nI didn't say the economic model, but the mode of production (primitive communism, roman slavory, feudalism, capitalism and ...). Politics can't define the mode of production. The mode of production morph when it become less effective than a new one, or when nobody is interested anymore by playing the rules of a particular mode of production (what seems to have happened to feudalism). \n\nYes you could adjust the mode of production, by changing the economic model, but it's still the same mode of production. It's like modifying a (currently bad) design. You won't get marvels. Better to start from scratch. \n\nIn the capitalistic mode of production, you'll always have private property (which comes from the work of some humans for other humans: the owners of the means of production). You'll have a state, and money.  You'll have alienation (which comes when someone does a job he doesn't like). You'll have class struggle, coercion, lots of laws. And last but not least, you'll have the tendency of the rate of profit to fall which end with a final crisis.",
				"added": 1479383326
			},
			{
				"comment_id": 28,
				"body": "> [binero](#comment_72_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): >You still haven't backed up your claim that the profit falls,\n\nhttps://thenextrecession.files.wordpress.com/2014/04/world-rate-simple-mean.png\n\n >and furthermore, a profit ratio of 0 suggests that people consume less than they produce.\n\nHow can they consume something they don't need? Nobody want 15 car and 50 phones. With full mechanization, that's were we're headed. Then you'll say that we could build more technological goods, but still, if the production line is 100% automated, it will still cost about nothing to produce, then to sell, then no profit. \n\n >If you take issue with overproduction, the solution is simple. Apply worker rights and production drops. \n\nAnd what to do if there is no workers needed to produce? Also, this doesn't take the relocation problem into consideration. Apply worker right in the west, and companies will relocate anywhere there isn't such rights. \n\n> Capitalism provides a system in which people are incentivised to do jobs that are needed the most, and that's what has started all thee economic revolutions in the last three centuries. I do not see how a communist economy can still provide this.\n\nAnd what to do with the 80% which will not be needed anymore in the near future? \n\nYou really like your mode of production.\n\nThink it will last forever?",
				"added": 1479398299
			},
			{
				"comment_id": 29,
				"body": "> [binero](#comment_73_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Same source, different story? https://thenextrecession.files.wordpress.com/2012/09/world-rate-of-profit.png\n\nMaybe we haven't the same eyes, but it's still falling. Capitalism just keep it's head above the water because of the third world were there is still growth to accomplish. In the west it's ineluctably falling:\nhttp://www.leftcommunism.org/IMG/jpg/Graph_3.jpg?1469656899\n\n\n> As I alluded to earlier, if the production cost is 0, then it's not unthinkable that for the sectors where this is true, cooperative organisations will take over, and slowly capitalism will be phased out. \n\nYes but it's very important that many people understand the dilemma, because if not, the 1% will still own the means of production, even if it cost nothing for them to produce. \n\n> I'm not in favour of modern day free trade. The same worker's right standards should be applied for imported goods as domesticly produced goods. \n\nThis is somehow delusional. Capitalism doesn't care of what is right. Only to make profit. You'll have relocation, whether you like it or not. \nAll of our current standard of living is based on the fact that chineese worker manufacture our daily items for wages 10 times lower than in the west. \nAs i said before, the only way for no relocation to happen is if there were no countries with different legislation anymore. One world government of some sorts. However, most of the people don't want this, and i understand them. \n\nI, for myself, don't like the concept of nations, because it was itself created by the capital, however, a world government is not the abolition of money and the state, but just one big capitalist and technocratic  super-state, and probably totalitarian (see Orwell or Aldous Huxley). \n\n\n> I said before I don't think it'll last forever, because a zero production cost will kill capitalism and will boost cooperatives. I'm also in favour of a universal basic income, to make the evolution smoother. I actually advocated for subsidising cooperatives in our federal parliament in 2014, and also lobbied for a universal basic income at the same occasion. While since then there is now a vast interest in cooperatives in our country, I do not see the universal basic income happening as long as people do not actively fight for it.\n\nI'm skeptic about the basic income. Looks like Tittytainment from Zbrezinzky. Also basic income would put the beneficiaries of this basic income on the hand of the state which allows it. And since the state is in the hand of the capitalist class (owners of the mean of production), it'll put them in the hand of this capitalistic class. \n\nIt could also create a third class of people: the UBI people. \n\nWorkers have a strong leverage against the capitalistic class: general strike. \n\nWhat leverage does basic income people have? None. If they don't behave, the state will just shut their UBI down. \n\nThe hand which gives is always above the hand which receives. \n\nI won't fight the basic income. However, people should not be naive, and understand that there could be some bad side effects about this basic income. It could also create inflation, and increase housing prices and cost of living for the working class.  \n\nThere is also the problem of immigration. If you propose a basic income, everybody from countries were such  income doesn't exist, will try to come to countries were basic income exists.",
				"added": 1479411299
			},
			{
				"comment_id": 30,
				"body": "> [binero](#comment_75_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Same can be said about your \"modern communism\".\n\nWe don't know yet if superior communism don't work. We haven't even created such a complex system on paper,  a super high tech one with algorithms, computers and robots to manage and share the production. \n\nAbout Bolshevism it wasn't modern communism but state capitalism. \n\nAlso, modern communism,  in an archaic form,  worked during the revolutionary Catalonia (1937), but was crushed by the  republic.",
				"added": 1479470952
			},
			{
				"comment_id": 31,
				"body": "> [binero](#comment_86_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): I agree 100%, but I considered deleting people from your own platform as censorship.\n\n\n\nBy recognizing the right to suppress posts in platforms owned by a particular individual, you just recognized the right to private property. \n\nOkay, right, i'm no bolshevik, if some want to have something only for themselves, and have absolute rights over it,  good for them, but i don't want to participate in it if i have the choice not to do so. \n\nThat's why we need to advocate more P2P platforms. Platforms which doesn't belong to anybody.\n\n Those who want to post on traditional  central servers platforms could do so, but in those central servers platforms, self-censorship (coming from fear of being banned) is always a problem. \n\nEven here in Zerotalk Nofish has administrator rights. \n\nThe only forum systems which cannot be censored at all and that i use are Sone and FMS (in freenet).\n\n> thisweb11: Democracy and free speech only exists where everyone truly has an equal platform to speak, propose or share ideas, words and media.\n\nExactly. That's why using P2P networks like Freenet or Zeronet are  small steps further to real democracy. Here no one own anything. We all own everything.",
				"added": 1479857998
			},
			{
				"comment_id": 32,
				"body": "> [binero](#comment_88_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): I agree with P2P, but you need censorship. Not to get rid of others' opinions, but to get rid of stuff that doesn't belong. If I open a website about cats, I don't want random spammers to come talk about their religion or whatever.\n\nThis doesn't really happen if you have humans (people interferring with your content). Thus strong (but simple like images or very simple logic tests) captchas could garantee that you have humans.\n\nI only believe in local censorship, like  banning locally (on your install) an other person.\n\nIf there is a global censorship option, it must come from the majority, like in Sone or FMS in Freenet. In such system, you can ban locally (on your freenet install) as you like, but for someone to be globally banned, he must have a global review of less than -1 (between -100 and +100). \nTo my knowledge, no one has ever been globally banned in Sone and FMS, and there is no spam.",
				"added": 1479896026
			},
			{
				"comment_id": 34,
				"body": "> [binero](#comment_89_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): It does happen when you have humans. \n\nSo maybe freenet users aren't humans.\n\nMore seriously, there were some reflection about it, and we think it's because the strong captchas system to annouce an identity combined to the fact that there is a (direct) democratic censorship system make users more responsible. That added to the fact that the average internet user don't use freenet.\n\n>It'll be really hard to enforce non-private ownership of digital information though, unless you want to keep track of everything everyone does on the internet, which is a very dangerous thing to do and in direct violation of privacy.\n\nI didn't say enforce. Everybody should be free.  \n\nNevertheless, in freenet, the content is encrypted and dispatched on everyone datastore. So it's anonymous, censorship resistant and nobody owns it.",
				"added": 1479931517
			}
		],
		"1_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": [
			{
				"comment_id": 25,
				"body": "I thought she was a lizard?",
				"added": 1479162041
			}
		],
		"1_1PjRj4wTyghfsvPSS2AVdiRV42JGX2WdFJ": [
			{
				"comment_id": 33,
				"body": "> [poyak](#comment_1_1JDU4gAPb7qTvStSNBaFSNNapg9nAUDHST): Recovered? Any way its an evil thing. Use duck duck go or yacy\n\nI don't believe in duck duck go.\n\nHowever, it would be great if more P2P search engines like yacy were  developed.",
				"added": 1479911207
			}
		],
		"5_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": [
			{
				"comment_id": 35,
				"body": "> [ancap](#comment_89_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz): I see I'm dealing with clueless central planners here.Why stop at that?Why settle for $500 to still let 20% of the victims die or get injured?Why not \"throw\" $5,000 or $50,000,000 worth of equipment on every car and completely eliminate pedestrian hits?\n> \n> Right, so why is the taxpayer forced to subsidize Tesla cars and various other monstrosities? The $400 that the average Joe could spend on this simple add-on ends up as subsidy for the socialist elite that buys Tesla cars.Each Tesla car (assuming average subsidy of $10,000) takes away 25 of these $400 anti-collision devices from the market\n> Don't bother replying - I know you don't get it and can't understand any of this.\n\nTesla with it's \"machines building machines\" philosophy (Musk), is just very sweet for someone like me who wants an other mode of production.\n\nYeah, machines building machines is the ultimate rate of profit killer. Wealth only come from human work. Machines don't create wealth (wikipedia page about the tendency of the rate of profit to fall). Thus Tesla only accelerate capitalism downfall. I'm sure Musk must have perceived it. \n\nThe more Tesla factories like that are created, the sooner we will exit this capitalistic mode of production. \n\nbinero understood this.",
				"added": 1479940501
			}
		]
	},
	"comment_vote": {
		"17_1FEikAyxCNPJcW996B69r5UFg29yfq579m": 1
	}
}