{
	"next_comment_id": 18,
	"user_name": "Kaffie",
	"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
	"post_like": {
		"19APmBDZBVPHNXw2eM5b7vBgzLiKG4U2ck_1492804935": 1492842091,
		"1eQKH8VcGoV17tUEfCHad8pMix9qR8aVu_1493200256": 1493203787
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Border0464fred: is correct. ZeroNet (in terms of technology) is decentralized for searching for peers, and distributed for content. Zites themselves (in terms of management/authority) are centralized with the exception of merger sites, which are federated/decentralized.",
			"post_uri": "1HxiFjyEUfLeqvXza7TqV1h4mpo167JnrL_1492072219",
			"date_added": 1492097183
		},
		{
			"comment_id": 2,
			"body": "I liked this but can't really speak. I use mac >_<",
			"post_uri": "19APmBDZBVPHNXw2eM5b7vBgzLiKG4U2ck_1492804935",
			"date_added": 1492842110
		},
		{
			"comment_id": 3,
			"body": "@Kito: I hate the proprietary side of it, but I love the UI. Kills me. And when I think of switching off I just feel like I'm wasting money.",
			"post_uri": "19APmBDZBVPHNXw2eM5b7vBgzLiKG4U2ck_1492804935",
			"date_added": 1492921937
		},
		{
			"comment_id": 4,
			"body": "@Rythyrix: I've played with Linux a bit. Both in the past and more recently. It's just switching my primary OS that stings a bit haha. I'm too used to the convenience.",
			"post_uri": "19APmBDZBVPHNXw2eM5b7vBgzLiKG4U2ck_1492804935",
			"date_added": 1492933676
		},
		{
			"comment_id": 5,
			"body": "@Rythyrix: When I played around with it, I tried Xubuntu which was nice. Xfce is probably one of the nicer linux UIs I've tried. As for getting into linux long-term, I'd really like to go with arch. It's more my style, but looks like a nightmare to get into.",
			"post_uri": "19APmBDZBVPHNXw2eM5b7vBgzLiKG4U2ck_1492804935",
			"date_added": 1492935493
		},
		{
			"comment_id": 6,
			"body": "@Rythyrix: Ideally I'd like a setup of stuff where I know what's on my machine, understand how everything works, have as little as possible and keep everything super simple, and ultimately have a quick setup and migration time. So if I ever need to hop on a new computer I can setup real quick and go. Arch might not be the best for that though now that I think of it. I played a lot with liveboot usbs for this reason. Just plug into any computer and you've got your workstation. That idea appealed to me a lot",
			"post_uri": "19APmBDZBVPHNXw2eM5b7vBgzLiKG4U2ck_1492804935",
			"date_added": 1492936639
		},
		{
			"comment_id": 7,
			"body": "@Rythyrix: Yeah, it's unfortunate. I feel like I'm still messing around a lot with what things I use/need/etc. and how I go about doing computer stuff. Trying to find an ideal workflow and all that.",
			"post_uri": "19APmBDZBVPHNXw2eM5b7vBgzLiKG4U2ck_1492804935",
			"date_added": 1492947037
		},
		{
			"comment_id": 8,
			"body": "@Rythyrix: Only problem with VMs is that most computers can't handle them real well and the virtual os runs real slow. I've tried it. Though that *is* how I've played with linux.",
			"post_uri": "19APmBDZBVPHNXw2eM5b7vBgzLiKG4U2ck_1492804935",
			"date_added": 1492955836
		},
		{
			"comment_id": 9,
			"body": "[Here you go.](/ZeroTorrent.bit/) That's zerotorrent which is the most popular torrent site on here. You can find streamable movies and TV shows for free over on zeronet's video streaming site [kopykate.](/kopykate.bit) There's also [zerotv (tv shows)](/1BEJbnufyav7TK23ADTs2Qi2UJeKSGDzw6/) and [play (movies)](/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/) if regular torrenting is more your thing.\n\nEdit for hacker/evil shit you're not gonna find that here. Go on Tor sites.",
			"post_uri": "12YRGB3FqA45xAdU5ZE9wfGBeRQXxYPKme_1492808350",
			"date_added": 1493117620
		},
		{
			"comment_id": 10,
			"body": "Enjoying it? More goodies on the way ;)",
			"post_uri": "1eQKH8VcGoV17tUEfCHad8pMix9qR8aVu_1493200256",
			"date_added": 1493203349
		},
		{
			"comment_id": 11,
			"body": "@DElUSiON: Look at me, I should be working on the auto-tagger and updating the index, and all I wanna do is add fun new features.",
			"post_uri": "1eQKH8VcGoV17tUEfCHad8pMix9qR8aVu_1493200256",
			"date_added": 1493204003
		},
		{
			"comment_id": 12,
			"body": "@Kito: There's a good reason for that. ZeroNet is not an anonymization network. You *can* get anonymity if you use tor, but other than that...  You're not really gonna find the stuff you're thinking of here. Perhaps a [hacker forum?](/14Z5ps3D5tpFbd1TUnqF7xjAtBW5yFuJRb) No one here cares about being super edgey.  Pretty much anything you want can be found on the clearnet too (except black markets and CP). What exactly are you looking for? There's not a secret internet or anything.",
			"post_uri": "12YRGB3FqA45xAdU5ZE9wfGBeRQXxYPKme_1492808350",
			"date_added": 1493278029
		},
		{
			"comment_id": 13,
			"body": "The actual scene is much better, tbh.",
			"post_uri": "19KFM4xs3UxrJoveyPf1FUWi3XVhR3zzAp_1493468215",
			"date_added": 1493473190
		},
		{
			"comment_id": 14,
			"body": "@Kito: There is no content that you can get on different web platforms than you can on the clearnet. Except for highly illegal things like CP or drug markets. Given that ZeroNet, like most other P2P software, is *not* an anonymization network, there's no reason for those things to be on here.\n\nAs for why one 'needs' zeronet, that varies. I think most people here are here for one of a few main reasons:\n\n1. Want to take control over their own data. Major organizations are making this less and less so. Decentralized/P2P software like ZeroNet helps fight that.\n\n2. Reduce reliance on major organizations. This one is mostly political/economic. You remove the ability of major organizations to control how you use the web, as you're no longer reliant on them.\n\n3. Avoid censorship. This is what most chinese people are here for. To get around the filters/censorship their government forces on the internet.\n\n4. Simply wanting to help develop new tech, and enjoying the decentralized web.\n\nThe main reasons to be here are *not* content. But do please enlighten me what other alternative web platforms you use explicitly for content you can't get elsewhere. AFAIK all you'd go for is CP and drugs. Since that's the only stuff not on clearnet.",
			"post_uri": "12YRGB3FqA45xAdU5ZE9wfGBeRQXxYPKme_1492808350",
			"date_added": 1493946350
		},
		{
			"comment_id": 15,
			"body": "@Kito: Well right off the bat there's NASA, ICANN, Google, DOD, etc. You can see just the organizations for the root servers [here.](https://www.iana.org/domains/root/servers) You can find quite a bit of info on [wikipedia.](https://en.wikipedia.org/wiki/Internet_governance) And that's just for DNS and governing. For actual maintenance you've got your ISPs, and all the other hidden companies that you don't see that manage things. For just the web itself you need to look at things like host servers, namely stuff like IBM, amazon, etc.\n\nLast I checked, the average person like your or me has *0* influence over these organizations and what they decide to do with the web. Which of us decided to make .google a tld? I certainly didn't. Who says you need to be an official registrar to register domain names? I didn't. Who agrees that a single organization (ICANN) gets to allocate and sell IP addresses? Not fucking me, that's for sure.\n\nAre you comfortable with these companies essentially having 100% control over the internet and web? I personally don't. ZeroNet fixes that for the web side of things. cjdns/hyperboria fixes that for the IP side, and meshnets fix it for the hardware side. Once these systems are in place, you can have a truly free and distributed web uncontrolled by corporate/government goons.\n\nNext time you use a clearnet site, do a bit of research. Install an extension to detect how many services are tracking you. Look at how many ads phone home to different major organziations. Then look at your network traffic. If you used a domain name, look at where it's coming from: your dns, their root server, etc. For your internet, look at your ISP, followed by who they peer with. If you spend money, watch that and see where it goes. It's horrifying.\n\nIf you're just looking for content, you're better off just using the clearnet. It's popular as fuck and has more and better content than any alternative can provide. I can't give you a personal reason to stick around zeronet. Personally, I use it because of these political issues. As well as the fact that I value my control over my own data. I also love the fact that it's distributed/decentralized and is completely resistant to any attackers. This means I'm safe to do as I please without worrying about anyone meddling. I also see it as the future of the internet and web, which is why I support it.",
			"post_uri": "12YRGB3FqA45xAdU5ZE9wfGBeRQXxYPKme_1492808350",
			"date_added": 1494048037
		},
		{
			"comment_id": 16,
			"body": "[Lots of bitcoin brainwallet sites.](/kaffiene.bit/?q=wallet&i=Kaffiene%20-%20Full) Nothing called 'zerowallet' from what I've seen though.",
			"post_uri": "19yRyR57LxFjbzieSEhvyvhe4heSo7KrLa_1494026821",
			"date_added": 1494077037
		},
		{
			"comment_id": 17,
			"body": "I've yet to see an ethereum app that I'd actually use day-to-day. Whereas ZeroNet I use basically daily. It has a long way to go to win me over.",
			"post_uri": "15vJjtekghtind7a1xjLBFN96PSXDx9mso_1494559241",
			"date_added": 1494582494
		}
	]
}