{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Plenty of errors around",
			"body": "There seem  to be high amount of errors recently, which may or may not be related to my tor connection. Getting error on zeroboard, error on zeroid, and most of them \"unknown\" errors, with no visible explanation. Anyone experiencing similar?",
			"added": 1490544526
		}
	],
	"topic_vote": {
		"1_1HFgQAVFpWppF6iAg6p6bNwZr34yHGYnCW": 1,
		"1_1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ": 1
	},
	"next_comment_id": 37,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "> [hrc](#comment_1_1Gv5ZyDen9vqkAuHQHiiziAr9VHnC4gu85): Hello! I'm new. Could someone help me to test my new blog if it could be accessed? Thank you very much in advance!  http://127.0.0.1:43110/18G3oy6wg3esqkDKQhkPQGtRcL94PuK5Z9\n\nits too big to pull by default (13MB>10MB)",
				"added": 1490315589
			},
			{
				"comment_id": 2,
				"body": "> [eratas](#comment_1_18tHMpnEEZgu1rA9cmCyqsQABeqphsDbKH): lala\n\nlala what? :-)",
				"added": 1490317413
			},
			{
				"comment_id": 3,
				"body": "@yani @sunnywong you succeeded",
				"added": 1490368235
			},
			{
				"comment_id": 4,
				"body": "> [dun](#comment_2_14nCEDo97Cx4VpSHwPytWvacPo29Y7FAbk): Why is this stickied? And who is able to sticky posts?\n\nLet me guess: the admin of the service (ZeroTalk) decides who, what, how, when, why.",
				"added": 1490534927
			},
			{
				"comment_id": 8,
				"body": "-",
				"added": 1490544384
			},
			{
				"comment_id": 13,
				"body": "> [iusezeronet](#comment_1_19TU94ahnbj9u57SLqpV6ot1vvzWfFYeE4): Does this work? When I/you see it then it works!\n\nit doesn't and you'll never know. ;-)",
				"added": 1491748974
			},
			{
				"comment_id": 14,
				"body": "@iusezeronet: Life's never been fair. Deal with it. \nBut, on the bright side, we have messages like the one of @ekethis, a true gem of the results of the human evolution. No other species can do brain farts.",
				"added": 1491809333
			},
			{
				"comment_id": 17,
				"body": "> [goozerin](#comment_1_1DVd64Knf2A3xTvbDwFLdbTUJGLYDuqmFy): blubblub\n\nAs in?",
				"added": 1492440129
			},
			{
				"comment_id": 18,
				"body": "> [robxau](#comment_1_1QDPtMZr73ZewwEfjFJAh9vJG9r3Ztxvn2): just checking that this works after creating an ID. Also : ELVES!\n\nindeed it does.",
				"added": 1492553096
			},
			{
				"comment_id": 21,
				"body": "> [robxau](#comment_2_1QDPtMZr73ZewwEfjFJAh9vJG9r3Ztxvn2): hey, can anyone see this page? Am trying to check if visitors can access it, after getting some previous stuff about port 15441. If it doesn't work will have to get access to my router and try opening the port. [...]\n\nhappy now? ;)",
				"added": 1492554269
			},
			{
				"comment_id": 25,
				"body": "> [robxau](#comment_3_1QDPtMZr73ZewwEfjFJAh9vJG9r3Ztxvn2): \"Content published to 1/1 peers.\" Yep, thanks! No messing around with router needed. :) Cheers again!\n\nWhat basically happened is that you coerced me to lend my disk space and bandwidth to host your website. :-) Since most people are either too lazy or ignorant to go and delete a site they're not interested in you only need a few person to click on your site for whatever reason, and it's replicated, until the victims log off the virtual world. Like put one porn image on it and later you can remove the image and put up real content; the site will keep replicating.\n\n#socialEngineering ;)",
				"added": 1492612327
			},
			{
				"comment_id": 27,
				"body": "> [alexmmog](#comment_1_15v6Xgc739BkCHTXb1Y89AX16XT65cabb1): test from nowhere\n\nworks",
				"added": 1492789706
			},
			{
				"comment_id": 28,
				"body": "> [ombresaco](#comment_1_1NJHSvMA4Vqh57WJvhoU3qfpkwKWht2cpg): sdfasdfg\n\nMaybe. I am not sure.",
				"added": 1492789720
			},
			{
				"comment_id": 31,
				"body": "> [malokate](#comment_1_1JQho5KY4psCVQ5yPVEVTSr35fgdToY519): Meowwww\n\nwoof woof aroof woof LeChuck?",
				"added": 1492960728
			},
			{
				"comment_id": 35,
				"body": "> [greentea](#comment_2_1HrLZ8r5MufWDSNS1EbL17GW4QNeeCcbqM): Yes, of course this is. Hello.\n\n[source?]",
				"added": 1493153907
			},
			{
				"comment_id": 36,
				"body": "> [greentea](#comment_4_1HrLZ8r5MufWDSNS1EbL17GW4QNeeCcbqM): Thanks akito\n\nBy the way there is multiuser plugin/addon, which simply show you your key and enable you to enter any.",
				"added": 1493153942
			}
		],
		"1_16UbJDyboDaAjW5fiZouKWpPJztpt43kEj": [
			{
				"comment_id": 5,
				"body": "> [kai0](#comment_69_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): 零网使用方法http://127.0.0.1:43110/14qzPjqXiZV5PokSbX1EnkKZtpUASNxnfZ/\n\nDo I look like someone who talks in such hieroglyphs? :-P \nWhy do you chinese people spam your gibberish everywhere? We cannot read it. Most of us don't even want to. What's the purpose, apart from providing minor annoyance? (Or you need peers to cache your stuff? Why not tell it in English?)",
				"added": 1490535233
			},
			{
				"comment_id": 6,
				"body": "> [kai0](#comment_72_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): be nice!\n\nWhy?",
				"added": 1490536891
			},
			{
				"comment_id": 7,
				"body": "> [kai0](#comment_73_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): you can block any one you don't like at here\n\nNot obvious how.",
				"added": 1490537653
			}
		],
		"1_1QEfmMwKVxgR4rkREbdJYjgUmF3Zy8pwHt": [
			{
				"comment_id": 9,
				"body": "ZeroBoard: \"Message submit failed! undefined\"\nZeroId: \"unknown error\"",
				"added": 1490544580
			},
			{
				"comment_id": 10,
				"body": "> [kai0](#comment_74_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): even zeroboard ？\n\nYep, gives \"Message submit failed! undefined\" even for the default msg.",
				"added": 1490545241
			},
			{
				"comment_id": 11,
				"body": "Oh. Got it. Tries to open a connection outside zeronet to demo.zeronet.io, which has been blocked.",
				"added": 1490545418
			}
		],
		"8_16UbJDyboDaAjW5fiZouKWpPJztpt43kEj": [
			{
				"comment_id": 12,
				"body": "It definitely worked, after visiting through the proxy the zite seems to update the content on the proxy in real time...\n\nOther way is to lure others to proxy it, like this softporn site did: http://127.0.0.1:43110/1N5MKpGyUS1L6EQiahUZQKjer6bWiRibGs/?Post:4:New+blog+post",
				"added": 1490969529
			}
		],
		"1_14YkpjZoU1Q897PhRG4CWyg6CL6Rn4QEVf": [
			{
				"comment_id": 15,
				"body": "@kaffie: wow, your message actually makes sense. I haven't seen such a weird thing on zeronet for AGES. I'm shocked.",
				"added": 1491809494
			}
		],
		"2_1165u6pt5mQNFjyhMVwy6azB7bZuQGLA9b": [
			{
				"comment_id": 16,
				"body": "most of them probably from israel, originally. funny, but probably most of them have some israelitan dna inside. :-P",
				"added": 1491855751
			}
		],
		"1_19Z8aJ32x4pE2iGvVssPJazJgpGe5L32rq": [
			{
				"comment_id": 19,
				"body": "> [huntrnr](#comment_3_15M9YVK8YpC5kqBWz6J27rhpWDRXwmFUAV): Foreigners don't understand freedom of speech\n\nwell technically they don't understand the speech, freedom's or else's",
				"added": 1492553344
			},
			{
				"comment_id": 20,
				"body": "> [alaric](#comment_23_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY): I fully support your freedom of speech! Welcome to the discussion.  [...]\n\nYou are wielding the weapon of intelligence against an unarmed man. Cruel.",
				"added": 1492553425
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 22,
				"body": ">> What happens if two people use the same keys to modify a site?\n> Every content.json file is timestamped, the clients always accepts the newest one.\n\nYeah, and is there a compulsory time sync? What about fake clocks? Clock in the far future?",
				"added": 1492554711
			},
			{
				"comment_id": 23,
				"body": "> [nofish](#comment_912_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Clients only accept content.json timestamped local time + 1 day in the future. So in worst case you will be locked out for 1 day.\n\nSounds good, so I only have to write a script to timestamp T+23h any site I want to do a DoS?\n\nOr generally speaking… I've seen the external security audit of [gocryptfs](https://defuse.ca/audits/gocryptfs.htm) which touched the general problem of _\"We believe the reason these vulnerabilities exist is because gocryptfs doesn't have a clearly spelled-out threat model.\"_  Have anyone looked around the threat model of ZN and have examined the possibilities related?",
				"added": 1492611606
			},
			{
				"comment_id": 24,
				"body": "Replying to myself: this reminds me to mention [vector clock](https://en.wikipedia.org/wiki/Vector_clock) algorithm as the ordering in a completely distributed system.\n\n(And what I was looking for was Google's TrueTime, but that's a completely different topic, really interesting nonetheless.)",
				"added": 1492612021
			},
			{
				"comment_id": 26,
				"body": "> [nofish](#comment_913_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): If you have the private key for the site's address  then yes, you can block updates. (but in that case the site is already fucked up, since you can delete it)The user files are time stamped separately, so you can't cause any problem by that.\n\n(I shall read through the whole architecture one day.) So on any user-input-processing site, like this one, I cannot send out updates which would block others from updating? Only myself? Not the database content or any dynamic files containing our user inputs?",
				"added": 1492612984
			}
		],
		"2_1Gi1gKhUwd3SBAKYyGTyWvN1L6QHtf56SL": [
			{
				"comment_id": 29,
				"body": "You have some serious display of inferiority complex, boy. You'll never be a jew, you're some worthless poo. You fight for recognition in a world of smart able jews and a lot of moronic, stupid, ignorant, clueless goys. Give up, you're shit, you are not jew, and nobody cares about your whining. All the intelligent people are jews, you know. You're not jew, go figure.\nBut by no means should this stop you from whining, kids need it to release their frustration. Tell us more!",
				"added": 1492884129
			}
		],
		"1_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L": [
			{
				"comment_id": 30,
				"body": "What about the USA?",
				"added": 1492884196
			}
		],
		"1_17jhcV7ACnYLDiBSdw6KqL3d9WVjDtcjf1": [
			{
				"comment_id": 32,
				"body": "Are you possibly aware that zerone is not quite anonymous? ;-)\nBut I guess you're already on drugs anyway. :-)",
				"added": 1492960867
			},
			{
				"comment_id": 33,
				"body": "> [delusion](#comment_8_1eQKH8VcGoV17tUEfCHad8pMix9qR8aVu): Nice try, FBI. 0/10 for effort.\n\nFBI possibly couldn't care less about russian drugs. And the government there is possibly heavily support it: drugged citizens will do ANYTHING to get the dose, even vote for ex-KGB powermongers.",
				"added": 1492960980
			},
			{
				"comment_id": 34,
				"body": "> [mi6agent](#comment_22_14YdhMiNAG8LDichYEQvyZZboGL8bSeZEu): No major world government is supported by selling illegal drugs. Get back to your conspiracy forums.\n\nSidenote: \"illegal\" is what is declared illegal in the law. \n\n(But there are reliable sources of drug-related governmental transactions all over the world. It's quite big money, and rather easy when you control the antidrug agencies. I do not mean \"the government\", as it is, but various people in specific, high positions. In some countries pretty high amounts of those people. But unless it's proven that's surely a theory, similar to the huge amounts of deaths of the opposition of the Russian government. Shooting, poisoning, deadly accidents, just within a decade. Seen a summary recently and it's scary. Don't trust me: ask the russians here around.)",
				"added": 1493029565
			}
		]
	},
	"comment_vote": {
		"1_1JMgbdWHNHzkhZMA2z1MjDVxHg769K7zf2": 1,
		"1_1g2hUTEe1UMksKSaN3aQeJjm7VrJa11nA": 1,
		"52_18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y": 1,
		"172_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": 1,
		"5_14nCEDo97Cx4VpSHwPytWvacPo29Y7FAbk": 1,
		"85_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6": 1,
		"8_1QEfmMwKVxgR4rkREbdJYjgUmF3Zy8pwHt": 1,
		"74_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": 1,
		"275_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"126_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6": 1,
		"6_1Bte1EMmKsRq3aCPtKQNh3NLuhuXL8VVv": 1,
		"23_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"912_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"3_1QDPtMZr73ZewwEfjFJAh9vJG9r3Ztxvn2": 1,
		"914_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_1KGozab6jp6jA6zVM8cTFdzMmBasriNP4f": 1,
		"276_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1_13VQ3f93wEFAjF3AHVheCU7dVURxseZbEE": 1,
		"329_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"4_1NTgaYjK2bh1axvruth8HqtGt6Pw5ab13x": 1
	}
}