{
	"next_comment_id": 7,
	"comment": [
		{
			"comment_id": 1,
			"body": "Will this be live streamed? I don't live within driving distance of California.",
			"post_id": 84,
			"date_added": 1464586928
		},
		{
			"comment_id": 2,
			"body": "> [jayofthezero](#comment_1_16nArdxrSaNThNp83kL8E6NLL9WD98iUne): Will this be live streamed? I don't live within driving distance of California.\n\nDid some digging for myself, and yes, the event will be live streamed, though not sure if this specifically will be.",
			"post_id": 84,
			"date_added": 1464644044
		},
		{
			"comment_id": 3,
			"body": "At this rate you'll need a vacation from your vacation.",
			"post_id": 88,
			"date_added": 1468874432
		},
		{
			"comment_id": 4,
			"body": "Decentralization, especially at the infrastructure level could be hugely beneficial. Running servers can get prohibitively expensive, especially if something you made jumps in popularity suddenly(which happens a lot when something goes viral), and bandwidth is expensive. If your site dies just because 10,000 people visited it out of nowhere and you were running it on the crummy server in your backroom on your home ISP, it can create damage in more ways than one. You could miss an opportunity because of that. How many times has some Youtuber or Twitch streamer mentioned a cool site only for their wave of viewers to crash that site seconds later. You've now lost that free publicity, and some people could even get mad at you for wasting their time.\n\nBut with decentralization you can make a site or service on whatever you happen to have laying around, and then if it suddenly becomes popular, the load isn't all on you, but is spread out across all of your visitors so widely that they'd never really notice the load. I can make a quick project and just post it on Zeronet, no fees beyond my normal internet access and electricity. If I want a domain, I drop some change on Namecoin and I can get a .bit easily. Bandwidth isn't an issue. If somebody can't access my server because of a bad or clogged inter-connect, they can get what they need from another peer. It's just so much more robust, and it can't be turned off just because some big wig in his high castle gets angry.\n\nPS: How long would we have to wait to see your talk online? Or would it be better to just see it in a Cinema?",
			"post_id": 107,
			"date_added": 1489110580
		},
		{
			"comment_id": 5,
			"body": "> [nofish](#comment_189_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Thanks for the ideas. \n> \n> It's up for the TED organizers. They only publishes 10-20 videos every week (chosen not only from TED, but also from third-party TEDx conferences)Unfortunately around 50% of the talks never reaches the Internet, so it has to be really good.\n\nUgh, I'd be willing to pay for the Cinema event($20 mind you) if I could get a guarantee of you being shown. But the descriptions for the three showings give no specifics on speakers besides \"surprise guest\" Serena Williams for the second one. I hate it when they do vague stuff like that.",
			"post_id": 107,
			"date_added": 1489111815
		},
		{
			"comment_id": 6,
			"body": "> [hexkey](#comment_1_18NsJqjikBYBjwLzMVp7aBJSpqtyRSd9qF): I have a lot I can say about this, but here is the one thing I can think of right now:\n> Putting a balance of power in only one place can cause single points of failure anywhere, not just in networks. \n> One non-network example is advertising. If a show of some kind (TV, webshow, etc) has several big sponsors and one removes themself from the show, the show looses a huge amount of money. A more decentralized version is a system where viewers donate instead--there's less of a chance that lots of them will stop donating all at once. Spreading power among the users turns a monarchy-like system into a more democratic one.\n> There are probably other metaphors like this that might be useful, I'll put any others I think of here.\n\nSort of like Patreon.",
			"post_id": 107,
			"date_added": 1489146053
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"84": 1,
		"95": 1,
		"96": 1,
		"98": 1,
		"100": 1,
		"102": 1,
		"107": 1,
		"108": 1
	}
}