{
	"next_comment_id": 2,
	"comment": [
		{
			"comment_id": 1,
			"body": "Let's share some ideas about why decentralization is so important:\n\n    Why decentralization important to you?\n\nIt is important because we don't need big eyes watching us, and also because decentralization in this case help us use a different internet from the one that ISPs sell. Decentralization lets anyone with enough sources speed up process and live the whole experience from within the self. I think this is one important thing of decentralization, the experience of a different internet that is created from ourselves rather than from corporations.\n\n    What's bad with the current internet?\n\nI don't if it might be helpful to talk in depth about the local cases, but in South America there's poor infrastructure (rather US dependent than south american) that is managed by military for their plans. This makes a less enjoyable internet here, where we don't have only copyright blockings (remember TPB blocking case in Argentina) but also censorships based on what we say and where people lost their jobs \"because of what they tweet\" or post at facebook. In this sense the current (centralized) internet is just for the benefit of who already owned all that gigantic modelling\n\n    Why are you using ZeroNet?\n\nI wanted to build up my website and after running out of likeable stuff I decided to find out if there was something like peer-to-peer internet connection. And I found ZeroNet! I'm using it because peer-to-peer is less tiring than registering a NIC domain and all of that bureocratic stuff. It is also less tiring because I just can focus on programming my website and that's all I need for presentation! \n\n    Or just what do you think, what should I talk about?\n\nWhat you're asking is good! You can talk about what improves after decentralizing the internet!\n\nI hope you've found useful answers! ",
			"post_id": 107,
			"date_added": 1489336134
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}