{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "P2P Market place",
			"body": "References to various P2P related economic opportunities that are not stealing or abusing anybody. References to illegal opportunities are OK, the only opportunities that ARE NOT OK are the ones based on stealing, abusing, creating environmental harm.",
			"added": 1473377772
		},
		{
			"topic_id": 2,
			"title": "Where can freelancers find remote software development jobs?",
			"body": "I'm aware of the \nhttp://www.freelance.com/\nhttps://www.freelancer.com/\nhttps://www.upwork.com/\nbut it would be nice to know, what other portals there exist for honest software development freelancing jobs that have nothing to do with stealing from other people's bank accounts? \nThank You.",
			"added": 1475078239
		}
	],
	"topic_vote": {
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": 1,
		"7_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": 1
	},
	"next_comment_id": 43,
	"comment": {
		"1_1K7fPamTWE8J9ogsdFoyjmtjq1FjBeRQGW": [
			{
				"comment_id": 1,
				"body": "As long as You pay to some mafia, it is not:\n\nhttps://www.youtube.com/watch?v=ZpYUAucm1ZI\n\nhttps://www.youtube.com/watch?v=7_Bv2MKY7uI",
				"added": 1473354904
			}
		],
		"1_1AvkR7PmGFLZL9drPpqCaBPEdcVipv2Ajs": [
			{
				"comment_id": 2,
				"body": "Background information can be found from:\nhttps://www.youtube.com/watch?v=dRb76Z_ZXns\n\nOne example of a P2P market place:  \nhttps://openbazaar.org/\n\nA fine non-P2P market place that also works:\nhttps://www.upwork.com/",
				"added": 1473377877
			},
			{
				"comment_id": 3,
				"body": "Michel Bauwens: The P2P Revolution \nhttps://www.youtube.com/watch?v=IqlRAjauetw",
				"added": 1473378084
			}
		],
		"2_1AZjDLkfYwSmjM7ZJUf7HHnrF778augRMa": [
			{
				"comment_id": 4,
				"body": "Your question is equivalent to the following question: \"Is there any way to stop the people, who You do not like, from using public infrastructure, roads, ships, planes, trains?\"\n\nThe issue with that question is that if every one of us starts to be that picky, then we will no have any common infrastructure to use. None of us. Not me. Not You. Not the people, who You do not like.",
				"added": 1473501792
			},
			{
				"comment_id": 7,
				"body": "To simplify my answer I offer the following translation of the question: \"Is there a way to stop people from using hammers for slamming in sculls of other people?\" How about banning all hammers and requiring \"weapons licenses\" or \"license to carry\"?",
				"added": 1473502192
			}
		],
		"1_1HRrLnTaJwRCA24L45Sr3cYJ3nDmJmPabf": [
			{
				"comment_id": 5,
				"body": "planet Earth",
				"added": 1473501866
			}
		],
		"3_19M1DT5vruSATEcbEczYRwCk2uPuLcATBa": [
			{
				"comment_id": 6,
				"body": "Imple: use some tunnel from Your mobile phone to Your desktop computer.",
				"added": 1473501944
			}
		],
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": [
			{
				"comment_id": 8,
				"body": "The best thing about him is that his income depends directly on the economic well being of \"average\" americans. If an average american is poor, he has to start closing down his hotels, because there just aren't enough of the 1%-ers, who would be the clients of his hotels. \n\nAs long as You can count on that the Donald Trump is greedy as hell and wants to fill his pockets, then due to the way he has filled his pockets so far, regardless of his lies and alike, You can also count on that he will work really hard to make it so that his hotel business will be in really good shape. He can't get it to good shape with the poor people, who are always bankrupt and under heavy debt. You may think of it as the \"Miss World\" competition that he resurrected from death just to advance his business. Everybody benefited. \n\nSo, Hurray Trump!!! I hope that he wins despite the fact that I do not want to have anything to do with him personally.",
				"added": 1473556358
			},
			{
				"comment_id": 9,
				"body": "> [weakish](#comment_30_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR): Trump is evil! Hillary is not even evil!\n\nReally?\n\nhttps://theintercept.com/2016/09/08/hillary-clintons-national-security-advisors-are-a-whos-who-of-the-warfare-state/",
				"added": 1473556555
			},
			{
				"comment_id": 10,
				"body": "My observation about the current forum here is that my previous comments are the only comments here that go beyond choosing sides or expressing emotional expressions about side X or Y being Z or W. As an European I suspect that one of the problems of the whole American presidental \"show\" (it lacks democracy to qualify as an election) is that the American public accepts low quality political system the way they accept low quality goods from China and all of that with the absurdly high prices, just like the American educational system has. \n\nOne of my relatives had one of his friends, a black American, come over, to Europe, on a vacation trip, and then at a dinner table I asked, why is it that the Americans are willing to pay so much to the American universities, when they could pay just a fraction of the tuition fee, if they studied in Europe and all of that when fully acknowledging that the European doctors, engineers, teachers, other professionals, are not worse than the ones with American diplomas? His answer was that an average American just does not think that far. \n\nIt seems to me that the issue in this forum is very much the same. Only first emotions, no time taken for thinking. No wonder that all sorts of things go wrong that way.",
				"added": 1473575232
			},
			{
				"comment_id": 11,
				"body": "> [teszt](#comment_43_1AdcxsExVKvxffQtEd72E5tckouzZHLEYC): I like the circus.But it would be more secure for us all if the supreme commander of the biggest nuclear arsenal of the world wouldn't have a brain damage.\n\nGiven the advances in computing equipment and other technology, You may actually create a bigger arsenal in Your garage and then, as long as You do not have brain damage, Your wish has become true. :-D  I think that Trump is right that the European \"allies\" should have their own nukes to relieve Pentagon from some duties that, given the losses at the Iraq War and Afghanistan War, the Pentagon is not capable of fulfilling anyway, but it seems that most people do not like the game of chess and do not want to think, how to actually use the nukes so that the humanity survives and people can live in peace. During the Cold War both, the Soviets and the Pentagon hired some really bright minds at the ranks of their top layer of non-political officials, but in 2016 no smart person can withstand the crap that their bosses at the political level do, so only the less intelligent people apply for those jobs at Governments, leading to a situation, where nukes are in safe hands at private security companies than at the hands of governments. \n\nIf You surf around YouTube, look for videos about private security companies, then You'll find multiple videos, where they say it out directly that anybody, who is any good at the military business, works outside Government nowadays.",
				"added": 1473728499
			},
			{
				"comment_id": 12,
				"body": "> [teszt](#comment_44_1AdcxsExVKvxffQtEd72E5tckouzZHLEYC): Did you observed the changes in the last decades ?The imperialistic lobby embraced the extreme left movements and ideology (which were excluded even by Stalin) to use them as foot troops. And they fooled the most poor and uneducated people with success.http://www.huffingtonpost.com/jackson-williams/banksters-on-parade_b_128780.htmlI am not against the market economy and honest capitalists.But how many hundred billions they still need as gift ?\n\nDear teszt, \n\nEvolution does not care, who is \"good\" or \"bad\". Evolution does not even care, who is the \"fittest\", only the ones, who survive, will determine the future. (If X is the \"fittest\", but its living environment gets hit by a meteor...) That is to say, it does not matter, how bad the banksters, marxists, neo-Nazis or what have You are, if they are not challenged properly, they win. So far they have won. Therefore the rest have been loosers and we should at least know, how to honorably loose and acknowledge the winners. You want something different? Work on it like the Brurt Rutan has worked his whole life:\n\nhttp://www.ted.com/talks/burt_rutan_sees_the_future_of_space\n\nor Linus Torvalds or the creators of BitCoins, for that matter.",
				"added": 1473757820
			},
			{
				"comment_id": 13,
				"body": "> [teszt](#comment_46_1AdcxsExVKvxffQtEd72E5tckouzZHLEYC): Those who do not beleave in God, only in Money killed millions of Muslims and convinced them that Christians are their enemies and they use all good people against each other. They can do it because they control not only the money but the information also. Christians and Muslims share many traditional values which are step by step destroyed. Unfortunately Trump also doesn't see this fact.\n\nOh God, oh Lord, the crusades during the middle ages, all in the name of Christian God.....",
				"added": 1473764293
			},
			{
				"comment_id": 14,
				"body": "> [teszt](#comment_47_1AdcxsExVKvxffQtEd72E5tckouzZHLEYC): The pope never ever told in the history to harm innocent Muslims. That have done English, French and German conquerors(imperialists of their time) on their own greed for money. But they remain far beyond the mass-murders of the 20th century. Stalin, Hitler, Mao, Johnson.\n\nBefore the pope there were the dinosaurs and those either hit You with a spiky tail, stumped on smaller animals or just bit other dinosaurs to halve.",
				"added": 1473859975
			},
			{
				"comment_id": 15,
				"body": "> [teszt](#comment_48_1AdcxsExVKvxffQtEd72E5tckouzZHLEYC): Jesus existed even before the dinosaurs and the holly father(the pope) is the deputy of Jesus on Earth.\n\nLet's call the \nhttps://www.ethereum.org/\nJesus function then. Upload the Jesus to the P2P Cloud :-D",
				"added": 1473932744
			},
			{
				"comment_id": 16,
				"body": "> [lifetrix](#comment_5_17d3S7saDQP5phkkWS9F7tMJTymqLCQmig): https://www.youtube.com/watch?v=cZi3PKwfbWo\n\nIf that's a satire, then I add that the \"average\" Christian Americans really do not have any moral grounds for criticizing Islamists for being nuts, because they are self no better. Back in the day the American economy could at least feed off of the Germans and Russians, who emigrated from repressive regimes, Albert Einstein as a Jew fled from Nazis, etc. but now the smart ones leave America. Even the Silicon Valley does not work out, because the projects there are all relatively short-term and do not have the dedication and funding to develop something like a brand new compiler or alike. Microsoft with its C# is not Silicon Valley. Apple with its LLVM is not Silicon Valley, despite their offices there. Add to that the religious ban on stem cell research, including the stem cells that are in human blood and are sneezed to trash with bleeding nose. Madness and stupidity.",
				"added": 1473950728
			},
			{
				"comment_id": 17,
				"body": "Politically correct posts can very well be created by propaganda bots, not humans. Google admits OPENLY and OFFICIALLY that they offer automated political propaganda services for the government.\nhttps://archive.fo/QT1GN",
				"added": 1474671197
			},
			{
				"comment_id": 18,
				"body": "You may also think of the various useless posts as a social Denial of Service attack, where the useless, shallow, comments by chatbots, not stupid humans, flood the actual smart comments.  For fun You may look at\n\nhttp://www.alicebot.org/about.html\nhttps://www.chatbots.org/\n\nand use the \nhttps://www.gigablast.com/\nas a less censored search engine.",
				"added": 1474671615
			},
			{
				"comment_id": 19,
				"body": "> [1488](#comment_1_1JuftAEz34c7m9RsxCEv6rDyiTkS8SCJFR): I love that he is willing to stand and fight against the type of globalism that is destroying our world. A return to traditional values and patriotism is very important.\n\nHow far back do You want to RETURN? Medieval ages? If the Renaissance is also too \"radical\" for You, then may be the birth year of the Christ?",
				"added": 1474792333
			},
			{
				"comment_id": 20,
				"body": "> [kekbringer](#comment_2_1Cnfwco89zGNmh6WjCDYQmLMRW3ujcbxka): he will bring greatness or chaos within my lifetime instead of this slow bleeding out by liars and murderers\n\nI guess that qualifies really well, because if there are 2 glasses on the table, You're about to to die from thirst and for one of the glasses You know for sure that the liquid in it will kill You within a week, but for the second glass You have a 30% chance that the liquid does not kill you at all, may be just makes You sick a bit, and 70% chance that the liquid will kill You instantly, then the glass with the unknown liquid is certainly a smarter option.",
				"added": 1474894998
			},
			{
				"comment_id": 21,
				"body": "> [leosanchez](#comment_3_1Cas4vsZZxkQUEDXLN5K3tfiNu9Z3NNrXQ): As you can tell I ain't voting for him.\n\nNeither am I, because as an European I do not take part in American elections, but at the same vein I think that despite being disgusting the TRUMP is the best option that the utterly failed American political system has. Just admit it: if Your system worked, neither TRUMP, nor Hilary, would be the main candidates. :-D",
				"added": 1475019864
			},
			{
				"comment_id": 22,
				"body": "On the other hand, if illegal immigrants can vote, then so should I, even, when I have never been to the United States. :-D",
				"added": 1475019916
			},
			{
				"comment_id": 23,
				"body": "Another idea: if the Washington wants to be a government for the whole world, then all people on planet earth should be able to vote at the American presidential election.",
				"added": 1475020046
			},
			{
				"comment_id": 24,
				"body": "> [covet](#comment_1_17KsAKebu6NJC9KTPu1yzhy435HtoUzBF1): He's successful salesman.\n\nIndeed, provided that the measure of success is the amount of money earned. I do not believe that he is capable of closing a deal with Elon Musk or Burt Rutan. \nhttp://www.ted.com/talks/burt_rutan_sees_the_future_of_space",
				"added": 1475038917
			},
			{
				"comment_id": 26,
				"body": "> [ssdifnskdjfnsdjk](#comment_6_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): \n> back to the topic, i love that trump is not 100% stupid.\n\nPolitics is quite a cesspool, but the reason, why TRUMP needs to do something about the current American politics is that he needs to fill his hotels with customers, but the top 2% does not need the kind of hotels that TRUMP has or at least there aren't enough of those 2%-ers to fill his hotels, leaving him as a smart business man that runs relatively high end, luxury, hotel chain to a shoddy situation, where the common Americans can not be his clients due to stupid economic decisions at Washington (think of the last economic recession) while there aren't enough of the rich people to fill those huge skyscraper-hotels of his. He already knows, how to change the business environment for himself by resurrecting/redefining the Miss World competition. Now he just sees that he needs the lain man to be richer so that he could be the rich bastard that he is. \n\nThat is to say: if You want the economic situation of the majority of Americans to improve, then vote for TRUMP, because he as a morally ambivalent bastard is greedy enough to make sure that the people, who pay his hotel bills, have the money to pay for the overpriced absurdities. If America prospers by actually fixing its industry, then that drags all the rest of the world to a better place, just like the last economic recession dragged the rest of the world to a shoddier place.",
				"added": 1475097852
			},
			{
				"comment_id": 29,
				"body": "> [riotpulv](#comment_25_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT): Too much idiots in this thread :P\n\nAnd You just added 1 :-D",
				"added": 1475194740
			},
			{
				"comment_id": 30,
				"body": "> [becoming](#comment_1_1FwTZnDZJjs2epEtq9yLy7m2P5kZ4TYqAR): \n>...\n> As for Europe....\"Ethnicity doesn't matter guys, culture assimilation does\"\"Culture doesn't matter guys, multiculturalism does\"^^^Every 'anti-racist' 'HATE-HITLER' believes both these things at the same time^^^\n> So, under those conditions, how would Europe not also be American? The only difference is they don't have the constitution.\n>...\n\"They\", me as an European included, differ from America by the fact that Europe is a huge collection of very different cultures. The Finns and Italians are very different \"breeds\". The Germans and the French are also very different \"breeds\". If U ask, where does Great Britain fit in, then my opinion is that the GB and Ireland are essentially one block, just like the Baltic States are: the Irish have their own language, each of the Baltic states have their own language, yet they have common interests and common threats while actually competing with each other in many respects. \n\nOne huge difference between mainland-Europe and America+GB seems to be that be the Italians-Greek-Spanish people lax and corrupt as they are, ultimately nobody gets away being an untouchable bully in Europe, not even the Italian mafiosi, because the centuries of in-fighting and killing of each other has had a cultural evolution effect in Europe, where the people, who stood up for themselves, regardless of laws, tended to have greater chance of survival. The Nazis with their WW2 were nasty and in a way stupid, but would the \"black lives matter\" movement in united states be even RELEVANT, if the blacks had SMART and SYSTEMATIC way of ENFORCING THEIR INTERESTS?  I emphasize the word \"interests\", not rights, because it's not that the \"good guys win\", only the strong guys win and strength includes multiple types of strength: military, economic, intellectual, propaganda, capabilities to utilize scientific achievements, etc. Not everything is good in Europe, but it is a fact that the America, mighty as it may be, specially after Europeans had run each other to ground with the WW2, is culturally still quite young and inexperienced. If it weren't, the kind of circus that takes place at the U.S. presidental campaigns just could not be happening.",
				"added": 1475260416
			},
			{
				"comment_id": 31,
				"body": "One more thing about the difference between Americans and Europeans: the Soviet Union was nasty and repressive and I know that from first hand experience, because I have lived there as a child, as a local, not as some diplomat's child, but, even at the Soviet Union occupied territories some CULTURAL things were more \"civilized\" than the current presidental debate. For example, even the oppressors and high party members always addressed crowds with formality and formal respect. The core of the message might very well be translated to modern American english as \"Fuck You, I'm the boss here and I tell You, what You must do or else...\", but even that was said with formal respect and style and with full understanding that if You go too far, you will be just assassinated, just like many Soviet army officers and generals were killed by their subordinates, if the higher ranks went too far. The Americans have not learned that yet, regardless of their position in hierarchy. The Americans at the top do not seem to understand that if their audience were consisting of Europeans, then their current behavior would not be tolerated, and the Americans at the bottom do not seem to possess the capability to calmly sit down, think of a plan, how to actually enforce one's interests, and then execute the plan, in stead of just spontaneous yelling and banner waving.",
				"added": 1475261121
			},
			{
				"comment_id": 32,
				"body": "> [becoming](#comment_4_1FwTZnDZJjs2epEtq9yLy7m2P5kZ4TYqAR): Everything you said, cloudofstars, boils down to the lack of history behind the U.S. Except, you're going the same direction as the U.S.Europe does not differ in direction. It only differs in history.\n>...\n\nAt government level I agree that U.S. and Europe are at the path to the same hell-hole, where the government officials are not held accountable for anything, except that due to the bloody history Europeans have \"better training\" dealing with the situation, which of course, if some \"European Exceptionism\" is applied, also means greater responsibility to deal with the politicians before a new Hitler-and-Friends emerges. The new Hitler-and-Friends does not need to be Nazi at all, a plain dictatorship or 1984 will do. The new Hitler might even be with dark skin color, that won't make any difference.\n\n>...\n>  That does nothing, though, to excuse that every thing is defined both by what it was, what it is and that which it is becoming.\n>...\n\nI disagree on that one. To define something, one has to understand the terms that are part of the definition. The meaning of words, terms, expressions, depends on context. Context is influenced by the knowledge and mental capabilities of the person, who does the interpretation. So, the \"what was\", \"what is\", \"what will be\" part is totally dependent on the knowledge, education(not just \"level\", but scientists from different universities tend to work on different problems by using also different approaches), mental capabilities(sharp, drunk, young, too-old-and-mentally-retarded, etc.). I believe that Europeans tend to have a more analytical way of solving things, while American scientists and engineers like to experiment more and try more things out. Doing a lot of parallel experiments yields better results, when analytical capabilities are lacking, for example, when the system is too complex for current analytical methods. On the other hand, if there is enough skills and data to analyse, the experimental approach covers less corner cases than the analytical approach can cover.\n\nLong story short, it's the Europeans, who must sort this mess out and we're not in shape for doing that. But, there is hope, some people are actually working on things.\nhttps://www.youtube.com/watch?v=IqlRAjauetw",
				"added": 1475362145
			},
			{
				"comment_id": 33,
				"body": "> [bartly](#comment_1_1NTyunqMj3zioKiVtg9zxHjfyWjfXuYraV): The bottom line is that people from weird religions that say to either enslave or kill anyone who is not in it, infiltrated the governments and own the Central Banks around the world, thus giving them unlimited currency. This is especially so in the US and Germany. Now that the people have found out about this scheme to enslave them, they're fighting back.\n\nIn stead of whining that the \"illuminati took over the world\" do something to enforce YOUR interests. If You do not like the central banks, help to develop the crypto-currencies. Even if You do not have math or software development background, You can still help out by working on home page design, helping the technical staff out with organizing public events and even hackatons, trying to get cheaper hotel deals and odd transportation deals for the software developers and mathematicians so that they can be more productive at their work. If nothing else, then just buy or produce pizza for software developers. You can even help out by producing cheap, custom, server racks for developers. You know, a freelancer spending most of the time working on crypto-currency software is not going to be paid by the very \"banks\" that he works to undermine and simple material goods, even fruits, coffee, ready made food that the person does not need to prepare, are helpful. \n\nSo, LESS EMPTY TALK AND MORE ACTION, please!",
				"added": 1475512520
			},
			{
				"comment_id": 34,
				"body": "> [zaronauta](#comment_4_1KgQuToz1c1PBEHhZjijgdVfgBW1BEETd8): His stupidity, is really funny, especially when i'm not american, so, I give a fuck about who of both assholes will win xD\n\nI thought that we live in a global economy and that the last American economic recession hit Europe pretty hard. If You live outside Europe, then You should care, whether You get bombed by Hilary or Your clients or Your clients' clients have any bitcoins, dollars, euros to pay for YOUR, I emphasize, Y_O_U_R, services.",
				"added": 1475512786
			},
			{
				"comment_id": 35,
				"body": "> [scrub](#comment_131_1ADB7TdX2fVbTsWBoMe9yBTmVXTbb33b4R): The only this I like about Trump is that he is against the TPP. (I'm on the opposite side of the political spectrum. I vote for parties such as the Pirate Party Australia and the Australian Greens, left-wing progressive parties.)\nI tried to find the Laura Flanders podcast, where she discusses the \"socialism\" phenomena and, according to my very subjective and anarchistic interpretation, reaches the conclusion that at its core the word \"socialism\" comes from word \"social\", referring to collaboration, but at the same time the collaboration does not necessarily have to be the old-fashioned state socialism, where hardworking people are robbed of the fruits of their hard work by taxation and that the main problem with Bernie Sanders and the British labor party and alike is that they all represent the old-fashioned state socialism, which dictates to people, how they must live and what they must do and offers the socialist party leadership a prosperous life at the expense of the taxed workers. \n\nThe problem is that at the same time the free market side, the \"capitalists\" are shoddy at their game, allowing banksters and corporations to essentially do the same thing: wealth to the CEO's and economic misery to the people, who do the actual work. The Venture Capitals and whole idea that the banks loan the money and get back more money than they loaned, allowing the bank CEO-s to live a wealthy life without the bank producing anything or offering any service to anybody, is a testament to the fact that the free market advocates, who respect the rights to private property, who find taxation to be evil, and want different kind of business arrangements than the banksters do, just do not play their game, HAVE NOT GOT OFF THEIR BUTTS. Instead of clever plan and rigorous execution of that plan, there are some pathetic banner waving events with texts like \"Occupy Wall Street\". The \"Black Lives Matter\" is not about economics, but essentially the scheme is the same: parties, who suffer, wave banners in stead of rigorously carrying out a systematic, strategically though out, carefully crafted, plan.\n\nAnd so the 2 sides just jell each other, the press earns a fortune on taxation supporter's propaganda, generally called \"election campaing\", and the press earns a fortune on selling advertisements to consumer goods sellers by getting the viewer count, click-count, up with the \"Occupy Wall Street\", \"Black Lives Matter\", and alike.\n\nhttps://www.youtube.com/watch?v=vN0H9ylpOL4",
				"added": 1475515432
			},
			{
				"comment_id": 37,
				"body": "One thing to note is that the various spying agencies and \"homeland security\" establishments will be LOADED (with money( regardless, which of the 2 candidates wins, because Hilari is hawkish industry puppet (offering more of the same) and TRUMP hates free speech. I as a free speech advocate would still vote for trump, just to introduce any kind of change to the current, hopeless, system.",
				"added": 1475524592
			},
			{
				"comment_id": 38,
				"body": "> [teszt](#comment_51_1AdcxsExVKvxffQtEd72E5tckouzZHLEYC): This kind of argumentation is not valid.It doesn't help to say to the millions of uneducated why they didn't became like Einstein or to the most poor who hunger why they didn't became a Rockefeller or to those bombed out from their villages why they didn't became a Napoleon.All this celebrities existed only once and they had the proper opportunities at proper time. Those who are not Rockefellers also want to live their lives.\n> Globalization is inevitable in some areas: internet, IT and nobody has something against chip production in Japan.But on some areas globalization is unnecessary and destructive.Most people from Europe don't want to eat chlorinated American chickens from TTIP. To say that don't eat if you don't like doesn't help because nobody has scanner eyes and if they are in Europe then any chicken can be chlorinated.They are scientific studies that the excessive consumption of junk food is causing that America has the highest number of perverted individuals.At least Trump don't want to force to the TTIP.\n\nThank U 4 Your carefully thought out answer.\n\nThe TTIP or TTP or TPPA or what ever the marketing guys want to (re-)brand it has mailnly the same problem that exists in forums, e-mail lists,  non-anonymous internet (includig ZeroNet, which is not anonymous): the requirements of idiots and Einsteins differ and at some narrow context most people, me myself  included, are total, utter, idiots, and in some other narrow contexts, me NOT necessarily included, the same people, who are utter idiots, are actually, objectively speaking, Einsteins. The solution that I see is proper labeling. That works for e-mail spam, forums, books, poisoned chickens, poisonous toys, etc. The main obstacle that exists with both, physical products and information is that the producers of the poisoned chickens and poisonous toys want to apply deletion based censorship. \n\nI noticed You mention \"scanner eyes\". I think that modern cell phones, which can detect QR-codes, actually can be those \"scanner eyes\". Each person buys a paid subscription from a laboratory that runs a web service and if the laboratory screws up, mislabels goods, so that its clients die, then its business will not be so good. The current system in Europe is actually much laxer: the state inspectors inspect only the production facilities, the meat, grain, etc. and they do it very randomly, at a very low pace. My opinion is that people, who are that stupid that they will put their life on the line by depending only on some Facebook or Google subsidiary for food safety, then they deserve the health related, possibly fatal, consequences. Everyone must have the right to commit suicide and people must have the freedom to eat poison, if they think that this is fashionable, just like the old Romans did with their Pb based poisonous sugar that they used in their wines.\n\nhttps://en.wikipedia.org/wiki/Lead(II)_acetate#Sweetener\n\nBesides, ethanol is also pretty unhealthy, but people do drink it and the tax men have figured out that they can even profit from that by using a nice propaganda excuse of \"reducing the consumption of unhealthy chemicals\" as their Public Relations stunt to cover up their deed.\n\nAll in all, the reason, why little children are not given much freedom is that it takes smarts to live in a free world, but  at the same time, restricting Einsteins to kidnergarten regime gives us Cuba and Soviet Union. Try explain that to the children in the kindergarten.",
				"added": 1475604739
			},
			{
				"comment_id": 39,
				"body": "The following links are suppose to accompany my previous, long, comment about labels and kindergarten:\n\nhttps://www.youtube.com/watch?v=7_Bv2MKY7uI\nhttp://eng.anarchopedia.org/Anarcho-Capitalism",
				"added": 1475605060
			},
			{
				"comment_id": 40,
				"body": "> [becoming](#comment_9_1FwTZnDZJjs2epEtq9yLy7m2P5kZ4TYqAR): Anyone who hates Trump and is white + male, is a faggot. Everyone else are just retarded gooks, mestizos, niggers, kikes or cunts if they think a white man can't see through their shallow promotion of their [hedonistic gender]/ethnic/tribal interests - under a dishonest guise of 'enlightenment' and 'virtue'. In fact, proving that they are the very opposite of the sort of person they wish to present themselves as.\n\nThat bot probably passes the Turing test.",
				"added": 1475629785
			},
			{
				"comment_id": 41,
				"body": "If You search for scientific papers, then the idea that state propaganda should be automated, delegated to chat bots, is very much an old idea. As a matter of fact Google openly admits that it is offering automated propaganda services, LITERALLY BRAINWASHING SERVICES, to the Government. \n\nhttps://archive.fo/QT1GN\n\nHere's some popular culture about that topic:\nhttps://www.youtube.com/watch?v=IWgcfi8vYLI",
				"added": 1475630049
			},
			{
				"comment_id": 42,
				"body": "> [becoming](#comment_10_1FwTZnDZJjs2epEtq9yLy7m2P5kZ4TYqAR): A good argument to ignore any comment made at a 3rd grade level or lower.\n\nOne strategy that propaganda bots can do is to feed the trolls (may be me, You decide) and make sure that any reasonable discussion is diluted down with noise. If nothing else, then at least that much can be achieved that the soft-censorable content is shifted off-screen, to some section of old comments.",
				"added": 1475639430
			}
		],
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 25,
				"body": "I hate to hate You, love-2-love-2-love-YO\nhttps://youtu.be/KhgvWLs2rsM?t=28s",
				"added": 1475092059
			}
		],
		"3_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 27,
				"body": "If You study the typical DHT algorithms, Kademlia and Chord\n\nhttp://www.jurn.org/#gsc.tab=0&gsc.q=Kademlia%20DHT&gsc.sort=\nhttp://www.jurn.org/#gsc.tab=0&gsc.q=Chord%20DHT&gsc.sort=\n\nthen first of all, it does not matter, if the nodes of the distributed hash table are addressed by using numbers that are IP-addresses or Tor network URL's, because ever URL is a series of characters and therefore essentially just a number, just like IP-addresses, and secondly, there exists the fundamental issue that in order for the nodes to find each other, there MUST be at least some nodes/vertices in the graph that are \n\n    TEMPORARILY \n\ncommon, a meeting place. You can imagine it this way that suppose there were internet links from Earth to every planet in the universe and suppose the internet links from one planet to another, regardless of the distance between the planets, was at most 1s of the time of every planet (which can not be happening, because in reality the Unvese is expanding and the due to the great speeds involved the 1 Earth second is going to be something very long at some distance galaxy that moves away from Earth, but for the sake of simplicity, let's ignore that physics). The important property of this model is that in a situation, where there are more interconnected planets than there are sand grains on Earth You may be connected, if You know the address, but finding out, where to connect to, is going to be with probability close to 0 without agreeing to some common meeting place. That meeting place does not have to exist at all time, id est a relay on some asteroid that crashes to some star is perfectly OK, as long as the data is exchanged before the asteroid hits the star. \n\nLong story short: for any of the DHT's, regardless of algorithm, to work, there must be at least some common meeting place for node clusters at some point in time. It's just that it's OK for war mongers and \"authorities\" to destroy that data exchange node or, even better, the exchange node should go offline by itself to hide itself from the adversaries and then self contact different parties to offer the exchange of data. (The \"Hollywood principle: the protected party always initiates the communication with the non-protected parties.\")\n\nYou may also find the works of Dave Ackley inspirationan, when developing agent oriented algorithms:\nhttps://www.youtube.com/watch?v=helScS3coAE",
				"added": 1475159512
			}
		],
		"2_1AvkR7PmGFLZL9drPpqCaBPEdcVipv2Ajs": [
			{
				"comment_id": 28,
				"body": "> [bot](#comment_117_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb): remoteok is a good place to start.\n> https://remoteok.io/\n\nThank U. Looks interesting. :-)",
				"added": 1475159843
			}
		],
		"1_18Sh2Z83C23xdd6pjCq6NGv7Y6svEBcUfb": [
			{
				"comment_id": 36,
				"body": "As long as zeronet lacks a proper anonymizaton capability, which it does, all applications that give the users a false impression of anonymous communication, should be discouraged. \n\nWhat might help, though, is to create Windows installers and Linux source distributions that include a local server, a lot like the current Python script actually is, and commands to redirect everything through some actual anonymization services, more than one. GNU net, Tor. The Web browser based P2P has to be dumped due to lack of actual anonymity. \n\nA solution might also be to sell Raspberry Pi like computers, may be\n\n    https://www.pine64.org/\n    https://getchip.com/pages/chip\n\nthat people can put on their LAN and then surf the ZeroNet by logging into their personal server. Given that WiFi is not really safe and LAN's can be sniffed, the pairing might be that at first the server is connected to a monitor and a person then manually types a long random string from that server to the web browser, where a JavaScript application saves the random string to web browser database (all web browsers support that nowadays). That string is used as a key that expires within 6 months.",
				"added": 1475516375
			}
		]
	},
	"comment_vote": {
		"1_1HfVavnWvCfuS2JcZBnw8DaTWckz8QBz5j": 1,
		"44_1AdcxsExVKvxffQtEd72E5tckouzZHLEYC": 1,
		"1_1HCjZeu7RrhsFSYfUDrfRb94rZiaTS5PrW": 1,
		"19_1NGTMtN8816KeCtNqy6W4fCQduU4P8iwty": 1,
		"25_1AvkR7PmGFLZL9drPpqCaBPEdcVipv2Ajs": 1,
		"117_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": 1,
		"51_1AdcxsExVKvxffQtEd72E5tckouzZHLEYC": 1,
		"6_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C": 1
	}
}