{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": 1,
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_1KLTeqiNMx1QNWTqBzJsjTQp112dDZPeqZ": 1,
		"1_1At4zensbxPGhXYbe5bnx9eGuE4V1vnbc8": 1,
		"1_1NU6gdra9qhUhdbYGLia1G3HYT87qUTA7w": 1,
		"1_1DqaWUpq6dRXfuXCokpjYoAkDj2nzZDnAn": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": [
			{
				"comment_id": 1,
				"body": "Fecal phantasies are very frequent by Jews.\n\nFecal freak Spielberg’s other Oscar-winning Holohoax propaganda film Schindler’s List features a scene in which young kids hideout from the “evil Nazis” inside of a toilet—neck deep in urine and feces.\n\nOne Jewish author, Joseph E. Tenenbaum, actually wrote about Jews having sex while inside of a dung-filled toilet. Imagine for a second crawling inside of a toilet, and then having sex with someone. These people are disgusting beyond belief.\n\nA bizarre offshoot of psychology led by possible Jew Lloyd deMause called Psychohistory takes the childhood toilet trauma a step further and asserts that both the so-called Holocaust and WWII were natural outcomes of incredibly sadistic behavior practiced on infants by the average German mother.",
				"added": 1488018642
			}
		],
		"1_1KLTeqiNMx1QNWTqBzJsjTQp112dDZPeqZ": [
			{
				"comment_id": 2,
				"body": "https://www.amnesty.org/en/latest/news/2009/04/tropas-israelies-revelan-abusos-gaza-20090401/\n\nThe Jewish science of psychoanalysis is also loaded with fecal-minded personalities. The coke-sniffing Jew who invented it, Sigmund Freud, was himself borderline obsessed with bathroom behavior and described the second stage of his thoroughly disturbing “psychosexual development” theory as the “anal stage,” in which, around the age of two, pleasurable sensations become centered on the anus, and children become fascinated by their own feces. This is the stage of life where “anal personalities” could develop, he claimed.",
				"added": 1488019068
			}
		]
	},
	"comment_vote": {}
}