{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Where is Julian Assange?",
			"body": "all things Wikileaks and Assange",
			"added": 1477685463
		},
		{
			"topic_id": 2,
			"title": "Will Hillary bow out before the election?",
			"body": "the state of Hillary's campaign",
			"added": 1477765863
		},
		{
			"topic_id": 3,
			"title": "Thank you, Julian Assange",
			"body": "Thank you, Julian Assange. Your great sacrifice for truth is duly noted and appreciated.... a grateful nation may not be able to say it out loud. But we understand. \n\nNov. 8, 2016",
			"added": 1478703126
		}
	],
	"topic_vote": {},
	"next_comment_id": 15,
	"comment": {
		"1_1Cxt2k3farSSee7HTkJKJ7eCTKxfFGNXe6": [
			{
				"comment_id": 1,
				"body": "Is he still in the Embassy of Ecuador? If not, where is he, and how did he get out?\n\nHas Wikileaks been compromised?",
				"added": 1477685510
			},
			{
				"comment_id": 2,
				"body": "I'd like to have somebody present \"proof of life\" -- meet him and take a selfie with him,\nor something.",
				"added": 1477746836
			},
			{
				"comment_id": 9,
				"body": "Notice put out today:\n\nhttp://redstatewatcher.com/article.asp?id=46959\n\nBreaking! Assange Just Emerged From Hiding To Deliver The Biggest November Surprise To Hillary\n\n*Please share this and spread the word\n\nOn Thursday, we discovered that Julian Assange had emerged from hiding and alllowed John Pilger from Dartmouth Films to record him in an interview. The video will be aired this Saturday November 5th on RT but we've found a teaser trailer.\"",
				"added": 1478232514
			},
			{
				"comment_id": 14,
				"body": "So where is Assange? He really hasn't been heard from since mid-October. \n\nCopied from another source:\n\n \"Apr 16th: John Jones QC, Assange's U.N. Lawyer dies jumping in front of a train. - May 11th: Michael Ratner, WikiLeaks' chief counsel, dies of cancer. - Jul 10th: Seth Rich, DNC staffer who supposedly leaked DNC documents to Wikileaks, is shot in the back and dies. Nothing is stolen from his body. \n\n- Aug 5th: Edward Snowden (source of leaks on surveillance by the NSA) tweets 64 bit code (potential dead man's switch),  - \n\nAug 10th: Wikileaks offers $20k reward for information on murder of Seth Rich. - \n\nOct 16th/17th: John Kerry visits the UK, personally pressures Equador to stop Assange from publishing documents about Clinton. - Oct 16th: Wikileaks tweets SHA-256 prerelease keys. - \n\nOct 18th: Equadorian Embassy cuts off Assange's internet access. - Oct 18th: Pamela Anderson visits Assange and feeds him a vegan sandwich. - Oct 18th: Witnesses photograph and report heavily armed police and vans outside Equadorian Embassy, are barred from approaching and have cellphones confiscated. Live feeds are cut off. - Oct 18th: Fox News reports Assange will be arrested in a matter of hours. -\n\n Oct 18th: https://file.wikileaks.org/file made publicly visible, file dates/timestamps changed to 1984 (Orwell reference). - Oct 18th: London Airport evacuated due to \"chemical attack\", potentially used as cover to fly Assange out of country. - Oct 20th: /sub/wikileaks, /sub/dncleaks, /sub/wikileakstaskforce and /sub/nsaleaks add 21 new moderators and remove previous mods, all threads about Assange going missing deleted since. - Oct 20th/21st: Wikileaks tweets 5 tweets with misspelled words. The incorrect letters spell \"HELP HIM\". The Wikileaks twitter has never made a spelling error, let alone 5 in two days. -\n\n Oct 21st: Massive DDoS attack on US internet. Wikileaks tweets to imply the attack originates from its supporters, asking them to stop, no evidence supports claim. - Oct 22nd: Gavin MacFadyen (mentor to Assange and key player in Wikileaks) dies of lung cancer. - Oct 23rd: Wikileaks Tweets poll asking how best to prove Assange is alive (he still hasn't appeared on video or at the window since). - Oct 24th: Wikileaks Tweets video of Assange and Michael Moore recorded in June. - \n\nOct 26th: 4chan users successfully successfully decode their first message in Wikileak's blockchain. Threads are instantly flooded by shills saying that it's not worth looking into. The blockchain is blocked with fees and 43000 unconfirmed transactions appear in the mempool. - Nov 6th: Huge DDoS takes down Wikileaks for first time in years. - Nov 7th: Various entities notice hundreds of Podesta and DNC emails are missing from recent leaks, accessed with direct entry. - Nov 12th: Assange meets with Swedish prosecutor regarding rape allegations, lawyers barred from attending, meeting conducted via an Equadorian ambassador (not face to face) - Nov 14th: Wikileaks releases insurance files, SHA-256 hashes do not matches, those tweeted in October.\"\n\nAnd so on. Even the alleged interview with Assange may have been  \"contrived\". \n\nWhy has Assange's internet not been restored, since the US election is over?\n\nAnd why isn't Assange much more visible and issuing statements?\n\nThis all may be nothing. Or it may be indicative of something.",
				"added": 1479358141
			}
		],
		"2_1Cxt2k3farSSee7HTkJKJ7eCTKxfFGNXe6": [
			{
				"comment_id": 3,
				"body": "Given her deteriorating health (clear even from the latest photos), and the expanding scandals\n(from Wikileaks and the latest Weiner revelations), what happens in a presidential candidate \nbows out before the election?",
				"added": 1477765940
			},
			{
				"comment_id": 4,
				"body": "It appears now there may be a lower-level revolt at the FBI: \n\nagents refused to destroy some laptops containing evidence which were supposed to be destroyed as part of a plea-deal; and so that evidence still remains (and could likely be used legally if the plea-deal isn't kept)\n\nthe DOJ (Lynch) has tried to keep the latest emails away from the FBI\n\nand Comey is now \"re-opening\" the investigation\n\nAll is not well in the Hoover building, it seems...",
				"added": 1477833991
			},
			{
				"comment_id": 5,
				"body": "Moreover, the Huma-Weiner emails were kept on their computers in a file labeled, \"Life insurance\". \n\nDid they consider who they were dealing with when they named it that?",
				"added": 1477834035
			},
			{
				"comment_id": 6,
				"body": "Speculation: is Huma a spy? It would fit the profile of spies --get close to a principal and then become\ntheir shadow. Is that what is about to break, forcing Comey to disobey Lynch and re-open the investigation?\n\nAll speculation: but are the thieves starting to fall out among themselves?",
				"added": 1477834114
			},
			{
				"comment_id": 8,
				"body": "650,000 emails? \nDoes it seem like every email sent by the State Dept. (and/or other government departments?) ended up\non Huma Abedin's server -- or rather, her husband's, where they would not be subject to legal discovery in an investigation directed at her?\n(Had Weiner not been investigated for pedophilia, would those emails ever have come to light?)\nWho in the world stores 650,000 emails? (Who writes 650,000 emails?)\nDoes this possibly suggest that someone was acting as a spy and posting US govt. emails where they could be hacked?\nAnd who can investigate this mess? The FBI? (You're joking, right?) Congress? (You're joking, right?)\nThe media? (You're joking, right?)\nIs there any way Hillary's candidacy can overcome this?",
				"added": 1477866947
			}
		],
		"1_1L14vSk76tujfNoqrcRuFk2tBBZgUPy92t": [
			{
				"comment_id": 7,
				"body": "\"I am Assange, do not fret.\"\n\nWe all need to be Assange.",
				"added": 1477846735
			}
		],
		"3_1MdwjTFbwpWCLfyo2ZjeXzB7DbL7euNPBi": [
			{
				"comment_id": 10,
				"body": "I hope this is true; but heaven help the revolutionaries if it fails...",
				"added": 1478315943
			}
		],
		"3_1Cxt2k3farSSee7HTkJKJ7eCTKxfFGNXe6": [
			{
				"comment_id": 11,
				"body": "Let's support a pardon for Assange; whatever errors he may have made, they are more than made up for, imho, by his contributions to a more open, less cloaked society and government.",
				"added": 1478712532
			},
			{
				"comment_id": 13,
				"body": "Assange's internet has still not been turned on again, even though the US election is over.\n\nWhy is Ecuador still denying him direct internet contact with the outside world?",
				"added": 1478830041
			}
		],
		"9_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": [
			{
				"comment_id": 12,
				"body": "Can't be too bad a place; Adolf retired there after his career in Europe went bust. ( I suppose that submarine could have taken him anyplace, and he chose Argentina.) But how's the internet? I could live on a barren Andes mountaintop if they gave me a laptop with high speed internet.",
				"added": 1478753065
			}
		]
	},
	"comment_vote": {}
}