{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 1,
				"body": "> [nutomic](#comment_17_1FEikAyxCNPJcW996B69r5UFg29yfq579m): Seems like you forgot about christians here. Instead, why don't we kick out the capitalist leaders and switch to a better system? One that's focused on the people, and not on the profits of the rich.\n\nWho do you mean by we?\n\nChristians that aren't brainwashed with meh universal equality or judeo primacy bullshit are mostly fine. Moslems and Jews are not because they want to kill or enslave us all any way they can.\n\nWho do you think the capitalist leaders are?\n\nThe same people own or control all the important business, institutions, media, and politicians, as well as all the money.\n\nWhat better system are you referring to?\n\nCapitalism is just the tails side of the shekel and communism is heads. Exchanging one for the other won't get us anywhere.\n\nIs there a third alternative to communism and captialism?\n\nMaybe you're under the illusion that THE PEOPLE know what's best for themselves?  Unfortunately they absolutely do not. Never have. I wish it wasn't true but it is. Accordingly the weak cannot be permitted to influence state policy directly because they will be exploited and manipulated at every turn by those seeking to gain power for their own ends at the expense of the common good. Only a strong leader with a vested interest in the welfare of his people can make the right decision when faced with a decision that requires a strong character to make.",
				"added": 1474682539
			},
			{
				"comment_id": 2,
				"body": "> [kukuneneh](#comment_1_12XqJsGMG5dUrxjGtGKrjwg4DFKfXtEkg3): Meh. People and emotions. Just hail the machines man. This is 2016 coming to 2017. Not the 1942\n\n>it's the current year!",
				"added": 1474682729
			},
			{
				"comment_id": 3,
				"body": "> [kopykate](#comment_18_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4): Kick all muslims and jews out of all countries? So which country would you deport them to?\n\nThey can go in a boat that we torpedo for all I care... their well being is their problem not ours. That said if they have to go to a country then Jews to Palestine er I mean Israel and the Moslems can go back to whatever desert rock they crawled out from under.",
				"added": 1474744450
			},
			{
				"comment_id": 4,
				"body": "> [phr34kz](#comment_17_1NGTMtN8816KeCtNqy6W4fCQduU4P8iwty): No dawg.. It's freaking humans. Go dig on American debts with Israel and debts all around the world. Name one country that hasn't been fcked by Americans. Ya'll been a puppet since day one lmao. Best way to solve this shit is to eliminate all humans on the planet. In general, humans love to poop wherever they go. Why you ask? Because everyone has their own views and believe over matters. Be it for profit or not. Science thought us the evolution of man and with the age technology, humans became more dumb and evolving back to fucking monkeys instead of how to coexist.\n\nMeh why can't we all just get along? Because we are meant to fight it out. Universal equality is a lie meant to lull suckers into letting their guard down -- which we have done.\n\nI totally agree that Weimerica is Israel's puppet and has been for some time, although it got a lot worse after the good guys lost WWII.",
				"added": 1474753018
			}
		]
	},
	"comment_vote": {
		"1_18K6YQFvGRTHXih412VUQyDd4LxZWKGM3W": 1,
		"6_17bo4yV2YQ8qERFytHMogwancQzQmzzaDM": 1,
		"1_1GVmhdQ9seQD5Mv6uzX7t8ZXVJPRHQfAHQ": 1,
		"2_1CEnKfVALihFLwjwwb9qbA6JojRKFjGAZM": 1
	}
}