{
	"next_comment_id": 5,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [nofish](#comment_196_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): I'm just arrived back to Hungary without any problems :)The rehearsal went well, but they want it more focused on censorship with real-life examples. Please let me know if you know any.\n\nGreat to have you back nofish. \n\nWhat comes to my mind are blockages of social media during the Arab Spring and in Turkey. China and the Great Firewall - I mean where else are Chinese users able to mingle with other nations on the web? Facebook's hidden algorithm that decides what you are served. All that won't happen with an open source ZeroNet - it is by the people for the people. Blockages of VPN providers and TOR won't matter on a ZeroNet page with many seeders. \n\nNot to forget the vision of a web that is truly able to remember forever - as long as there are seeders. No government can ever take down a site.",
			"post_id": 107,
			"date_added": 1490724872
		},
		{
			"comment_id": 2,
			"body": "> [nofish](#comment_197_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Thanks for the suggestion I need to look for a specific, well documented (news sites links) case.\n> \n> The conference will be at end of April, this was only an internal rehearsal.\n\nA specific case where ZeroNet was used to circumvent censorship or a case of censorship where ZeroNet could have been the solution? I think the former is difficult as it is not so well known as TOR (yet).",
			"post_id": 107,
			"date_added": 1490731478
		},
		{
			"comment_id": 3,
			"body": "> [nofish](#comment_198_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): \"Could have been\" is enough, currently using these examples:\n> \n> For \"censorship by DDOS\": https://www.theregister.co.uk/2016/09/26/brian_krebs_site_ddos_was_powered_by_hacked_internet_of_things_botnet/\n> For \"censorship by company\": https://www.theguardian.com/books/2016/jul/14/dennis-cooper-google-censorship-dc-blog\n\nAs ZeroNet records very little information about its users, the privacy protection and anonymity are higher compared to sites like blogger, wordpress, twitter, facebook.\n\n* political bloggers: \n\nhttps://en.wikipedia.org/wiki/Hossein_Derakhshan\nhttps://lorelle.wordpress.com/2012/10/04/banned-blocked-and-censored-bloggers/\n\n* relatively harmless comments on social media can land you in jail in some countries: \n\nhttp://www.bbc.co.uk/news/technology-20427139\nhttp://www.arabnews.com/saudi-arabia/news/713876\nhttp://www.bbc.co.uk/news/technology-31692914\nhttps://news.vice.com/article/young-people-in-thailand-are-going-to-jail-for-facebook-comments\n\nBut when I think of Zeronet I also think of more energy efficient web hosting, opposed to the huge serverfarms that are eating as much electricity as entire towns.\n\nPlus the idea that ZeroNet is the equivalent of public spaces in real life - Facebook wants to make people believe it can fulfil that function but it cannot, as you have to pay with your privacy and it actively censors. If I visit a public space like e.g. a park, I can meet anyone I want - rich or poor, black or white, old or young. There is no doorkeeper who would deny entry - it is owned by everyone: the public.\n\n",
			"post_id": 107,
			"date_added": 1490734131
		},
		{
			"comment_id": 4,
			"body": "> [endredeak](#comment_1_1FCT2YuWqfXEiucoemquB41TCyyLNNk9Dv): I'm really curious about the whole technology. One question: these kind of tools like tor, bitcoin, torrent, etc. are mostly criticized because of it's easy usability for criminals (drugs, terrorists, etc). What is your opinion about that and is there any way to preserve these kind of usage?\n\nThat is a good question which should be addressed: can a technology be blamed when people misuse it? I agree that if a technology is primarily used for damaging activities, e.g. a gun - some oversight is justified. The digital equivalent of a gun is a virus/malware. However, ZeroNet and other software should rather be compared to a car or a hammer. Terrorists use cars, but we don't ban cars, nor do we oblige the car manufacturers to monitor their driver's behaviour. \n\nAlso, morality and laws develop over time and this can only happen in \"grey zones\". If in the last century governments would have had the ability to track down and jail every gay person, wouldn't that have prevented the LGBT community from organising and promoting change in the West? Same goes for the legality of marijuana. \n\nWithout \"grey zones\" a society would actually stagnate and become dull.",
			"post_id": 107,
			"date_added": 1490807708
		}
	],
	"comment_vote": {},
	"post_vote": {
		"107": 1
	}
}