{
	"next_comment_id": 3,
	"comment": [
		{
			"comment_id": 1,
			"body": "Hi Tamas,\nThe distributed web is above all about Democracy. There are many watered down versions of democracy and also models of governance calling themselves democratic which are nothing of the sort. Your Platform, IPFS and Swarm and others I have not heard of, I am sure.,are at the Elite end of Computing. Within the proprietary software model even distributed systems would leave existing Elite hierarchies in control manipulating and rationing information and access to the fruits of what we call Society or civilisation.\nRichard Stallman the founder of GNU describes what free software is.\n´´Free software means the users have the freedom to run, copy, distribute, study, change and improve the software.\nFree software is a matter of liberty, not price. To understand the concept, you should think of “free” as in “free speech”, not as in “free beer”.\nMore precisely, free software means users of a program have the four essential freedoms:\nThe freedom to run the program as you wish, for any purpose (freedom 0).\nThe freedom to study how the program works, and adapt it to your needs (freedom 1). Access to the source code is a precondition for this.\nThe freedom to redistribute copies so you can help your neighbor (freedom 2).\nThe freedom to improve the program, and release your improvements to the public, so that the whole community benefits (freedom 3). Access to the source code is a precondition for this.\nDevelopments in technology and network use have made these freedoms even more important now than they were in 1983.\nNowadays the free software movement goes far beyond developing the GNU system. See the Free Software Foundation’s web site for more about what we do, and a list of ways you can help.\nhttps://www.gnu.org/\nIf we are free it is easier to see the scams or to challenge the validity of restrictions placed upon us by those who assume authority. This project and other distributed computing can make freedom meaningful in our, Media our Politics and our money these 3 are the interfaces through which we conduct our social and business relations.\nEthereum, The prescient augur of exchange.\n\nCLICK TO GO TO ETHEREUM HOME PAGE Ethereum, The prescient augur of exchange. Bitcoin has opened the eyes of the world …\nletthemconfectsweeterlies.blogspot.se\t\nBitcoin 'creator': 'I want to be left alone', Crypto Currencies vis Blockchain , Money Unit of…\n\nYou heard about Crypto Currencies, See Large bitcoin-infographic Thats really cool, can they do anything else? Dr Craig…\nletthemconfectsweeterlies.blogspot.se\t\nOn Tulip Manias and Fragility in our Nascent Democracy.\nfor ethereum to have utility as a means of exchange what is needed is stability, money has several functions Store of Value means of exchange and unit of account being the most well known. The idea of Bitcoin and ethereum being in competition is unhealthy for both. Both currencies are complementary and their chief predator and enemy is FIAT money or Central Banks and issuers of FIAT money credit. Ether and Bitcoin are vanishingly insignificant in the context of the Trillion dollars Global FIAT derivatives market. Money is by definition debt in the current system and both Ether and Bitcoin are pegged to FIAT currencies and hence debt. The size of the FIAT debt market dwarves Bitcoin and Ether and they are both highly vulnerable to market manipulation, as such they are merely tolerated. As long as they are seen speculatively there is a potential problem but, if Cryptocurrency generally is seen as a complementary alternative system that is symbiotically connected and mutually supporting outside of a FIAT money framework then real value and enduring value will be created and become \nun-manipulated by the structured/rigged and Coercive FIAT debt ´´Markets```\nHere are two blogs I did on Ether and Bitcoin over a year ago. Both Ether and Bitcoin are and have been in Bubble territory, diversification and balanced portfolios rule in what is a highly volatile and As I say very very small and therefore highly manipulated market place. Remember, Money and Value is make believe so have lots and lots of dreams, not just one.\nJUST MY 5 CENTS.\nhttps://letthemconfectsweeterlies.blogspot.se/2017/03/on-tulip-manias-and-fragility-in-our.html?spref=tw\nhttp://127.0.0.1:43110/1G3LKaUe9CtiQmxGe8fDPYC26u3DFYcvBd/?Post:2:The+Distributed+Web\n\nA non echo chamber balanced search engine is what the web needs most of all.",
			"post_id": 107,
			"date_added": 1490431029
		},
		{
			"comment_id": 2,
			"body": "Hi jca 3g2 link timed out 404? but installing yacy i´ll let you know how I get on with it. thanks for the heads up",
			"post_id": 107,
			"date_added": 1490457132
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}