{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": 1,
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": 1,
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": 1,
		"2_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_1AQwGx5xyBi5Fvv9WHJFMCMNtQhUc8UhQF": 1,
		"1_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": 1,
		"2_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": [
			{
				"comment_id": 1,
				"body": "The male child must be big enough to provide enough blood for all Jewish participants but must be before the puberty to be innocent. \n\nPurim Sacrifice Body of Andrei Yustschinsky(with ideal age of 12 years) found in the Kiev area in 1911.\nThe forensic medical autopsy found 47 piercing and cutting (336) wounds; the wounds on the head, left temple (1) and neck had produced the fatal exsanguination; the loss of blood had been so considerable that the body was close to being empty of blood.\nThe physicians rendering their expert opinions, the University professor, lecturer for forensic Medicine, Obolonski and the prosecutor at the same professorship, Tufanov, reached the following conclusions:\nAll of the wounds found on the body of Yustschinsky were produced while he was alive.\nBy the circumstance that all wounds were cold-bloodily produced by a sure and calm hand, by a hand which was accustomed to the slaughtering of animals, Professor Sikorski saw in the technique of this murder an indication that the possibility of such an exact, emotionless and unhurried work was secured for the murderers in corresponding manner, and he came to the conclusion that the slaying of Yustschinsky represented an act which was carefully prepared and which was carried out according to plan under cautious supervision!\nThe boy Yustschinsky was slaughtered by Jews, in order to tap off his blood and to use this blood for ritual purposes, in accordance with an allegedly Jewish religious law. \nTherefore, because a Jew was accused of a serious crime, for that reason the Jewry of the entire world exerts itself in order to bring criminal justice to a standstill.\nBribery money was raised by ruthless Jewish contributors to stop the judge.\nCase attention\nThe case attracted universal attention. Protests and addresses by scientists, public and political leaders, artists, men of letters, clergymen, and other liberal-minded men were published in all the civilized countries of Europe and the United States affirming that the blood libel was baseless.\nThe Beilis case was investigated for two and a half years. The trial took place inSeptember and October 1913. \nJews organized street riots to stop the court.\nThere were 355 witnesses in the trial.\nAs a whole, the documents are a valuable source for study. Most of them are originals and have a powerful information potential yet to be explored.The documents are in Russian, Yiddish, German, and Polish.\nAfter the Jewish lead Bolshevik revolution the Jewish controlled Cheka shot the Judge, the Public Prosecutor and many of the witnesses, including Father Pranaitis, the medical expert Kozoratov,  Professor Sikorski and Justice Minister Shcheglovitiv (according to one source, it was he who \"gave the order to investigate the case as a ritual murder\").\n Professor Pawlow, a Jew, who was a witness for the defense, became a leading scientist in Bolshevik Russia!\nhttps://just-another-inside-job.blogspot.com/2007/03/purim-sacrifice_27.html",
				"added": 1480972700
			}
		]
	},
	"comment_vote": {}
}