{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_18EjLHTadBR6ci3XRWyMfsGeWVtXTR8xx": 1
	},
	"next_comment_id": 39,
	"comment": {
		"1_1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA": [
			{
				"comment_id": 1,
				"body": "I grew up during the \"wild west\" of the internet - No censorship, constant discoveries and new developments every day. ZeroNet feels like a resurgence of those times. \n\nYes, it can feel dead and stagnant sometimes, but it's new. Many people have already pointed out the benefits of P2P web and over time it'll grow more popular. I believe the biggest surge of users will come from those who are looking for a new place to find torrentable content. \n\nWe'll get there guys. In the meantime, just enjoy Internet 2.0.",
				"added": 1483690598
			},
			{
				"comment_id": 2,
				"body": "> [grandpa](#comment_1_1DSiY7oNYWw4W5JZPQXwc5gk8YTA1sg8s8): What was the kind of content that kept you coming back?\n\nZeroNet content? The original draw towards ZeroNet for me was the fact that it was something new. P2P web is a great contender for Internet 2.0 and coming in at the ground floor to (hopefully) watch it grow is exciting. Unfortunately, due to having such a small user-base, this also means that it lacks fresh content. As more people discover it, it'll grow. The best part is no censorship and no central point of failure.\n\nI probably spend around 80% of my time between ZeroTalk and 0List. Mostly lurking and reading unless I feel I have something I can contribute.",
				"added": 1484435333
			}
		],
		"1_1CwbqLCD6TdkinNNNb4GneZxbsoJ6Mw6oE": [
			{
				"comment_id": 3,
				"body": "The instructions need a little clarity and fine tuning for novice users, but everything here looks legit. Thanks 12hlearn -  It's a great guide on how to run ZeroNet off a USB drive attached directly to your router (if your router supports it).\n\nHaving said that, I'd suggest running ZeroNet on a stand-alone device instead. A Raspberry Pi would be much more suitable, or even an old PC you have lying around - Chuck your preferred flavor of Linux on there, setup your VPN, then chuck it in the corner and let it seed away. This way you have a little more control over Bandwidth and traffic allowances (for those people that still have to operate within peak/off-peak times).",
				"added": 1484906175
			}
		],
		"8_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 4,
				"body": "Which \"old computers\" exactly?",
				"added": 1485245627
			}
		],
		"1_15R9r41EsReC5cmHPrLqryHyMHVFnfjLf1": [
			{
				"comment_id": 5,
				"body": "> [warlock](#comment_72_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): I'm responding just to let you know that the community is not dead, but I'm to lazy to give you a rundown. Have some curiosity and explore. It makes it more fun too.\n\nI agree. It's far from dead. 3 months ago Play (one of the more popular .bit sites) was sitting at around 300-400 peers. It's sitting on 1054 at the moment. \n\nCommunity activity and discussion is low due to the userbase being mostly lurkers.",
				"added": 1485931614
			}
		],
		"1_1MocL2J4KmBk6xozE4eE4jQVfurHdGCTqM": [
			{
				"comment_id": 6,
				"body": "> [planespherev3](#comment_162_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): I thought about this (cloning reddit, not the animal porn stuff).\n\nPlease don't, let the memes live in peace and harmony on Internet 1.0",
				"added": 1487655197
			}
		],
		"10_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp": [
			{
				"comment_id": 7,
				"body": "Bash",
				"added": 1487746214
			}
		],
		"2_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": [
			{
				"comment_id": 8,
				"body": "Because ZeroNet is currently one of the only real platforms out there for free speech. You can say whatever you want without being censored. But having free speech doesn't mean you're not free from criticism. For every comment like whitethunder's below, there's someone calling him out on his racism. \n\nI don't agree with anyone's racist comments, but I'll defend their right to say them until the day I die. There is no such thing as a safe space except the one you create in your mind. If you don't like what someone has to say, simply ignore it.\n\nThis shit has been going on for so long and people still don't grasp that concept.",
				"added": 1490342561
			},
			{
				"comment_id": 12,
				"body": "> [00d4n1](#comment_17_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd): Deleting whitethunder's comment since it's disgustingly racist isn't a violation of free speech. You can stand for freedom of speech without supporting that shit. https://xkcd.com/1357/\n\nThat's all well and good when you're talking about free speech within a country like the United States - Which the xkcd comic is actually referring to. The internet is a different monster altogether. It's not owned by a country or regulated (at least it shouldn't be). \n\nRacists have the same right to comment their bullshit just as much as anyone else. It doesn't matter if you're a feminist, brony, transgendered, white male, muslim, chinese, straight female, midget, giant or an obese asexual that identifies as a 1950' era fridge. Everyone should have the freedom to say what they want on a completely free platform such as the internet. If all racist comments are censored, who's to say all anti-government comments won't be next? Followed by anti-celebrity comments. Followed by anti-Futurama comments. \n\nIt's a slippery slope and the notion of censorship on the internet should never be entertained. If you support the censorship of shit you dislike and choose to wrap yourself in a little bubble of \"safety\", no one will be there to help you when the things you DO like are censored.\n\nI mean really, is it THAT hard to ignore someone? Has society come to the point where we're all so easily offended that we'd rather hand over our rights just to have the illusion of safety?",
				"added": 1491008908
			},
			{
				"comment_id": 13,
				"body": "> [00d4n1](#comment_20_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd): The xkcd comic is referring to the only concept of free speech that exists - which is that the government can't arrest you for what you say.\n\nYet the very definition of freedom of speech specifically refers to censorship: \"Freedom of speech is the right to articulate one's opinions and ideas without fear of government retaliation or censorship, or societal sanction.\" \n\n> [np](#comment_2_1Hr2EnaPQkPexyHaMMaVNNHbSwjMezoQWD): \n> Yes it is. This is why forums need sections, to separate people who want to ignore each other. Temporarily or permanently. This is why it can't be censorship to block someone from a community or to filter content out of sections.\n> If that where the case, then you are censoring someone by preventing them from sending you spam or by using an add blocker. A simple case of subscribing to a single publisher is also censorship of all other publishers. \n> Why do you do all those things? Because ignoring, is extremely hard. It's not only a hard problem, its a unsolvable problem without what most call censorship.\n> This inst about safety, this is about the fact that i would much rather be reading about other things then waste of times, like politics and religion. That requires some system that allows filtration of content. Which in turn is called censorship.\n\nI read through that and was confused until I realized we're both talking about two completely different types of censorship.\n\nI'm all for the block button. Being able to personally block a user's content from appearing when you view a website? Yes please. It's the equivalent of putting your headphones in when someone says something rude in real life. Sign me up. \n\nWhat I am against however, is completely banning/filtering a user or topic just because a certain percentage of the population doesn't want to hear it. That's the difference here. Like I said previously, I don't agree with the garbage being posted, but where do you draw the line? You have to have all of it, the good and the bad. If you choose to surround yourself with people that think and conform to the same ideas as you, you'll be forever living in an echo chamber and will never have your opinions challenged.",
				"added": 1491050459
			},
			{
				"comment_id": 14,
				"body": "> [mynameislegion](#comment_28_1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV):\n> if you want to discuss Jews, please start your own site and discuss the purity of your genes there. \n> If you want to contribute to ZeroNet in other ways than spreading your ideology like the witnesses of Jehova, you are welcome to participate on the main page.\n\n\"You can talk about any cult or ideology except for the ones I don't agree with\" - I know people that have escaped the cult of Jehova. It's a scam that preys on people that have recently lost loved ones. They steal money and possessions from their members to ensure those at the top of the food chain are kept in a luxurious lifestyle.\n\nYet I'd welcome anyone who's a Jehova to come and post about it here. They have every right to, just as everyone else has the right to disagree. You can't pick and chose what is off-limits and what isn't, as what's offensive to you might be a way of live for me and vice versa. \n\nIf you grew up in a racist household and all your friends were racist, that'd be the only life you'd know. You'd post your rubbish on an internet forum and people would call you out. Without that, these people will never be challenged to think differently or learn how to form outside opinions. Sure you might not want to deal with it or sift through all the bullshit, but a personal block button would remedy that - Outright banning them or preventing discussions on certain topics is not the way for ZeroNet to move forward. \n\nWe don't want another Reddit...",
				"added": 1491100050
			},
			{
				"comment_id": 20,
				"body": "> [00d4n1](#comment_21_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd): Notice how it says \"government retaliation or censorship\"? The modifier \"government\" applies to both of those words.\n\nI guess I (and the rest of the free world) interpret it as two completely separate statements: \"Government retaliation\" and \"censorship\" - not \"Government censorship\".\n\nRegardless, both the European and American Convention on Human Rights state that everyone has:\n\n1. the right to seek information and ideas;\n2. the right to receive information and ideas;\n3. the right to impart information and ideas\n\nIt doesn't say \"information and ideas, unless it hurts people's feelings\". If that isn't enough, it goes on to specifically say:\n\n\"International, regional and national standards also recognize that freedom of speech, as the freedom of expression, includes any medium, be it orally, in written, in print, THROUGH THE INTERNET or through art forms. This means that the protection of freedom of speech as a right includes not only the content, but also the means of expression.\"\n\nThis honestly isn't a hard concept to grasp...",
				"added": 1492248035
			}
		],
		"1_1MxX4JMJ71sfYS1Lo3jL8Ja5u811nySEJJ": [
			{
				"comment_id": 9,
				"body": "It's insane that people are still fighting over Hillary vs Trump. They're both shitty candidates and neither of them should have been elected. Instead of everyone fighting against the system, that forced us to chose between a corrupt liar and an inept idiot, we fight amongst themselves.\n\nHillary supporters don't realize the ramifications of her actions over the last 30 years - Treason, corruption, bribes, murder - and if they do, they're prepared to overlook it because \"she's the first female president and it's her turn\".\n\nTrump supporters got lured into false promises that he'd clean up the corrupt government, only to turn around like every other president elect and go back on his word. Instead he appoints people that have ties with the likes of Goldman Sachs. \n\nEveryone should be fighting against the system, not each other.",
				"added": 1490343099
			},
			{
				"comment_id": 35,
				"body": "> [breitshart](#comment_1_12UhiqqmEFy9e5iDphNwnugKQrhWMMAP3J): \"... Ms Clinton won the popular vote by more than three million ...\"  [...]\n\n> [breitshart](#comment_2_12UhiqqmEFy9e5iDphNwnugKQrhWMMAP3J): Mongoloid Tramp needs to be reminded to be patriotic:https://imgur.com/6p1rQWS\n\nAnother Hillary supporter that doesn't get that the only choice the US had was between two corrupt and shitty candidates. Trump is a fucking train wreck, but Hillary would have been just as bad. The people voted Trump because there was definitive proof that Hillary was corrupt, at the time the proof on Trump was just conjecture.\n\nYes, he turned out to be just as bad, but instead of spending all your time shitting on Trump, why don't you focus it on the system that put him there in the first place? Otherwise, in 2020 the entire thing is just going to repeat itself with two more candidates just as bad.\n\nYou'd be naive to think that there isn't a higher power pulling the strings here and that the President is anything more than a marionette.",
				"added": 1493550071
			}
		],
		"1_1MwJSNBC1savftEvXQyoHcVLDgThtAPr6T": [
			{
				"comment_id": 10,
				"body": "Obvious troll. Nothing to see here guys.",
				"added": 1490393746
			},
			{
				"comment_id": 33,
				"body": "> [twiggydew](#comment_5_1MwJSNBC1savftEvXQyoHcVLDgThtAPr6T): Sorry to disappoint you guys but I'm not a troll. I do have the money to donate to any of these decentralized projects if they are 100% user friendly for non-coders. I still do not see any improvement to ZeroBlog and other sites on ZeroNet are still buggy. There's still no good youtube site where people can easily upload videos. App Centre http://127.0.0.1:43110/1LANDERvVWbShpNWpsrbBvfqSK1PabXtwv/ has no apps. ZeroPlus http://127.0.0.1:43110/1NCRELKZ3zWRS6DijziYrfWi9dsUY8Fh8n/ Avatars don't seem work. Even gifs don't work on 0ChanPorn http://127.0.0.1:43110/1NZNtZQZHQRJXafvJpmY5jgqwRaCEZMsUc The only thing that seems to work ok is the email and your music sites and that's not enough to get people to use ZeroNet. I knew this would be another failed project and so far I've been right. I think I'll just start donating money to the poor people. You guys have a nice day.\n\n\"Hi guys, I'm not a troll\"\n\n*proceeds to troll*\n\nNo one is fooled by your bullshit. Your $500 in savings isn't going to help fund a P2P project. You know what is? Telling other people about it and using it yourself. It's P2P, the more people that use it the better it becomes.\n\nYou've said goodbye twice now, please don't make it a third time.",
				"added": 1493543209
			}
		],
		"1_1FxpcMsoTKTeUoNDRJKzqyLAwXuwVg3zgX": [
			{
				"comment_id": 11,
				"body": "Because the English board is the default one. \n\n> [tun](#comment_6_1FxpcMsoTKTeUoNDRJKzqyLAwXuwVg3zgX): Yeah, I could do that. I would need to spend a lot of time. If there is enough support for it, I would invest more time in it though. This is early stage discussion, and you went nuclear from the start! :D I like your enthusiasm, though.\n\nI'm not sure what \"early stage discussion\" we can have here as there's only one solution - Make the default board match with the user's selected language.",
				"added": 1490394103
			}
		],
		"2_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 15,
				"body": "> [binchan2](#comment_3_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h): Maybe it's better to create a specific English forum, and just keep the main forum multi-languages supported. Anyway, like what @mi6agent seems to express, we still can't list all languages on the navbar. And I guess it's better to have one with multi languages support :) For example, it helps everyone to learn or just perceive different cultures.\n\nSpot on brother. We're all a minority here on ZeroNet. Not only would it promote multiculturalism within the default board, it would open up communication between races/cultures that want to learn another language and communicate with others. \n\nYou can still have your native language board and a \"default\" one. There's no need to have two \"English\" boards.",
				"added": 1491560840
			}
		],
		"1_1EWcSH8L4VBXvQVn4NB4s8HsJuJzNwATYD": [
			{
				"comment_id": 16,
				"body": "> [curseofham](#comment_1_1PZkgWBgz2g5ABMugRJLXocXk7yX1Wit5d): \"I base my fact and knowledge of history off of a 2000 year old book.\"\n\nIt's 2017, time to wake up and think for yourself. A book written approximately 2000 years ago by multiple authors, that all lived in different centuries, cannot be accurate. Especially one that involves incredulous \"miracles\" and world wide floods. If you're going to hate on Jews, at least base it on something substantial, not some thin-thread, tinfoil bullshit.",
				"added": 1491561440
			}
		],
		"1_1No1EtiPxGfiXXqM4tJNGWxiEH64jgm63Y": [
			{
				"comment_id": 17,
				"body": "> [wakata](#comment_1_1M6efZ2qRapxaUGpZXYQE7vEiAg7H77BNk): To all Chinese people who might read this, I hope that you one day have proper representation in your government. Remember your roots and look past the suppression of your rich culture by these communist thugs.\n\nThis is true for pretty much every culture, not just the Chinese.\n\nEgypt, Iran, Iraq, Afghanistan, Syria - They all used to have a rich and deep culture until they were suppressed by dictatorship. People forget this.",
				"added": 1491561657
			}
		],
		"1_17x8jz45zq7SowdS5GNFDnaNSKxtgm1d5g": [
			{
				"comment_id": 18,
				"body": "> [baron](#comment_1_1SYHKxZCtonF5bGwDxwHydSxBSpUYVbc5): Why not post memes in 0chan.bit?\n\nThis is the only comment worth reading in this thread.",
				"added": 1491984923
			}
		],
		"2_1165u6pt5mQNFjyhMVwy6azB7bZuQGLA9b": [
			{
				"comment_id": 19,
				"body": "Who cares? Stop replying to them, ignore the topics and move on.",
				"added": 1491985231
			}
		],
		"1_1CwxK59mAFkKoFhnEw3ZyuHsVSEF2bj76": [
			{
				"comment_id": 21,
				"body": "> [rythyrix](#comment_68_18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y): Hi there! In no particular order: [...]\n\nGreat post!\n\nAlso check out Play (http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/) for a bunch of new release movies.",
				"added": 1492411357
			}
		],
		"1_1E8KDakJCmMofVgTawocXc4pX9Fn3K3ob1": [
			{
				"comment_id": 22,
				"body": "I think there's potential for WW3, but I also think people are starting to wake up to the \"Divide and Conquer\" regime that's been manipulating us for the last 15-20 years - Make us fight amongst ourselves and hate each other so we don't realize who the problem really is - Central Banks, corrupt politicians, old world money, etc...\n\nIt's the same tactics, just a different narrative each time - Blacks vs Whites, Muslims vs Christians, Men vs Women, Rich vs Poor, Gay vs Straight, North vs South, You vs Me. If everyone just did their part and looked past all this bullshit, we could unite together and make a REAL difference.\n\nWhether or not enough people start to grasp this before something drastic happens, well, I guess we'll see.",
				"added": 1492506461
			},
			{
				"comment_id": 24,
				"body": "> [gary2016](#comment_3_1E8KDakJCmMofVgTawocXc4pX9Fn3K3ob1): i think behind all jews and bankster are an forgotten power elite maybe not human???\n\nI guess stranger things have happened... I'm not saying I agree, just not ruling it out either!\n\n(FYI - The below isn't aimed directly at you gary2016)\n\nI can see the anti-jew viewpoint and I fully understand the implications and why someone would think that way - Most/All central banks are run by a Jewish ancestry. But to hate an entire culture based off of a small minority is such a narrow minded view. Sure the corrupt global elite might all be Jewish and might be completely responsible for the downfall of humanity, but that doesn't mean little Bobby Goldstein around the corner is in on it. It's not some secret Stonecutters club that all people of Jewish decent are born into...\n\nWhy not focus on the specific people that are to blame instead of the entire culture? Blame the Rothchilds or the Rockerfellers instead of people that come from the same culture who are probably struggling just as much as the rest of us.\n\n> [border0464fred](#comment_134_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): There will be no WW3 as there been WW1 & WW2, we don't do war like this anymore this time is over.\n\nI'm not sure what's scarier, the thought of being drafted/conscripted, or the thought of nukes/WMDs being dropped...\n\nMaybe WW3 will be a united people vs government and global elite? If people could put aside their differences it'd actually be a plausible idea. It wouldn't even have to be violent, you can make a stand against them by a show of solidarity - Everyone refuses to vote or everyone refuses to pay taxes (I know both of these are bad examples, but I don't have all the answers. Maybe someone smarter than me can think up one that would actually work...)",
				"added": 1492602223
			},
			{
				"comment_id": 25,
				"body": "> [planespherev3](#comment_193_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): World wars are a result of the capitalist mode of production. Without capitalism, no more world wars.  [...]\n\nYeah I'd totally agree with that.\n\nThe issue is how do you negatively affect capitalism when so many household products are manufactured and produced by a handful of parent companies? There are plenty of us out there that already avoid the big name products like Apple and Microsoft, but what about everyday items like toothpaste, packaged food, toilet paper, etc? It's insane how many of these items are actually produced by the likes of Nestle`.\n\nI already distance myself from these mega-corporations and shop from local small businesses, but they're an expensive alternative and I understand not everyone can afford to make this change. I guess distancing yourself from luxury items like phones, electronics, etc is a good start?",
				"added": 1492674095
			}
		],
		"1_19Z8aJ32x4pE2iGvVssPJazJgpGe5L32rq": [
			{
				"comment_id": 23,
				"body": "> [huntrnr](#comment_3_15M9YVK8YpC5kqBWz6J27rhpWDRXwmFUAV): Foreigners don't understand freedom of speech\n\nI fully support your freedom of speech! Welcome to the discussion. \n\nYou have a platform here at your disposal, somewhere to voice your real concerns and discuss the problems that you face - If you have an issue with a different race, articulate it, let us know what that issue is and what you think should happen to fix it.\n\nYou have the right to free speech, but you completely waste it. Talk about ironic.",
				"added": 1492507519
			}
		],
		"1_1NTgaYjK2bh1axvruth8HqtGt6Pw5ab13x": [
			{
				"comment_id": 26,
				"body": "On the ZeroNet launch page, underneath \"Hello ZeroNet_\",  you'll see two headings - \"Sites\" & \"Files\".\n\n\"Sites\" will list all the .bit sites (or zites) you view and are potentially seeding. Simply click the 3 dots that appear to the right of the site name and select \"Delete\". This will delete the entire local copy of the site from your PC and you'll no longer seed it until the next time you view it.\n\nThe \"Files\" header will show all files and optional files of any site that you've decided to seed. If you want to keep seeding a site except one or two of the files, simply select/tick the files you want to remove and click the \"delete\" button.",
				"added": 1493017763
			}
		],
		"1_16bYoVV4ZHBY4kA416cTDvU1ZpjcLNkavi": [
			{
				"comment_id": 27,
				"body": "Cheap, easy and reliable - https://www.privateinternetaccess.com/ - It'll work on any platform and they claim they don't keep logs, so even if they get subpoenaed by the Government, there's nothing to hand over. Whether this is true or not is questionable, but there's been no proof so far that they log.\n\nIf you have some IT knowledge (or know someone that does), the best option is to create your own VPN. Purchase a cheap VPS (Virtual Private Server) and configure your own VPN and run all traffic through that. The downside is that a VPS will be more expensive, but if you get a few people together and all chip in, you can all use it at a reduced cost.",
				"added": 1493018257
			},
			{
				"comment_id": 29,
				"body": "> [ghostaz](#comment_3_17jhcV7ACnYLDiBSdw6KqL3d9WVjDtcjf1): Hello friend, cool article, really liked! Tell me where to get this server (VPS)?And do you know where you can buy a jabber server? Thank\n\nThere's loads of places that will sell you hosting space. Do a search for \"Cheap VPS Hosting\" and you'll get too many hits to comb through - Some as cheap as $2-3 a month. I'd give you some recommendations, but I'm not sure what part of the world you're located in. I say that because it'd be advisable to purchase a VPS nearby - Whether it's in your own country or a neighboring one.\n\nIf you want to test it out and see if you can build your own VPN before committing to hosting costs, sign up for Amazon's AWS service. Their lowest tier hosting is free!",
				"added": 1493082228
			}
		],
		"1_1CMYxdit4qq9QGk9DYRu2ruRPd2YDGckH8": [
			{
				"comment_id": 28,
				"body": "The novelty of ZeroNet as a safe haven for free speech is wearing off and the \"edgy\" racist spam has dropped off considerably - Mostly because they're not getting the reaction that they want. You'll still see plenty of racism and tinfoil theories, but at least it's more of a discussion and not just ascii swastikas.\n\nWith a platform like ZeroNet you have to take the good with the bad, that's how freedom works.",
				"added": 1493080696
			},
			{
				"comment_id": 30,
				"body": "> [1491301186](#comment_3_1AZG3avnpwcn37q9eeCEjXKFBye81eAxg5): No, trolling and racism have not stopped in ZeroTalk.\n\nIt'll never stop completely and I wouldn't expect it to, but it's decreased significantly compared to 3-4 months ago.",
				"added": 1493120085
			},
			{
				"comment_id": 32,
				"body": "> [jewsabusebabies](#comment_1_1ChiEBUu2VriAkKjFtmNSUWe3RPWrmt44A): racism ? are Jews an own race ? are Jews above all Gentiles ?antisemitism ? are Jews semitic ? 80% of the Jews not at all and 20% of the Jews have some semitic originare Arabs semitic ? YESare Jews hating arabs ? YESare Jews the biggest antisemits ? YESso why are Jews abusing words ?why are Jews abusing babies ?https://m.youtube.com/watch?v=w9Rk__I2__4https://m.youtube.com/#/watch?v=rLcXvgv4FYI\n\nIs this all Jews, or just a small minority? By your logic all Caucasians are members of the KKK and all Italians are part of the Mafia.\n\nLook, I get it. It's not coincidental that the leaders of the central banks are Jews or that Israel seems to get special treatment from the UN and US congress. There's a load of corruption associated with people in power that just so happen to be Jewish - But that doesn't mean all Jews are in on it, it's not some secret club that 15 million + people are a part of and actively conspiring against the rest of the world.\n\nI agree that there's definitely a problem that needs fixing, but blaming an entire culture for the deeds of a few is downright ignorant. This goes for any form of racism/sexism/sectarianism. Instead, focus that hate on the people that deserve it and call them out by name, not by their beliefs or skin color.\n\nLet's fight the Rothschild's, Lehman's, and Warburgs instead of each other.",
				"added": 1493429213
			},
			{
				"comment_id": 34,
				"body": "> [sharonim](#comment_1_178MYzA3aYwPawawsdWZBTq8rjctaKMzEM): Look on this pictures how black Africans are kept in the Sharonim Concentration Camp in Israel by Jews in the desert without any charge.http://www.sunray22b.net/saharonim_concentration_camp.htmhttps://www.rt.com/news/israel-illegal-immigrants-jail-014/Now be honest and ask if is a racist troll who is exposing this ?Or racists are those who keep them enjailed without any trial.\n\nIt's a shitty system, but what's the alternative? They're illegally entering another country. What do you suggest they should do Sharonim? All I'm reading is hate and absolutely no thought or discussion.\n\nThis isn't a \"Jew\" problem, this is a common issue found across the world. Almost every country is doing it - Japan, United States, Australia, Canada, Denmark... If you enter any of these countries illegally, you'll be detained until your circumstances are examined and either exported back to your home country or given asylum. Unfortunately, it's not possible to give everyone asylum.\n\nThere are refugees stuck in these detainment camps because they're unwilling to give their name and address for fear of being sent back. There are terrorists that want to enter these countries illegally under the guise of a refugee to wreck havoc. There are families fleeing war-torn countries that they may, or may not have helped destabilize in the first place. \n\nAre you saying that every country should open it's borders and let whoever they want to flood in without any consequence?",
				"added": 1493549605
			},
			{
				"comment_id": 37,
				"body": "> [sm431241](#comment_1_17eEEfYPLR4wdej85kFmH2gNeSnxiTBvgC): But don't be too afraid to read opinions counter to your own you might learn a little something.\n\nSolid point!",
				"added": 1493690603
			}
		],
		"1_1CjmMpMZgtzY2w9REEwLWQbtHhd5B5NStZ": [
			{
				"comment_id": 31,
				"body": "Like Kaffie explained below, if you think of ZeroNet as Internet 2.0 that would make IPFS something similar to MEGA/Megaupload. Both are based on the P2P platform but serve completely different purposes.",
				"added": 1493262190
			}
		],
		"14_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": [
			{
				"comment_id": 36,
				"body": "> [seequ](#comment_3_19BZ9s633TaM3t7oW5bQPTPQJU3cbyibVH): Maybe. Anyways, easier auditing would be useful.\n\nNot maybe, Kaffie is straight-up correct. Opt-in seeding would kill ZeroNet.\n\nI understand your concern though. Until a proper counter measure can be created the best option you have is to run everything through a trusted VPN and TOR - That way if you end up seeding something sinister you won't be caught. No, it isn't fool proof, but this is the wild west of Internet 2.0 and you need to understand that there will be road bumps and issues along the way.",
				"added": 1493639880
			}
		],
		"4_1NTgaYjK2bh1axvruth8HqtGt6Pw5ab13x": [
			{
				"comment_id": 38,
				"body": "> [ivesen](#comment_15_1NmkVyqBJX6a82YQFYkCNgQpE9AWsmeppp): because they've been imprisoned to proprietary software by their so called \"friends\" that make it nearly impossible to  switch away from their skypes, facebook and twitter!\n\nDing, ding, ding! We have a winner!\n\nFacebook is so ingrained that it's become a part of everyones lives. They could come out and say \"We sell all your data to the Russians\" and people would still use it. There's a small percentage of people that quit and actually stay gone, but for everyone else the convenience of having all their friends in one place is too good to give up - Even if they're aware of Facebook's shady business practices.\n\nThe most common phrase I hear on an almost daily basis is \"I've got nothing to hide\". It's such an ignorant and narrow-minded statement, they may as well say \"I'm happy being cattle, let me live in my safe space\".",
				"added": 1494229263
			}
		]
	},
	"comment_vote": {
		"1_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"3_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"2_19QpUXaZfscvuTpEAveS3oNrvL7sasm2tY": 1,
		"72_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1": 1,
		"5_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"341_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"268_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"269_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"13_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"3_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h": 1,
		"1_1M6efZ2qRapxaUGpZXYQE7vEiAg7H77BNk": 1,
		"1_1SYHKxZCtonF5bGwDxwHydSxBSpUYVbc5": 1,
		"23_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"20_1QEfmMwKVxgR4rkREbdJYjgUmF3Zy8pwHt": 1,
		"22_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"193_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS": 1,
		"194_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS": 1,
		"9_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"27_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"3_17jhcV7ACnYLDiBSdw6KqL3d9WVjDtcjf1": 1,
		"29_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"28_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"7_1NTgaYjK2bh1axvruth8HqtGt6Pw5ab13x": 1,
		"1_14HEruU17ycsg5Y5MBCFnh8SAU87Jmh5dq": 1,
		"279_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"31_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"32_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"35_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"1_1JotUZXuxBXpqGxowyTTUbBMZoAFvzteea": 1,
		"1_17eEEfYPLR4wdej85kFmH2gNeSnxiTBvgC": 1,
		"36_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"14_1AZG3avnpwcn37q9eeCEjXKFBye81eAxg5": 1,
		"30_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY": 1,
		"31_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY": 1,
		"34_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"37_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"15_1NmkVyqBJX6a82YQFYkCNgQpE9AWsmeppp": 1,
		"38_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1
	}
}