{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"3_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": [
			{
				"comment_id": 1,
				"body": "Japanese men masturbate too much and God have punished Japan.",
				"added": 1475872231
			}
		],
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 2,
				"body": "The Emperor of Japan advertises for a new bodyguard. Three swordsmen apply: one is Japanese, one is Chinese, and one is Jewish.\nTo test them, the Emperor lets a fly loose in the room and tells them to kill it.\nThe Chinese swordsman sweeps down his blade and chops the fly in two.\nThe Japanese swordsman swings his sword twice and manages to cut the fly into quarters before it hits the ground.\nThe Jewish swordsman chases it around the room, swings his sword a few times, then sits down with the fly buzzing around his head.\n   \"Why have you stopped?\" asks the Emperor. \"The fly is still alive.\"\n   \"Yes,\" replies the Jewish swordsman. \"But now it's circumcised.\"",
				"added": 1475872556
			},
			{
				"comment_id": 3,
				"body": "> [planespherev2](#comment_4_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): \n> The problem is not the capitalist ruling class religion or ethnicity (jews, satanists, soon Chineeses or whatever).\n> The problem is not the system's elite religion or ethnicity. The problem is the system itself: the money game. \n> Homo sapiens is so brainwashed by the money game since thousands of years (it began 12000 BCE with the neolithic revolution). He has forgotten it is not his true nature.\nThis is a communist ideology invented by Jews. But you can still fool with it some people in the jungle of South America if you hurry.",
				"added": 1475951744
			}
		],
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": [
			{
				"comment_id": 4,
				"body": "I am so disappointed of Trump. He capitulated in front of gays, feminists and Jews.\nWhy needs somebody to apologize if he in a private conversation expresses his aversion towards  women with silicone breast ? I mean these are still humans to a certain degree but sexually are certainly not attractive to normal men. Even Jews know that.",
				"added": 1476014028
			}
		]
	},
	"comment_vote": {}
}