{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1_18Sh2Z83C23xdd6pjCq6NGv7Y6svEBcUfb": [
			{
				"comment_id": 1,
				"body": "> [a1user](#comment_2_18Sh2Z83C23xdd6pjCq6NGv7Y6svEBcUfb): Users should be able to use the same user id without having to copy .json files over to the new device.There should be a search engine.There should be html5.People should be able to very easily clone their existing ShitNet(regular Internet) websites over to here, and then be able to administrate them from here, eventually allowing them to dump their ShitNet websites.Ecommerce should be supported.Basically, you want ZeroNet to take over completely, and take all power away from the ShitNet.\n\nAgree! A few more comments:\n\n- integrate WebRTC webcam/voice communications that are encrypted and secure for web conferencing or one-on-one communications (like Firefox hello), and host developer/community town halls. \n\n- create a social media page with a  \"Facebook-like\" experience where my chosen family members could host backups of my content. This would be a decentralized Facebook experience for the more privacy-conscious.",
				"added": 1475444768
			}
		],
		"1_1Gi4g59DwnkjgL9VmvmrfC95tMymyWFaaY": [
			{
				"comment_id": 2,
				"body": "Good job on the rebuttal Kaffie. I think you should post that to his clearnet blog and email it to  him. He will never see it here because he is too scared of the unknown.",
				"added": 1480050799
			}
		],
		"10_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr": [
			{
				"comment_id": 3,
				"body": "If you want a simple solution that integrates end-to-end encryption into your commercial webmail, then use Virtru. It has a browser plugin that integrates straight into your webmails. Viewers are redirected to a secure webpage to view  and reply to your emails and do not need your public key in advance, and do not have to download anything.\n\nIf you are looking to use a more secure webmail service overall, I would suggest protonmail.",
				"added": 1480053166
			}
		]
	},
	"comment_vote": {
		"2_18Sh2Z83C23xdd6pjCq6NGv7Y6svEBcUfb": 1,
		"215_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1
	}
}