{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Holly Jewish Excretion. Asher yatzar (Hebrew: ברכת) אשר יצר) Excretion is a holly act by Jews, it is a frequent topic and part of many prayer.",
			"body": "Asher yatzar (Hebrew: ברכת) אשר יצר) is called the excretion act by Jews.\nJews love not only talking about their fecal habits, but also stressing about them. Are we pooping often enough? Too much? There’s even a prayer, the Asher Yatzar, thanking God for the orifices of our body, and expressing gratitude that they open when they should and perhaps more importantly, that they remain closed when they should.\nhttps://en.wikipedia.org/wiki/Asher_yatzar\nEnglish\n    \"Blessed are You, Hashem our God, King of the universe, Who formed man with wisdom and created within him many openings and many hollows. It is obvious and known before Your Throne of Glory that if even one of them ruptures, or if even one of them becomes blocked, it would be impossible to survive and to stand before You (even for a short period). Blessed are You, Hashem, Who heals all flesh and acts wondrously.\"\n    Hebrew\n    בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם אֲשֶׁר יָצַר אֶת\n.הָאָדָם בְּחָכְמָה וּבָרָא בוֹ נְקָבִים נְקָבִים חֲלוּלִים חֲלוּלִים גָּלוּי וְיָדוּעַ לִפְנֵי כִסֵּא כְבוֹדֶךָ שֶׁאִם יִפָּתֵחַ אֶחָד מֵהֶם אוֹ יִסָּתֵם אֶחָד מֵהֶם אִי אֶפְשַׁר לְהִתְקַיֵּם וְלַעֲמוֹד לְפָנֶיךָ .אֲפִילוּ שָׁעָה אֶחָת .בָּרוּךְ אַתָּה יְהֹוָה רוֹפֵא כָל בָּשָׂר וּמַפְלִיא לַעֲשֹוֹת\nfrom the Wikipedia\n\n\nExcrement also plays an important role in jewish pornography:\nIn 2008 Isaacs was brought to trial in Los Angeles, California on federal obscenity charges for videos featuring scatology and bestiality. At issue were obscene films sold between May 2004 and October 2006: Gang Bang Horse \"Pony Sex Game,\" Mako's First Time Scat, Hollywood Scat Amateurs No. 7, and BAE 20 (also titled Avantgarde Extreme).\nhttps://en.wikipedia.org/wiki/Ira_Isaacs\n\nAs Jewish excrements are created with Gods blessing it is a traditional Jewish instrument to exercise control over Gentiles. Typhus was a frequent disease in the past caused by Jews in their effort to exercise control over Gentiles with their holly excrements.\nJewish soldiers in Israel also like to humiliate Palestinians by using excrement: they break into Palestinians' homes and defecate on the tables, and wipe their asses with the clothes that they find in the wardrobes.\nEven though the houses had functioning toilets, soldiers had defecated in cardboard boxes and plastic bags and left them lying in rooms. Wardrobes and cupboards had been emptied on the floor and contents stepped on and otherwise soiled.\nhttps://www.amnesty.org/en/latest/ne...gaza-20090401/",
			"added": 1487765760,
			"parent_topic_uri": "9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		}
	],
	"topic_vote": {
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": 1,
		"1_13GyWy7pXEtCorqUBAv7ZPjyzNfwMA6Hh2": 1,
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1
	},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}