{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": 1,
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": 1,
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": 1,
		"2_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": 1,
		"1_1AQwGx5xyBi5Fvv9WHJFMCMNtQhUc8UhQF": 1,
		"1_12Xj1w5HYu6w5xtEwwLyEiMYGuCqvYKL2q": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": [
			{
				"comment_id": 1,
				"body": "Some entries from the Auschwitz death books\n\nAccording to the holocaust legend, Jewish prisoners who arrived at Auschwitz between the spring of 1942 and the fall of 1944, and who were not able to work, were immediately put to death and that no records were kept of such deaths (even though all other deaths where recorded in detail).\n\nGerman journalist and researcher Wolfgang Kempkens, obtained copies of some 800 of the death certificates from sources in Poland and Russia. Reproductions of thirty of these certificates appeared in the article \"Pages from the Auschwitz Death Registry Volumes\" by Mark Weber, Journal of Historical Review vol 12 p 265.\n\nWe provide the following selection from the 30, to show that the old and weak appear among the death certificates of the Auschwitz death books, proving that the claim that \"all who were not able to work, were immediately put to death\" is false.\n\nJosef Hoffmann, a Jewish butcher, was 89 years old when he died of \"old age\" on June 22, 1942.\n\nAbraham Stieber, a Jewish salesman from Slovakia, was 79 years old when he died on July 2, 1942, of \"old age.\"\n\nChaim Richter, a Jewish salesman, was 81 years old when he died in Aschwitz on March 1, 1942, of \"weakness of old age.\"\n\nJosephine Kohn, a Jewish inmate born in Hungary who had been living in Leipzig, was 69 years old when she died on February 10, 1943. Auschwitz camp physician Dr. Kitt reported \"weakness of old age\" as the cause of death.\n\nEmil Kaufmann, a Jewish attorney deported from Germany, was 78 years old when he died of \"old age\" on February 15, 1943. \"Weakness of old age\" is given as the cause of death.\n\nJulius Sonnenberg, a salesman from Germany, was 65 years old when he died on February 27, 1943, of \"angina pectoris.\" His religion is cited as \"non-believing, formerly Jewish.\"\n\nAbraham Blok, a Jewish butcher from the Netherlands, was 70 years old when he died of \"old age\" on March 6, 1943.\n\nJettchen Fuld, a Jewish inmate, was 67 years old when she died on October 10, 1942. Old age and physical weakness is given as the cause of death.\n\nSalomon Serlui, a Jewish laborer from the Netherlands, was 67 years old when he died in Auschwitz on October 16, 1942. Camp physician Dr. Kremer reported a stomach ulcer as the cause of death.\n\nRenö Hirschfeld, a Jewish tailor born in Berlin in 1878, was 64 years old when he died on November 2, 1942. Camp physician Dr. Kitt reported \"weakness of old age\" as the cause of death.\n\nArmin Horn, a Jewish salesman deported to the camp from Slovakia, died on August 19, 1942, at the age of 70. Camp physician Dr. Thilo recorded the cause of death as \"accumulation of fluid in the intestine and weakness of old age.\"\n\nThis Auschwitz camp death certificate reports that prisoner Josef Buck, a Jewish teacher from Kattowitz, was 65 years old when he died on August 1, 1941. \"Weakness of old age\" is given as the cause of death.\n\nJosek Nisenkorn, a Jewish laborer, was 71 years old when he died in Auschwitz on August 11, 1941. \"Weakness of old age\" is given as the cause of death by camp physician Dr. Siegfried Schwela, who himself later died of typhus.\n\nSamuel Mandel, a Jewish tailor, was 74 years old when he died in Auschwitz on March 26, 1942. Physician Dr. Entress reported the cause of death as \"influenza with heart failure.\"\n\nErnestine Hochfelder, a Jewish inmate who had been deported to the camp from Slovakia, was 70 years old when she died in Auschwitz on June 4, 1942. \"Physical weakness and old age\" is cited as the cause of death.\n\nDavid Reichman, a Jewish farmer, was 70 years old when he died on July 22, 1942, of \"old age.\"\n\nThis selection has been chosen to illustrate that the old and weak where not \"immediately gassed\" as is often claimed, and to point out that according to the death records, many died of old age.",
				"added": 1484227709
			}
		]
	},
	"comment_vote": {}
}