{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": 1,
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": 1,
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": 1,
		"1_1NU6gdra9qhUhdbYGLia1G3HYT87qUTA7w": 1,
		"2_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_1AQwGx5xyBi5Fvv9WHJFMCMNtQhUc8UhQF": 1,
		"1_12Xj1w5HYu6w5xtEwwLyEiMYGuCqvYKL2q": 1,
		"1_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": 1,
		"2_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": [
			{
				"comment_id": 1,
				"body": "> [hitlerjew](#comment_1_1JzD42M2hPbYtTVMEnM68AXyTqgFFWqewv): Was Hitler the Jews best friend?\n\n\"Swimming Pool, Auschwitz Camp, June 1996. Inmates from Auschwitz and surrounding camps enjoyed swimming and sunbathing beside the pool on Saturday and Sunday afternoons. Although not as popular as sports like soccer, some competition was organized where inmates from different countries of origin, and different camps, raced in individual and relay events.\" From www.air-photo.com, now off-line.\n\"The working hours were modified on Sundays and holidays, when most of the kommandos were at leisure. Roll call was at around noon; evenings were devoted to rest and to a choice of cultural and sporting activities. Football, basketball, and water-polo matches (in an open-air pool built within the perimeter by detainees) attracted crowds of onlookers. It should be noted that only the very fit and well-fed, exempt from the harsh jobs, could indulge in these games which drew the liveliest applause from the masses of other detainees.\" (De l'UniversitÈ aux camps de concentration: Telmorgnages strasbourgeois, Paris, les Belles-lettres, 1947, p. 453).\nhttp://www.scrapbookpages.com/AuschwitzScrapbook/Tour/Auschwitz1/AuschwitzPool.html\nCompare Auschwitz(war time detainee camp) with the Gulag (peace time detainee camp)\nhttp://thebirdman.org/Index/Others/Others-Doc-Jews/+Doc-Jews-Holocaust-HolocaustsCausedByJews/ComparingAuschwitzToTheGulags.htm\nhttps://archive.org/stream/TheAuschwitzSwimmingPool-WithReferences/TheAuschwitzSwimmingPool-WithReferences_djvu.txt\n\nDid any of the peace time detainee camps from the USA or Soviet Union had such facilities for inmates?",
				"added": 1482154820
			}
		]
	},
	"comment_vote": {}
}