{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": 1,
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": 1,
		"2_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_1AQwGx5xyBi5Fvv9WHJFMCMNtQhUc8UhQF": 1,
		"1_12Xj1w5HYu6w5xtEwwLyEiMYGuCqvYKL2q": 1,
		"1_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"2_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1,
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": [
			{
				"comment_id": 1,
				"body": "Elizabeth II is since 1952 Queen of the United Kingdom, Canada, Australia and New Zealand and  Supreme Governor of the Anglican State Church of England.\nThe Anglican State Church of England is a strong supporter of Gay Marriage, strongly financed by Jews also.\nAccording to historical evidences the British royals began consuming human meat and human blood centuries ago, around the time they adopted circumcision by Jewish rabbis after traditional Jewish ritual(including baby penis sucking). As they consider themselves superior to other humans like Jews do, centuries of inbreeding and incest did its work, porphyria became a serious threat. The Jewish rabbis possessed already the secret knowledge how to overcome this handicap and shared with the royals.\nhttp://www.philly.com/philly/blogs/evolution/120589149.html\n\nAn aboriginal man who claimed to witness the abduction of ten fellow residential school children by the Queen of England and her husband in October, 1964 in Kamloops, British Columbia. has died suddenly at the St. Paul’s Hospital in Vancouver.\nWilliam Combes, age 59 and in good health, was scheduled to be a primary witness at the opening session of the International Tribunal into Crimes of Church and State (ITCCS) on September 12 in London, England.\nAccording to his partner Mae, William was in stable health and was assigned a new doctor at St. Paul’s Hospital. William was then committed to the hospital for “tests”, and his health began to immediately deteriorate. He died suddenly of a still-undisclosed cause.\nThe Vancouver Coroner’s Office refuses to comment on William’s death.\nKamloops residential school in mid October, 1964, when both the Queen and Prince Philip were in Canada.\nWilliam was the sole survivor of a group of three aboriginal boys who claim to have witnessed the abduction of ten children during a royal visit to the  Kamloops residential school in mid October, 1964, when both the Queen and Prince Philip were in Canada.\n“They took away those ten kids and nobody ever saw them again” described William, in several public statements made over the airwaves of my former Vancouver Co-op radio program.\n\nScientific evidence of cannibalism by the British Royals.\nBritish royalty dined on human flesh, a new book on medicinal cannibalism reveals.\nhttp://www.mirror.co.uk/news/uk-news/royalty-dined-on-human-flesh-180262\nhttps://www.youtube.com/watch?v=UoWKg2O_Ad8\n\nMurdered woman found on Queen's Sandringham estate is missing 17-year-old Latvian, say police\nhttp://www.dailymail.co.uk/news/article-2083872/Body-Queens-Sandringham-estate-identified-Alisa-Dmitrijeva.html",
				"added": 1482498349
			}
		]
	},
	"comment_vote": {}
}