{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_1Gi1gKhUwd3SBAKYyGTyWvN1L6QHtf56SL": 1
	},
	"next_comment_id": 2,
	"comment": {
		"2_1Gi1gKhUwd3SBAKYyGTyWvN1L6QHtf56SL": [
			{
				"comment_id": 1,
				"body": "Let us see how the criminalistics works. In the most cases they are no hard evidencies just some hints to the crime.\nWhat we know.\n1. We know that Einstein was not good in mathematics but physic use extensively mathematics.\nLook at the mathematical complexity of the work of Maxwell or Heisenberg.\nWhat is the only way around ? Making experiments like Edison did or making observations like Tycho Brache did.\nNone of this did Einstein.\n2. Had he the possibility to steal ideas ? Oh YES. He worked at the patent office.\nAnd we know that he took not only ideas but even formulations.\n3. Now lets see similar criminal activity patterns.\na. Is just accidental that half of the Nobel prize winners are Jews, but only 1% of the western world population is Jewish ? Very improbable to be a coincidence.\nb. Does the Nobel Commettee giving his prizes on merit ? Or much more on purpose to create symbols and instruments ?\nTo find the answer look on the case of Malala, a girl (maybe unjustly) beaten by his father in Afganistan who received the Nobel prize for peace at 17 years.\nhttps://en.m.wikipedia.org/wiki/Malala_Yousafzai\nWhat she did for the peace ? Is somebody thrown out unjustly from the physics university liable for the Nobel prize for physics ?\n\n\n\nNow lets see the parallel.\nEinstein as Jew was persecuted and he had to flee from the nazi Germany.\nCreating a symbol of a genial scientist persecuted by a mad dictator was like a story from Star wars and this fascinated millions of young people, science and technic freaks.\nThe propaganda macinery of the nazi Germany fall in this trap, being anti-Jewish tried to combat the Relativity Theory itself and strengtened with it the legend of mad dictator Hitler against genial scientist Einstein.",
				"added": 1492848592
			}
		]
	},
	"comment_vote": {}
}