{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "Testerester",
				"added": 1475371472
			}
		],
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 2,
				"body": "sure, generalize an entire group for the actions of some of them, worthy of a two-digit IQ",
				"added": 1475371689
			},
			{
				"comment_id": 5,
				"body": "> [becoming](#comment_7_1FwTZnDZJjs2epEtq9yLy7m2P5kZ4TYqAR): You're doing nothing to stop the same happening against white men. White men being generalized as having contributed nothing but suffering to the world. White men being generalized as 'sexist' and 'rape apologists'.\n> I bet you've done nothing to fight the left's prejudice, but you're fine speaking out about the right's. Because you're a hypocrite. You cannot see the value of radical-rightism exposing the hypocrisy of the left, but instead choose to go on the offensive on the weaker movement, to score cheap political points.\n> That is why your criticism is unwelcome. You treat the radical right more harshly than you do the radical left - when the one that requires the harshest treatment is the one going unchallenged by moderates.\n> The only one with a low digit IQ is you.\nwell, yes I'm a hypocrite, however, you has assumed things of nothing, both sides of radicalism are cancerous in my opinion and nothing in my comment give a hint of my thoughts about the left., the hipocrisy of the left and his (eg) \"all white men are racists and sexists\" is equally awful,maybe more becouse of the false ideal of justice, my point just was that the emphasis that OP uses (ALL muslims and jews) is an absurd exageration, but whatever, this is just internet and nobody cares nothing. [my english sucks, I know]",
				"added": 1475635064
			}
		],
		"2_18Sh2Z83C23xdd6pjCq6NGv7Y6svEBcUfb": [
			{
				"comment_id": 3,
				"body": "Some countries actually can control the climate, but just in a short run, days or weeks at maximum, and just in some ways. No, the climate change is not something ex profeso, and no country alone or conglomerate has the power to do it now nor in the close future",
				"added": 1475372438
			}
		],
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": [
			{
				"comment_id": 4,
				"body": "His stupidity, is really funny, especially when i'm not american, so, I give a fuck about who of both assholes will win xD",
				"added": 1475372737
			}
		]
	},
	"comment_vote": {}
}