{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Moderation support on ZeroTalk?",
			"body": "Currently there is absolutely no way to block, report, or downvote threads or comments on ZeroTalk. This is a problem because I count no fewer than three disgustingly anti-Semitic threads on the first page - such content is not appropriate for *any* forum, and especially not for the discussion board most actively promoted by the ZeroNet software.\n\nWhat can be done about this? I'm aware that ZeroNet is built around a non-censorable architecture, which may make the outright removal of content impossible even by a privileged moderator, but allowing individual users to block and to downvote should be viable without restructuring the system. Thoughts?",
			"added": 1484787063
		}
	],
	"topic_vote": {
		"1_1ATpj32EgvgApKTmBq1KiY62B5UjzfSRJS": 1,
		"1_19Z8aJ32x4pE2iGvVssPJazJgpGe5L32rq": 1,
		"2_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": 1
	},
	"next_comment_id": 22,
	"comment": {
		"1_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd": [
			{
				"comment_id": 1,
				"body": "> [warlock](#comment_40_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1):  Debate them in a respectful manner, but don't feed them. That's my thought.\n\nYou can't debate fascists in a respectful manner - they're not arguing in good faith and will not be convinced by reason. Allowing literal Nazis to air their evil on your general-purpose discussion board *is* feeding them, certainly far more so than *not* allowing such would be. It's letting their views spread and perpetuate, it's letting them gain momentum, and all the while it's alienating good people who just aren't safe in a community with no practical way to escape fascist contributors.",
				"added": 1484822103
			},
			{
				"comment_id": 2,
				"body": "> [deafboy](#comment_39_1xf9XC4Nsa7YfQWFiK6xGsNDJA3AaCTUa): Osiris serverless protal had a nice feature. You could start a forum in anarchy mode and instead of following the \"official\" moderators, people could subscribe to the blacklist of whoever wanted to act as a moderator. Something like an adblock, but for the forum posts.\n\nThis is a really cool approach! I don't think it obviates the need for \"official\" moderators, but it's easy to understand, practical to implement, and provides a straightforward workaround for inept or corrupt moderation. Tools like [Block Together](https://blocktogether.org/) work similarly and have proven themselves effective. Awesome!",
				"added": 1484859793
			},
			{
				"comment_id": 3,
				"body": "> [warlock](#comment_43_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): You call them deplorable. You are bullying them. All the while you are sitting on your high-horse, but you are no better than they are. You are just different.\n\nActually no, I think you'll find I literally am better than fascists.",
				"added": 1484981993
			},
			{
				"comment_id": 4,
				"body": "> [enoch](#comment_13_1QH1N2BcCN6bQu1J98yUovsnnkvHn8TKhC): Antisemitism does not correlate with fascism which is an economic/political ideology (not based on race).\n\nThere's a *very* strong correlation between anti-Semitism and fascism. It's called the Holocaust.",
				"added": 1484990344
			},
			{
				"comment_id": 5,
				"body": "> [planespherev3](#comment_115_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): No. War between 2 jewish factions. Zionists/ Non Zionists. \n> NaZi = National Zionist (might be i'm not 100% sure). \n> https://www.youtube.com/watch?v=LO5sbwGCR7A\n\nAre you *serious*? \"Nazi\" is a contraction of the literal German name for the party, *Nationalsozialismus*. It absolutely does not mean \"National Zionist\", and the Nazis absolutely were not Jewish.",
				"added": 1485002762
			},
			{
				"comment_id": 6,
				"body": "> [warlock](#comment_49_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): That's retarded logic. This is equally valid:You want to sensor the expression of a certain opinion.Fascism also wants to sensor expression of certain opinions.If follows from your statement that by implementing sensorship of certain opinions, one gains fascism, thus anti-semetism.\n\nThe *literal goal* of the most notorious and historically most powerful fascist group - the Nazi party - is ethnic cleansing. Anti-Semitism, along with every other flavour of racism and discrimination, is implicit in that goal. Censorship, while effective in furthering fascist movements, is not intrinsic nor unique to fascism and has historically served more noble purposes (for example, [V-mail](https://en.wikipedia.org/wiki/V-mail) was subject to censorship).\n\nIncidentally, I don't want to \"sensor\" (sic) any opinions. \"Pineapple on pizza is disgusting\" is an opinion. \"Black/Jewish/Muslim/[insert any identifiable social group here] people aren't human and should all be killed\" is not an opinion - it is advocating for *genocide* and *does not deserve a platform*.",
				"added": 1485257186
			},
			{
				"comment_id": 7,
				"body": "> [planespherev3](#comment_126_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): This is not a platform you retard. This belong to all of us.\n\nUh, of course this is a platform? It's a website. It works differently from most websites, sure, but it's functionally equivalent in terms of spreading ideas.",
				"added": 1485268380
			},
			{
				"comment_id": 8,
				"body": "> [warlock](#comment_54_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): 1a) Saying that anti-semetism is inherit in Fascism is like saying that war is inherit in western democracy, since we've been invading a new country every third-fourth year (more or less) since the early nineties.\n\nLet's not pretend Western democracy is perfect. Nonetheless, it doesn't *require* anti-Semitism, because as an ideology democracy isn't built around racist ideas of purity and white supremacy. Fascism is.\n\n> 2) Yes it is an opinion, most people (me included) just happen to think it's outrageous.\n\nLet me put it this way: genocide isn't a *matter of* opinion. It's bad, and that's not up for debate. It's objectively a bad thing that should not be done or advocated.",
				"added": 1485268601
			},
			{
				"comment_id": 9,
				"body": "> [planespherev3](#comment_131_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): This is P2P internet. Either you deal with it or you get the fuck out.\n\nThat's exactly what I'm doing. I'm dealing with it by proposing and discussing possible solutions for moderation. Having a block button would be an excellent start - having shareable community blocklists would be even better, and both would not be difficult to support.",
				"added": 1485301340
			},
			{
				"comment_id": 10,
				"body": "> [warlock](#comment_58_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): The point is, it's my opinion that no opinion is better to be censored. Its universally better to deal with the opnion rather than removing it from its existence.\n\nGenocide *isn't an opinion*. Opinions are subjective, and people are free to have differing opinions and to talk about them. Genocide is objectively evil, and anyone claiming otherwise is objectively wrong.",
				"added": 1485301556
			},
			{
				"comment_id": 11,
				"body": "> [dantox](#comment_4_124r7zJTeBXwvYzBSd1FzxPViL3J967VWm): Agree perhaps completely.  If one blocks a user, in a sense that blocked user posts are not displayed when one reads a thread, is completely ok. \n> And if another wish to develop and maintain list of users to block, and people chose to use its lists to reduce noise in their custom render of threads, is also completely ok. If peepz choose which black list(s) to use (given that they do not have time, or do not wish, to maintain their own list). In this situation suppose they remain hidden from public if a maintainer knows each of his subscriber public key, but then each blacklist modification would have to be encrypted and pushed to each subscriber, and distributed by subscribers among them, i suppose.\n\nThis is a great technique and doesn't demand anyone trust particular moderators. If a blacklist maintainer disagrees with you on what should be blocked and what shouldn't, you can always spin up another one. Excellent.\n\n> I did not use aforementioned solution, but what i would find useful is that i subscribe to more than one blacklist maintainer, so blacklisted users that are not in the intersection of my subscribed lists get deprioritized in render rather than completely blocked. In an example, i may agree with 00d4n1 what is noise in moderation subforum, but i probably will not agree with him on what is noise in e.g automobile subforum\n\nFascinating! I'm envisioning that you could employ different \"levels\" of blockedness, so if several lists agree that a user is Dangerous and Abusive then you get a definite block, whereas if one list says Abusive and others just say Mildly Annoying you might just get them deprioritised. Sort of like the PGP web of trust system, except for distrusting instead. A block for \"Off Topic\" would perhaps only be considered at all in the context of a particular subforum, and so on. There's a lot of interesting stuff you can do here! (Oh, incidentally: I'm her, not him. :0 )",
				"added": 1487124846
			}
		],
		"1_127xneP1vvFJyc6SQZNzh2hyrkBuezpcvr": [
			{
				"comment_id": 12,
				"body": "> [yinyue](#comment_11_1GNgaj5EqkzqYECYbXa889fGLyuseHRi3t): This idea is a bad idea for the whole zeronet world. Someday somebody will add a plugin to limit upload speed ,in that time ,zeronet will be bad to use.\n\nThat's a different idea though. torezen's idea doesn't inhibit seeding of the zites you care about, it just keeps you from redownloading and then seeding zites you don't.",
				"added": 1489551431
			}
		],
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 13,
				"body": "ZeroNet needs a blacklist option so that I don't have to seed anti-Semitic garbage like this.",
				"added": 1489551859
			},
			{
				"comment_id": 14,
				"body": "> [yinyue](#comment_12_1GNgaj5EqkzqYECYbXa889fGLyuseHRi3t): You can do it by click here :)\n\nHuh. That's an improvement on last time I used ZeroNet - but, does that actually stop me from *seeding* content published by that user, or just *hide* it?",
				"added": 1489552674
			},
			{
				"comment_id": 15,
				"body": "> [yinyue](#comment_13_1GNgaj5EqkzqYECYbXa889fGLyuseHRi3t): Just hide it,hide his/her messages in the whole ZeroNet,so if you block he/she,you can NOT see he/her anymore.Because of you have NOT his/her private key ,so you can NOT delete it . Say something is his/her freedom.\n\nEh, I mean, of course I can't delete someone else's content, since I don't have their key and also it'd be The Dreaded Censorship. But if I'm *seeding* content like this thread, I'm actually spending my own computing resources on distributing anti-Semitic garbage, which I'd prefer not to do. Freedom of speech doesn't imply freedom to make innocent non-Nazis' computers spread your speech, y'know?",
				"added": 1489554411
			},
			{
				"comment_id": 16,
				"body": "> [a2f7](#comment_1_1NQ2rUT8zy9oPKG3ye7hZdrujyC9JmmuFY): ZeroNet needs a JewList option so that I don't have to seed Jewish garbage like this.\n\nDon't worry, adding a blacklist option will let you be as much of a Nazi as you like. I just won't be seeding you any more, because you're a fucking Nazi.",
				"added": 1490138384
			}
		],
		"2_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": [
			{
				"comment_id": 17,
				"body": "> [alaric](#comment_8_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY): Because ZeroNet is currently one of the only real platforms out there for free speech. You can say whatever you want without being censored. But having free speech doesn't mean you're not free from criticism. For every comment like whitethunder's below, there's someone calling him out on his racism.\n\nDeleting whitethunder's comment since it's disgustingly racist *isn't* a violation of free speech. You can stand for freedom of speech without supporting that shit. https://xkcd.com/1357/",
				"added": 1490571676
			},
			{
				"comment_id": 19,
				"body": "> [planespherev3](#comment_187_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): By the way, they are sure obsessed about Jews, but you're undoubtedly obsessed about Nazis, something which almost completely disappeared more than 70 years ago.\n\nThe conversation thread you're in right now is full of Nazis. Last I checked, ZeroNet didn't exist seventy years ago.",
				"added": 1491017836
			},
			{
				"comment_id": 20,
				"body": "> [alaric](#comment_12_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY): That's all well and good when you're talking about free speech within a country like the United States - Which the xkcd comic is actually referring to. The internet is a different monster altogether. It's not owned by a country or regulated (at least it shouldn't be). \n\nThe xkcd comic is referring to the *only* concept of free speech that exists - which is that the government can't arrest you for what you say. It's not meaningful to discuss free speech on the Internet, because as you rightly point out the Internet doesn't have a government. Like Randall said, \"if you're yelled at, boycotted, have your show canceled, or *get banned from an Internet community*, your free speech rights aren't being violated.\"",
				"added": 1491018281
			},
			{
				"comment_id": 21,
				"body": "> [alaric](#comment_13_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY): Yet the very definition of freedom of speech specifically refers to censorship: \"Freedom of speech is the right to articulate one's opinions and ideas without fear of government retaliation or censorship, or societal sanction.\"  [...]\n\nNotice how it says \"government retaliation or censorship\"? The modifier \"government\" applies to both of those words.",
				"added": 1491798110
			}
		],
		"1_19Z8aJ32x4pE2iGvVssPJazJgpGe5L32rq": [
			{
				"comment_id": 18,
				"body": "> [border0464fred](#comment_85_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): Looks like this Guy/Gal is hating the haters. how Ironic.\n\nThat's not ironic. Hating bigots is a normal and expected thing for a decent person to do.",
				"added": 1490572867
			}
		]
	},
	"comment_vote": {
		"39_1xf9XC4Nsa7YfQWFiK6xGsNDJA3AaCTUa": 1,
		"13_114htPrU5VWip9ohwc6AnSvnpKpCdPKFqY": 1,
		"1_15P6GFRCWwkfUEo2g8nm22epWiF4np3Dob": 1,
		"113_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS": 1,
		"2_124r7zJTeBXwvYzBSd1FzxPViL3J967VWm": 1,
		"3_124r7zJTeBXwvYzBSd1FzxPViL3J967VWm": 1,
		"58_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6": 1,
		"5_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": 1,
		"5_1GuYKebkQAqGJ4tNpNp4TD1UuoHHudCJLA": 1,
		"12_1GNgaj5EqkzqYECYbXa889fGLyuseHRi3t": 1,
		"1_13EUVTHXUNK46bs3QXB8AtJ6sxPXcSQh31": 1,
		"2_1PuEpLmGzwDtWzVn96wr8iyzyubM5YFQoX": 1,
		"37_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9": 1,
		"38_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9": 1,
		"5_14nCEDo97Cx4VpSHwPytWvacPo29Y7FAbk": 1,
		"3_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": 1
	}
}