{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_14gU7BmDVYaUD6b1fks74MQv6XtsCnAgEX": 1
	},
	"next_comment_id": 195,
	"comment": {
		"1_1AhXDbKvcLap7TcS2542J7bFYzKHM3xeRU": [
			{
				"comment_id": 1,
				"body": "> [binero](#comment_117_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Because the UK is a very unrepresentative democracy, and doesn't even respect seperation of powers.\n\nRepresentative democracy isn't democracy (direct democracy is the only real democracy). So i can't even begin to contemplate what an unrepresentative representative democracy is.",
				"added": 1480198824
			},
			{
				"comment_id": 2,
				"body": "> [binero](#comment_119_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Representative democracy is, how I see it, the only practical form of democracy. You cannot have a referendum on everything\n\nIf you want to have something \"practical\" (before you should ask Switzerland how they do to vote 2 times a month), then take an interest in liquid democracy (aka delegative democracy). Far better then representative democracy.",
				"added": 1480286854
			},
			{
				"comment_id": 3,
				"body": "> [binero](#comment_120_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): I kid you not, but I never knew such a system had been thought out. I have been wondering for years why that's not how we do it. I've been calling it proxy-voting. I would 100% support such a system.\n\nYes liquid democracy is not popular enough even if it is a more \"democratic\" system. The mainstream medias don't talk about it at all.",
				"added": 1480331342
			},
			{
				"comment_id": 4,
				"body": "> [binero](#comment_123_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): I would understand why. It's not relevant atm.\n\nI think it's because the republic, and representative democracy, is the cherished system of the Capital. The capital really took off when republics were instigated in western europa. Today, almost every developed country has a republic as a political system. The reason for it is because it's easier to buy 500 representatives (in a parliament) than a king, a dictator (who are all-powerful) or all the citizens (in this last case,  if the political system is a direct democracy). We know that there is a lot of conflict of interests in the EU institutions, especially in the EU commission and the EU parliament. For us citizens conflicts of interest are a problem, but the capital like them. He is the one buying representatives. \n\nI think the future of the capital (if we don't stop the process one way or another) is not even a republic anymore, but a pure technocracy. Like the European commission which has law initiative in the EU but isn't elected.\n\nLiquid democracy would mean more democracy (although for me there is democracy or there isn't, but i can accept that liquid democracy is somehow better than representative democracy but not as good as direct democracy).\n\nThus, more democracy isn't in the Capital best interest. The Capital would like a pure technocracy (which isn't a democracy at all) better.  That's why mainstream medias, which are owned by the capitalistic class, don't talk about liquid democracy.",
				"added": 1480373950
			},
			{
				"comment_id": 5,
				"body": "> [binero](#comment_125_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Eh? Socialists and communists alike are both in our federal and local parliaments, and our country has been run by socialists for decades until the populists finally took over this legislature.\n> I don't oppose a state. It organises, it provides logistics. Again, I don't see direct democracy working on any larger scale than a village.\n\n> [binero](#comment_125_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Eh? Socialists and communists alike are both in our federal and local parliaments, and our country has been run by socialists for decades until the populists finally took over this legislature.\n\nIf they want money, if they want a state, they are not communists, but state capitalists. In my country, there is not a single political party which propose the abolition of money and the state.\n\n> I don't oppose a state. It organizes, it provides logistics. Again, I don't see direct democracy working on any larger scale than a village.\n\nHave you heard about revolutionary Catalonia (1937, before it was crushed by the republic)?",
				"added": 1480461520
			},
			{
				"comment_id": 6,
				"body": "> [binero](#comment_126_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): \n> Yes. It was ironically a very unjust rule, killing thousands, and above all, still had a state with ministers.\n\nSo you haven't really read about it, or you mistake the anarchists with the communists during revolutionary Catalonia.\n\nI'll copy past  wikipedia, about the workers self management during revolutionary Catalonia:\n\nhttps://en.wikipedia.org/wiki/Revolutionary_Catalonia#1936_Revolution_and_worker.27s_self_management\n\n \"Anarchic communes often produced more than before the collectivization. The newly liberated zones worked on entirely libertarian principles; decisions were made through councils of ordinary citizens without any sort of bureaucracy. \"\n\n(...)\n\n\"If you didn't want to join the collective you were given some land but only as much as you could work yourself. You were not allowed to employ workers. Not only production was affected, distribution was on the basis of what people needed. In many areas money was abolished. People come to the collective store (often churches which had been turned into warehouses) and got what was available. If there were shortages rationing would be introduced to ensure that everyone got their fair share. But it was usually the case that increased production under the new system eliminated shortages.\"",
				"added": 1480464323
			},
			{
				"comment_id": 7,
				"body": "> [binero](#comment_129_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Regardless, I cannot have confidence in it just because it worked for a couple of years. Such a system sounds very unrobust, with a tendency to collapse into a state again. It also seems like no everyone agreed with the lack of a state either.\n\nRegardless, I can have confidence in it just because it worked for 148000 years.",
				"added": 1480539155
			},
			{
				"comment_id": 8,
				"body": "> [binero](#comment_130_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Did it though? Seems to me we live in organised states now.\n\nThe state is a concentration camp. \n\nJust a few years ago, when an ancom wrote this in a forum, i usually got really upset.\n\nBut when you think about it, and when you understand that the capital needs a state in order to enforce debt, collect taxes, and manage money (with the use of coercion), then you realize it makes sense.",
				"added": 1480547339
			},
			{
				"comment_id": 9,
				"body": "> [binero](#comment_131_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Debt can be privately enforced. Taxes are not unique to capitalism. Money can be independantly organised. We choose the state as clearly the state works best.\n\nLike cages work better for animals: they have a longer longevity and a lower death rate than in the wild.",
				"added": 1480551412
			},
			{
				"comment_id": 10,
				"body": "> [binero](#comment_132_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Yes. Consider me pro-cage.\n\nI hate cages. I always hated zoos and circuses.",
				"added": 1480629008
			},
			{
				"comment_id": 11,
				"body": "> [dud](#comment_3_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG): \n> Coercion is coercion, no matter who is doing it, and if it had to be done in an anarchic society, I feel that the state would come back rather quickly, as the wealthier would organise to keep themselves away from the savagery so below. In fact, anarchy is only ever achievable if all are free, and free to collaborate and contribute. Not being coerced into contributing into any ways, because if that has to happen, the wealthier will just run off with their money. \n\nYou haven't read what's written a few posts below. During the Revolutionary Catalonia (1937), people were allowed to keep their real property if they wanted to. \n\nI your post you talk about money, money, money and money. (quoting you: \"taxation, taking their money, wealthier, run off with their money, sponsored, platinium Visa card, two cents\"). \n\nDuring revolutionary Catalonia there were some eras which functioned totally without money. So the problem about the wealthier fleeing or the visa in the Ghetto would simply not exist anymore. \n\nSeriously, have you ever considered a world without money? Have you ever imagined how everything would be different in a positive way, regarding friendship, love, our activities, our studies, leisures, food, medicine, and almost everything else?",
				"added": 1480679380
			},
			{
				"comment_id": 12,
				"body": "> [dud](#comment_5_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG): Money is merely a value attributed to common goods, and was that way ever since it was invented. Without money, we can not have an estimation of the value of items, wheter demanded or given, and that is all it is. And I did read about the revolutionary Catalonia, but to me it is not a good example, having lasted only a few years and being composed of communists and anarchists, which are naturally opposed to each others.\n\n >Without money, we can not have an estimation of the value of items,\n\nWe could if we used other criterias than how much people are willing to pay. Criterium like : are the raw material which compose this item rare or abundant, is the item easy to produce or not, could we manufacture it in large quantity etc... With these criterias, we could address a value to an item, and decide if it must be produced massively and shared, or kept for specific usages. \n\nAlso, in capitalism, some items are not valued, however, they are immensely valuable. One of the best examples is helium, which is cheap but very rare on earth. Or biodiversity on the rainforest. We destroy it but it is a treasure regarding health correlated molecules allowing to cure diseases. \n\n> Money is merely a value attributed to common goods\n\n\nIn every dollar or euro bill, there is speculation, hierarchy, 2 class society, theft, scarcity, greed.............\n\nMoney means circulation of goods,  exchange, and private property. \n\nMoney is opposed to homo sapiens nature. Goods aren't supposed to circulate, but be consumed from the source. Their is no exchange, but sharing. Private property also doesn't exist regarding homo sapiens in his natural state.\n\nAnarchy cannot exist until most of the people are convinced that capitalism is inherently a shitty mode of production. \n\nForcing people to accept anarchy isn't possible. Otherwise they'll always rally to the state and to money.  They must understand the concept, and agree that it would be better than a state and money based society. The breaking point is about 80% of the population. Then nothing will be easier than to change our society to an anarchic one.",
				"added": 1480714194
			},
			{
				"comment_id": 13,
				"body": "> [thisweb11](#comment_124_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM):  He had a lot of good, inspiring and fascinating things to say about the anarchists in Catalonia (in Homage to Catalonia) , he fought alongside the anarchist militias against Franco,  and later concluded \"If I had understood the situation a bit better I should probably have joined the Anarchists.\"\n\nI read about 1984 more than 10 years ago, and every bobo in every western city has read 1984. However, i just discovered Homage to Catalonia recently. \n\nI think Homage to Catalonia is even more important than 1984, because it's not a fiction, but a biography of a period of Orwell's life. What's more it's a testimony, extremely well written (it's Orwell) of functional  anarcho-communism, not in the primitive tribe, but in modern era,  just 80 years ago.",
				"added": 1480714699
			},
			{
				"comment_id": 14,
				"body": "> [thisweb11](#comment_129_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): \n> I tried to find that book but its out of print (no suprise!) .  Have you read it?  I'm keeping my eyes peeled for a copy. I want to read the book Orwell himself most wanted us to read!\n\nI didn't know about it. Thanks for the information, i'll try to find it.",
				"added": 1480772044
			},
			{
				"comment_id": 15,
				"body": "> [thisweb11](#comment_132_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): \n> If you want to talk about stalinist communism thats fine, but please be clear about what you mean by 'bunch of communists', because the similarity between stalinist communists who support a state and anarchists is so near non-existent that anarchists sacrificed their lives fighting against them.  See  Bolsheviks and Spanish civil war. .\n\nYes the Capital (the society of the spectacle through mainstream medias owned by the capitalistic class to be more precise), succeded in discrediting communism by associating it systematically with Stalinism and Bolshevism. \n\nI was myself myslead by it until about 2 years ago. Before, if you talked to me about what is communism, i'd have answered something like \"an ideology which killed dozens of millions of people\". However, in France, there is an extremely eloquent radical marxist named Francis Cousin which was invited to a webTv (metaTV), about 2 years ago.  Later he did other videos on youtube. \nHe explained everything about the distinction between Bolchevism (Leninism, Trotstkyism), Stalinism, which were based on state coercion,  and radical marxism (which is anarcho-communism). \n\nWe need more people like him in each country native langage, in order for everybody to understand the difference between state capitalism (bolchevism) and radical marxism (anarcho-communism).",
				"added": 1480772886
			},
			{
				"comment_id": 16,
				"body": "> [binero](#comment_134_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): This was part of our high school curriculum. Still, no one was convinced.\n\nMaybe your school teacher had the charisma of a lizard in a nappy compared to Francis Cousin. You're Swiss aren't you? (i guessed..., or maybe Scandinavian...) Anyway if you speak french take a look.",
				"added": 1480790911
			},
			{
				"comment_id": 17,
				"body": "> [dud](#comment_8_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG): \n> Don't try to tell me I'm oppressed by working, I am not. I am a working class person and I don't think there's any wrong with that.\n\nI could refute most of your argument rationally, but this end of the week, i have no desire to do so. As anarcho-communists, the time is with us (because it's homo sapiens true nature (primitive tribe)). So whether our ideals prevail in 1 year or in 100, it doesn't matter.\n\nInstead i'll just ask you  questions.\n\nYou said you're from the working class. \n\nAre you happy to work for the owners of the means of productions, who make (the real) profit from your work? Wouldn't you prefer to work for yourself or at least for the whole community instead?\n\nDo you like your job so much that you wouldn't do any other thing during the time you work? Or do you just work so you can pay your bills and your rent?",
				"added": 1480810168
			},
			{
				"comment_id": 18,
				"body": "> [dud](#comment_11_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG): But how do you determine the value of a labour? That's the main question.\n\nThe value of labor is the price the owners of the means of production are willing to pay a worker for a particular work. It varies on many factors, the market, the quantity of workers available for this particular job on the market. \n\nAnyway from an other point of view it seem you didn't understood the tendency of the rate of profit to fall problematic. \n\nEven you, having a good job, will be replaced by machines sooner or later, and the rate of profit will fall since only work creates profit, machines don't create it. (yes the first time someone hear this he thinks it's nonsensical but read the wikipedia article about the tendency of the rate of profit to fall and you'll understand).\n\nIf you cannot be replaced, because you have one of the few intellectual jobs that cannot be automatized (computer scientist, researcher, engineer), then it won't change anything because a whole society cannot function with only 10% of people working and 90% being unemployed, or even having UBI. There would be too much frustration in the end.",
				"added": 1480849651
			},
			{
				"comment_id": 19,
				"body": "@dud\n\nHomo sapiens is not supposed to exchange but to share. He is not supposed to work for others but for the whole community, and do as he like the rest of the time (in the primitive tribe, people work (means hunt or gather) about 2-3 hours a day, the rest of the time, they mostly do what they want).",
				"added": 1480852402
			},
			{
				"comment_id": 20,
				"body": "> [dud](#comment_8_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG):\n> Capitalists do not exploit others labour, they recompensate other for the production of a product that is not their original idea. Capitalism recompensate ideas, and those who help them achieve their ideas.\n\nMaybe in some high tech domains, it could make sense, but what if the owner of the mean of production manufacture generic screw drivers, low quality shoes, or milk? Were is the value of the original  idea in these examples? \n\n >If it was \"exploitation\", then you likely wouldn't be paid. Marx called the product of a labour \"labour-power\", and that it was the item they were selling. \n\nExploitation doesn't mean they aren't paid at all, but like binero said, that they are paid less than the value their work produce. Workers are more and more exploited, since the production increase considerably the last decades more but the wages didn't follow proportionally at all.",
				"added": 1480855258
			},
			{
				"comment_id": 21,
				"body": "> [binero](#comment_141_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Bogus. If you don't pay your debt, you won't see any violance.\n\nWhat about the millions of people who saw their house seized after the sub-prime crisis (2008), and still live in tents? \nBeing forced to leave your own house with your family under coercion and live under a tent isn't (direct) violence for you?",
				"added": 1480941772
			},
			{
				"comment_id": 22,
				"body": "> [binero](#comment_145_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Humans aren't worth their labour. How do you determine the value of their labour? Is it worthless to you?\n\nLabor isn't supposed to exist. Also, value isn't supposed to exist. These concepts only exist since the neolithic revolution (12000 BCE).",
				"added": 1480942969
			},
			{
				"comment_id": 23,
				"body": "> [binero](#comment_152_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): We're not talking about violance to start a revolution. We're talking about violance comitted out of evilness. Regardless of how utopian a society is, there will always be violance comitted. \n\nIn the primitive tribe the response to such acts of violances are immanent. The responsible is shunned or if he pursue, perhaps banned.\n\nSince it's not possible for a 7 billion humans tribe to be immanent, violence should be exerted by citizens randomly drawed, or elected through direct democracy.\n\nIn a non capitalistic society, evilness should considerably decrease anyway. There would be no reason to steal anymore. \nAs for rape, most rapist today are social misfits, so they would also disappear in a non monetary world.",
				"added": 1480943474
			},
			{
				"comment_id": 24,
				"body": "> [binero](#comment_153_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Saying capitalism is political is just being intellectually dishonest. You can implement capitalism under any form of political system, be it a totallitarian dictatorship or a direct democracy, be it a far rigth nationalist state or a far left socialist state.\n\nYou have it upside down. You don't implement capitalism. Capitalism is the whole of the world today. You don't implement capitalism under any form of political system, but you implement any form of political system under capitalism. \n\nThe capitalism mode of production is the foundation of our world, and all the political systems are just different flavors, but they are all capitalistic.\n\nNazism, Bolchevism, liberalism, socialism, Maoism, Castrism (Fidel Castro), Even north Korea is state capitalist.",
				"added": 1480943745
			},
			{
				"comment_id": 25,
				"body": "> [binero](#comment_156_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): What's the difference with what we have today? The only difference is the monopoly of violance is held in an organised structure.\n\nToday, the cops are not here to defend the people, but the system. (The sub-prime example summarize it).\n\nThey are paid, they are given wages, so the system can function. \n\nWhen there were the firsts agrarian stocks, it was also the beginning of theft. Before, there was no theft, since there was no stock. Everything was consume directly from nature. When humans begin to stock, necessarily, theft came. So the first owners of these stocks (first owners of the means of production) paid some people in order to defend the stocks. The police was born. The police is born from private property. They are a consequence of private property, and their reason of being is private property.",
				"added": 1480980376
			},
			{
				"comment_id": 26,
				"body": "> [binero](#comment_157_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): There will always be stock to steal from, whether there is private property or not. The police aren't paid to protect the system, they are hired to enforce the law made by the people.\n\nAlways, certainly not. If we live in a world post scarcity, and scarcity mostly reside in our minds, then i don't see the point of theft.\n\n>\"they are hire to enforce the law made by the people\"\n\nSo the system says. \n\nIn the end, people participate in their own imprisonment. And that what direct democracy will be in the future: prisoners of the capital, managing their own prison. However, it is a necessary step in order to finally go back to real anarchy again, in a far future.",
				"added": 1481016752
			},
			{
				"comment_id": 28,
				"body": "> [binero](#comment_158_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Ironic how you call a word without any stock one without scarcity. \n> \nBefore there wasn't any stock, all was consumed directly from nature. In the future, the stock would be so important that there would be not scarcity anymore (but it must be managed carefully regarding natural ressources).",
				"added": 1481102328
			},
			{
				"comment_id": 29,
				"body": "> [rcastanonz](#comment_2_1PGFKCfMSL1QdudndfYCo4mGM8E8XKzMMG): I want to add one question to this discussion, sorry if my english is broken but I thought It is important to address it. \n> I advocate anarchism (anarcho-communism, RBE, Voluntarism whatever you call it) for being one the fairiest way of producing common wellbeing meanwhile assuring the individuals autonomy. But I'm really concerned about one thing right now.\n> A horrendous case of social injustice just happened today: A 7 years old girl was kidnapped, tortured, raped and murdered here in Colombia.\n> http://www.latintimes.com/rafael-uribe-noguera-colombian-man-arrested-alleged-kidnapping-rape-murder-7-year-old-406369\n> I would like to ask to the people here, what will anarchism do to prevent this happen? maybe education will be the answer, perhaps interconnected public surveillance, mental illness health care?\n> What do you guys think?\n\nAs i told, most of the crimes are a result of our alienated mode of production. Do you see such crimes in the primitive tribe? Certainly not. \nCapitalism creates crazies. It's pretty obvious, and there has never been so many crazies since we entered the capitalistic era. \nThe recent John Podesta affair illustrates it.",
				"added": 1481102674
			},
			{
				"comment_id": 30,
				"body": "> [binero](#comment_158_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Ironic how you call a word without any stock one without scarcity. \n> \n> You didn't make any argument for anarchy but just evaded the entire point. If the police enforces the law by the people, and people will always make these laws regardless of the political system (as you clearly impleid with \"people will participate in their own imprisonment\"), then anarchy is not an issue but a problem.\n\nIt's about inertia. You don't change someone in a day, and you don't change a society in a year. It will take decades, possibly even more. Of course it's only possible since the horizontal society made possible by the internet. \n\n> It seems like you are more concerned with changing human nature than actually implementing anarchy. Direct democracy, sure, but direct democracy can be done in a state. Most recent public votes have not turned out well. It's what kept prison slavery in the US, got the UK to Brexit and started a movement to ban abortion in the EU. I'm a mild supporter of direct democracy, as I said, but one has to wonder, do we really want to trust people with such a powerful tool when it seems they are more moved by emotion than facts.\n\nI trust the people more than our representatives.",
				"added": 1481103328
			},
			{
				"comment_id": 35,
				"body": "> [binero](#comment_160_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Who says anarchism won't just die out? \n\n\nBecause it's written in your DNA.",
				"added": 1481204889
			},
			{
				"comment_id": 43,
				"body": "> [binero](#comment_162_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): If you'd ask most other people they'd claim the opposite. Organised structures is what's in our DNA. \n> The state has brought humans to their greatest successes.\n\nWhat the state and  money are in our DNA? \n\nBinero, have you watched (serious) documentaries about the primitives societies? Are they organized structure? Not really.",
				"added": 1481236633
			},
			{
				"comment_id": 44,
				"body": "> [binero](#comment_162_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): \n> The state has brought humans to their greatest successes.\n\nWhat fucking up the planet and making humans killing hundred of millions of other humans? That the greatest successes? \n\nIf i had the choice, i would prefer to live before the neolotic revolution (primitive communism), or in the middle age (during feudalism), which wasn't so bad when you study it just a little (direct democracy in the cities during this era, longevity of 70 years contrary to the common belief,  and single women could work and even be healer or crusaders,  but nobody talk about it...).",
				"added": 1481236972
			},
			{
				"comment_id": 45,
				"body": "> [thenineswords](#comment_3_1KdH7Rbk9viJxmJ3SApQR6ZpB8iYAN35gR): dna is the genetic code that dictates the physical body it does not dictate what you choose to think and believe also be very careful on researching \"primitive\" societies/civilizations our history is not not what you think and has been rewritten many times to fit the global elites agenda\n\nYes i know. But i don't talk about it here because it could affect the credibility of other important subjects i'm talking about.\n\nHowever, you cannot deny that the last primitive tribes still living, and many others which still lived in the beginning of the 20th century (now disappeared) and are well documented: they are anarchist and communists. Whether it's in the DNA or not, when living totally in nature, homo sapiens organize himself like this. \n\nI don't think our best way to live is with money and hierarchy. You must know it's pretty obvious. If it's not printed on our DNA to be anarcho-communist, then living like this is still better than living with hierarchy and class society, and the last homo sapiens living in nature are proof. They are way more sane than us. \n\nBy the way, since you're into this stuff, what is their most powerful tool to keep people under control? Money. And hierarchy (delegation of power, which contradicts the primitive tribe organization).",
				"added": 1481239973
			},
			{
				"comment_id": 47,
				"body": "> [thisweb11](#comment_190_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): anarchism is the solution to everything including but not limited to:     violence, racism, misogyny, poverty, crime, prisons, prostitution, work, poor childcare, censorship,  boredom, climate change, pollution, lack of innovation, missinformation, bankers, advertising,  war, politicians, bureaucrats, police, dead zones of the imagination and all round joylessness.\n\nYes but most people keep thinking that their small savings in their bank accounts is worth not taking the risk of a new world. \n\nThis, and also they don't realize (yet).",
				"added": 1481401809
			},
			{
				"comment_id": 48,
				"body": "> [binero](#comment_164_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Good for you. Most people like the internet. You seem to like it too.\n\n\nIn the middle age, people ate about 600 grams of meat each day (i'm vegetarian but just to prove they weren't starving or eating hard bread everyday like we are supposed to think). What's more, and that's interesting, they drank 3 liters of wine every day. Hard to believe but it's the truth.\n",
				"added": 1481415311
			},
			{
				"comment_id": 49,
				"body": "> [binero](#comment_164_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Good for you. Most people like the internet. You seem to like it too.\n\nInternet is the tool that was needed to realize anarchy again. It' an horizontal media. The first since verbal speaking in the primitive tribe. The one to connect each humans without any intermediaries. \n\nWhat's more, it's only rumors, but i read that Arpanet was designed by anarchists. For the benefit of the US government, of course, but possibly by people who knew from the beginning what it was and what it could accomplish once in the hand of the people.",
				"added": 1481416544
			},
			{
				"comment_id": 51,
				"body": "> [binero](#comment_167_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Source? I can only find sources which say in Medieval times, most people did not get to eat a lot of meat. \n\nhttp://medieval.mrugala.net/Alimentation/",
				"added": 1481541085
			},
			{
				"comment_id": 52,
				"body": "> [binero](#comment_168_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): There was no internet in primitive tribes, and there would have never been any.\n\nThis is not mainstream but they potentially  can access far greater networks than the internet with Ayahuasca.\n\nI am not sure if it's true (i didn't try), but i tend to think it's real.",
				"added": 1481541337
			},
			{
				"comment_id": 55,
				"body": "> [binero](#comment_174_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): The highest number I can find on that page is 70 grammes per day, which is barely a tenth of your claim, and still under the average today.\n\nSo you still need to improve your french: in this same page: \"En 1397, à Berlin, on mange 1,3 kg de viande/j.\"  /j means: per day.\n\nAlso, in case this last figure is somehow wrong: \"En 1307, à Francfort sur Oder, on mange 100 kg de viande de boeuf/h/an.\"\n\n100 kg of beef meat per year is a little less than 300 grams of beef per day, and beef only. They also ate other meat, mostly pork.",
				"added": 1481640927
			},
			{
				"comment_id": 56,
				"body": "> [binero](#comment_173_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): It's hillarious to even suggest that a hallucigenic could somehow replace the internet.\n\nI don't know, maybe you should try and then you'll give an other answer.",
				"added": 1481641065
			},
			{
				"comment_id": 57,
				"body": "> [binero](#comment_176_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Anecdotal evidence is invalid evidence. Even if I would make such a claim, that wouldn't make it true and it would likely have to do with the fact it's, again, a hallucigenic. That's like saying God is real because you saw him while you were on LSD.\n\nThe fact that most people experiencing it begin to believe in non material things is itself intriguing, from a \"rational\" point of view. Even some hardcore scientists doing researchs about it totally changed their mind and their conception of reality after experiencing it. But you're right, it doesn't \"prove\" anything.",
				"added": 1481649275
			},
			{
				"comment_id": 59,
				"body": "> [binero](#comment_177_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): You're right. Let's change the world with magic.\n\nMagic is just science we don't understand.",
				"added": 1481743807
			},
			{
				"comment_id": 61,
				"body": "> [binero](#comment_178_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): And science we don't understand is useless.\n\nNot necessarily. Take into consideration LENR. Mainstream scientist don't understand, but it could be very useful.",
				"added": 1481753416
			},
			{
				"comment_id": 63,
				"body": "> [binero](#comment_180_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): A new system won't change the people in it. Since the dawn of time there have been pricks.\n\n Since the dawn of    ̶t̶i̶m̶e̶ civilization there have been pricks.\n\nYou don't understand there is something inherently wrong with civilization. Something linked with delegation of power and abstract value like money. Okay it's comfortable to have electricity and networks but this whole social organization is flawed. We must only keep the technology but change almost everything else.",
				"added": 1481837417
			},
			{
				"comment_id": 64,
				"body": "> [binero](#comment_185_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): We understand gravity.\n\nI'm not a scientist but... No. At best only theories. And some scientists (like Tesla and more recent ones) think it's only a form of electromagnetism.",
				"added": 1481837675
			},
			{
				"comment_id": 65,
				"body": "> [binero](#comment_184_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): (about capitalism and money). It's been proven to work.\n\nIt works but the price (in emotional and physical suffering of humans and animals) is too high.",
				"added": 1481837746
			},
			{
				"comment_id": 75,
				"body": "> [thisweb11](#comment_216_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): It may.  Bitcoin has the potential to destroy the greatest power from the state (of all states).  If you want to pay an army, you have to control the currency.   Bitcoin wont allow that.   The next big global economic collapse will likely make bitcoin (and cryptodata/cryptocurrencies in general)  only currency people will want to use.  When that happens, the govnt is out of control.  If it can't pay its armies and police in bitcoin its doomed.  Watch this space.\n\nI wonder if Satoshi (or the group behind his name), isn't some anarchist genius who knew exactly the potential consequence of the bitcoin core technology. ZeroNet is probably the  best example today.",
				"added": 1483569778
			},
			{
				"comment_id": 82,
				"body": "> [warlock](#comment_3_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): This is funny. To me Anarco-communism doesn't make any sense. Anarchism means no rulers, and communism wants a society where everything is shared, now it is obvious that not all humans want this, thus it has to be enforced. Oh hi, ruler!\n\n\nIn revolutionary Catalonia, private owners were allowed to keep their exploitation, but not more than they could exploit themselves, and they weren't allowed to employ workers. \n\nSo it's was, and it wasn't enforced. Let's say half enforced. \n\nPrivate property of the means of production is also currently enforce towards the majority. \n\nI don't think most humans on the planet think that's fair that 67 person own half the planet: http://www.forbes.com/sites/forbesinsights/2014/03/25/the-67-people-as-wealthy-as-the-worlds-poorest-3-5-billion/#120d360790ab\n\nAnyway if we concentrate toward open hardware and sharing of the means of production we won't even have to enforce anything to the 99%.\n\nI think currently open hardware/ patent is key to accelerate the process.",
				"added": 1483910043
			},
			{
				"comment_id": 83,
				"body": "> [warlock](#comment_8_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): You're avoiding my questions. The machine is so complex you wouldn't be able to copy it. (It's a thought experiment and you're not smart enough to even recognize that, and you think you have the question of all of the worlds problems. Jesus christ).\n> Anyway, assume I can produce something and sell it for huge amounts gold. (Yeah, I know. In your fantacy world it wouldn't be valuable. Forget your fantacy). I could see it for huge amounts of freeze dried food. Or whatever is valueable. Just answer the question.s If you cannot answer such basic questions how are you going to convince 7 billion people to live with unicorns under your rainbow?\n\nThe answer is simple: you're a greedy person. But it's not really your fault since you were born in this society. In a boxing match, you can't blame one boxer to hit the other in the face: it's the rule. However, there are other sport to practice, and even fighting sport less violent (wrestling, jiu jitsu). See my analogy: an other world is possible, but first we have to acknowledge it. \n\nLinus Torvalds and Brahm Cohen could have easily been billionairs if they wanted to. Same for Nicolai Tesla.\n\nBut guess what: they though the technology itself was more interesting than the amount of money they could get from it.  \n\nOn the opposite, you have assholes like Edison, Gates or Steeve Jobs. Well they can rule this world, but not force me to like them, or sharing their view of society. ",
				"added": 1483914474
			},
			{
				"comment_id": 84,
				"body": "> [warlock](#comment_11_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): Then it's not a voulentary contract you idiot. That's why I'm reffering to you guys as idiots. You are uncapable of doing rational conclusions. All the problems you listed are a result of states, not free-markets. If you are in a contract that is not benefitial to you, then you are by definition stupid.\n\nI think you are somehow projecting your frustration on us. That's why you get aggressive.  Deep inside you know that capitalism cannot, and never have worked, without a state. You treat us as delusional, because somehow, it's anarcho capitalism that is delusional. At least we have proof that anarcho capitalism worked before (primitive tribe, and also currently in the last primitive tribe on earh), and also, and more importantly, in order to be sure the concept work: in modern era: revolutionary Catalonia (1937). \n\nYou blame the state, but the state is the only thing that can glue together a capitalist society: a society with money, hierarchy and a working class/ owner of the means of production duality. Without a state in a capitalistic society, people would jump on each other, or it would be like the dystopias i refered to: blade runner, alien 2, avatar, where big corporations run everything.",
				"added": 1483915132
			},
			{
				"comment_id": 85,
				"body": "> [warlock](#comment_13_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): Still not answering my questions. News flash. There are greedy people on this planet. Anarcho-capitalists biggest issues is to cope with agression. You cannot even cope with a person with ambition. Talk about a broken philosophy.\n\nhttps://www.psychologytoday.com/blog/freedom-learn/201105/how-hunter-gatherers-maintained-their-egalitarian-ways\n\nAlso, you could have fame and respect in an an-com world without being rich. No doubt in a non monetary, anarchist world, someone ambitious like Elon Musk would get much respect. He wouldn't be a billionair (because there would be no money), but some very smart person in charge of technological projects.",
				"added": 1483915888
			},
			{
				"comment_id": 86,
				"body": "> [warlock](#comment_14_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): Yes, I won't deny I get frustrated with you anarcho-commies. You have all these grand ideas, just like the venus project,\n\nVenus project for me is more like an altruist,  scientific,  enlightened despotism. It's not really an-com. \n\n> but they are completely out of this world. You cannot talk 7 billion people to live in harmony and singing combaya.\n\nAgree. That's why it's not for tomorrow. Only when there would be no social antagonism left, would the global an-com society emerge. That's decades in the future. Without internet, it could have taken centuries, but with internet, i hope to see it when i'm still alive. \n\n> I completely reject that second paragraph. There is no basis of this assumption. And, if there is, it applies equally much to anarcho-communism. \"The state is the only thing that can ensure that all people own the capital goods.\" I could just as well say that with no justification.\n\n Well, my basis:  an-cap never has existed, an-com did (revolutionary Catalonia).",
				"added": 1483916283
			},
			{
				"comment_id": 89,
				"body": "> [thisweb11](#comment_243_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): That sounds like state nationalism to me.  Now THAT is ironic. \n> It isnt prosperous because of anarco capitalism. Its prosperous because the British state had the guns to go over there,  kill people and steal their living.   Or maybe that is anarcho cap.  Either way its not fucking anarchy.  Its  violent capitalism at its lowest point.\n\nI didn't want to say this because i didn't want to offend anglo-saxons american (including you, i don't know which nationality you are thisweb). But it's pretty obvious. \n\nThey stole an enormous amount of land and ressources, it's only normal that they became a superpower. Any organized country doing the same thing (stealing north america to the native indians) would have become a superpower, including China, the Turkish empire, japanese, the dutches etc...",
				"added": 1484007701
			},
			{
				"comment_id": 90,
				"body": "> [up4](#comment_70_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz): Anarchy to me is that if you pretend or try to have power over me in any way, be it moral, judiciary, political, physical, fiscal or economical, you better get this: I'm going to hurt you. Radically, I am an anarchist.\n\nThen you're lying to yourself, since the state always take taxes from you, put you through school, and impose all the laws on yourself.",
				"added": 1484255787
			},
			{
				"comment_id": 91,
				"body": "> [up4](#comment_72_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz): Funny how what you say never makes sense.\n\nSo you don't pay taxes?",
				"added": 1484255911
			},
			{
				"comment_id": 92,
				"body": "> [warlock](#comment_22_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): If all an-coms had the same perspective as you on this consept, then an-com and an-cap could easily co-exist. We litteraly want the same thing - freedom. Unfortunently many an-coms don't respect the consept of ownership of your own labour,\n\nHere i think you touch something interesting, since, it's not private property which create labour, but labor which creates private property. \n\nSo if there is no labor, in the sense we understand it today: working for the owners of the means of production, there is no reason that property will still exist.\n\nPS: about ownership of you own labor, no one will ever blame you for enjoying the fruits of your own labor.   You can keep it to yourself, or you can share. But the moment you employ people who aren't owners of your mean of production, it's not your own labour anymore. In revolutionary Catalonia, owners of farms were allowed to keep the farm, but not to employ workers.",
				"added": 1484256295
			},
			{
				"comment_id": 95,
				"body": "> [thisweb11](#comment_251_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): My time has no financial value.  It has social value.  That's why I'm not charging you for this conversation. Lucky for you, otherwise with my enourmous wealth of knowledge I'm giving away to you, you'd be bankrupted by now ;)\n\nWarlock sees everything as property, money, copyright, valuable time, market.\n\nIf this kind of guy understand that it would be better for everyone, including him, to live in a propertyless, moneyless, copyrightless, and timeless society, then everything will be okay again.",
				"added": 1484519951
			},
			{
				"comment_id": 99,
				"body": "> [warlock](#comment_25_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): \n> \n> Not copyright! But yes. I believe in property and money (real money, not fiat currency). My time has value. I'm exchanging my time for something that I later can exchange for something that I cannot provide for by my self. E.g. food, clothing and electricity. I have a child and what I want more than anything in life is her security. To protect her I claim the right to own certain things. Some things that are mine and that no one can take from me just because they believe I won't have any use for it. It doesn't matter if they'll die without it. My daughter might die without it. They can buy it from me, but not take it. And I'll be the judge of what I need, and nobody else.\n\nTragic that you haven't understood that you need the system (guaranteed property and land), in order to defend yourself against the same system (theft: if there is no property, there is no theft).\n\nThink i believe everything is happy and pinky in this society? Everything is shit. But contrary to you, i think it's not human nature, but social organization: capitalism to name it.  And i also have strong stuff to defend myself and to survive in case of a chaotic crisis. \n\nHowever, in the primitive tribe, no one had to defend against each other. If your fellow human is your brother and not your rival or your enemy, then you can count on him instead of protecting yourself against him. Property, hierarchy and work are some sort of contagious mental diseases transmitted through generations. \n\nBut heh, i'm not naive, i know anarcho communism isn't for tomorrow. If one day i'm a centenarian, i might just see it. Many things can happen in between, and they could be not pretty.",
				"added": 1484602613
			},
			{
				"comment_id": 102,
				"body": "> [warlock](#comment_30_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): I agree. Then you would have people like me making their own community with free market, trade and prosperity. \n\nTrade is obsolete. \n\nPost scarcity society is the future. \n\nWhen in 10 years from now, there will be a full open source, and open hardware smartphone, made with almost nothing from 3D printers, who will be the retard, the one with such a device, or the stupid fuck who spend half his wage to buy an iphone 18?\n\nScarcity is what make people steal and commit crimes. And the most stupid thing is that scarcity is mostly in our head. Is an iphone scarce? Yes. Should it be? Is it worth it? No: there are smartphones which do the exact same thing for only 1/10th of the price. There is real scarcity, sure, but mostly it's in our head. ",
				"added": 1484650881
			},
			{
				"comment_id": 104,
				"body": "> [warlock](#comment_33_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): That's why communism comes short. You are dictators and you care not about what people want, only what you want people to want.\n\nI maintain people who enjoy having shiny stuff (cars, phones, clothes, jewels, watches...) are retard and bad for the whole society. When i see all these retards on the street, parading with their expensive clothes, smartphones, car,  watches and so on, i think there is still a long road to go. \n\nHowever i'm no dictator, i won't force anything upon them, even if i had the possibility (if i was some god), but nonetheless, they are retard, and i have the right to think and say so. \n\nIf all these effort to build and buy this shiny shit would be put into politics or economy, we will already live in a post scarcity, direct democracy system. \n\n> And there will most certainly not be a printable open hardware phone in 10 years. And probably I would still pay for a good phone, than to build my own. Why? Because I WANT to. I don't want a printed brick. I want a smooth sexy and sleek phone that I can buy with instant gratification. Not something I have to tinker with and spend time producing and fixing.\n\nYou can have very good phones which aren't printed brick for less than 100 dollars. New cheap models or old ones refurbished but as good as new. \n\nAnd i don't want a smooth sexy and sleek phone. For what? I hate it. It represents scarcity, and all the dumb fucks fighting each other, being in rivalry  just to have the nicer phone, instead of thinking about an other world. \n\nI criticize smartphones, but for me it is a symbol of our alienation. It is the golden calf, and i hope this era would be over soon.  \n\n> But I agree to some extent regarding scarcity. Scarcity is forced by the state. There would be perfect iPhone copies in a free market economy, so people could get an iPhone for half the price. And TONNS of people would pay for a good looking, neat, smooth phone instead of printing a phone.",
				"added": 1484676093
			},
			{
				"comment_id": 109,
				"body": "> [jjg](#comment_1_1AfMv5MuNfa3BfmdsvGiHn9fnrEsCwxhhC): \n> So the question is, do you want to live in a world of free people with reasonable things, or do you want to have fancy things and tolerate slavery and human exploitation?\n\nGod dammit it feels good to know we are a majority here, even if it is in one of the furthest place possible of mainstream internet. I hope 60 years from now, most people on this planet will think like this. \n\nThis is exactly it. I could afford Ishit, expensive watches, clothes, and so on, but i don't want to perpetrate this system, so i try to live with the cheapest things possible, to humbly set the example, and accelerate the post-scarcity society.\n\n I'm absolutely not miserable if i have a 20 euro watch, a 60 euro smartphone and a 70 euro jacket. People mostly judge you on on your social skills, not your belongings anyway.",
				"added": 1484780872
			},
			{
				"comment_id": 110,
				"body": "> [warlock](#comment_42_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): I'm confident in my belief system. I don't need reassurance from others. ;)\n> \n> That is factually wrong. People judge a person in less than 10 seconds. Your appearance means everything. Obviously once you get a deeper connection with a person, they will learn who you are and judge you by ethics and what not. But appearance means more than you think.\n\nYes but you're not a pariah if you have cheap stuff. They'll judge you mostly on your body langage, and on your physique (tall, muscular, beautiful...), if your confident and affirmative. If you're a shy looser that has the last iphone, it won't make any difference.",
				"added": 1484860051
			},
			{
				"comment_id": 111,
				"body": "> [jjg](#comment_2_1AfMv5MuNfa3BfmdsvGiHn9fnrEsCwxhhC): I agree community size is key.  One thing I'm experimenting with now is simulating small (100-200 person) communities to see if it's possible to sustain the good things of modern life in community sizes that are compatible with the limits of human compassion.\n> The idea comes from observing and spending time with members of a nearby, successful, contemporary near-anarchist community: the Amish.\n> The Amish deliberately limit community size to about 150 people.  This happens to agree with research that people are capable of maintaining meaningful relationships with about the same number.  When an Amish community grows beyond this size, they send a group of members off to create a new one.  They stay connected (to the extent that they are connected to any other Amish community), but they are each separate autonomous communities.\n> My work is focused on determining if this (along with some other principles) could be applied to communities that don't have all the restrictions the Amish place on themselves.  I've been studying them and other similar communities and so far I don't see a reason to believe it's not possible.  Now I'm working on software simulations that will help me test these ideas and understand where they need to be tweaked or improved before involving groups of people IRL.\n\nVery interesting subject. However, revolutionary Catalonia, which suppressed money and hierarchy in some areas, proved that it was possible with hundred thousands (at least) of people. So it is probably scalable. \n\nAlso, the point is not to place restriction on ourselves (i know it's not exactly your point, but i'll say it for the others), but quite the contrary: free ourselves of private property (of the means of production), money and hierarchy.",
				"added": 1484861058
			},
			{
				"comment_id": 119,
				"body": "> [warlock](#comment_46_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): \n> \n> That's exactly my point. Private jets isn't a problem in and of it self. It's a problem when many people wants that lifestyle. And just like you said in the previous paragraph, the earth can't take 7 billion people, because I DONT WANT TO live like the poorest 1 billion. The earth can take 7 billion people if everybody has the standard of living that the bottom 1 billion has. But I want to live with the standard of living that I have now. If everybody wants my standard of living, we can't have 7 billion people. It's as simple as that.\n\nI have a completely different opinion on this, and it's even different to other an-com point of view. \n\nI think the earth can take 30 billions of people with high living standard and without destroying the environment. \n\nQuickly how: 1/Living in giant structures in the desert (3d printing), where there is nothing to destroy or pollute (Sarah, Gobi, Kalahari, Antarctica), or in floating structures in the water. 2/Clean and quasi illimitable energy: fast breeder reactor, thorium, LENR, fusion reactor, or simply massive PV panels with V2G technology in these deserts (with just an area like Spain, we could provide the whole world with PV electric energy). 3/Stop torturing animal and ecosystems by being full vegan, and growing vegetable with aquaponics (or other systems), which use a fraction of the land for a way higher yield, thus stop deforesting and exploiting lands were animals should be left at peace.\n\nJust MHO.",
				"added": 1485187111
			},
			{
				"comment_id": 122,
				"body": "> [warlock](#comment_48_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): No. Spoon-feed me the reasoning, because in no way is that an oxymoron.\n\nHistory never serve the same dish up again. An-cap was a state of development of capitalism, a previous version of it, but still the same system. It exist in the free cities in medieval times and in the far west. I won't even question the value of this system (however regarding the far west there is lot's of criticism to make). It won't happen again, since capitalism move forward, never backward. And forward, there is no an-com, but ultra-liberalism, were you can buy children and be obliged to be euthanized when you're not productive anymore. The only way to stop capitalism isn't to go backward, but to fight capitalism upstream, before it's new evolutions happen. \n\n\n> Complaining they don't do what? I'm not complaining. I'm happy for them. I'm telling you that you can be an an-com today if you want to. But you don't. Only in the comfort of your current environment will you be an an-com. You're not a pioneer. You are waiting for someone to do the dirty work for you. Typical an-com philosophy in other words.\n\nYou can be ancom if you join one of the many anarchist communities around the world, but the standard of living is poor. What's more, if one do so, he is not really fighting capitalism, but fleeing it. \n\nAn-com is something which will need the global social conscience to wake up, and choose an other path. \n\n> The burdon of proof is in your hands. Only 1 billion of the 7 billon live in my luxury today and nature is suffering. Feel free to enlightenme how we will raise the standard of living for 6 billion people to my level of luxury AND preserve nature WITH the current technology.\n> (In before: Abolish capitalism.. Yadda yadda. Come up with a better answer than that)\n\nBeginning to be 100% vegan would be an excellent start. Then increase recycling, clean energy (thorium HTR-PM,  PV coupled with V2G,  EVs, hydrogen fuel cell planes and boats), and you're almost there.",
				"added": 1485214717
			},
			{
				"comment_id": 124,
				"body": "> [warlock](#comment_50_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): That wasn't an explanation why an-cap is an oxymoron.\n> \n> How do you propose fighting capitalism, wake up the global social conscience AND streer them into an-com while at the same time stay true to the an-com ideals?\n\nEasy, doing what i'm doing here, and IRL. Even the stupidest will understand (see what i mean in some areas of the world...). Only it will take a lot of time. \n\nCapitalism succeed in totally discrediting communism during the last decades, systematically assimilating to bolshevism, or even more stupidly: Stalin. It worked perfectly. \n\nWith the net, it's not possible to make such bashing successful again. Information isn't vertical but horizontal.",
				"added": 1485264483
			},
			{
				"comment_id": 125,
				"body": "> [binero](#comment_204_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Area is not the problem, resources is, and the Earth only has resources for 10 billion people with the current technology.\n\nMost ressources has alternatives. Carbon composite for steel. Hybrid metal for copper. Graphene for platinium. And the bottom of the oceans are rich in rare earth.",
				"added": 1485264621
			},
			{
				"comment_id": 128,
				"body": "> [warlock](#comment_55_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): So did Soviet on the free market. The disinformation continues to this day - from both sides. I agree 100% with information. From what I've read I've come to the conclusion that an-cap is true freedom. You have come to the conclusion that an-com is. One side will never manage to convince 100% of the people, so we have to find a way to agree to disagree and co-exist.\n\nWell do your an-cap, see that it's not true freedom (you'll have hierarchy, money, class struggle, delegation of power).\n\nThen you'll come to your senses.\n\nSometime, the only way to understand that an ideology isn't what it promised to be, is to try it.",
				"added": 1485266844
			},
			{
				"comment_id": 130,
				"body": "> [warlock](#comment_57_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): Then you and I have different view of what freedom is.I would love to try an-cap, an luckily I will. We're getting there. It's inevitable.\n\nThe internet like you said is kind of an-cap (ebay, amazon, netflix, bitcoin, uber...), and more and more services will probably be an-cap. It might not be a bad thing, since most people don't understand an-com (or an-cap either for that matter, they just use a particular service without knowing about the fundamental structure of it), and are far from ready to it.\n\nHowever, in the end of an-cap, there is an-com.",
				"added": 1485280288
			},
			{
				"comment_id": 132,
				"body": "> [thisweb11](#comment_287_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Whats anarchist about businesses that depend and coerce people signing unreadable terms and conditions backed by the state and copyright police.   Seriously anarcho capitalism doesn exist, even slightly.  Google is king of straight up Adam Smith capitalism.  And the state looks out for its interests primarily over the peoples and even itself (see bilderberg) - it does so in a way an-caps claim they would never tolerate.    Bitcoin is money , it is neither anarchist or capitalist.  It is anti statist though.\n\nNew technologies like Uber, Bitcoin, Ethereum are indeed not really anarchist. But they tend to bypass the state in many ways. It's not really an-cap, like said, or an-com, but a new form of economical organization which needs less and less the state. The coercion seem to not come from the state anymore, but from the software itself. https://en.wikipedia.org/wiki/Decentralized_autonomous_organization\n\nThis might be a good thing for an-com. Since in the beginning it will use coercion in the form of money (ETH) and reputation (in the software), but the years and decades passing, it could relies less and less on money. \n\nHowever, i don't know if anyone could profit from it. So in a way it'll still be unequal, with people taking the most profit. \n\nBut then, the software could also serve the majority in a way or in an other, balancing the profit. \n\nOh well, we'll see...",
				"added": 1485297846
			},
			{
				"comment_id": 133,
				"body": "> [warlock](#comment_61_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): No. The difference between you and planesphere is that he assumes that the consept of an-cap is a real thing. \n\nHmm, no need to take sides here.\n\nAn-cap is a previous version of capitalism (free cities in the middle age, far west), when the state wasn't even there. But it soon came by.\n\nThe thing with Ethereum, bitcoin, decentralized autonomous organizations,  i don't know what it is exactly. Maybe it's something else than an-cap in the traditional meaning. \n\nhttp://www.investopedia.com/articles/investing/022916/decentralized-autonomous-organizations-iot-today.asp\n\nHowever, this, Zeronet, and Freenet, torrents, edonkey, are typically an-com IMO.",
				"added": 1485298386
			},
			{
				"comment_id": 134,
				"body": "Read this thisweb11:\n\nhttp://www.investopedia.com/articles/investing/022916/decentralized-autonomous-organizations-iot-today.asp\n\nI don't know what this shit is, but it could lead to an-com, or at least a post scarcity world. At first it'll use shares and a currency, at first...",
				"added": 1485299933
			},
			{
				"comment_id": 135,
				"body": "> [kaffie](#comment_229_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Not all anarchists support currency. I'd argue that you can't be a true anarchist if you support a society that has money and ownership.\n\nAgree. That's one of our divergence with thisweb11. But i don't point out this difference because we have more common points than differences. \n\nFor me also, it's absolutely necessary that we abolish money, since it's the core of the system. The mechanism around everything else is organized. \nIn revolutionary Catalonia, in some areas, money was abolished.",
				"added": 1485392753
			},
			{
				"comment_id": 136,
				"body": "> [jjg](#comment_3_1AfMv5MuNfa3BfmdsvGiHn9fnrEsCwxhhC): So, are we practicing anarchists here or is this mostly theoretical?  If practicing, let's trade tips and tactics, because each day it looks like the world needs more anarchists :)\n\nWe need 7 billion anarchist. There is nothing to do except making people listen reason. When we reach a critical mass (about 70-80%), then society will change itself without any use of violence. \n\nOf course there is only one little problem: it will take decades, but for me it doesn't matter.",
				"added": 1485393003
			},
			{
				"comment_id": 137,
				"body": "> [shishi900](#comment_4_17U149zMQuTXJ53cXGLyDfrGEoztPiFkjc): fuck off communist fucks\n\nHere we go, another ignorant (there are some from time to time), who think communism=bolshevism=stalin= Castro= anarcho-communism= URSS= goulags.\n\nRemants of Maccartyism and cold war, but retard remants i must precize. Indeed, and i talk to you shishi900, URSS is state capitalism.\n\nJust a little advice shishi900: when you don't have the basic knowledge in a particular subject, just keep your mouth shut. It's better for you.",
				"added": 1485471202
			},
			{
				"comment_id": 144,
				"body": "> [shishi900](#comment_6_17U149zMQuTXJ53cXGLyDfrGEoztPiFkjc): Why the harsh language tho ? Fuck off with your sci-fi utopia already it never was, it never could be and it will never happen. The capitalism with big empire-like corporations is the future and you can see it.Try to land a man on the moon or mars with anarchism.\n\nHarsh langage because you started it (\"fuck off communist fucks\")\n\nOh because it's so important for everyone of us to land people on other planets. Funny one of the arguments of convinced capitalists is always putting rockets in space or landing people in other planets when our current planet is by far the most beautiful in the solar system but we treat it like trash. \n\nBy the way, your ancestors did live in this utopia from 160000 BCE to 12000 BCE. So it was. Also in modern era during revolutionary Catalonia.\n\nNever could be: we had 3 mode of production before capitalism (primitive communism, roman slavery, feudalism). I don't see why there will never be an other mode of production after capitalism. \n\nIt will never happen: you have strong certainties. Or maybe you would like it but your frustrated so you get angry? \nThose who don't hope don't deserve a better future.",
				"added": 1485536084
			},
			{
				"comment_id": 145,
				"body": "> [kaffie](#comment_230_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): \n> I'd be curious on how you can practice anarchism in modern society. It's not exactly like you can just ignore the legal system and assume nothing will go wrong. I do think opting out of society as much as possible should be the current goal. And focusing on making free decentralized systems so that the current legal and monetary systems are unneeded. The less support mainstream society has, the easier it'll be to get rid of it. I talked a bit about this on my blog, but I definitely need to do some more in-depth writing. Unfortunately I don't think opting out completely without societal support will ever be possible, as long as you have medical needs or desire new tech.\n> What we really need to get anarchism off the ground and going is lots of funding and resources. Building up networks of anarchist communities, and focusing on cutting ties with major systems. I think ZeroNet can be a key piece of this in terms of tech. No need for dedicated webhosts, no need for ICANN, no big corp tracking or spying, etc. Unfortunately the hardware and physical aspect of it all is much more difficult than the digital portion. Software is already an anarchy :)\n\nI totally agree with your view of anarchy. \n\nWhat's more we need functional open hardware devices. It would be a big step forward. \n\nStarting with a smartphone (a symbolic device in our current era), would be great.",
				"added": 1485536551
			},
			{
				"comment_id": 146,
				"body": "> [thisweb11](#comment_306_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): right wing scum your time has come.\n\nI think his problem is not that he is right wing, but mostly ignorant. As i said i'm sure in his head an-com = gulags.\n\nI found that many right wing can be converted to an-com. Paradoxically more than traditional state socialists (bobos, hipsters). \n\nIn France, there is a hard right wing website, one of the most visited in the country (egaliteetreconciliation.fr not to name it). Since they were putting on their website anarchist content, not because it is right wing, but because it's intersting content, many of the site posters were \"converted\" to an-com (in France, it more called radical marxism, but it's the same thing).\n\nMyself, i was a nationalist just 3 years ago.",
				"added": 1485556119
			},
			{
				"comment_id": 147,
				"body": "> [kaffie](#comment_231_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): \n> It absolutely is important to start decentralizing and get people on other planets and to make it easily done. But it's also important to help the earth. These are not contradictory goals.\n\nI don't want to give a bad name to anarchy, and this has nothing to do with it. And i don't want to troll or anything. \n\nBut since only truth can give the best of us, and there's no reason to self censor ourselves here, i'll say it.\n\nI'm not 100% sure that such things as space, or planets, exist.\n\nNow we can go back to anarchy.",
				"added": 1485566766
			},
			{
				"comment_id": 148,
				"body": "> [kaffie](#comment_232_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): You're right that it doesn't really have anything to do with anarchism. I didn't mean to imply such. Personally I think it's an important goal, and it's not contradictory with anarchism.\n\nWasn't irony. \n\nBut heh maybe it's too soon ;-)",
				"added": 1485605908
			},
			{
				"comment_id": 149,
				"body": "We need to stop using people to provide a service for us in exchange of money. The more possible. \n\nEvery time you pay someone for something, ask yourself: \"is it really necessary?  Couldn't i do it myself or use an other way?\"",
				"added": 1485730827
			},
			{
				"comment_id": 150,
				"body": "> [thisweb11](#comment_330_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Which reminds me  -  another point about releasing the cockroaches in mcdonalds:    It ensures the workers don't have to flip burgers for people that day.   And the public are forced to ask, 'do I really want a Big Mac anyway?'\n\nIronically, and since you talk about sabotage, there has been a very recent video of Francis Cousin about it:\n\nhttps://www.youtube.com/watch?v=S77G9i8B5Rw\n\nUnfortunately, for french speakers only.\n\nAlso, one of the best historical book about sabotage (le sabotage, From Emile Pouget).\n\nhttps://www.fichier-pdf.fr/2016/05/29/bpt6k245539/",
				"added": 1485782148
			},
			{
				"comment_id": 153,
				"body": "> [binero](#comment_215_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Why would we want to do everything ourselves? Specialization is what lead to the enormous production capacity we have these days.\n\nThis is the best example of over-specialization. Poor guys cooking garbage meat burgers for you.\n\nI avoid restaurants if i can. Cooking is something anyone can do.",
				"added": 1485977053
			}
		],
		"1_1WyK7N7rcBdyRWbKe8fBjpBZJN68E6XTW": [
			{
				"comment_id": 27,
				"body": "Eating meat is disastrous for the environment. \n\nBut heh, have a good brisket next time.",
				"added": 1481026869
			}
		],
		"2_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG": [
			{
				"comment_id": 31,
				"body": "> [dud](#comment_14_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG): The internet was created by the United States DEFCON, computers were created by CAPITALISM, the computer on which you are saying this was created by CAPITALISM, how is this not evidence? \n\nExcellent example! However, i have even better: the wheel was invented by the slavory mode of production, proof that the slavory mode of production is even better!",
				"added": 1481148690
			},
			{
				"comment_id": 32,
				"body": "> [dud](#comment_15_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG): \n> Capitalism and government are not interchangeable, and capitalism can work without a government, \n\nCould you give me one example of capitalism working without government in the past?",
				"added": 1481148818
			},
			{
				"comment_id": 33,
				"body": "Also, i understand that anarcho capitalism would be more feasible than anarcho communism in the near future (in the far future anarcho communism is obvious for me), however, even if it is the more practical mode of production, aren't you disgusted by money, private property of the means of production, the separation of society in 2 classes, and hierarchy? \n\nIs that completely all right for you?",
				"added": 1481149098
			},
			{
				"comment_id": 34,
				"body": "> [dud](#comment_14_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG): >Anarcho-communism is a great idea on paper, \n\nAnd also great IRL for 95% of human history.\n\n>but in practices it would lead to Neo-tribadism, highly-corporate and organized mafias, and if we look at history, looking at Rome, we would see the formation of new \"Kingdoms\", driven by profit.\n\nRome is a slavory mode of production. It has nothing to do with anarcho-commuism. Quite the opposite in fact. \n\nAs for Neo-tribadism, if there is no tribe anymore in the future, it can't happen. In the future, there would be no antagonism left since the capitalistic mode of production destroys all identities and ethnicities, and is cosmopolite by nature. \n\n >Maybe I'm paranoid, but all socialism did in the past was creating highly-corporate mafias, that socialism tries to oppose but does not succeed at, because all socialism does is promote crony capitalism. En masse.\n\nGet your concepts right. Socialism isn't anarcho-communism. Socialism is state capitalism. \n\n> I am not saying that capitalism solves all problems, I am saying that profits drives the world more than social justice, trans right, black lives matters and poorness of culture regroupement.\n\nWhat does anarcho-communism has to do with the progressive ideology? Progressive ideology derivate from capitalism (Guy Debor, Michel Clouscard, Francis Cousin). Because capitalism needs to isolate individuals and split groups,  in order to weaken them. \n\nNo, capitalism don't solve problems, it creates them since the 13th century A.D.",
				"added": 1481149929
			},
			{
				"comment_id": 36,
				"body": "> [dud](#comment_20_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG): No the wheel was not invented by slaves, nobody knows who and when the wheel was invented.\n\nNot by slaves, but during the slavory mode of production. Get your concepts right. Check the wikipedia page for modes of production. \n\nThere is 4 mode of production. Primitive communism, slavory, feudalism and capitalism. \n\nSince it's not primitive communism, and feudalism came later, it's necessarily the slavory mode of production which invented it.",
				"added": 1481234273
			},
			{
				"comment_id": 37,
				"body": "> [dud](#comment_21_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG): Can you give me an example of socialism working without government in the past? Me neither.\n\nHeuh, homo sapiens between 160000 BCE and 12000 BCE. \n\nAlso, what you mean by socialism is in fact anarcho communism. Again, no offense, get your concepts right.",
				"added": 1481234346
			},
			{
				"comment_id": 38,
				"body": "> [dud](#comment_22_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG): This is all right to me, the ascension of social classes can be possible with the right opportunities, with anarcho-capitalism leaving quite a lot of them. Social classes always have existed, even in \"communist\" countries. \n\nFalse, primitive communism from 160000 BCE to 12000 BCE. Also, the last pirmitive tribes on earth (Guayakis, pigmees, Jarawas), are classless. Easy, since they don't have money or private property of the means of production. \n\n>I would say they are natural in human societies, in all of our history we have had them. I do not have an issue with them.\n> I am not in any way encouraging class division however, I am just saying it is natural.\n\nIt's not even a discussion if you don't have basic knowledge about homo sapiens in it's natural state. It's not my point of view, it's very well documented by mainstream science from the most eminent universities over the world: homo sapiens in it's natural state (primitive tribe) is classless. \n\nWe cannot argue ideologies if you don't have your facts right.",
				"added": 1481234597
			},
			{
				"comment_id": 39,
				"body": "> [dud](#comment_23_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG): Anarcho communism was never achieved, WTF are you speaking about?\n\nHave you ever heard about primitive society? It is anarcho communism. Plain and simple. \n\nTime for you to catch up on this.",
				"added": 1481234767
			},
			{
				"comment_id": 40,
				"body": "> [dud](#comment_23_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG): Anarcho communism was never achieved, WTF are you speaking about?\n>\n> Capitalism doesn't divide, being merely an economical model.\n\nCapitalism is a mode of production, and mode of production have the most influence on people live, far beyond politics. \n\nThe slavery mode of production had influence on people, far more than the politic of the roman republic. Feudalism had influence on the people, far more than the King's politic. Capitalism has the same influence in everydays life. \n\nIt's not a tool. Capitalism is at the core of our society functioning. It's the way we produce things. In the primitive tribe, everyone produced everything he needed, then came the slavory mode of production, where human were owned and worked for the society, then feudalism with serfs, and finally, capitalism with the separation of the society in 2: the owners of the means of production, and the workers, working for the owners of the means of production. \n\nWith mechanization and the tendancy of the rate of profit to fall, the birth of a new mode of production is inevitable. \n \n> Capitalism does solve problems, having fixed a lot of countries economical problems in the past. Chile is a good example, being the third richest country in america, and having been capitalist since the 1960s.\n\nI'm not a specialist of Chile, but it's a capitalist country far before the 1960s. \n\nYou know capitalism was born in the 13th century in western europe right? \n\nReally, you seem to debate in good faith, but you need to take a look on capitalism history and homo sapiens history.",
				"added": 1481235095
			},
			{
				"comment_id": 41,
				"body": "> [planespherev3](#comment_37_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Heuh, homo sapiens between 160000 BCE and 12000 BCE. \n> Also, what you mean by socialism is in fact anarcho communism. Again, no offense, get your concepts right.\n\n A little push: 1/socialism is state capitalism, with public ownership of the modes of production (mostly). 2/Anarcho- communism is: a classless society, money-less, without hierarchy and without private property: homo sapiens in it's natural state: the primitive tribe. Also, it will probably be the base of the next mode of production. With the internet of the future and full mechanization, it's the most probable thing to happen.",
				"added": 1481236165
			},
			{
				"comment_id": 46,
				"body": "> [thisweb11](#comment_188_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM):    Libertarianism is the worse of all ideologies.  If the state heirachy must exist  I'd sooner have higher tax capitalism than low tax libertarianism.  Libertarianism is bullshit.\n\nI don't know if it's worse of better, but it sure is another capitalistic flavor.\n\nWhen people will understand that we need to change the core of the system: the mode of production, and not the flavor of the system: the political system, then things will change at last.\n\nNo money, no state.",
				"added": 1481385544
			},
			{
				"comment_id": 80,
				"body": "> [warlock](#comment_4_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): Absolutley not. That is, if you refer to capitalists like most media is, then absolutley not. If you refer to capitalist as free market capitalists, then yes.\n> Capitalists, as we know it through media, are actually fascists, where they love the merging between the corporations and state. That means that they can use the full force of the state to enforce their will for their profit. With minimal state that is no longer the case. Heck, they wouldn't even have copyrights protecting their intelectual property.\n> No, capitalists wants more government, as is vividly apparent with the raise of TISA/TPP/TTIP. They want to set the rule though a corporate judge and then enforce the ruling with state force. This would be demolished in a more libertarian world.\n\nNo wrong, but still a world governed with money and hierachy, thus a world i wouldn't like.",
				"added": 1483898292
			},
			{
				"comment_id": 81,
				"body": "> [thisweb11](#comment_219_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): TTIP etc exists because the state exists.  Thats my point.  We need to get rid of the state.  Libertarians dont want that.  Which would allow TTIP to re emerge.  TTIP isnt even a product of the state its a product of unelected corporations.    The state is an excuse to bring it into being.   Anarchists oppose the state because they recognise libertarianism leads to extreme STATISM BY THE UNELECTED PLUTOCRACY .   Which is worse than even loosley democractic states.\n\nYes it seems that the capitalistic class don't even need the state to legitimate their acts. Now with treaties like the TTIP, they can rule directly and have their owns private courts, the state will just enforce the sentence with it's police.\n\nAnd i agree that if the state doesn't rule, big corporation will rule instead, like in dystopian movies blade runner or alien 2 (among other examples). \n\nThe state is just a puppet used by  capitalism to rule, because the state is  supposed to represent the common good. The state legitimate the whole coercitive, hierarchical, and money system, because people elect representatives supposed to rule in the common interest. It's been a long time (probably the begining of the 20th century), since the representative don't even serve the common interest, but only the interest of the capitalistic class. \nHowever, if people are not even interested in common good anymore, and don't even feel that being represented by political representatives is useful for them,  then the corporates will rule directly. It is the concept of the european union, were the european commission isn't elected, and were european commissionner work in the interests of the companies through promises from the companies to hire them later when they have finished their mandate.",
				"added": 1483903313
			},
			{
				"comment_id": 87,
				"body": "> [warlock](#comment_12_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): Listen. People can be exploited because they let them selves be exploited. People are idiots because they buy shit they can't afford and are forced into a job that doesn't value them. And then they look for more government to solve the problem, when in fact it's government that cause the problems in the first place.\n> If people weren't desperate, something they are because they live beyond their means, they wouldn't be forced to take underpaying jobs. In a free-market economy skilled, smart and unworried employees are valued because they performe miles better than someone who walks about worring about getting food on the table. That's what a job used to be like before governments came and fucked it up. In a free market the job owners usually (as a rule) genuinley care about their employees. But there are exceptions. And you are an idiot if you work for them. That's my point.\n\nIt's possible, but i'm not interested in a society based on money and a working class/ owners of the means of production duality.  I don't like it. I want to see in others fellow humans, and not other pieces of a gigantic machinery, were pieces are separated according to their importance for the functioning of this gigantic machinery.\n\n But i understand why a warlock could like it. Sorcery is about taking life force from others after all.",
				"added": 1483916994
			},
			{
				"comment_id": 88,
				"body": "> [warlock](#comment_16_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): Money is not evil and posess no magic enslavement power. \n\nFrom your point of view i guess it's some chutzpah you did. Mammon isn't very far.  You're smart but you're on the dark side. \n\nI think of money as liquid power over others. \n\n\nPS: about the editing function, check the little pen which appear if you put your mouse on it at 7 o'clock of your name written on the post you want to edit. It doesn't appear on some web-browser (some bug i don't know) , but on firefox it should work. See? I even help some admirers of the horned god like you. Oh, and this has nothing to do with the subject, but in the end, he'll loose. Just succeed to take some losers with him. ",
				"added": 1484004496
			},
			{
				"comment_id": 96,
				"body": "> [warlock](#comment_21_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): \n> Obviously I don't believe woman are a problem. But I believe that women should be home with their children. It is my beliefe that most of the sosial problems we see today is because the children were \"rejected\" by their family and put in a kindergarden. Also they don't get the connection with their family that they are supposed to have and they don't get the love and recognition they deserve, hence they get insecure and end up like teens are today.\n\nThis is something interesting. \n\nIn the primitive tribe, there is no father who is working for a salary, and a women at home, taking care of the children. There is only the group, and people, the elders, take care of the children. \n\nThe isolated nuclear family is already a byproduct of capitalism (which, i need to remind, was born in the 13th century). \n\nToday, after having isolated the nuclear family from the group,  the capital wants to break this nuclear family. With no parents, or only one weak, isolated parent, the children will really be owned by the capital. It could brainwash the child from his early years. \n\nI don't want to get back to a time when the woman was at home, taking care of the children, and the father was working, in order to \"put bread on the table\". I want to come back to the begining: where the bread was shared among everybody, not earned by the father,  and the children were taken care of by the whole group, with stronger links with their parents and extended family, who all had time to take care of them: they were working about 15-20 hours a week. https://en.wikipedia.org/wiki/Original_affluent_society\n\nOur world is becoming more and more alienated. We are becoming more and more what we aren't supposed to be in the begining. \n\nComing back 50 years ago? Why? I want to come back 12000 years ago. \n\nOf course, you get the point. We'll come back in the past regarding our social organization: no hierarchy, no property, no work, same relationships with the children and the marital dynamics as in the primitive tribe. But of course, we'll keep the technology. \n\nHumans are not supposed to be slaves, serfs, or workers. This is not our nature. We cannot be happy if we don't understand our roots, and how we are supposed to function. Humans being anarchist and communists in the beginning is not a point of view: it is a fact. Every anthropologist will confirm.",
				"added": 1484530947
			},
			{
				"comment_id": 98,
				"body": "> [warlock](#comment_26_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): \n> Also I want the right to own land and to own what I create or gather. That is essential for me to secure my and my families life. With no land that I own, then my life is, once again, in the hands of others. We might have been communists way back when. It doesn't matter. It doesn't mean it's the correct way of life. We are humans and we evolve. We used to remove then skin from animals with a rock. That doesn't mean we should disregard the knife. We should embrace it. Communism is good for organizing small groups. A family or a small business. It doesn't scale to 7 billion people. It's just not possible.\n\nHave you ever heard about the german tribes? They were communists. Lands, animals and production were shared, but they were able to fight on par with the roman empire.",
				"added": 1484601794
			},
			{
				"comment_id": 100,
				"body": "> [warlock](#comment_27_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): No, I haven't heard of them. But it's not going to work with modern technology. It's too complex to organize super high technology without a leader. I will be convinced that communism works when I see it. When I see a self-organized crowd-funded rocket filled with 100 crowed-funded satalites launched into orbit and then land the rocket standing on a floating platform off-shore, I will convinced that communism can work in practice. E.g. never.\n\nAre you binero alter ego? He had the exact same argument (you can check in this very topic).\n\nThus i'll answer the same counter argument: have you heard of Debian organization? It's super complex, but it's organized in a democratic way. https://www.google.no/search?q=debian+organigram&client=ubuntu&hs=Yax&channel=fs&source=lnms&tbm=isch&sa=X&ved=0ahUKEwi-utjY28fRAhXBFSwKHXDtB1gQ_AUICCgB&biw=1375&bih=773#imgrc=n1t8tVNQOWSI2M%3A",
				"added": 1484606082
			},
			{
				"comment_id": 101,
				"body": "> [planespherev3](#comment_100_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): \n\nAnd about satelites, i'm not sure that we need them. With fiber optical we have all the needs in communication covered, for GPS, it can be replace with a system without satellites. https://www.extremetech.com/extreme/202111-darpa-to-re-invent-gps-navigation-without-satellites\nFor weather, multiple weather stations already give a pretty accurate weather without the use of satelites.",
				"added": 1484606946
			},
			{
				"comment_id": 103,
				"body": "> [warlock](#comment_29_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): Don't know him. Debian is software so it not really complex. It just takes a lot of time, and you can do forkes and all sorts of local adjustments. This is not always the case for hardware.\n> \n> Satellites wasn't the point. Image 15 years ago when we had single core CPUs of 100 nm or whatever. They were pretty good. But, could we organically organize the people needed to get to 15 nm technology and get 16 core CPUs with the same power as a small super computer at the time?\n\nMaybe it would take longer, but what's the point of rushing, instead concentrating on software efficiency which doesn't use hardware would have been probably better. It took almost 20 years for P2P internet to take off, when the software possibility was already available in the begining of the 2000s (edonkey, torrent). Instead, we have CPU with 16 core but most people don't use their potential. And most of the people who use 1000 dollars CPU to their potential are spoiled brat who play video games. \n\n >How would we distribute the CPUs? Who would get first batch and the second?\n Who would have to wait?\n\nI don't care to wait a few years. My CPUs are always a few years back and it's more than enough. A 2011 AMD FX is enough for 99% of the people.  \n\nIn our current system, the poor don't have to wait, then don't have access to this technology. Is it better? \n\n >Who makes these decisions? Who decides on the architecture?\n\nDirect democracy.",
				"added": 1484652134
			},
			{
				"comment_id": 105,
				"body": "> [warlock](#comment_32_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): This is the big problem with \"you guys\". You decide that what is good enough for you is good enough for everyone. That is clearly not the case.\n> \n> The first people who buys new technology product, maybe rich or maybe just people with different priorities, takes a much bigger economical burden. They pay for the development of the product. Once they sale starts gaining momentum the synergy of higher production means cheaper unit-price, then poorer people can afford, which again increase the production and decrease the price, so the even poorer can afford. It's a very fair system. Those who get it first, pays for the development.\n\nTotally agree (however it's pretty obvious). \n\nHowever it would be better if as a whole society we would debate and vote for the new technology to develop in the near future and then put effort toward creating it instead. Like a crowd funding but without money, just voting. \n\nSo i could vote for thorium reactors, which are just 100 times more important than new smartphones. If all the money invested in smarthones r and d and buyers have been used to this technology, we would already have at least 100 of these thorium reactors around the world, and many more to come.  \n\n> Yeah, may be it could work, but I doubt it.\n\nIn Swtizerland, although it's just a partial direct democracy, it works.",
				"added": 1484678051
			},
			{
				"comment_id": 106,
				"body": "> [warlock](#comment_34_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): That I do not believe. If thorium is so fantastic as people say it is, it would be in production already, and it is not. The reason for that is that where there is opportunity, there is money. They just presented a list of the 8 richest men on the planet. I can promise you that he who solves the problem of producing clean and sustainable energy will be on that list. So there is a lot of incentives to get thorium working, and it's still not. So I think it's several decades away, and I don't want to halt innovation in other fields while everybody is trying to get Thorium working.\n\n\nWrong, it exist functionnaly still the end of the 80s (THTR-300), in the form of the pebble bed reactor.\n\nAnd it will exist again in China by the end of 2017 (HTR-PM, which is thorium fully compatible).\n\nBut heh, fossils fuel companies didn't want it because they were clinging to their business. That's an other flaw of capitalism, in adition of enormous wealth gap between individuals and hierarchy. At one point, powerful businesses don't do what's best even for the whole market, or for the well being of humanity, but what's best only for them. The same thing happend with the electric car GM EV1, which was literraly destroyed by fossils fuel companies in the 90s, because it would threaten their profit margin. You get it, at one point, capitalists only tend to make money for themselves, regardless of the well being, or even the profit of the whole market. Every entity on the market will struggle to increase it's profit, even if it's in opposition to the common good, or the interest of the market as a whole. What's more, if you invent something, and if it's formidable, but useless to make a profit, then it won't be produced. Because the whole point of the system is to make profit, not stuff useful to humanity. \n\n> That's politics. I'm talking about running some sort of voluntary \"business\" where people are not paid money and were technical challenges has to be overcome with no people directly in charge. So what I thought you meant was the the people working for the business would appoint a leader that would take technical lead, for instance. \n\nThat sound like the worker concil system\n\n>That might work. But voting directly on technological alternatives, e.g. landing the rocket upright, I think will not work very well because a lot of incompetent people will be voting.\n\nYou obsessed about rockets?",
				"added": 1484739677
			},
			{
				"comment_id": 107,
				"body": "> [warlock](#comment_35_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): \n> It's a philosophy. It's a philosophy we believe will transform the planet into freedom. And you still cannot fathom the difference between crony capitalism and a free market. You just keep on repeating that they are the same, when clearly they are not. That's why I keep telling you that I will not differentiate an-com with gulags before you differentiate an-cap with the crony-capitalism that we know.\n\nNo. Because An-com with gulags (guess you mean bolsheviks) aren't an-com at all. They are state capitalists, or slavers, depending on the fact that you are outside or inside the gulag.\n\nWhat he tries to tell you is when you start to organize society with hierarchy (owners of the means of production, workers), money, delegation of power, then it's too late. Profit calls for more profit, and nothing will stop it. \n\nYou create a game, capitalism, and define the rules. Then everybody will act according to these rules, but they will always play the most agressively possible according to these rules, and sometimes (even often), they won't even respect the rules and go beyond them. That's why i believe free market will never be possible, since there will always be super rich sociopath who will do whatever they can, publicly or not,  to prevent this free market to ever happen. \n\nHowever, if you completely change the game, and abolish the main rules (hierarchy, money, private property of the means of production), then there is no possibility of cheating anymore. Maybe there will  be other cheats possible, but we aren't here there.",
				"added": 1484740302
			},
			{
				"comment_id": 108,
				"body": "> [warlock](#comment_36_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): Then why are you on the internet? The money you have paid for everything in your life you could give away for charity, because you don't NEED the internet and a computer. So, go ahead. Give it all up. Lead by example.\n\nCharity exist still capitalism exist, and it doesn't really work. It's like bandages to heal a fatal wound. What we need is a system where we don't need charity. Were we don't need to take on some to give to others. \n\n>So, don't assume anything about how I am, who I am, how I treat others, what I am and what I am not. You do not know me. You see, we an-caps see YOU as the selfish ones. You want everything to be free. Up for grabs. If somebody don't need it - it's mine.\n\nSo you try to restore balance between what you have and what other have. Why not having a system were there is no balance to restore, because everything is even (at least regarding living condition, because i'm not against someone being a natural leader or someone respected  because he's competent). \n\nNot everything is to be free, just the means of production to be shared. Then if you want to have your own watch or your own computer, nobody will take it from you. It's the distinction between private property and personal property. Personal property (E.G a watch, clothes, a car...), cannot be used to produce other stuff, so you can keep them.",
				"added": 1484741275
			},
			{
				"comment_id": 118,
				"body": "> [warlock](#comment_39_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): No, that is a preposterous claim. If you really believe what you are saying there, then it mwans all capitalists in the world are cooperating on suppressing technology. That is clearly not the case. This tells me you don't understand the free market at all. Thorium is in fact the best example I can think of. If someone can make it work, then they will corner the whole energy market. They will literally rule the energy of the earth for a number of years. That's such a tremendous opportunity that any capitalist would take it, even if it meant braking allegiances.  Claiming it's a global super conspiracy is just to easy. It's just a way for you to uphold an illusion that you are being suppressed by the market.\n\n\nWould you please shut up and read the wikipedia page about the THTR-300? (not for the current debate, but because i'm sick that not enough people know about this):\n\nhttps://en.wikipedia.org/wiki/THTR-300",
				"added": 1485173568
			},
			{
				"comment_id": 120,
				"body": "> [warlock](#comment_45_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): \n> Yes. I never questioned that it would work. I didn't know they had a working production facility that many years ago. I fail to see your point though. Is that they need a non-renewable source that comes as a by-product of petroleum industry for cooling? (Helium) Is it that it wasn't financially viable?\n\n\nMy point is that in this capitalist system, it was more profitable (mean make more money) for the fossil fuel industry to take lobbying actions against this technological marvel in order to keep their privileges, instead of allowing it to finish it's development (which was almost done since it produced 423 days). Same example, but more mainstream, with the GM EV1 (\"who killed the electric car\" documentary).\n\nOf course it wasn't financially viable, like the Tesla roadster wasn't viable. A functional prototype rarely is viable. However the Chinese are finalizing the HTR-PM, which is a copy of this THTR-300. So finally we'll see this technology in the capitalist system, but 30 years late, when we could already be far in the post-fossil fuel era. The irony is that now in the USA they want to replace the coal power station boilers with this technology, mostly because the Chinese are using it. So they don't use the stuff since it's the best technology (the concept was invented in 1947 if i remember), but because they don't have any other choice left, since the competition (China), is using it. Petrodollars, which are a consequence of the capitalism system, has strongly something to do with it in my opinion. If there was already 100 reactors of this kind around the world, and many more to come, oil value, thus the dollar value (which is linked to oil since all oil transactions are made in dollars), would already have significantly decreased. \n\nIt's not the only time fossil fuel industry did this, they did it again with the integral fast reactor in the 90s: http://ergosphere.blogspot.no/2010/10/why-integral-fast-reactor-had-to-die.html\n\nAbout the Helium, it's not a problem since it could be replaced (i read it on papers) by Nitrogen, Hydrogen or even air. They use Helium because it's the finest stuff, but it could be replaced with some adjustments.",
				"added": 1485211007
			},
			{
				"comment_id": 123,
				"body": "> [warlock](#comment_51_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): You're starting to get it. THIS is what you'll have under a free-market and what I've been trying to explain to you. Remove the governments and somebody will understand that if they can make Thorium work, they will corner the energy market and oil will be history.\n\nOkay then, just answer me a simple question:\n\nIn An-cap, How do you enforce a contract without a state?\n\nI checked: dispute resolution organization (DRO), and it doesn't convince me at all.\n\nThese dispute resolution organization will never have the full strength and (false, but still) legitimacy of the state. What's more, it is suggested (https://en.wikipedia.org/wiki/Dispute_resolution_organization) that there would be many of such firm competing with each other in a free market. Then what happen if some don't like one organization and doesn't respect it's mediation or personal protection? If more and more were to place their trust in one dispute resolution organization, and others in an other one? What if all the people behind one DRO decide that the other ones are not legitimate anymore? What happen then? Civil war. \n\nOne other issue is that even if DRO work, it could end like being some state. So instead of having a public state, you'll have one, or many, private states. Isn't that even worse? \n\n",
				"added": 1485257064
			},
			{
				"comment_id": 127,
				"body": "> [warlock](#comment_53_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): I never said it was perfect, but an-cap is the closest thing to freedom that I can think of. Some contracts will be voided and you will take a loss, for sure. That is also the case today, and that will also be the case for an-com. Signing a contract is inherently risky, but you can gain great benefits and rewards. \n\nThere is no such things as contracts in an-com.\n\n> One DRO can't decide the other ones are not legitimate. The market makes that judgement. And it's not a given that it will be civil war. That's your assumption.\n> With that said, we ultimately have to find a way to deal with violence as well. Even though we have the non-aggression principle, some will not follow it. The same is true for an-com. You seem to be making the assumption that if just everybody could realize what you have realized, then there would be peace on earth. Similarly you assume that in every other case than an-com, there will be war, killing and crime.\n\nWithout property, money, hierarchy, and on the condition that there is no human antagonisms left, i don't see the reasons for war, killing and crime (except sexual crimes).\n\n\n> The reason why I entered the discussion in the first place was to see if I could find some common ground. Because ultimately, if states can be overcome then we have to find a way to co-exist. There simply isn't any other way. We can't convince all of you to join us, and you can't convince all of us to join you.\n\nIn the end, it will be like in the beginning. I'm convinced of this like a theist believe in God.  Do what you want in the middle.",
				"added": 1485266501
			},
			{
				"comment_id": 129,
				"body": "> [warlock](#comment_56_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): That's just a cheap rhetorical trick. Obviously you don't have contracts since that is a legal term. Having a fruitful conversation would be a lot easier without you wasting time on trivialities. You are not dumb and I am certain you understood my point. But since I'm not 100 positive: How will you share the means of production without agreements? And what if agreements aren't met? \n\nI'm not medium, i don't know exactly.  Something like centralization of all needs, but not managed by a state or a company, but by direct democracy through the network. Plenty of algorithms to ensure that not too much resources are used, and that some person don't use too much of a particular stuff for something different than the common good. Correction mechanisms to ensure that no one is Favorited. Full transparency to avoid cheating. \n\n> If that is the case, then why aren't we still in communist utopia? What happened. You said that people used to live an-com, and that if people live an-com there will be no antagonism and no reason to commit \"crimes\". Yet we live in a world of hurt. That doesn't make any sense at all. You are obviously wrong.\n\nNo, people lived an-com, but there was antagonisms with the other tribes.  Tribes were waging war to each other, but inside the tribe, it was an-com. Then the neolithic revolution happened, which induced the separation of humanity in 2 classes. For it to coexist and not endlessly fight each other, the state was created. Laws and courts. Delegation of power.  So the 2 classes were forced to work together, even if it's not natural to have this separation. \n\nAn-com cannot exist today, because there would be an antagonism to absorb it and crush it. This is what happened in revolutionary Catalonia.  Whether this antagonism be ethnic, cultural, ideological, religious, makes no difference. But capitalism dissolve all this to make only one kind of relationship between humans: money. Oh yeah, this unholy thing doesn't have any ethnic, culture, ideology or religion. It's the ultimate fungibility.   What's more, capitalism is predatory. It will predate any existing an-com, just for the sake of resources or because it contradicts its imperative to make profit. But when capitalism will become 100% of the world, having destroyed everything else, including antagonisms,  then the time will be appropriate.",
				"added": 1485272753
			},
			{
				"comment_id": 138,
				"body": "> [binero](#comment_211_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): No matter how democratic, any organisation you are forced into is a state. It doesn't matter if you're not directly forced into it.\n\nAt one point what you call the state could just tend to represent the natural organization of homo sapiens.",
				"added": 1485471582
			},
			{
				"comment_id": 151,
				"body": "> [warlock](#comment_68_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): \n> With all that said, oil is a special comodity because the supply is not determined by market forces but by an oil cartel called OPEC. You claim that OPEC is also in control of the nuclear energy market in a global conspiracy. I do not believe so.\n\nIt depends on the words you want to use.  For example, taxi drivers around the world, are they part of a global conspiracy when they take  actions (sometime violent) against Uber? Lobbying, pressure group, conspiracy, choose your word. It's not conspiracies which made history, but history which made conspiracies.\n\nIt depends on the terms you're using. \n\nIf i was in the oil industry, i'll probably do the same in order to keep my place on the company and pay my rent. \n\n\nCurrently, some on this topic (including me) are also conspiring against capitalism. Thisweb11 even proposed to release cockroaches inside Mcdonals ^ ^. If this isn't a conspiracy i don't know what it is. \n\nConspiracies exist, only sometime people mind is too weak to admit that they do, especially when they come from powerful entities. Anyway, conspiracies don't make history (as i said, it's history which made them, when the necessity appears).",
				"added": 1485827879
			},
			{
				"comment_id": 152,
				"body": "We shall know soon enough:\n\nhttp://www.world-nuclear-news.org/nn-first-vessel-installed-in-chinas-htr-pm-unit-2103164.html\n\nAnyway i think solar in the Sahara, in synergy with V2G and HVDC, is even far better than thorium:\n\nhttps://en.wikipedia.org/wiki/Medgrid",
				"added": 1485866575
			}
		],
		"2_1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA": [
			{
				"comment_id": 50,
				"body": "Agreed, we need a forum were topics are sorted by themes.",
				"added": 1481485007
			}
		],
		"1_1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA": [
			{
				"comment_id": 53,
				"body": "What would be a must would be to have an instant vod system. Like youtube but integrated on zeronet and with data hosted on it. \n\nAlso, integrated tools to anonymize everybody a little more.",
				"added": 1481563111
			},
			{
				"comment_id": 54,
				"body": "> [ryanleesipes](#comment_4_18GMgG7f7mYquJC1RCphMRLhMX1wsxzxff): Have you seen ZeroTube? http://127.0.0.1:43110/1FUQPLXHimgCvYHH7v3bJXspJ7bMBUXcEb\n\nThat's cool.",
				"added": 1481628485
			},
			{
				"comment_id": 58,
				"body": "> [whacko](#comment_1_15eMfttUaaszDW39pJHosSc5bgZHuXMEaK): Love the concept but I really hope things improve moving forward in regards to truly decentralized identities. Thats one critical issue I really hope to see resolved soon, its an important part of the growth of ZN imo.\n> unless something has changed since Ive last been on here, but i dont think so.\n\nYes. There's no need to have a P2P internet if the identities aren't decentralize. That completely defeat the purpose.",
				"added": 1481655930
			},
			{
				"comment_id": 74,
				"body": "> [sirolf2009](#comment_2_1669uhTeS1CptbLN8L88NVjP1BTgGMqk9W): No we don't, we need a zeronet cp chan where all the zeronet cp and pedo's can go to for their injection. That way, it's still decentralized and nothing can ever be removed without everyone's permission and I won't have to look at CP all day\n\nAgreed. That's what happened in freenet. When FMS and Sone were developped, all the pedo stayed on Frost, the former board client, so FMS and Sone don't have pedos. \n\nPedos need a place of their own so they won't bother us. I think they'll stay on freenet because freenet is way more anonymous. \n\nAgain, you can treat pedophilia with psychotherapy IRL, but banning all the pedos sites from the clear and the dark, and they'll just exchange their shit IRL with DVDs, which is worse since they'll get in contact with each other and could create some networks and make new contacts (John Podesta?) and do nasty shit IRL.",
				"added": 1483474941
			},
			{
				"comment_id": 77,
				"body": "> [klew](#comment_1_1KiTdHqhaN4cLW9FxzDM61ypmKuaB1YgRA): I agree that the point is not being an anonymity network, but i think it's still relevant to the issue. If there's no anonymity, officials can still track people down for hosting something that's against the state, and ordinary people will start to avoid the stuff out of fear. Sure, you cannot really take it down, but then it's only for those people, who really only want that their shit cannot be taken from the net. But then ZeroNet wouldn't have very many users. Just the criminals and idealists. Remember that Facebook didn't become successful because of its superior technology of user interface or privacy options, but because everyone nowadays feels kinda forced to use it.\n\n\nUse freenet.",
				"added": 1483630867
			},
			{
				"comment_id": 78,
				"body": "> [klew](#comment_3_1KiTdHqhaN4cLW9FxzDM61ypmKuaB1YgRA): ABut at least this allows for easy website deployment and that should be used to market ZeroNet to the regular users.\n\nThis alone is the reason why in 15 years most of the web will be P2P.  The dark will become the clear, and the clear will disappear. \n\nAlways available (no sites down), DDos immune, and no need to rent/own a server.\n\nP2P internet is way more cost efficient. It uses a ressource which is scarcely used in the clear today (except for torrent or filesharing in general  of course): upload of the users. \n\nSo instead of one expensive upload used by big central servers, it use many little uploads of the users.",
				"added": 1483648278
			}
		],
		"1_1NZLYRazPPGcshsgPacgfQVBntrBBLuZ3e": [
			{
				"comment_id": 60,
				"body": "> [gremious](#comment_12_1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA): Yes, I can see why, it is far too easy to post Anything on here without it being censored or removed - a blessing and a curse. Of course, freedom is a major aspect of the 0net.\n> However a bit part of it is going to be the fact that website admins can still monitor and, well, administrate the content of their own websites, and still hire moderators. Chances are, since most people are actually decent human beings, when it comes to major websites like reddit clones and what not, we are going to see standard moderation when it comes to spam or raids and the like while still having freedom of speech (depending on the moderation, which is still a whole new area to explore later in the life of 0net), which will be quite nice. \n> It does post some issue when it come to legislation which is why, as I said, I believe the media is going to jump on it - anything that cannot be lawingly censored can easily be shown as bad. \n> I think there are way to govern this if necessary - the whole point is, however, that hopefully, for us as a humanity - it won't be.\n\nAbout censorship, the only censorship i tolerate in networks is collective censorship, like in Freenet, which works really well in my opinion. \n\nI think you are talking about child porn. About this, the responsible shouldn't be ZeroNet (or freenet), but the sub-humans that record such material. Also, objectively, the thing most responsible for child porn, after the garbage that do this, is the camera itself. Seriously (i'm not even ironic now), cameras are way more responsible for childporn than the networks that are used to share them. \n\nIf one wants to fight against children porn, he needs to act IRL with tools like strong psychotherapy, chemical castration (for hopeless cases), and severe prison penalties of course. In a way, and that controversial, childporn on the internet could reduce childporn IRL. If it follows the same dynamic as adult porn, it could. Indeed, many men don't even want to move their ass and pick up girls and face rejection, they just watch porn. If we make a parallelism with CP, pedophile who haven't still abused children might neven commit sexual abuses IRL, because they can release (literally) their frustration in front of their computer. Yes you need recorded pedophiles acts in the first place, but pedophilia unfortunately exist since the neolitic revolution, and hopefully, it will disappear one day, but P2P networks won't make it worse until then. Probably better in fact like i said.  \n\nChild porn is an awful phenomenon, but it's also rare (not rare enough i reckon). And i repeat, it must be dealt with IRL, before it happen.\n\nWhat is more problematic is the lack of right to oblivion in P2P internet.  With networks like ZeroNet (and freenet),  nobody will have the right to oblivion anymore. In the clear, it works, you can ask google to remove from index content linked to you private life,  but here, as we know, it's impossible to apply. That could be scary regarding stuff like revenge sex, or voyeurism. \n\nWe could also have passive censorship, like an app that register each sites (like adblockers lists) and classify them as offensive or not, with some scale.",
				"added": 1481749900
			}
		],
		"1_16ruLucRLto6GhT1Zb3P8JVZzC48fxd9Cc": [
			{
				"comment_id": 66,
				"body": "Hope in 2017 we will see a major growth of P2P decentralized networks ;-)",
				"added": 1483282469
			}
		],
		"1_1LogBQ7aRYS9KNPZx2nrNKserBBAL5XhyD": [
			{
				"comment_id": 67,
				"body": "> [shellbound](#comment_31_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9):  When it comes to proving Darwin and evolution a simple test like the one with short lived fruit flies does it.\n\nNo. Everything done in labs about fruit flies or bacteria only use genes that were already here. Sometime suppress a gene a rearrange it. Never creates anything. \n\nhttp://www.icr.org/article/5532\n\n When you say \"I prefer to trust what my own eyes or own mind think as true\" how do you do that? Is your values or ideology more important than facts?\n\nWhat my own eyes saw is not ideology. \n\nScience people always say they rely on facts. However, it's more like their own interpretation of those facts. You'll see that the Darwin theory will probably fall in the coming decades.\nDarwin theory emerged in an era when people, especially in the scientific community, were more and more atheist. Thus they projected this atheism into biology. \n\nI prefer to rely on my instinct. That doesn't mean i reject science, but i'll only believe it if anybody can verify. Which isn't the case for Darwinism or even the round earth.\n\nThat's the same reason i don't believe 100% in God/gods. \n\nAlthough i came to the point were i think God's existence is pretty plausible, i'm not 100% sure. \n\nOur world might as well have been created by a demiurge.\n\nIn fact, i think that in 2017, we know pretty much nothing about our existence and why we are here. We have cool tools but that's it.  ",
				"added": 1483319657
			},
			{
				"comment_id": 72,
				"body": "> [shellbound](#comment_32_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9): Well, they can alter the body of the fly by changing it's DNA... What kind of smoking gun do you need? What do you btw mean with \"never creates anything\"? The point here is about transferring traits between generations.. and that is what you can do with flies. That is what happens in dog kennels and other breeder kind of business. You pick a specimen with a desired trait and then breed it. If the long beak of a bird is good for the natural selection it will develop. This is observable.\n\nI think you didn't understand neo-darwinism. \n\nIn neo-darwinism, there is random mutation in the DNA occuring constantly in the nature (sun ray, natural radioactivity, errors in DNA replication). Most of the time, these errors are bad for the individual (cancers, malformations). However, once in a while, a mutation which brings a positive change is supposed to appear (E.G: feather, warm blood, some useful protein etc...).\n\n\nWhat is done in fruit fly doesn't create a new gene or a new function. It just delete an old one or replicate an old one (hence the 4 wings in a fruit fly experiment), by replicating or displacing a gene. No new function are created, no new design.\n\nAbout the long beak, how can you prove that it's the results of random mutations and not something else? The process is supposed to happen in Thousands of years, thus it's not possible to verify the facts.\n\n\n> \n> Yes, that is true... when something turns out the same even with multiple repetitions with different studies. It is eventually regarded as proven. \n> \n> So a \"feeling\" you have is higher valued than multiple years of studying a subject? I can see why you are open to conspiracies. Because they are masters at manipulating that feeling of yours. Which also is why I am critical of these.. I need more than a feeling. I need some facts. Not just any facts but fact that I deem objective enough. ;)\n\nMultiple years of studying a subject by who? Paid by who? Belonging in which power center? Biased by which beliefs? And in the end, multiple year done by humans, which are psychological creature by essence, and more interested by their own interest and their close group than by the real common good. \n\n\n> Are you seriously believing the earth is flat?\n\nI don't know. NEVER was it prooven it is round. All theories and formulas begin with the assumption that it is round. The fact that you cannot see beyond 5 km on the see doesn't mean it's round. \n\n> \n> This is actually something I agree with you. We haven't come far enough. What we can do however is disproving the Bible. Stuff like how humans archeological finding predates the time the Bible suggest humans was created e.t.c...\n\nThe fact the Bible is false doesn't prove humans weren't created.",
				"added": 1483448899
			},
			{
				"comment_id": 76,
				"body": "> [shellbound](#comment_33_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9): Yes, true... but as I pointed out with the kennels. It has been observed and we can see traits transfer to next generations. We can even manipulate it to some degree. Especially in plants this is done which a bit simpler to handle. I guess you have heard of GMO and for instance the golden rice?\n\nWhat your talking about has nothing to do with darwinism. \n\nAbout the dogs, it's not natural or artificial evolution. It's variation in pigment (color of hair), or size (growth control genes. Dogs are not evolved creatures: they are basically wolves. \n\nDarwinism and evolution theory imply radical changes like the creation of the eye, or new fundamentally different proteins. \n\n> Yes, humans are psychological creatures and can fail and be biased. That is why the documentation is so important. If it is biased it will be discovered eventually. Some things faster than other..It is possible to build a rocket yourself and send it up with your gopro to space..\n\nI've seen this. Fisheye lens. It's not anybody who did this, it's  a company.  https://www.youtube.com/watch?v=bDoh8zQDT38\n\n> so that earth is round it is a veeeeery proven fact.\n\nIt's a very not proven fact. All the equation and calculus start on the assumption that it is round, but it was never proven. I don't know if it's flat or round or something else. However, i don't trust Nasa. Lot's of what was produced by Nasa is just pure fake, and this, even people believing the earth is round agree. \n\nIf you want my opinion,  it's possibly a dimension. It doesn't really have a form, or edges, but you might not be able to escape, or go to space, which possibly don't even exist. However, i don't deny that it's possible that it's round, and space exist. I don't know. \n\n >When ordinary people send up rockets and you can see it is round... then the conspiracy is very much dead. \n\nThis one looks flat, one of the highest done by amateur. Of course, you'll say it wasn't high enough to see the curbature. https://www.youtube.com/watch?v=sQw_C5KLhFM\n\n>Or do you think there are some kind of Portal (the game) kind of apparatus surrounding the plate and send you back to the opposite side when you reach the edge?\n\nNow you might be onto something.",
				"added": 1483580620
			},
			{
				"comment_id": 79,
				"body": "> [shellbound](#comment_34_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9): Yes, it is.. it is about survival of the fittest and that doesn't necessary mean growing a never heard of new function. It is about growing an extra limb, being bigger or have a different color set. Small things that might improve your chances of survival. That we can do. We can also clone.... We can however not make a video of evolution having it course but that is not really needed. How do you know dogs are basically wolves?\n\nNeo-Darwinism isn't about survival of the fittest. It's about random DNA mutation which lead to evolutionary advantages in a specific environment.\n\nDogs are wolves, is basic. What differenciate a race from a species, is that individuals from this particular species can repreduce with each other. Dogs can reproduce with wolves, hence, they are from the same species. \n\n> So earth is flat... well, take a look here. I am guessing you will say it is fake. B.t.w.. I live close to a rocket launch site which isn't Nasa. I have personally seen a rocket go up to space.\n\nI didn't say it's flat. I said i have doubt about NASA and what we are told about. \n\nSo you see rocket launching. Do you also see were they are going? You see a rocket going up, but were? Does it really goes into orbit or does it just travel a few thousands kilometers in the atmosphere and then crash somewhere in the ocean? Is it  reality or is it a story? \n\nTake an interest in the early nasa founders, including Von Braun and Walt Disney (yes).\n\nOh, and by the way, as a kid i also read books about spaces, and i dreamt about it when a was a teenagers, and as a young adult i dreamt about extraterrestrial life, but guess what, it's not impossible that it's all BULLSHIT. \n\nWe might be alone in this terrestrial dimension, were we can't escape and were the sky is a holographic projection. ",
				"added": 1483705211
			}
		],
		"2_1CR3B1Bwx6umZqL7H6hrbyPdXKJR7j8Mfn": [
			{
				"comment_id": 68,
				"body": "That was/is pretty stupid for the Ukrainian to fight each other for the benefit of the western hegemon.",
				"added": 1483383495
			}
		],
		"1_16t3kUomTJyA8o91DM8t5uxqqgvxNAo3Ly": [
			{
				"comment_id": 69,
				"body": "Someone should put Kaffiene in Zeronet homepage (it's not really your fault). \n\nhttp://127.0.0.1:43110/kaffiene.bit/",
				"added": 1483394946
			},
			{
				"comment_id": 71,
				"body": "> [k9](#comment_4_1AWSA7oG2qrhWYgeSiJtDHCwc2KvyR7ijs): Kaffiene is horrible?? play is probably the best without being really good...( /1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/)\n\nDon't know i like Kaffiene.",
				"added": 1483404487
			}
		],
		"1_1EnpqtRvDzbDetkQkTScZ38unnd9pX4izp": [
			{
				"comment_id": 70,
				"body": "+1000\n\nCheck the anarchism topic below.",
				"added": 1483397359
			}
		],
		"13_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": [
			{
				"comment_id": 73,
				"body": "Agree. A massive ddos could happen again like the one which happen a few weeks ago. \n\nWhat's more, a news zite would galvanize Zeronet (like Torrents zites do).",
				"added": 1483474122
			}
		],
		"1_1BRSETd8x5XUtHt9jz2e4WdB9rWY1WNfiu": [
			{
				"comment_id": 93,
				"body": "The tutorial to run Tor with Zeronet with Debian is well done, however, with other distros it is not so simple. \n\nJust a suggestion (and since i'm not in computer science), someone should add tutorials for the other mainstream linux distros,  or find a way to integrate tor in Zeronet in linux as well (i think it's already integrated in windows).",
				"added": 1484487255
			},
			{
				"comment_id": 112,
				"body": "It works under my computer were it's the \"classic\" Tor\"\n\nI have some computers were the Tor browser bundle is installed. \n\nWhat's more i'd like to know a method to install it in some friends computer under ubuntu were the Tor browser bundle is installed as well. \n\nIs there a method to make ZeroNet work with the Tor browser bundle? \n\nI guess the answer is yes but the Torrc file is different with the Tor browser bundle.",
				"added": 1484872317
			}
		],
		"31_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 94,
				"body": "Opera was in my opinion always way ahead it's time. \n\nTo my knowledge, it was the first to integrate tabs, add-ons, a startup homepage, and many other innovations. They must have some smart developers. \n\nShame that the other browsers just copies the innovation and had more success (internet explorer, firefox).\n\nHowever, opera is not open source. So that's not very nice.",
				"added": 1484493950
			}
		],
		"1_12GaWA6iLCDZ2bfQ2QBBvrj3bY17HwFCgA": [
			{
				"comment_id": 97,
				"body": "Strange affair. \n\nOnce again those who are implicated in projects who could help humanity and make things better have a very short life expectancy. \n\nHowever, Kissinger, Rockfeller D. and Gerges H.W Bush (just to name a few) are still alive and doing well. Strange isn't it?",
				"added": 1484601472
			}
		],
		"1_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd": [
			{
				"comment_id": 113,
				"body": "> [zerofirstpulse00](#comment_1_15P6GFRCWwkfUEo2g8nm22epWiF4np3Dob): Agreed. Not necessarily about the down-voting, since that just ends up like Reddit where things people disagree with end up at -50. But you should be able to block individual users that are blatantly trolling. Freenet had a clever system where up-voting individual users would percolate through people that up-voted you, so those people would see the comments  of the the account that you up-vote as higher rating; the idea being that trolls that get down-voted essentially have their accounts drop off the system completely.\n\n\"freenet had\" ^^\n\nIt's not dead yet. But i agree ZeroNet is 10 time better, mostly because it's way faster and has (perfect?) data persistency. (in freenet older messages tend to disappear which is awful in my opinion).  \n\nAnd i agree and amplifly. If there is one good system to manage troll and spammer, it's freenet Sone and \nFMS system. It's democratic and you can put your own parameters, depending if you want to just make trolls invisible, or  people not interesting for you, or see everybody.",
				"added": 1484932757
			},
			{
				"comment_id": 115,
				"body": "> [00d4n1](#comment_4_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd): There's a very strong correlation between anti-Semitism and fascism. It's called the Holocaust.\n\nNo. War between 2 jewish factions. Zionists/ Non Zionists. \n\nNaZi = National Zionist (might be i'm not 100% sure). \n\nhttps://www.youtube.com/watch?v=LO5sbwGCR7A",
				"added": 1484999263
			},
			{
				"comment_id": 116,
				"body": "> [00d4n1](#comment_5_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd): Are you serious? \"Nazi\" is a contraction of the literal German name for the party, Nationalsozialismus. It absolutely does not mean \"National Zionist\", and the Nazis absolutely were not Jewish.\n\nTake an interest in the links between the Nasdap and the zionists. Hitler and the Tavistock institute. Also, in the Haavara Agreement. \n\nIn the end, believe what you want to believe. \n\nIf you feel good believing the jews (and not only the orthodox jews), were the victim of the big bad nasdap which came out of nowhere except the inherent hatred of the german people, then good for you. \n\nOr you can open your eyes and see reality for what it is,  and not what is most comfortable for you,  what the grown ups told you when you were younger.",
				"added": 1485005096
			},
			{
				"comment_id": 126,
				"body": "> [00d4n1](#comment_6_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd):\n> Incidentally, I don't want to \"sensor\" (sic) any opinions. \"Pineapple on pizza is disgusting\" is an opinion. \"Black/Jewish/Muslim/[insert any identifiable social group here] people aren't human and should all be killed\" is not an opinion - it is advocating for genocide and does not deserve a platform.\n\nThis is not a platform you retard. This belong to all of us. \n\nNow get back to CNN, it's a \"safe place\".",
				"added": 1485264829
			},
			{
				"comment_id": 131,
				"body": "> [00d4n1](#comment_8_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd): \n\nWhat is your problem exactly. Are you jewish? \n\nAre you a SJW and expect to score points by being the best progressive guy in the room? \n\nThis is not a bobo party downtown,  in a big metropolis somewhere in the west, or, for that matter, the comment section of your average MSM, where most comments are filtered by paid employees, mostly relocated in the third world. \n\nThis is P2P internet. Either you deal with it or you get the fuck out.",
				"added": 1485296298
			},
			{
				"comment_id": 139,
				"body": "> [warlock](#comment_65_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1):\n> Honestly. Fake news is easy to cope with. Just have a transparent administration. But they won't. So they cannot cope with fake news, because they have to many skeletons in the closets.\n\nFake news are just the latest newspeak word to blame those who don't think like the system, and hunt them down. \n\nWho decide a news if fake? Professional journalists? Reuters, associated press, AFP? The NSA? Tavistock institute? \n\nThis is bullshit. For me this is the last social engineering thing. \n\nTHEY are probably the one who spread the most fake news. \n\nThere are no real fake news, just news to discuss, even the most absurd, and people must decide, according to their reason, if it's real or not, depending on the facts supporting them.",
				"added": 1485472632
			},
			{
				"comment_id": 140,
				"body": "> [binero](#comment_214_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): \n >Look in the UK, where there is fake news everywhere claiming the EU parliament is not democratically elected,\n\nIt is democratically elected (however representative democracy isn't democracy), but there is an average of 1 MP for 680000 european citizens. So no. For me they are democratically elected but it's a masquerade of democracy.\n\n\n> or that the EU commission appoints itself. \n\n\"The President of the Commission is first proposed by the European Council taking into account the latest Parliamentary elections; that candidate can then be elected by the European Parliament or not.\n\nFollowing the election of the President, and the appointment of the High Representative by the European Council, each Commissioner is nominated by their member state (except for those states who provided the President and High Representative) in consultation with the Commission President, although he holds no hard power to force a change in candidate.\"\n\nIt's not democratic at all. If someone is elected by someone who is elected (and represent 680000 citizens for one MP for the EU parliament), it's not democratic.  Only the european commision can propose legislation. The european parliament can't, and has no power at all. Even the european union concil can block the European parliament during the legislation process. The EU parliament is caught between the commission and the european union concil during the legislation process. Even if it wasn't, it's a farce (again, one MP for 680000 citizens).\n\nThe real politic of the EU isn't decide in the commission, or the parliament (which is just a facade), but in oligarchs informal reunions.",
				"added": 1485473424
			},
			{
				"comment_id": 158,
				"body": "> [binero](#comment_217_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Why not just have community moderation? If too many people dislike something and too few like it, the post becomes unlisted. If you feel that's censorship, you can create your own zite. \n> It's no good to have a lot of spam or bad content on the homepage. It puts people off.\n\nYes i prefer a community moderation (FMS and Sone like) than a blacklist, even if the blacklist can be disabled. \n\nI don't know why the idea of a blocklist is more popular here recently. Probably because many don't know about the FMS and Sone system.\n\nOh and yes, a community moderation might be slightly more difficult to understand than a blocklist.  It seems the blocklist is the easier way (everybody knows adblock). In our day and age, the easiest way is most of the time preferred. We like things to be simple and comfortable, more than having (real) equality. \n\nIn short, we prefer comfort (blocklist) than equality (community moderation system).",
				"added": 1487164851
			},
			{
				"comment_id": 159,
				"body": "> [burningcold](#comment_5_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs): Downvotes on Reddit exist for a reason, and we should have them here.\n> On the other hand, this is a forepressure based system - so create some pressure by producing new content! If non-Nazis actually write highly upvoted posts, then the Nazis will get downvoted to heck.\n> Additionally, I want to be allowed to choose which content I do and do not share with others. I have no desire to be seeding anti-Semitic bullshit to others.\n\nYou sound like anti-semitic bullshit is the biggest problem in this world. \n\nIn the end of the day, do what you want, with your all your blocklists proposition and censorship, you won't stop this concept of P2P internet.",
				"added": 1487195423
			},
			{
				"comment_id": 160,
				"body": "https://wiki.freenetproject.org/Web_of_Trust",
				"added": 1487423189
			}
		],
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 114,
				"body": "Make some deep research (or read/hear the right authors) and you'll find that Islam is some derivative from Judaism.",
				"added": 1484950800
			}
		],
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 117,
				"body": "> [psy](#comment_1_1CF2st1nsRZ9AP1YdUw3rVQAgg3vMQraKA): Jews were always good liars and this gave them a great advantage in scamming other people.It has been demonstrated neurologically that lying very much changes the brain structure.As they have habbits not accepted by the society they had to disguise it and doing it since many centuries this ability has been impregnated in their genes. This is the same ability as used for cheating.However this is not without costs. Lying requires more brain ressourses to memorize your previous lies and to be consequent with them. This way your create other realities in your brain.This creates by many Jews rupture in their brain structure, schizophrenia.Schizophrenia occurs with a much higher percentage by Jews, this is a statistic evidence.\n\nSometimes, they tend to believe their own lies...",
				"added": 1485103525
			},
			{
				"comment_id": 141,
				"body": "> [binero](#comment_213_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): This is not how evolution works. Behaviour doesn't make it into the genes if you keep doing it for enough generations. \n\nNo but epigenetic does (regardless of the topic i'm not particulary antisemit, i don't really care and all things considered, i prefer jews than muslims).",
				"added": 1485474653
			},
			{
				"comment_id": 157,
				"body": "> [desecration](#comment_1_1K7A478yCYFaroSqmPNJzzMPcf2rJQvhw): Another method used by Jews to keep secrecy was to steal and desecrate host from the church, the bread simbolizing the body of Jesus.This was used by other groups sponsored by Jews also.Gays have stolen host and put on their ass before making anal sex.The feminist group Pussy riot put urine on host in front of the media.\n\nI heard freemasons do the same thing.",
				"added": 1486667483
			},
			{
				"comment_id": 178,
				"body": "Okay i stumbled upon this:\n\n https://outofthisworldx.wordpress.com/2015/09/30/harald-kautz-vella-the-elderers-humans-have-completely-failed-the-game/\n\n\n4. Do the souls of the Jews who destroyed their own planet always incarnate on Earth in Jewish bodies or do they incarnate as other races as well?\n\n.\nThe Earth is the only planet they are allowed to incarnate on, and they always incarnate as Jews. We have to state at that point that it is a big honor for a being to be allowed to incarnate on a planet. There are many examinations to be passed before a being is allowed to incarnate. Due to the crack of Atlantis it was possible that beings incarnated on Earth that within the heavenly order would not have had the maturity to incarnate at all.\n\n.\n5. Were Jesus, Mary, etc. Jewish souls, and if not, why did they incarnate in israel as Jews (or is that disinfo?)\n\n.\nAll stories about Jesus and his parents have been heavily distorted by the Archons and their servants. Jesus is the son of the two Elderer we are in contact with, and he also is incarnated at the moment and is currently two years old. He hasn’t been Jewish back then and did never incarnate in Israel. The entire history of Jesus did not take place where it is believed to have happened today. We will not display more information about this issue at this point.",
				"added": 1488902886
			},
			{
				"comment_id": 179,
				"body": "> [aiden](#comment_3_1GB5YpL2bL1qNx2tuQrzjh35HbZysivKtb): good for them, a world government would be a nice change of pace\n\nCould be but who'll be in charge? \n\nThe people? The rich? Technocrats? Jews? Satanists? Alphabet agencies?",
				"added": 1489107814
			}
		],
		"1_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": [
			{
				"comment_id": 142,
				"body": "> [d0157](#comment_1_1HgRVz1iqP8K7pbToiu1SoQLPynoh8Zr4y): Germans killed six million Jews.Stop with antisemitism.\n\nAnd you stopped to believe in Santa Klaus at the age of 12.",
				"added": 1485474798
			}
		],
		"1_16EGCX1cmogYo2EPidRU3axQ6N3jNQndoa": [
			{
				"comment_id": 143,
				"body": "I don't have any competence in computer science, but i think if most people use VPNs, it should be very hard to censor ZeroNet. \n\nZeroNet could be blocked on the  ISP level, but not if users use VPNs (located in countries which do not block). And there are about 20000 different VPNs around the world.\n\nIMHO, the biggest force against censorship, isn't Tor, Zeronet, Freenet, but the combination of such networks with VPNs.",
				"added": 1485535615
			}
		],
		"1_17AcmbLffN1gjfsTf6Jy8K2aBPdMaSBrrf": [
			{
				"comment_id": 154,
				"body": "Try this: http://127.0.0.1:43110/kaffiene.bit/\n\nAbout IPFS, it's not part of ZeroNet, but it is an other software.",
				"added": 1486146745
			}
		],
		"1_1PvP6Vjh8q44LhyXTiBZc4APMtyzwyttbL": [
			{
				"comment_id": 155,
				"body": "Anytime an internet  service or software gets too much influence, it begins to fuck up. Microsoft, google, android apple, facebook, twitter, and now youtube (which belongs to google), etc...\n\nWe already know it, but if we concentrate towards open source and P2P it won't happen.",
				"added": 1486150887
			},
			{
				"comment_id": 156,
				"body": "> [warlock](#comment_74_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): I don't really question global warming, but UN is very questionable imo. My main problem with climate change or whatever it is they are calling it these days is the profound verbal assults you will get if you are skeptical. In science one needs critics for the theory to get vigrously tested. This is not the case for climate change. However, I see first hand that things aren't as they used to, so I haven't really been questioning the whole idea.\n> But when I see this:http://www.investors.com/politics/editorials/climate-change-scare-tool-to-destroy-capitalism/\n> It gets me thinking. It would be better if it was an internal document leaked to wikileaks or something though. Just an assertion on a website I haven't heard of isn't very credible. But still it fits well with the globalists narrative.\n\nClimate change is a tool to get to a world government.\n\nWhat is a problem that could be universally shared? Pollution? Poverty? War threat? Not. Really. But climate change is the (supposedly), universal threat, which potentially concern every person on earth.  \n\nThat's why the proponent of a world government have found their perfect problematic to initiate the draft of a world government: the COP21. They will push further and further. ECSC and euratom were draft for the european union. COP21, and other meetings like that, are drafts for a world government. \n\nThey were thinking how to initiate the process since the 60s (there are documented proofs). They even wanted at some point to reunite the world in face of a supposedly alien threat. https://www.youtube.com/watch?v=iQxzWpy7PKg\n\nSeems in the end global warming is more reasonable and plausible.",
				"added": 1486210433
			}
		],
		"2_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": [
			{
				"comment_id": 161,
				"body": "> [testunit](#comment_1_1CAUL8cJtANuC6khKYwg6orGWnLbjPgaLu): Oy vey what a shoah. Go back to your safe space if you don't like it here.\n\nYes this burningcold don't need zeronet. He wants everything to be under control,  like a MSM Tv set.",
				"added": 1487423843
			},
			{
				"comment_id": 163,
				"body": "> [testset](#comment_57_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp): I'm pretty sure there is only 1 pathetic guy with plenty of accounts trying hard to pretend they are many ;-)\n\nIndeed many times, these progressives do this.  But even with 100 accounts, here or in the clear, they are a small minority now. \n\nThey won't last 5 more years.",
				"added": 1487631431
			},
			{
				"comment_id": 187,
				"body": "> [border0464fred](#comment_89_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): Im totally ok to fight thoses retarded, My grand father have given me his lucky nazikiller bayonet form WW2 im all good.\n\nEasier said than done.\n\nBy the way, they are sure obsessed about Jews, but you're undoubtedly obsessed about Nazis, something which almost completely disappeared more than 70 years ago.",
				"added": 1490645019
			}
		],
		"1_1MocL2J4KmBk6xozE4eE4jQVfurHdGCTqM": [
			{
				"comment_id": 162,
				"body": "I thought about this (cloning reddit, not the animal porn stuff).",
				"added": 1487514223
			}
		],
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": [
			{
				"comment_id": 164,
				"body": "> [gazacrimes](#comment_1_1ARe6ts4pcAy5NvR6g77f6SKmtiB7tzXgn): Fecal phantasies are very frequent by Jews.\n> Fecal freak Spielberg’s other Oscar-winning Holohoax propaganda film Schindler’s List features a scene in which young kids hideout from the “evil Nazis” inside of a toilet—neck deep in urine and feces.\n> One Jewish author, Joseph E. Tenenbaum, actually wrote about Jews having sex while inside of a dung-filled toilet. Imagine for a second crawling inside of a toilet, and then having sex with someone. These people are disgusting beyond belief.\n> A bizarre offshoot of psychology led by possible Jew Lloyd deMause called Psychohistory takes the childhood toilet trauma a step further and asserts that both the so-called Holocaust and WWII were natural outcomes of incredibly sadistic behavior practiced on infants by the average German mother.\n\nI just thougt about this a few days ago. Not about all the jews, but specifically about the completely crazy jewish prophet Ezekiel. Maybe it comes from there.\n\nGod Orders Ezekiel to Eat Shit and Lay Siege to a Clay Tablet:\n\nhttps://www.libertariannews.org/2012/09/05/god-orders-ezekiel-to-eat-shit-and-lay-siege-to-a-clay-tablet/",
				"added": 1488064400
			}
		],
		"2_1JHumjFpXMTtSgm1ygdHqsvL9321Z87NDc": [
			{
				"comment_id": 165,
				"body": "> [mkg20001](#comment_11_177ia43eQrnWCHCWt1ik6viQGRzWuNXGzD): Unless you have/like/want Apple hardware, you should use Linux.\n\nMac is a scam. Hardware way more expensive than the equivalent in the PC market. \n\nAnd of course Linux is open source so you contribute to change the societal paradigm in adopting it.",
				"added": 1488113615
			},
			{
				"comment_id": 174,
				"body": "> [maemolee](#comment_1_162hARzMwv7JbbTF1d9ZsXD4TrFK2mYstD): Mac is the best choice for who don't want to be puzzled.\n\nPaying a lot so users are not a little puzzled. \n\nI prefer to use open source and be a little puzzled.",
				"added": 1488638943
			},
			{
				"comment_id": 183,
				"body": "About the great classless and propertyless world we will live in in half a dozen decades, Linux is the first stone.",
				"added": 1489710076
			}
		],
		"1_1HMgB5kC5CXhxSngryrEDLUrPXkKgH1mtt": [
			{
				"comment_id": 166,
				"body": "Search  engine bar with choice of a search engine (like firefox or chromium) in the homepage plz.",
				"added": 1488235035
			},
			{
				"comment_id": 168,
				"body": "> [kaffie](#comment_241_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): \n> You can install Kaffiene to your browser, if that's easier for you.\n\n\nIt's not about me, but about the new user who constantly ask if there is a search engine in Zeronet.",
				"added": 1488333315
			},
			{
				"comment_id": 170,
				"body": "> [kaffie](#comment_243_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Yeah, sorry. As I said, I've had personal stuff going on and my work ethic has just kind of been next to nothing lately. I really need to get myself working. Probably need therapy or something >_>\n\nJust do a complete blood exam (vitamins, neurotransmitters, essential fatty acid, minerals, food allergies), then according to this blood exam, take the food supplement you need. Don't take randomly these food supplement because you could take what you don't lack currently. That's what the blood exam is for. Most doctors won't prescribe a complete blood exam. So you need to find one who will do it. Ordinary blood exams are shit. They are just checking if you are not literally dying. \n\nMost of the time, people who complain about tiredness or depression just have bad nutrient deficiency. Of course big pharma prefer to sell antidepressant, it's a better income than food supplements.\n\nSource: i did this and i feel at least 2 times better.",
				"added": 1488377169
			}
		],
		"1_1ATpj32EgvgApKTmBq1KiY62B5UjzfSRJS": [
			{
				"comment_id": 167,
				"body": "Maybe he's a fake president, but you  1488312195 are a bobo (white upper middle class who lives around white upper middle class). \n\nAbout Muslims, you don't seem to know exactly what is Islam. \n\nI suggest you travel in arabic countries, alone, without a tour guide or a group.\n\nThen, when you come back, you'll feel soooo happy that you're in a Laic/ Christian country again. \n\nTraveling in an arabo-muslim country alone (although i made some westerner friends there), made me realize that most arabo-muslims are not our (we westerners) friends. Regarding westerners, muslims completely ignore the concept of fellow human beings. It applies to them, between muslims, but not to the non-muslims. ",
				"added": 1488323464
			},
			{
				"comment_id": 169,
				"body": "> [shellbound](#comment_37_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9): Islam is a part as is Christianity of the Abrahamite religions. They have the same origin. Which tells. A lot between them is very similar. They are very unlike the Confucius based religions. Take Malta for instance... they do not allow for abortion. They will not even save the women if it threatens her life. In Arabic countries you can do abortion if it threatens the woman's life. They believe the spirit doesn't come to the fetus until after 4 month. Which makes the time before that not as important..... but there is cultural differences between countries, areas, families. You can not apply the Saudi Arabia filter on a more liberal country like Lebanon or Tunisia. They are very different. One Muslim is not the same as another Muslim. They are not homogeneous. They are individuals..Disabled had it very though in Christian countries before. It was looked up on them as God's will. That they became disabled because of sins their parents had been made. Disabled was therefore hidden many times or killed. Luther saw for instance some of them as witches or taken by the devil. Stuff like this never happened in the Islamic countries..I have been traveling alone in a North African country. They are very liberal. At least in the urban areas. I could almost say 50% European values. Islam never talk about musts. It talks about what you should... but never explicitly must. If it would save you life it would for instance be okay to eat a medicine made from pigs. Life is precious. If you are sick, travels, are a kid or too old. It is okay not to pray. Christianity is the one talking about musts. It is natural for humans to sin though. So in essence they are kinda similar..What happened was the Enlightenment Movement. It changed the culture (including the religion) in Europe. Before that it could be argued that Islam was more humane than Christianity.\n\nYou seem to conflate Christianity and the Catholic church/ Church of England. Jesus Christ, whether he is the son of god or a very famous man, never talked about musts. \n\nAlso, nice the example with the disabled, but what about the women who are stoned to death and forced to wear a complete veil? \n\nAnyway i don't want to have a debate about Islam. I was in Islamic countries and i understood that they don't consider us as fellow human beings. It's enough for me for not willing to be friend with them.",
				"added": 1488333878
			},
			{
				"comment_id": 171,
				"body": "\n\nIt's interesting that when you think of Islam as an abstract religious movment, everything seem fine, better even than christianism like shellbound said. \n\nHowever, when you live in direct contact with muslims for years, even more, you end up thinking: \"they don't like us\". It's not me, but the experience of people who were super tolerant and open for decades, and i take their opinion into consideration. \n\nThen you have people who get upset when you say \"hello\", or \"goodbye\" to them, because the prophet said it's salam aleikum, and aleikum salam. You must adapt to be polite but never say a simple thing common to all westerners like \"Hello\". People who think you are disgusting because you eat pork (although i'm a vegetarian myself). People who think it's fine to fuck a white women but who will never allow their sister or daughter to date a non muslim. I'm taking about Muslims in western europa here. \n\nMost importantly, any societal change for Islam is not necessary, and rejected, because the perfect way of life was written in 632 CE.\n\nIt's one thing to have a muslim colleague, or even friend, but living among them as a non-Muslim is another matter. \n\nI don't say they are a threat, or even that we should fight them. But the west, and especially europe, is not a muslim continent, and should not become one. If they want to live accordingly to their beliefs, there are many countries were they can go. \n\nThe west have been christian for more than 1500 years. So now we should all forget about that? Even for the atheists and agnostics, christianism is our culture, our roots. An important part of our way of thinking. Shall we all forget that?\n\n ",
				"added": 1488471731
			},
			{
				"comment_id": 172,
				"body": "> [ins0mniak](#comment_3_1LMNoBqBx1J5Ug83Huseh6fTQ4TAaDZoJj): Sorry, I was talking to the Trump hater. not you.\n\nMy bad, sorry. However my post is still useful, in case some SJWs come here.",
				"added": 1488478071
			},
			{
				"comment_id": 175,
				"body": "> [shellbound](#comment_39_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9): The colonization have done a great deal in affecting the culture. \n\nAbout colonialism, it's not a good thing, contrary to the right of freedom of the people.\n\nHowever, let's not forget that the Ottoman empire which controled most of arab-muslims countries for hundreds of  years,  before the english or french colonization, was a slaver empire. What's more it taxed very heavily the populations, and deported the populations if they didn't pay the taxes. \n\nI'm not defending french colonization. But before it was way worse. Regarding Morocco, France colonized it in the 1830s, taking it from the Ottoman empire,  but abolished slavery in all it's territories in 1848. \n\nSo it's very true to say it's french colonization which abolished slavery in those territories.",
				"added": 1488666369
			},
			{
				"comment_id": 176,
				"body": "> [shellbound](#comment_40_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9): Not sure what you wanted to say with that. The point I tried to make was that colonization was before the globalization and that it too have led to a cultural harmonization. And slavery can be a tricky thing. Some say the American prison system is a kind of legalized slavery.\n\nI wanted to say that many north africans (maghreb) heavily criticize french colonization like it was hell on earth, when before, under the ottoman empire domination, it was way worse (slavery and suffocating taxes).",
				"added": 1488755657
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 173,
				"body": "> [jtl3525](#comment_1_1GXcdmK9YpMdC5co7w3Mi8J7o7HjsNTKTz): Very promising technology this was so badly needed as censorship will become the new norm soon.\n\nIt's cool isn't it ;-)\n\nBefore there was freenet but this definitively is better.",
				"added": 1488578973
			},
			{
				"comment_id": 177,
				"body": "> [ciphas](#comment_2_1KaE6CH96xFrVs3ynPmnFTpSVBaFzd6MpR): Usenet and Freenet still exist.\n\nYeah but this crush them in terms of potential.",
				"added": 1488773259
			}
		],
		"1_1MwJSNBC1savftEvXQyoHcVLDgThtAPr6T": [
			{
				"comment_id": 180,
				"body": "I don't see any particular bugs or even something lacking in Zeronet. \n\nCompared to freenet it's super fast, reliable, there are working search engines,  and we have streaming and the possibility to integrate comments in a Zite. Things that were lacking in freenet. \n\nSince i'm a little more skeptical than the other ones i'd say that your post is an attempt to demoralize the project. I don't know for who, or for which reasons, but i don't think it's gonna work.",
				"added": 1489414816
			},
			{
				"comment_id": 181,
				"body": "> [burningcold](#comment_22_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs): Not everything is a conspiracy. OP is just bad at computers.\n\nSince he said he tried IPFS, FreeNet, I2P, MaidSafe and now ZeroNet, he mustn't be so bad, that's why  i think there is some malevolent intention.\n\nYou cannot possibly try all these network and think all of them suck.\n\nWhat's more i'm also a non-coder and i'm fine with most of them.",
				"added": 1489432788
			},
			{
				"comment_id": 186,
				"body": "> [kaffie](#comment_246_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Personally, I'd like to kill the market, and business entirely. It should not exist, is a cancer on the world, and deserves to be abolished. I wouldn't want businesses here. Half the point for me is to get away from centralized monopolies that hoard and abuse data. I personally like that there's an atmosphere of community here, unlike on most of the internet.\n\nYou're right.\n\nThe point of P2P and open source is to abolish the market, not to be an other area for the market. \n\nThe capitalist mode of production has an enormous inertia, but it's still loosing a little speed, and will definitively stop in a few decades.",
				"added": 1490054132
			}
		],
		"1_1HJugahAiT2RnwJQdHuEd2RgW5fpWwNxnB": [
			{
				"comment_id": 184,
				"body": "I think it's twiggydew, the person from the \"leaving ZeroNet\" post, with an other username.\n\n\nWorking prototypes are rarely successful. See with electric car. 30 years they are trying, and it's only taking off now. \n\nBefore ZeroNet there was freenet, and it think there will be an other P2P network in the years to come which will have a real popular success. \n\nAn all in one stuff like the Tor browser bundle would probably have more success. Download, click to install, use. \n\nMost casual users don't understand why they should type http://127.0.0.1:43110/ in their adress bar. \n\nIn the end, P2P internet will be successful, not because people are awakened, but because it's more efficient : cheaper than huge central servers, like bitcoin vs the visa system,  no down servers, ddos immunity, could also be faster than central internet in a few years. ",
				"added": 1489778962
			},
			{
				"comment_id": 185,
				"body": "> [darvy](#comment_4_1EqerKajfi14bzTkqwSfqVrxKmQW1w6Nzk): \n\nP2P internet will take off anyway. \n\nWill be a shame if it's a closed sourced P2P project thought.\n\nI'm  a non-coder but i'm almost sure that a pre-configured web browser for ZeroNet, like Tor browser, and some adjustment, like Kaffiene or any other search engine on the start page, should significantly increase the number of users. \n\nWhat would also be good would be for the all the clear torrent site to definitively be closed. After the summer 2016 shutdown, i feel that there was an increase in interest in  Zeronet because of that, but now with Torrentz2 with onion mirrors and other mirrors in countries which are out of reach, torrents sites in the clear are even better than before.",
				"added": 1489876586
			}
		],
		"1_14aBVs7naxTC3Vs9N2yoYod6iwoRP6xfV2": [
			{
				"comment_id": 188,
				"body": "Am i really commenting such crazy topic?\n\nI hope you are not serious, otherwise you are seriously alienated.",
				"added": 1491774929
			},
			{
				"comment_id": 189,
				"body": "> [sabex](#comment_2_19rkiNP5VnnvFVshps5XRwhYsuxGe7QqDD): I dunno, people are innately disappointing.\n\nI'm not a SJW, however, talking about irrealistic and crazy stuff doesn't help to get things better.",
				"added": 1491782885
			},
			{
				"comment_id": 190,
				"body": "> [anim76](#comment_4_14aG268HqAHbykUN9h1kRzaGZHfrMtV33R): YEA! let's just forget about false flag cia chemical attacks that would legally allow nato to intervene, chemical attacks that happen to occur while assad's army has IS on a full retreat claiming weeks worth of ground daily with a foreseeable victory (aside from sporadic guerilla fighting) within 9-12 weeks (they won't tell you the real facts on MSM). Obviously the use of chemical weapons (crossing 'red line', allowing legal nato regime change) on civilians in full view of the white helmets (soros funded) and countless cameras was because assad's secret fantasy is to watch his country burn from a cell in the Hague, duh     -_- OP is 100% on welfare, food stamps, something, bitching at immigrants, having no clue that he's playing right into the real enemy's hands, the bankers, those globalist elite fucks at the CFR, TLC, etc. that wrote  those immigration policies and push said policies to the limit. [...]\n\nThe western hegemon (US, UK, France), want to build a gaz pipeline going through Syria. It's as simple as that. \n\nIt time we don't use fossil fuel anymore, so less conflicts will happen. N.B: the first world war cause was already fossil fuel in the middle east: the Baghdad Railway. http://www.revisionist.net/hysteria/baghdad-bahn.html\n\nhttps://en.wikipedia.org/wiki/Baghdad_Railway",
				"added": 1492351124
			}
		],
		"1_1E8KDakJCmMofVgTawocXc4pX9Fn3K3ob1": [
			{
				"comment_id": 191,
				"body": "> [gary2016](#comment_3_1E8KDakJCmMofVgTawocXc4pX9Fn3K3ob1): i think behind all jews and bankster are an forgotten power elite maybe not human???\n\nLOL\n\nYeah it's possible, but hey, most people, including here, won't believe it anyway.",
				"added": 1492530520
			},
			{
				"comment_id": 193,
				"body": "> [alaric](#comment_24_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY): I'm not sure what's scarier, the thought of being drafted/conscripted, or the thought of nukes/WMDs being dropped...\n\nWorld wars are a result of the capitalist mode of production. Without capitalism, no more world wars. \n\nNo money, no state, no division of labor,  no hierarchy = no world wars.",
				"added": 1492604451
			},
			{
				"comment_id": 194,
				"body": "> [alaric](#comment_25_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY): I guess distancing yourself from luxury items like phones, electronics, etc is a good start?\n\nExactly. It's a small step, but the first step is often the most important one. \n\nElectronics we can buy, but mostly the cheapest, most mass produced items. \n\nIt seems paradoxical, but mass production of many super cheap items  is the end of capitalism. Because the profit on those more and more mass produced  items tends more and more to nothing in the end. At one critical point, those  items won't  sell anymore, because people don't need like 28 different electronic toothbrush, so the system won't be able to make profit by selling many cheap items with tiny profit on each of them, and the capitalist mode of production will collapse.  See the tendency of the rate of profit to fall:\n https://en.wikipedia.org/wiki/Tendency_of_the_rate_of_profit_to_fall\n\nSo yeah, the way i see it, those who want to save capitalism must buy high end/ high-margin-for-the-producer items, like iphones, or expensive cars,  and buy them regularily, whenever a new one is released. \n\nThose who want to make capitalism die must make the opposite: buy cheap (mass produced with low profit) or second hand stuff.",
				"added": 1492698848
			}
		],
		"2_12UhiqqmEFy9e5iDphNwnugKQrhWMMAP3J": [
			{
				"comment_id": 192,
				"body": "That sounds very promizing. \n\nMust do the same with general search engine in order to replace google, bing etc...\n\nN.B: i know there is Yacy but it's not really usable...",
				"added": 1492530917
			}
		]
	},
	"comment_vote": {
		"2_1669uhTeS1CptbLN8L88NVjP1BTgGMqk9W": 1,
		"230_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"240_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"332_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"1_1KKcvfW9cCMV7ePebq35XSjvBNpk3tipt8": 1,
		"6_1NcJpmb77ERaoKxXMebaCTXqDQZxxm8Euc": 1,
		"217_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt": 1,
		"1_1CAUL8cJtANuC6khKYwg6orGWnLbjPgaLu": 1,
		"4_1MrRShZ9dp1stuYhAyzguqFXv8X4E4AjCn": 1,
		"139_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"6_1HQat1a4kYwNck8Bx3CGxh6rKCQ9CtBvME": 1,
		"3_16GMXUiefH9e271vTdr5h41WHkXKPS7ceY": 1,
		"6_16nArdxrSaNThNp83kL8E6NLL9WD98iUne": 1,
		"245_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"4_1HLFF47LhPMfkv43GJoGCn7ZwXEAZmFHC6": 1,
		"4_1EqerKajfi14bzTkqwSfqVrxKmQW1w6Nzk": 1,
		"246_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"344_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"8_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"4_14aG268HqAHbykUN9h1kRzaGZHfrMtV33R": 1,
		"22_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1
	}
}