{
	"next_comment_id": 6,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [p2p](#comment_106_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ): I'd not  follow the Q&A format because I also think there is some overlap with each other of the 4 questions. I just write something worth sharing IMO.\n> \n> Thanks to Peer2Peer technology and decentralized structure,  a site owner does not need to be online to watch and maintain sites now and then in case of sites cracked or DDOS-ed ( It would be nice if you can find a humorous GIF showing what is DDOS ). This is important because being online long-time and frequently is not possible for many site owners and is dangerous for someone who want to keep highly anonymous.\n> Centralizing is the friend of censorship. We can see censorship by commercial companies and evil governments. Methods of censorship are not only deleting or forbidding , but also DDOS.\n> \n> A good example: According Wikipedia, in 2015, Voat, a website has been labelled as an alternative to Reddit with a focus on freedom of expression, experienced large influx of new users after Reddit banned five of its subreddits for harassment—the largest of which had around 150,000 subscribers. The large influx temporarily overloaded the site, causing downtime. During this time, Voat had both its web hosting and PayPal accounts closed without warning. Its German web host cited \"politically incorrect\" content on the site and distrust of Voat as the cause since Germany has strict rules for hosting services. The website continued to accept donations in Bitcoin, and was able to continue functioning, as it had moved to a different hosting provider. But the website continued to experience downtime due to an ongoing distributed denial of service (DDOS) attack, rendering the 700,000 unique visitors unable to access the site.\n> A month later, following the dismissal of a popular administrator on Reddit, another influx of Reddit members registered with Voat, leading to traffic which again caused Voat to experience downtime.\n> So we have ZeroVoat (  show demo ), decentralized clone of Voat. No downtime if there is at least one peer seeding the site. Compared with the original centralized one, more influxes of users means more peers, and more stable and fast it will be.\n\nThere's also ZEROIT which is something like Reddit http://127.0.0.1:43110/1F59P4utFaXUoNgcu4K29JskSkCQTZaZPp",
			"post_id": 107,
			"date_added": 1489610010
		},
		{
			"comment_id": 2,
			"body": "> [styromaniac](#comment_2_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Oh boy. Global elite didn't like him. I'm now worried for Nofish, kind of have been before, but this solidifies my fear.\n\nI don't think Nofish has been on ZeroNet since the 18th. That was the last time I seen him post a comment.",
			"post_id": 107,
			"date_added": 1490586294
		},
		{
			"comment_id": 3,
			"body": "> [border0464fred](#comment_15_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): How it been @nofish ?\n\nHe's not been on ZeroNet since the 18th. He replied to a comment I posted on ZeroTalk about Yeti CMS and that's the last time I know of him being on ZeroNet. Maybe he's taking a break. Hope nothing is wrong with him.",
			"post_id": 107,
			"date_added": 1490590707
		},
		{
			"comment_id": 4,
			"body": "> [styromaniac](#comment_3_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Perhaps he left everything at home to avoid ICE bullshit.\n> Also, I've heard that Samuel having arms in Canada was a death sentence waiting to happen.\n> We should probably chill out and be patient. He's busy in the US ATM.\n\nHope he's back on soon though.",
			"post_id": 107,
			"date_added": 1490663575
		},
		{
			"comment_id": 5,
			"body": "> [nofish](#comment_196_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): I'm just arrived back to Hungary without any problems :)The rehearsal went well, but they want it more focused on censorship with real-life examples. Please let me know if you know any.\n\nJust ask people on Twitter. Twitter seems to be censoring like crazy now and showdowbanning people. Also welcome back.",
			"post_id": 107,
			"date_added": 1490722744
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}