{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_13t2ME4cTtkxrwPeugeZgdJF5Kg7C5CSEy": 1,
		"1_12uT4vU8m2CkuLW8ymLz5kpAyFQZ3Jj8XH": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1_1ARmoCDkmZkYWAMCipxPqbUoT4akypoPoE": [
			{
				"comment_id": 1,
				"body": "I have an answer for this, it sounds crazy but, in fact, it's proven.\n\nEvery human is worth the same because our actions are the recursive product of our other actions and of our passive perception of our environment. Therefore everything that makes the singularity of a human is due to passivity, so we can't judge a human on what happens passively to them… Right ?\n\nIf humans are worth the same, then our happiness is worth the same too : when I interact with strangers I always act to make us the most happy I can, even if it pulls me a bit down.\n\nWhich is cool is that, besides some basic stuff (carrying the bags of someone going in my direction), true happiness is shared (about that, I'm not sure if it's going to help you, but the end of Into The Wild is the most beautiful thing I've ever seen).\n\nHowever, depression can't be cured as easily. If you're going to feel better, it's probably because you'll have been helped. I don't know what I can do for you, but please leave me a mail (rw@zeroid.bit) with your country (if you don't use TOR). I'll ask my GP, who's a close friend of a famous psychiatrist, if he knows which medical help could help you.\n\nI hope that I've shown you happiness is possible. With help, you can overcome your depression.\n\nPlease stay with us.",
				"added": 1462214015
			}
		],
		"4_1Ci5Y4TxZwY1SQhvQR7Ttbdyyai4WRV5TU": [
			{
				"comment_id": 2,
				"body": "Archlinux is pretty good and has many packages.\n\nGentoo is excellent software, however 99,98% of Linux users would end up with a terribly broken installation unless they exactly know which USE flag is needed and which USE flag isn't needed, which would be a timesink to me.\n\n>Neither.\nWhy are you even commenting then?",
				"added": 1469228241
			}
		],
		"1_1JgHfDK4eojCkVZHKey9hiMAcAc9mxMUK2": [
			{
				"comment_id": 3,
				"body": "> [kopykate](#comment_34_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4): Dark Market? You mean, along the lines of Silk Road?\n> That'll just attract law enforcement like a swarm of wasps. They'll come over pretending to be buyers, and then go on sting operations to track down drug dealers, or anyone selling anything illegal like guns, etc.\n\nPeople can print guns nowadays, just wait for it to happen to drugs.",
				"added": 1475070094
			}
		]
	},
	"comment_vote": {
		"149_1KwTTgPRSTHFmmJAFBt6kQfdyNeSM5KJuH": 1,
		"24_1AvkR7PmGFLZL9drPpqCaBPEdcVipv2Ajs": 1,
		"20_1NGTMtN8816KeCtNqy6W4fCQduU4P8iwty": 1,
		"5_12uT4vU8m2CkuLW8ymLz5kpAyFQZ3Jj8XH": 1
	}
}