{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "MaidSafe",
			"body": "Another service that is emerging however they offer a incentive to people to join their network by offering SafeCoins to those who give up resources from your computer to the network.  \nWhat do you guys think of this service. \nhttp://maidsafe.net/",
			"added": 1457729662
		}
	],
	"topic_vote": {
		"3_1EMpuiFM1NLZmAVyoAWnwi8VwiZVV4dcnN": 1,
		"1_17AcmbLffN1gjfsTf6Jy8K2aBPdMaSBrrf": 1
	},
	"next_comment_id": 15,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "test Lugia",
				"added": 1456359379
			}
		],
		"4161_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 2,
				"body": "There was a all time conspiracies on YouTube that published a video on it",
				"added": 1456359493
			}
		],
		"14_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 3,
				"body": "I learned about it from the Osiris network.",
				"added": 1456359808
			}
		],
		"4_1KwTTgPRSTHFmmJAFBt6kQfdyNeSM5KJuH": [
			{
				"comment_id": 4,
				"body": "If it is a NSA Website then that means that they would have their fingers properly in Freenet or IPFS",
				"added": 1456738659
			}
		],
		"1_1LnyrYbdxDU1K78nEYVZkfJ1Q4SYP1ukFV": [
			{
				"comment_id": 5,
				"body": "I wouldn't see how it would make a difference. If you think that the persons opinion is wrong or you don't like it then just don't respond. Or you can disagree with them.",
				"added": 1457045913
			}
		],
		"1_1A6hcWNpQ9SSLoTTpuT19VsVQ6WCVRkyen": [
			{
				"comment_id": 6,
				"body": "Maybe it could be how many peers you are connected to.",
				"added": 1457046009
			}
		],
		"3_1EMpuiFM1NLZmAVyoAWnwi8VwiZVV4dcnN": [
			{
				"comment_id": 7,
				"body": "I like it. Could it work for social media.",
				"added": 1457077562
			}
		],
		"3_1MxdAjWgnqwCaunGHmhY39tVR51qV3peJL": [
			{
				"comment_id": 8,
				"body": "Well Zeronet is in that stage of development. I hope it could one day replace traditional centralised internet.",
				"added": 1457078128
			}
		],
		"1_1D7uESYtAKV36MVPGJZXuE7LUKbLwfo4dX": [
			{
				"comment_id": 9,
				"body": "But wouldn't the person who received the copy of the data actually have to personally delete it. I think all that would happen is that the person would stop receiving updates.",
				"added": 1457145586
			}
		],
		"1_1JxycrsLzVrPA247VxtPuwfdQBA6BJrSQ3": [
			{
				"comment_id": 10,
				"body": "It's amazing what is been currently been done now. I fully support the decentralisation of internet. If we decentralise the internet it goes back to the people.",
				"added": 1457155275
			}
		],
		"1_1BQg5MQZ63aEQZMzLEXP6yY3hsgznKpaps": [
			{
				"comment_id": 11,
				"body": "LXLE",
				"added": 1457677654
			}
		],
		"1_1AFL4FFT3BuEDwTwVqychMq4LbxjuEY5Ss": [
			{
				"comment_id": 12,
				"body": "> [ekaterina](#comment_108_1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD): The screenshots of apps they have shown look really awesome. But we'll have to see how well it actually works once they release the first version, right now there is only a development build, the first actual version should have been release already, it's a bit late it seems (blog post a month ago said in a few weeks), hopefully it will be available soon. It's really weird though that MaidSafe has been in development for a whole whopping 10 years. Why did it take that extremely long?\n\nMaybe because it is a network on a grand scale or lack of funds.",
				"added": 1457753410
			},
			{
				"comment_id": 13,
				"body": "I believe that the incentive is reason why it would jump off. Personally I would like to make coins.",
				"added": 1457753499
			}
		],
		"2_1AZjDLkfYwSmjM7ZJUf7HHnrF778augRMa": [
			{
				"comment_id": 14,
				"body": "Look within legal laws there should be measures like what you say @PaintNinja",
				"added": 1470484007
			}
		]
	},
	"comment_vote": {
		"421_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_17n5jg4bBEoWodXDf8L4Y2u88ShagS272Y": 1,
		"1_1QEzz3SceR19mpxVZcViL77F46FJSojQUw": 1
	}
}