{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1,
			"title": "Human by Design - Presented by Deus Ex Mankind Divided 2016 (Amazon RIPPED)",
			"body": "Since i don't have a seedbox and zeronet doesn't have a site to host files or mega.co.nz on here so...\n\nhttps://mega.nz/#F!looy3JpC!nhwVvOOgygs68rwSYBs39g\n\n+------- SUMMARY -------+\nWhat does it mean to be human? Human by Design examines this question through the lens of 12 extraordinary people who are at the intersection of technology and imagination. Inspired by the futuristic themes and ethical questions within the video game Deus Ex: Mankind Divided, this real world journey introduces the leading minds in bionics who are redefining what it means to be human.\n\nIf anyone even into Cyberpunk or Documentaries",
			"added": 1474183017
		},
		{
			"topic_id": 2,
			"title": "Use of LSD-25 for Computer Programming",
			"body": "http://www.maps.org/news-letters/v18n1/v18n1-MAPS_24.pdf",
			"added": 1474235907
		},
		{
			"topic_id": 4,
			"title": "$350 usd to whoever get their hands onto Yahoo 500million db dump",
			"body": "Yup. You heard me right. $350 usd to whoever get their hands onto Yahoo 500million db dump. Zeromail me if you do https://127.0.0.1/Mail.ZeroNetwork.bit/?to=phr34kz",
			"added": 1474751393
		},
		{
			"topic_id": 5,
			"title": "MOBVOI TICWATCH CHINA LEAK!",
			"body": "Because fuck them. https://gist.github.com/anonymous/459ff274a827498183934099cca590b7",
			"added": 1483910562
		}
	],
	"topic_vote": {
		"1_1NGTMtN8816KeCtNqy6W4fCQduU4P8iwty": 1
	},
	"next_comment_id": 33,
	"comment": {
		"2_12yaKkoqVKBUi66uB5pYXamWguKFaWdDnx": [
			{
				"comment_id": 1,
				"body": "Go google DNSCAT2, SSH tunnel, iVPN  or VPN over DNS .. That + tor + your vpn/proxies or whatever.. Proxychains, Proxifier.. Tons of ways to bypass that man. If you trying to make it public with that bit.no.com domain use this instead --> http://ngrok.com",
				"added": 1474049066
			},
			{
				"comment_id": 2,
				"body": "> [graveyardswatch](#comment_22_1HrRNH7KbdxMjwLmwrHmZqJrzVZVDKc9bF): Even if someone gives you another proxy, it will soon be blocked too.\n> Try using Zeronet through Tor.\n\nTotally and here i'm thinking why people still uses static or just manually collected a handful of proxies. Lmao. It's 2016 bruhh... It's the age of cyberpunks and skynet",
				"added": 1474049247
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 3,
				"body": "Testis.. Testicals.. Penis..",
				"added": 1474049490
			}
		],
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 4,
				"body": "Kek.. I'm a muslim and i don't complain shit. Kick ma butt. Calling tek sappoot, calling tek sappoot, these muricas need jeezuz.",
				"added": 1474049627
			},
			{
				"comment_id": 18,
				"body": "> [mrwhite](#comment_4_1NnciDBNk2s2o8ASCmXkhfvqR1qws6QNuq): Meh why can't we all just get along? Because we are meant to fight it out. Universal equality is a lie meant to lull suckers into letting their guard down -- which we have done.\n> I totally agree that Weimerica is Israel's puppet and has been for some time, although it got a lot worse after the good guys lost WWII.\n\nYeah man. It's kinda sad if you ask me",
				"added": 1474753094
			},
			{
				"comment_id": 29,
				"body": "Kill all humans. Done. Save the planet, save the trees. Fuck you people. Grow zeronet man. All these pep talks..",
				"added": 1476130465
			}
		],
		"1_1FQzw6BBWb8DqSgT3uMsMpcWu3uz48bEDX": [
			{
				"comment_id": 5,
				"body": "Kek. People actually fall for this shit? Really?",
				"added": 1474050926
			}
		],
		"1_1FEikAyxCNPJcW996B69r5UFg29yfq579m": [
			{
				"comment_id": 6,
				"body": "Yeah poosibel .. I'm running it now on my mobile with kali nethunter. Basically it's python driven so bet iphone supports it too since they're unix",
				"added": 1474051476
			}
		],
		"1_1FhBaNDUvHMejk1hfkEgiSTWKPZBntBnff": [
			{
				"comment_id": 8,
				"body": "Ya'll need webtorrent onsite.. Lol",
				"added": 1474055356
			}
		],
		"3_19wHyK5qpV9YVMiB9PUL3dMsqoJ6KLvZts": [
			{
				"comment_id": 9,
				"body": "Wat",
				"added": 1474184795
			},
			{
				"comment_id": 10,
				"body": "Kek",
				"added": 1474184804
			}
		],
		"1_13MUkdCRgz1jXmufWdvJn5qgRrwhrWNYbK": [
			{
				"comment_id": 11,
				"body": "> [misha](#comment_1_1JgdnJ79GXQPH7hFPyVdHE4FXtRca4Qwjn): There are no servers. It is distributed and decentralized. Use your brain please.\n\nAhahahaha! Go slow with this kid yo. He/she prolly didn't even check the folders for files downloaded after running Zero. I'm guessing Hego didn't read the \"manuals / how to startup guide\" and goes on blindly. Security practice is a must these days.",
				"added": 1474185048
			}
		],
		"1_17BWSb6UmakDJJpqRkTQkshzf2fqQiY1Vs": [
			{
				"comment_id": 12,
				"body": "@maledictus\n\ncontent.json does not exist. \nNot Found - index.html\n\nGo fix your site first lol",
				"added": 1474600692
			}
		],
		"25_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 13,
				"body": "Lel.. That took a long time to update that new Mr Robot episode. What you doing? Fapping? XD",
				"added": 1474600845
			}
		],
		"2_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz": [
			{
				"comment_id": 14,
				"body": "GAYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY.. Suck dicky.. GAYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY",
				"added": 1474600946
			}
		],
		"1_1JgHfDK4eojCkVZHKey9hiMAcAc9mxMUK2": [
			{
				"comment_id": 15,
				"body": "> [tkarita](#comment_138_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t): ZeroMail 2 and NullFolder use webtorrent, which uses WebRTC to transfer files from one browser window to another.  It stops working if the sender closes their window or even refreshes the page.  Coming from ZeroMail, one probably expects that the file sharing would store files in the same way that messages are stored.  It might be easier to create a new site to host your file than to arrange for both participants to be available at the same time.\n\nUgh.. another dude with his webrtc.. udp... = real IP / demasked . I vote for transferring files via DNS (see DNScat2 )",
				"added": 1474643556
			},
			{
				"comment_id": 22,
				"body": "Dark Market. Better zeronet search engine and probably tons others besides just movies and tv series. I don't see Animes and whatnot. There's room for improvement and one that doesn't lead to content.js can't be download or index.html not found. Not everyone here has a seedbox nor have any time to webtorrent their videos to be streamed at KopyKate. \n\nWhen it comes down to Dating Sites, think of the end users that's gonna use them, are they even savvy enough to even run ZeroNet? I doubt so let alone run this whole thing on their mobile.",
				"added": 1474908468
			},
			{
				"comment_id": 23,
				"body": "I've contacted http://fmovies.to/ owner. Let's see what he thinks of Zeronet",
				"added": 1474933562
			}
		],
		"1_15zYrGJKfXo6XXU6rBUsuU3cTgpJkDuQYA": [
			{
				"comment_id": 16,
				"body": "> [iol](#comment_7_15zYrGJKfXo6XXU6rBUsuU3cTgpJkDuQYA): Dear sifr,Right mouse click -> Save Link As...\n> This should allow you to download all the leaks.In case for some reason the html would be corrupt I will release within the next five minutes a new version.Kind regards,Dani\n\nTake a look at google search ---> dump site:\"thecthulhu.com\"\n\nhttps://www.google.com/webhp?sourceid=chrome-instant&ion=1&espv=2&ie=UTF-8#q=dump+site:%22thecthulhu.com%22&tbs=qdr:y",
				"added": 1474654076
			}
		],
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": [
			{
				"comment_id": 19,
				"body": "> [kopykate](#comment_22_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4): Damn .. I'm actually surprised to find out that ZeroNet isn't full of right-wing nationalists.. despite being the perfect free speech platform .. lol\n> Funny, it's always the Politically Correct media platforms where you see all the hate posts, such as YouTube, Twitter, Facebook, Reddit, etc.\n\nBecause people here has brains to even run zeronet compared to monkeys outside",
				"added": 1474830342
			},
			{
				"comment_id": 20,
				"body": "ALLL HAIL CTHULHU !! BEGONE WITH ALL HUMANS ! .. *Somebody pass me a popcorn please* .. HAIL CTHULHU !!",
				"added": 1474830870
			}
		],
		"4_1NGTMtN8816KeCtNqy6W4fCQduU4P8iwty": [
			{
				"comment_id": 21,
				"body": "> [kopykate](#comment_31_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4): Who even uses Yahoo these days anymore? lol\n> My faintest memory of Yahoo was in 2004, back when I was a kid playing on my dad's computer, trolling online chatrooms.\n\nDoesn't need for anyone to use and nobody even cares even if you use because the whole internet is an archive. It's a company willing to pay for the 500 million  leak dated back since 2012.",
				"added": 1474907876
			},
			{
				"comment_id": 24,
				"body": "> [kopykate](#comment_32_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4): Fortunately, I don't use the same passwords on Gmail that I used in Yahoo .. hehe ^^\n\n> [mohea](#comment_2_16b5oafCdo9g4ruCzc7pqyaDp3mLWo5Dgo): Considering how much the dump was going for, 350$ isn't much. I saw what might have been the sale, it was a bit sketchy so I wouldn't trust it, asking price was 5 grand\n\nThose 200 million dump they selling on darkweb for BTC are all a scam. Make it 10 grand.",
				"added": 1475144039
			},
			{
				"comment_id": 25,
				"body": "> [kopykate](#comment_32_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4): Fortunately, I don't use the same passwords on Gmail that I used in Yahoo .. hehe ^^\n\nOreally? Cool story bruh..",
				"added": 1475144073
			}
		],
		"1_14UupgrdnT7Y8vMES7aqUFgD1fC5RYNrh8": [
			{
				"comment_id": 26,
				"body": "Lol. Go get hackrf. For 6ghz max, you can do so much. $1000 to get your own cube satellite",
				"added": 1475144288
			}
		],
		"1_1EnFfeVqTYtJfhzucfQB8Z7sCfUBipRRow": [
			{
				"comment_id": 27,
				"body": "Bruh... fuck donations. I run a VPS too with ZeroNet. Get a job and donate to the Zero Creators instead. Smfh",
				"added": 1476129936
			}
		],
		"4_1CHcEy3SYsQvrW9uskKTZxUWj97BmZmvfa": [
			{
				"comment_id": 28,
				"body": "Please seed Google.com thanks",
				"added": 1476130095
			}
		],
		"1_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": [
			{
				"comment_id": 30,
				"body": "Now i know who to go if i want my penis sucked",
				"added": 1477953169
			}
		],
		"5_1NGTMtN8816KeCtNqy6W4fCQduU4P8iwty": [
			{
				"comment_id": 31,
				"body": "> [rythyrix](#comment_17_18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y): What precisely do you have against MobVoi? It looks like the file you linked is just a page for a job listing, in a DB instead of an HTML file.\n> If it's just leaking a new smartwatch, I can forward this to XDA :D\n\nLel job listing. I guess you missed the salted hashes etc. When you SQLi you have access to their _ENTIRE_ site after dropping a shell :P Simply say these buggers are invested by Google yet can't even pay shit or least be responsible to their supporters. Chinese, good at marketing, good at cloning other's work but shit in security. Ha..",
				"added": 1484086833
			},
			{
				"comment_id": 32,
				"body": "> [rythyrix](#comment_17_18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y): What precisely do you have against MobVoi? It looks like the file you linked is just a page for a job listing, in a DB instead of an HTML file.\n> If it's just leaking a new smartwatch, I can forward this to XDA :D\n\nJust take a look at their SDK, it's simply amending android code and rebranding. Lmao",
				"added": 1484086951
			}
		]
	},
	"comment_vote": {
		"4_1NGTMtN8816KeCtNqy6W4fCQduU4P8iwty": 1,
		"14_1NGTMtN8816KeCtNqy6W4fCQduU4P8iwty": 1,
		"2_1CEnKfVALihFLwjwwb9qbA6JojRKFjGAZM": 1,
		"1_12xy8Bd8zxT3cqFo5Dr6bgqd8X3CYJAywZ": 1,
		"29_1NGTMtN8816KeCtNqy6W4fCQduU4P8iwty": 1
	}
}