{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "What is it with Australia and weird animal problems?",
			"body": "Two decades ago, someone dropped a handful of goldfish into a creek in Australia now they've grown to 4 lbs each and taken over a whole river.\nhttp://www.nytimes.com/2016/09/23/science/discarded-goldfish-invasive-species.html",
			"added": 1475328576
		},
		{
			"topic_id": 2,
			"title": "wikileaks and stupid memos",
			"body": "To prove that Wikileaks is not all praise and fairness, something there that is the most stupid thing I've read in it. #ancap #nestle #switzerland #water #coffee #agriculture #science #technology #USA\n\nhttps://wikileaks.org/plusd/cables/09BERN129_a.html",
			"added": 1475519397
		},
		{
			"topic_id": 3,
			"title": "Japan is going down, and only anarchocapitalists predicted this decades ago.",
			"body": "Suck it down, communist dipshit.\nhttp://www.zerohedge.com/news/2016-10-06/bank-japan-throws-towel",
			"added": 1475753883
		}
	],
	"topic_vote": {
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": 1,
		"2_17bo4yV2YQ8qERFytHMogwancQzQmzzaDM": 1,
		"2_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR": 1,
		"1_1F8FQhrqzBj3TP1YH5MGpa1qNptyoKQtTn": 1,
		"1_1Pwcc1Fk7bKMA1uayUTvZaUuaGBpvGMTRg": 1,
		"2_14UupgrdnT7Y8vMES7aqUFgD1fC5RYNrh8": 1,
		"1_1CHcEy3SYsQvrW9uskKTZxUWj97BmZmvfa": 1,
		"1_1DxRHKJUGfY3ShVieAMxpf1HXhYDmXfYcP": 1,
		"2_1CHcEy3SYsQvrW9uskKTZxUWj97BmZmvfa": 1,
		"2_18Sh2Z83C23xdd6pjCq6NGv7Y6svEBcUfb": 1,
		"1_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": 1,
		"1_1Nv4Sz7ExDb5tJBZt27RwWWkUvQ8JFosFM": 1,
		"1_1EnFfeVqTYtJfhzucfQB8Z7sCfUBipRRow": 1,
		"8_1CHcEy3SYsQvrW9uskKTZxUWj97BmZmvfa": 1,
		"1_1FZEtMSz2tKFZPmBtjhD7JgR4awtAMD47G": 1,
		"8_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"3_1MdwjTFbwpWCLfyo2ZjeXzB7DbL7euNPBi": 1,
		"1_1ANXCwkxieV453iigVj4d6FNNkQJCHaPwE": 1,
		"2_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG": 1
	},
	"next_comment_id": 39,
	"comment": {
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 1,
				"body": "If you hate jews, fuck you.",
				"added": 1475294058
			},
			{
				"comment_id": 15,
				"body": "I never in all my life have read such huge amount of bullshit. Never, ever.",
				"added": 1476068469
			},
			{
				"comment_id": 17,
				"body": "> [photon](#comment_3_17a8xsj4Ds61C9wcox4Yqjp4GKD3qNdmdf): Why is it that where libertarians and ancaps gather together racist rhetoric isn't far behind? What a load of crap.\n\nWeak bait.",
				"added": 1476130322
			},
			{
				"comment_id": 18,
				"body": "> [photon](#comment_3_17a8xsj4Ds61C9wcox4Yqjp4GKD3qNdmdf): Why is it that where libertarians and ancaps gather together racist rhetoric isn't far behind? What a load of crap.\n\nWhy is it that ignorant people misunderstood right-winged state bullcrap with libertarian anarcho-capitalism? Why don't you study about the subject before saying something as stupid as this?",
				"added": 1476158425
			}
		],
		"2_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR": [
			{
				"comment_id": 2,
				"body": "We're having the same problem with this asshole in Zer0Talk in Portuguese. :/",
				"added": 1475326283
			}
		],
		"1_1HRrLnTaJwRCA24L45Sr3cYJ3nDmJmPabf": [
			{
				"comment_id": 3,
				"body": "Brazil. HUEHUEHUEHUEHUEHUEBRBRBRBRBRBRBR",
				"added": 1475326360
			}
		],
		"1_1CHcEy3SYsQvrW9uskKTZxUWj97BmZmvfa": [
			{
				"comment_id": 4,
				"body": "Is it going to support uploads?",
				"added": 1475660045
			}
		],
		"3_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": [
			{
				"comment_id": 5,
				"body": "> [riotpulv](#comment_26_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT): Yes, yes, my dear rat boy\n\nA rat with his fancy computer - therefore PRIVATE PROPERTY - calling me a rat. Oh, the irony.",
				"added": 1475826553
			},
			{
				"comment_id": 6,
				"body": "> [kaffie](#comment_210_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Not sure what this has to do with communism. It looks more like a failing of capitalism to me.\n\nSince you were honest and admitted you know nothing about the subject debated, I won't criticize your failed opinion.",
				"added": 1475826825
			},
			{
				"comment_id": 7,
				"body": "> [planesphere](#comment_12_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C): A computer isn't a mean (most of the time anyway) of production. Private property of the means of production alienate humans (factories, power stations, lands etc...).\n\nhow can you say that and have no sense of shame? #shitcommunistssay",
				"added": 1475861297
			},
			{
				"comment_id": 8,
				"body": "> [shellbound](#comment_16_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9): @kosherx: Yeah, Karl Marx predicted this centuries ago... this is an inbuilt flaw in capitalism. Deuche Bank is in trouble too and if it goes down things will be pretty dire. It would probably be a worse crash than Lehman Brothers of 2008. Also there is no wrong in having private property. You seem to shrouded in faulty propaganda. The libertarian policy didn't go so well in Honduras did it?\n\nFirst, I find it quite funny someone who comes with marxism mumbo-jumbo claiming that I'm into faulty propaganda, since Marx didn't predict this and even didn't live by his own words being supported\n by his wife and later by Engels, never working in his whole life. Anyone can predict economic crisis, but Marx never admitted that his claims against capitalism were responsible for them, exactly like Deutsche Bank, exactly like BOJ and exactly like the 2008 USA subprime crises caused by the socialist big government.  \nSecond, I never saw a libertarian claiming Honduras is \"a libertarian paradise\", quite the contrary.\nhttps://mises.ca/since-when-is-honduras-a-libertarian-paradise",
				"added": 1475863914
			},
			{
				"comment_id": 9,
				"body": "http://imgur.com/C0JD03K",
				"added": 1475866667
			},
			{
				"comment_id": 19,
				"body": "> [japs](#comment_1_1Jqm5dUdtvmo1StgeVy3rk1BHRUrMkKawV): The Jews who provoked Japan into World War, then saw to it that Japan would be bombed with atomic bombs. Their intent was always to use Japan to destroy itself and as many other Gentiles as possible, while promising them world conquest.The Central Bank of Japan is controlled by Jews.Today, Japan is used the Jews as a pawn between China, North Korea, Russia and the United States.In 50 years in Japan will be only Jews and African slaves.Leading Jews are doing the same to America and Russia. If the most cities will be destroyed by nukes in a nuclear war, then they can buy everything very cheap.\n\nI'm impressed by the sheer amount of stupidity I have to read from you guys, really.",
				"added": 1476227692
			}
		],
		"4_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 10,
				"body": "Problem is the FED itself, not everyone there is a j00, but everyone there is a filthy socialist. End the FED.",
				"added": 1475927423
			}
		],
		"3_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 11,
				"body": "What about the j00s? You forgot to blame j00s this time?",
				"added": 1475928722
			}
		],
		"3_1MYX3cuihkhYv6b6PQTrGe5wMPb6wMDG9Z": [
			{
				"comment_id": 12,
				"body": "What about the gold standard?",
				"added": 1476016270
			}
		],
		"1_1Kgy2CdXdjNQSjK6pkLasWjmza9KQ1uZE4": [
			{
				"comment_id": 13,
				"body": "Why should it have?",
				"added": 1476034100
			}
		],
		"2_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 14,
				"body": "I'm gonna start going chutzpah on your anti-semitic ass, chaver.",
				"added": 1476034282
			}
		],
		"1_1JgHfDK4eojCkVZHKey9hiMAcAc9mxMUK2": [
			{
				"comment_id": 16,
				"body": "How about an app to block anti-semites here?",
				"added": 1476070227
			}
		],
		"8_1CHcEy3SYsQvrW9uskKTZxUWj97BmZmvfa": [
			{
				"comment_id": 20,
				"body": "pacman is not working here",
				"added": 1476389957
			}
		],
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": [
			{
				"comment_id": 21,
				"body": "Hitler ran away to Argentina and lived in Brazil until he died of old age, everyone knows that.",
				"added": 1476543675
			}
		],
		"1_1FZEtMSz2tKFZPmBtjhD7JgR4awtAMD47G": [
			{
				"comment_id": 22,
				"body": "If they censor socialists, I don't even care. More power to them.",
				"added": 1476558917
			}
		],
		"1_17q6Zhf7PFjrY3ddySK2F78JhAH3FVhmWr": [
			{
				"comment_id": 23,
				"body": "You, sir, are really naive.",
				"added": 1476622234
			},
			{
				"comment_id": 24,
				"body": "Fuck Hillary Clinton, that lying cunt. #MAGA",
				"added": 1476624295
			},
			{
				"comment_id": 26,
				"body": "Read Wikileaks, lazy slob.",
				"added": 1476713720
			},
			{
				"comment_id": 31,
				"body": "> [rooty](#comment_3_15CnUuQWHaW3h1vZuLTxQ5tEt1SzjeNdAP): No ,they arent , just some stupid people.Just see this , is it in PT/BR but can understandshttps://www.facebook.com/quebrandootabu/videos/1212522798804105/\n\nthis sucks a lot, and so do you.",
				"added": 1476991521
			}
		],
		"11_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": [
			{
				"comment_id": 25,
				"body": "I can't understand mafia lingo.",
				"added": 1476713671
			}
		],
		"2_1AwNV17STiNUZZ4Z712z2FBf8YyERJ87rE": [
			{
				"comment_id": 27,
				"body": "no?",
				"added": 1476815159
			}
		],
		"1_121wHEZXhLuoFQhmawdQRLVvtBzhSDT4R5": [
			{
				"comment_id": 28,
				"body": "I guess not",
				"added": 1476822105
			}
		],
		"1_1JLptrZjV8VrpvMBex8CnCHGjNpCizYq1x": [
			{
				"comment_id": 29,
				"body": "> [waterrabbit](#comment_33_1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC): You need a private key. Unless you steal the private key from nofish, there is no easy way to take control over the site that is not really yours.\n\nhow do I steal a key? I have a zite but I lost its key.",
				"added": 1476933870
			}
		],
		"8_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": [
			{
				"comment_id": 30,
				"body": "> [nutomic](#comment_23_1FEikAyxCNPJcW996B69r5UFg29yfq579m): @kopykate: You think the capitalists will just give their profits away for free? Because that's what your proposal means. The only way that can work is if the workers control the means of production.\nThis way of thinking killed hundreads of millions, but why not? Let's try it again and kill billions this time? Stupid people never learn anything.",
				"added": 1476957907
			},
			{
				"comment_id": 32,
				"body": "> [planespherev2](#comment_42_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): God dammit, i know you've lurked here so you have already seen my other posts.\n> I'll repeat it again, just for you sweet-heart: BOLSHEVISM ISN'T COMMUNISM.\n> Communism existed from 160000 to 12000 BCE, and still exist in todays primitive tribes (Jarawas, Guayakis, Pigmees) but didn't existed in modern era. Bolshevism, URSS, is STATE CAPITALISM. Cuba, China (Mao), and North Korea are NOT communists countries. They have a society organized around money, and have a state. Thus it's not communism.\n> About modern communism, it only existed during a tiny fraction of time, during the Paris commune (1872), the barcelona commune (1937), and the Budapest commune.\n> Each of these communes were crushed by the capitalist state, the republic (Paris, Barcelona), and even by the capitalist state regime aka bolshevism (Budapest).\n> About the main subject.\n> Basic income seems seductive, but it could lead to a 3 class society, instead of 2 currently (working class, owners of the means of production). You'll have a thrid class: the basic income people.\n> Zbigniev Brezinsky said that, soon, only 20% of the people could make the whole system work. What is to be done with the rest? Tittytainment.\n> A basic income seem a nice idea, but if the ultra rich still own most of the mean of production, the 80% basic income people will still be fucked.\n> If you have a PS4, an iphone 7, a car, a warm house, you can still be fucked. \n> Being fucked have nothing to do with the standard of living. A worker in the 19th century had a far lower standard of living than a current worker, but he was PROPORTIONALLY better paid for a particular amount of work he did.\n> The wages didn't followed the increase of production during the last century. Machines, helping the workers, produce far more today, but the wages didn't follow the amount of production. \n> Goods are cheaper then half a century ago, so people live under the illusion than life is better, and that they are less exploited. In fact, they are more exploited. They produce the same amount of work than there ancestors, but they are proportionally less paid for the wealth they create.\n> About \"film, video games, music, programs\". \n> People never had to pay for this shit during 99.99999% of human history.\n> Copyright only exist for about 150 years, and it's a scam. Since when do humans have to give something to see lightwaves or heard soundwaves? Fuck this shit.\n> As someone said, humans shouldn't have to expect something in return in order to create. The example given: Deviantart, summarizes it.\n> Anyway you'll say that i profit from the system, but i don't watch TVshows, listen music or play closed source video-games anymore. Not because of copyright, but because most of them are just brainwashing tools, with lots of feminism, glorification of goods, depraved sexuality etc...Propaganda for a decaying Hegemon: the west.I only watch a handful movies each year for the externalization of some truths they put in.\n\ntl, dr",
				"added": 1477007484
			}
		],
		"1_1AhXDbKvcLap7TcS2542J7bFYzKHM3xeRU": [
			{
				"comment_id": 33,
				"body": "> [pzmw](#comment_10_1ALXyaQsvvCQ3R5WBrPbe4dXsqnLCLEkB7): Anarcho-capitalism has never been and will never be anarchism because anarchism is the antithesis of capitalism\n\nAnarcho-capitalism is the only moral form of anarchism because it does not deny reality and respects private property. All other forms of pseudo-anarchism are morally and logically wrong, therefore can't be applied in the real world.",
				"added": 1477024218
			},
			{
				"comment_id": 34,
				"body": "> [kopykate](#comment_66_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4): In my opinion, leadership is hard-wired in human nature. Is it any surprise that even the hard-core libertarians and anarcho-capitalists have come out in support of Trump? I think not.. we all want our leaders, we just want leaders whose policies suit us.\n\nI'm a hardcore libertarian ancap and I don't support Trump. I don't even care about this election.",
				"added": 1477124196
			}
		],
		"1_1L14vSk76tujfNoqrcRuFk2tBBZgUPy92t": [
			{
				"comment_id": 35,
				"body": "I am Assange, do not fret.",
				"added": 1477152298
			}
		],
		"1_15CBPoeiB4i4G6NaCzccZ2e3CANLm32sgT": [
			{
				"comment_id": 36,
				"body": "Not again!",
				"added": 1477393652
			}
		],
		"1_1MwP3deXPWryDQeSCbAhs7HMVbuHxmUnc9": [
			{
				"comment_id": 37,
				"body": "Cool. Welcome. And if you need it, there's a zerotalk in chinese. Check in on the link list in the upper side of this zite.",
				"added": 1477426971
			}
		],
		"1_1Cxt2k3farSSee7HTkJKJ7eCTKxfFGNXe6": [
			{
				"comment_id": 38,
				"body": "Assange is at ease. All well with the world.",
				"added": 1477733557
			}
		]
	},
	"comment_vote": {
		"207_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"8_1FwTZnDZJjs2epEtq9yLy7m2P5kZ4TYqAR": 1,
		"7_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"35_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": 1,
		"22_1NGTMtN8816KeCtNqy6W4fCQduU4P8iwty": 1,
		"23_1NGTMtN8816KeCtNqy6W4fCQduU4P8iwty": 1,
		"2_15rVDNb7L1Kpzt3MCvkxFayqfMBw7yPxbk": 1,
		"12_1FwTZnDZJjs2epEtq9yLy7m2P5kZ4TYqAR": 1,
		"1_15rVDNb7L1Kpzt3MCvkxFayqfMBw7yPxbk": 1,
		"6_1FEEuiCSKN1FpqCVrnJu91ponPHQAhfo7K": 1,
		"54_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": 1,
		"41_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": 1,
		"4_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"58_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": 1,
		"1_1Nx78TLGjBT18krMD175Mr1JwFwnxURRLb": 1,
		"2_16YW3WBnbLGnoaqqRwoeqNEQsKdGGmbqXS": 1,
		"4_164W1rFVD9Bm7poGJWvjVUjvkbhhFC5nnt": 1,
		"3_164W1rFVD9Bm7poGJWvjVUjvkbhhFC5nnt": 1,
		"1_1B7g2efHN6xyHc3itUjDzMUQTepa7WFqaC": 1,
		"5_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"78_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz": 1,
		"2_1QH1N2BcCN6bQu1J98yUovsnnkvHn8TKhC": 1,
		"79_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz": 1,
		"76_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz": 1,
		"1_1FiMS3zmuGDUicGZnLDie4hBvVG47dTvtK": 1,
		"4_1QH1N2BcCN6bQu1J98yUovsnnkvHn8TKhC": 1,
		"3_1QH1N2BcCN6bQu1J98yUovsnnkvHn8TKhC": 1,
		"90_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz": 1,
		"5_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1
	}
}