{
	"next_post_id": 20,
	"next_comment_id": 16,
	"next_follow_id": 3,
	"avatar": "generate",
	"user_name": "Aurea",
	"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
	"intro": "Warrior fighting the coup sect that is the evil of the century.\n\nWe appreciate the understanding and attention of all. God bless our country.\n\nStay informed with the unknown events in the country that people deserve to know but were prevented:\nhttp://127.0.0.1:43110/1ETq7XtKSXukTE2UQXS2ssazJhWkfe4LfC\n(This is my blog)",
	"post": [
		{
			"post_id": 1490926723,
			"body": "BRAZIL, I ASK HELP FROM PUBLIC MINISTRY AND AGRICULTURE, AND WHO CAN HELP US, THE MAUSONS ARE POISONING HERE IN REP. DE CURITIBA PR.",
			"date_added": 1490926721
		},
		{
			"post_id": 1490927152,
			"body": "We are in favor of WASHING JATO CORRUPTIONS ALSO, and against the DICTATORSHIP and FALSE \"PHILOSOPHICAL\" MORALISM of the \"MAUSONS\" here in REP. Of CTBA.",
			"date_added": 1490927149
		},
		{
			"post_id": 1490927231,
			"body": "\"CONSERVATIVES OF THE RIGHT-SIDE POLITIC and of MORAL and of the GOOD COSTUMES of the Brazilian family\" ??",
			"date_added": 1490927227
		},
		{
			"post_id": 1490927642,
			"body": "FOR GOD'S LOVE, SOMEONE ORDERS TO REMOVE THE CLANDESTINES OF BATHROOMS AND FAMILY ROOMS ?? There are children also being exposed!",
			"date_added": 1490927636
		},
		{
			"post_id": 1490927765,
			"body": "WE ARE VICTIMS OF PSYCHOPATHES ... APPRECIATORS ALSO, OF MACABROS RITUALS WITH SACRIFICES ... with INCITATION TO HATE, INTOLERANCE AND DISCRIMINATION",
			"date_added": 1490927758
		},
		{
			"post_id": 1490927930,
			"body": "THE CONTRADICTORS \"MAUSONS\" unlike the Brazilian People, do not suffer financial crisis, with their luxurious trucks, THEY CHASE 24 hr",
			"date_added": 1490927922
		},
		{
			"post_id": 1490928085,
			"body": "THE \"MAUSONS\" COWARDS take advantage of the fact that I am a woman, an old and sick widow, me and my son ... we are EMOTIONALLY and PSYCHOLOGICALLY tortured.",
			"date_added": 1490928076
		},
		{
			"post_id": 1490928372,
			"body": "With ABUSIVE AUTHORITY, THE DICTATORS of \"MORAL\" and BAD CUSTOMS ... make people their REFORES and SLAVES. THEY INTIMIDATE, BLACKMAIL AND THREATEN",
			"date_added": 1490928362
		},
		{
			"post_id": 1490928670,
			"body": "THE COWARDS ... INTIMIDATE ... SAYING THAT COMMANDS WHO CAN, OBEYS WHO HAS JUDGMENT, AND AFFIRM THAT FOR THEM THE \"MAUSONS,\" EVERYTHING FINISHES ON PIZZA !!",
			"date_added": 1490928658
		},
		{
			"post_id": 1490928781,
			"body": "THE INSANE PSYCHOPATHIES make offers with HUMAN SACRIFICE and argue that we must die to PAY PRICE, because who falls in the net is fish!",
			"date_added": 1490928768
		},
		{
			"post_id": 1490929149,
			"body": "THE PROBLEMATIC \"MAUSONS\" SHOWS EXISTENTIAL CRISIS, when they call their VICTIMS \"LEAFS/DRY BONES\" BY POISONING ... and also calls \"COBAIA RATS\"",
			"date_added": 1490929135
		},
		{
			"post_id": 1491073497,
			"body": "Because of the CAMERAS ... they distribute LINK w / SHARES, since they could not guess by mimicking with obscene gestures the way I rub myself to take a shower!",
			"date_added": 1491073481
		},
		{
			"post_id": 1491074020,
			"body": "THE \"MAUSONS\" ... also call us \"CHICKENS\", \"GARBAGE\" ... and they argue that we deserve to be EXPOSED to MANY MARKINGS ... and PAY PRICE!",
			"date_added": 1491074003
		},
		{
			"post_id": 1491074417,
			"body": "Our Appeal and request for help, is for the reputed newspaper here of the Rep. Of Curitiba: GAZETA DO POVO, for the MEDIA, and all PUBLIC ORGANS. Our clamor is also for the Attorney General's Office, the Supreme Court and Federal Court, the Prosecutors of the Federal Public Ministry, Court of Auditors of the Union, for all Judges of the Country, the Politicians, and Messrs. Luis Edson Fachin, Aluísio Mercadante, To Carlos Marom, former Minister Antonio Palose, Rodrigo Maia, Moreira Franco, Francisco Meireles, José Sarnei, Renan Calheiros, and for all Senators Petistas or not, to all Lawyers of the Country, Interpol and Supreme Court.",
			"date_added": 1491074399
		},
		{
			"post_id": 1491075255,
			"body": "Our CLAMOR and request for HELP is also for the Militant Activists of the PT Party, and for the solidary and suffered Brazilian people.",
			"date_added": 1491075236
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "BRASIL, SOCORRO MINISTÉRIO PÚBLICO E AGRICULTURA, E A QUEM PUDER NOS AJUDAR, OS \"MAUSONS\" ESTÃO NOS ENVENENANDO AQUI NA REP. DE CURITIBA PR.",
			"post_uri": "15dUSMQUxi86Bpzi8hWFA3v7kMMkvEQVK2_1490926723",
			"date_added": 1490926742
		},
		{
			"comment_id": 2,
			"body": "Somos a favor de LAVAR a JATO CORRUPÇÕES IGUALMENTE, e contra a DITADURA e FALSO MORALISMO \"FILOSÓFICO\" dos \"MAUSONS\" aqui na REP. de CTBA.",
			"post_uri": "15dUSMQUxi86Bpzi8hWFA3v7kMMkvEQVK2_1490927152",
			"date_added": 1490927168
		},
		{
			"comment_id": 3,
			"body": "\"CONSERVADORES da DIREITA da MORAL e dos BONS COSTUMES da família brasileira\"??",
			"post_uri": "15dUSMQUxi86Bpzi8hWFA3v7kMMkvEQVK2_1490927231",
			"date_added": 1490927284
		},
		{
			"comment_id": 4,
			"body": "PELO AMOR de DEUS, ALGUÉM ORDENE PARA RETIRAR as CÂMERAS CLANDESTINAS dos BANHEIROS e dos QUARTOS das FAMÍLIAS?? Tem crianças tambem sendo expostas!",
			"post_uri": "15dUSMQUxi86Bpzi8hWFA3v7kMMkvEQVK2_1490927642",
			"date_added": 1490927651
		},
		{
			"comment_id": 5,
			"body": "SOMOS VÍTIMAS de PSICOPATAS... APRECIADORES TAMBÉM, de RITUAIS MACABROS c/ SACRIFÍCIOS... com INCITAÇÃO ao ÓDIO, INTOLERÃNÇIA e DISCRIMINAÇÃO",
			"post_uri": "15dUSMQUxi86Bpzi8hWFA3v7kMMkvEQVK2_1490927765",
			"date_added": 1490927778
		},
		{
			"comment_id": 6,
			"body": "OS CONTRADITÓRIOS \"MAUSONS\" ao contrário do Povo Brasileiro, não sofrem crise financeira, com suas luxuosas caminhonetes, PERSEGUEM 24 hr",
			"post_uri": "15dUSMQUxi86Bpzi8hWFA3v7kMMkvEQVK2_1490927930",
			"date_added": 1490927937
		},
		{
			"comment_id": 7,
			"body": "OS COVARDES \"MAUSONS\" se aproveitam que sou mulher, viúva idosa e doente, eu e meu filho... somos torturados EMOCIONALMENTE e PSICOLOGICAMENTE.",
			"post_uri": "15dUSMQUxi86Bpzi8hWFA3v7kMMkvEQVK2_1490928085",
			"date_added": 1490928095
		},
		{
			"comment_id": 8,
			"body": "Com AUTORITARISMO ABUSIVO, os DITADORES da \"MORAL\" e dos MAUS COSTUMES... fazem das pessoas seus REFÉNS e ESCRAVOS. ELES INTIMIDAM, CHANTAGEIAM e AMEAÇAM",
			"post_uri": "15dUSMQUxi86Bpzi8hWFA3v7kMMkvEQVK2_1490928372",
			"date_added": 1490928406
		},
		{
			"comment_id": 9,
			"body": "OS COVARDES... INTIMIDAM... DIZENDO QUE MANDA QUEM PODE, OBEDECE QUEM TEM JUÍZO, E AFIRMAM QUE PARA ELES os \"MAUSONS,\" TUDO ACABA EM PIZZA!!",
			"post_uri": "15dUSMQUxi86Bpzi8hWFA3v7kMMkvEQVK2_1490928670",
			"date_added": 1490928697
		},
		{
			"comment_id": 10,
			"body": "OS PSICOPATAS INSANOS fazem OFERTAS com  SACRIFÍCIO HUMANO e argumentam que precisamos morrer para PAGAR PREÇO, pq quem cai na rede é peixe!",
			"post_uri": "15dUSMQUxi86Bpzi8hWFA3v7kMMkvEQVK2_1490928781",
			"date_added": 1490928784
		},
		{
			"comment_id": 11,
			"body": "OS PROBLEMÁTICOS \"MAUSONS\" demonstram CRISE EXISTENCIAL, quando XINGAM suas VÍTIMAS de FOLHAS/OSSOS SECOS por ENVENENAMENTOS...RATOS de COBAIA",
			"post_uri": "15dUSMQUxi86Bpzi8hWFA3v7kMMkvEQVK2_1490929149",
			"date_added": 1490929157
		},
		{
			"comment_id": 12,
			"body": "Por conta das CÂMERAS...distribuem LINK c/ COMPARTILHAMENTOS, já q não podiam adivinhar imitando com gestos obscenos a forma como me esfrego p/ tomar banho!",
			"post_uri": "15dUSMQUxi86Bpzi8hWFA3v7kMMkvEQVK2_1491073497",
			"date_added": 1491073507
		},
		{
			"comment_id": 13,
			"body": "OS \"MAUSONS\"... nos xingam também de GALINHAS, LIXOS...e argumentam  que merecemos ficar EXPOSTAS p/ os MARMANJOS MANÍACOS... e PAGAR PREÇO!",
			"post_uri": "15dUSMQUxi86Bpzi8hWFA3v7kMMkvEQVK2_1491074020",
			"date_added": 1491074016
		},
		{
			"comment_id": 14,
			"body": "Nosso APELO e pedido de SOCORRO, é p/ o conceituado jornal aqui da Rep. de Ctba: GAZETA DO POVO e para a MÍDIA, todos os ÓRGÃOS PÚBLICO. Nosso clamor é também p/ Procuradoria Geral da República, Supremo Tribunal e Justiça Federal, aos Procuradores do Ministério Público Federal, Tribunal de contas da União, para todos os Magistrados do País, aos Políticos, e aos senhores Luís Edson Fachin, Aluísio Mercadante, aos senhores Carlos Marom, ex Ministro Antonio Palose, Rodrigo Maia, Moreira Franco, Francisco Meireles, José Sarnei, Renan Calheiros, e para todos os Senadores Petistas ou não,a todos os Advogados do País, Interpol e Suprema Corte.",
			"post_uri": "15dUSMQUxi86Bpzi8hWFA3v7kMMkvEQVK2_1491074417",
			"date_added": 1491074608
		},
		{
			"comment_id": 15,
			"body": "Nosso CLAMOR e pedido de SOCORRO é também para os Ativistas Militantes do Partido PT, e ao solidário e sofrido povo brasileiro.",
			"post_uri": "15dUSMQUxi86Bpzi8hWFA3v7kMMkvEQVK2_1491075255",
			"date_added": 1491075244
		}
	],
	"follow": [
		{
			"follow_id": 2,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe",
			"user_name": "Plasmmer",
			"date_added": 1490923105
		}
	]
}