{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"9757_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"9881_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"1_18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj": 1,
		"5_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"6_162gsjqc5VB9ijkvSZMZVrcqdmqQ7XugiF": 1,
		"10642_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"10666_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"10661_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"10753_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"11059_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"11054_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"11248_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"13_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": 1
	},
	"next_comment_id": 12,
	"comment": {
		"4_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp": [
			{
				"comment_id": 1,
				"body": "> [usdyi](#comment_4_16osdFmHgwgy9sgBws1po2zP5PxwMALvZa): @loligod this link doesn't works\n\nThe port is wrong in the url, try this: http://127.0.0.1:43110/16pz3DbSRyz7D7e3qsxWMq98Z8VztJZN4j/videoss.html",
				"added": 1482154948
			}
		],
		"1_18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj": [
			{
				"comment_id": 2,
				"body": "I think the most common opensource model is the \"freemium\": build something which is interesting / useful, and add some functions which will be a must-have after a certain level of complexity, after you're getting familiar (or even stuck) to the solution (gitlab, artifactory, github, docker, ansible, just to mention a few)\n\nThe next is when a company build a product, opensource it, and give consultation (percona, ....). They know the best what they've built, so it may work.\n\nThe last solution I think worth mentioning is when someone build an opensource project, and try to get donations (wikipedia, zeronet, ...)\n\nI hope you find it useful, and I'm eager to see other opinions / perspectives.",
				"added": 1483625667
			}
		],
		"10394_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 3,
				"body": "\"Criminals use FIAT currencies all around the world to pay for illegal services\".",
				"added": 1485949789
			}
		],
		"1_1GuYKebkQAqGJ4tNpNp4TD1UuoHHudCJLA": [
			{
				"comment_id": 4,
				"body": "supporting them just like \"supporting terrorists, and helping them to change their minds\", I'm pretty sure that nobody will do that because in the heads, they're just like terrorists. \n\nOne possible solution would be to create a support group which is about \"Helping people to deal with sexual disorders\", so the group may have much larger audience and support from the community, than you support something which is illegal (which is totally valid, nobody wants their children to be hurt physically / emotionally).",
				"added": 1486468144
			},
			{
				"comment_id": 6,
				"body": "@urgeless I see that is a problem, but I still thing that changing a name / inventing a new word for it can work better than we think, because \n\npedophiles / serial killers / psychopaths / you name it, just cannot be accepted as \"mentally ill\" (who needs help) by most of the people, because it interferes with that \"free will\" thing (and some others) and implies serious questions about responsibilities which they don't want to answer (e.g. if someone commit a crime, and he's just ill, then how to punish them if the act was not deliberate), etc..\n\nI understand that you want to help dealing with that problems to lower / eliminate the risk of causing harm to anyone.",
				"added": 1486557934
			}
		],
		"10494_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 5,
				"body": "I think I'd never want to go to the US and/or work for them, and I'm sure I'm not alone with that. I just don't want to support a country where such things can happen..",
				"added": 1486468699
			}
		],
		"10642_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 7,
				"body": "thanks! it will definitely change things.",
				"added": 1487170164
			},
			{
				"comment_id": 8,
				"body": "I have an idea; create a thin browser, which communicates with a headless browser somewhere sitting on a VPS, and does not reveal anything to the site about the original, 'thin' browser.",
				"added": 1487170475
			}
		],
		"10666_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 9,
				"body": "thanks for sharing, informing people about this technology is the most important thing to do IMHO.",
				"added": 1487331693
			}
		],
		"11059_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 10,
				"body": "I'm running a full node (my money is on my computer), and keep a small amount of BTC in various web wallets for easy spending (mobile).",
				"added": 1489136226
			}
		],
		"11248_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 11,
				"body": "wow",
				"added": 1489946395
			}
		]
	},
	"comment_vote": {
		"4_16osdFmHgwgy9sgBws1po2zP5PxwMALvZa": 1,
		"850_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"7_18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj": 1,
		"99_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6": 1,
		"22_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1
	}
}