{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"9_1LRrd96P7FiTcsyNXVzPM5jtpQoH1B4gYf": 1
	},
	"next_comment_id": 14,
	"comment": {
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": [
			{
				"comment_id": 1,
				"body": "Trump is providing a great service to anarchists by undermining the legitimacy of the inherently corrupt system used by the elite to enslave us. One does not have to support, much less vote for, Trump to appreciate the damage he is doing to the credibility of the corporate media and the political infrastructure. Calling Hillary a liar to her face, the elections rigged, how crooked the establishment political hacks in both parties are, the media corrupt and saying how \"going into Iraq was stupid\" are just a few of his wonderful public service moments. His run for president has sped up the process of bringing on a voluntary society more than even Ron Paul's did. It also will make more people not want to vote for anybody. That's a beautiful thing.",
				"added": 1477366131
			}
		],
		"1_1AhXDbKvcLap7TcS2542J7bFYzKHM3xeRU": [
			{
				"comment_id": 2,
				"body": "I wonder how many of you discussing anarchy (and arguing against it) realize what you are doing on ZeroNet. This. Right. Here. This is anarchy. No rulers.\n\nIf you think it can't extend to the rest of the real world consider this. It's absolutely possible to create a ZeroNet e-commerce site with an encrypted order/invoicing system or one that uses Bitmessage. Payments through Bitcoin (even multisig with https://bitcoinjs.org/ or http://cryptocoinjs.com/) where what you make is completely yours. No taxes.\n\nForget the theory and start living free.",
				"added": 1477369878
			},
			{
				"comment_id": 3,
				"body": "> [planespherev2](#comment_57_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): \n> This is my vision of anarchy and a money less society.\n\nJust to be clear. I am a dirty little capitalist and an anarchist.\n\nHowever, freedom of association is great. If you want a money-free society, go ahead. Do not use force/coercion. If it works for you, great.\n\nI think economics (or human action given scarce resources) will keep trade (and mediums of exchanges) going.\n\n*The important thing is to go ahead and just do it.*\n\nThere can be many varieties and only time (and ingenuity) will show what works (whether it be 1000s of Ancapistans and Ancomsgrads).",
				"added": 1477410826
			},
			{
				"comment_id": 4,
				"body": "> [planespherev2](#comment_59_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): The very software you are using in this moment isn't capitalist.\n\nOkay, if you say so.\n\nHave you donated to (or created a PR for) ZeroNet?\n\nIf yes, then it's capitalistic. If you haven't then no, it isn't capitalistic.\n\nFree-riders are a non-issue. But Bitcoin/work was traded. A mutually beneficial exchange of subjective value is capitalism. Sorry buddy, capitalism doesn't need a state.\n\nForget your theory, just go *do it* already",
				"added": 1477428550
			},
			{
				"comment_id": 5,
				"body": "> [combustion](#comment_3_1F77xFSkr5vGCikW8QaHwGZk15Wg6sPxZY): http://marx2mao.com/Lenin/SR17.html#c4s2Give that a read.\n> I used to be an ancap, found out about ancom and moved over to that... the glaring problem with it for me was that there is no framework in place to suppress the bourgeoisie from regrouping and taking power, hence the need for a proletarian state\nthis is so much hog wash. You haven't eliminated force or coercion. you require force to stop people from doing what they **will** to do.",
				"added": 1477438292
			},
			{
				"comment_id": 6,
				"body": "> [combustion](#comment_4_1F77xFSkr5vGCikW8QaHwGZk15Wg6sPxZY): There is force everywhere... for example, when I wake up in a morning and don't want to get up, but because I need a piss I have to get up. That's a force... shall we abolish it too? Or maybe gravity. ABOLISH GRAVITY!\n> Read the link I've posted.\n\nDo you want everyone to know you don't understand the difference between the definition of force in physics and force in human relationships? Force refers to aggression in this context.",
				"added": 1477453618
			},
			{
				"comment_id": 7,
				"body": "> [combustion](#comment_6_1F77xFSkr5vGCikW8QaHwGZk15Wg6sPxZY): The two aren't different. A force compels something to do something. I could hold a gun to your head and told you to dance like a chicken, you'd do so if you wanted to live. Because of the Sun's gravity the Earth is compelled to orbit the Sun. In the stage of socialism, yes there will be coercion against bourgeois forces who try to undermine the proletarian state. The point is to shape society so that you are just left with one, working class. A state is a tool for one class to hold power over the other, with only one class there is nobody to hold power over and therefore the state would stop existing.\n\nSo you are saying that holding a gun to my head is the same thing as earth spinning and keeping me earth-bound? Well, I'm glad we could get your thought processes out in the open. Why would anyone follow your logic?",
				"added": 1477455862
			}
		],
		"1_1BHd3LMHR6ktduvE7mGSdsR4y6JGeU24nv": [
			{
				"comment_id": 8,
				"body": "Stupid question. You are a server (or seeder).\n\nDon't want it. Don't seed it.\n\nThat's what decentralization is all about. If digital forensics were about stopping crimes they would be used to find the original poster (not consumers) of filth. Simple, traditional, detective work is all that's necessary to find a victim (in real life) and put a stop to an abuser.\n\nIt's as simple as being a contentious neighbor and noticing if a child in your neighborhood needs help.",
				"added": 1477887246
			}
		],
		"1_1EwCeJE1k48nqMFtAuiEPLUzNeKvCGTmtX": [
			{
				"comment_id": 9,
				"body": "Sell things (physical things, preferably). Use multi-sig bitcoin to transact (security for your customers). Use ZeroNet's dbschema to collect orders. Use encryption to obfuscate records of incoming orders in your decentralized database.\n\nProfit.",
				"added": 1477890042
			}
		],
		"2_1Cxt2k3farSSee7HTkJKJ7eCTKxfFGNXe6": [
			{
				"comment_id": 10,
				"body": "> [ancap](#comment_93_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz): \n> It's not bad that the worst candidate is likely to win. The sooner this all comes down crumbling, the better.\n\nMy thoughts exactly. If Clinton wins it's because emotional people think words like \"stronger together\" mean more than past deeds. If Trump wins I don't think anyone will let him build a wall (what a waste of money).\n\nEventually +$20 trillion brings down the beast. They'll try to replace it, but people will finally see that this was never sustainable.\n\nI vow to live free, right now, not in some distant future. I call it \"sovereign in plain sight\". With Bitcoin, Bitmessage, ZeroNet and WebTorrent it's finally possible to simply ignore statists and go about your [life](/1HmaXJCQtcXHBQEkcPrVuq1aUFUrH9CTi2/government/sovereign-in-plain-sight/2016/10/28/the-four-horsemen.html).",
				"added": 1477890114
			}
		],
		"2_1Buu3gEo6EcUijPE6dkSToaYzXKGnAgXFy": [
			{
				"comment_id": 11,
				"body": "You are probably missing an argument to let ZeroNet know that you will be proxying \n```bash\n$ ./zeronet.py --ui_ip 0.0.0.0 --tor always\n```\n\n*assuming you use tor",
				"added": 1478146455
			}
		],
		"1_1FZEtMSz2tKFZPmBtjhD7JgR4awtAMD47G": [
			{
				"comment_id": 12,
				"body": "> [binero](#comment_8_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Capital is pretty easy to keep under control.\nHahahaha...says capital is easy to keep under control while using elliptic curve cryptography (i.e. Bitcoin tech) to post on the hardest platform to control in history. You Ancoms make me laugh.",
				"added": 1478329871
			}
		],
		"1_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd": [
			{
				"comment_id": 13,
				"body": "> [00d4n1](#comment_3_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd): Actually no, I think you'll find I literally am better than fascists.\n\nI think you're having a hard time defining fascists so I'm not sure. Antisemitism does not correlate with fascism which is an economic/political ideology (not based on race).\n\nIf you want a pristine area just clone this site, add yourself as a signer (content.json) and moderate to your hearts content.",
				"added": 1484986347
			}
		]
	},
	"comment_vote": {
		"58_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"54_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"5_1KnFgYp6rbz2VLe4H7RW36J8ChSqHSbxLn": 1,
		"5_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"90_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz": 1,
		"93_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz": 1,
		"97_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz": 1,
		"95_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz": 1,
		"654_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"23_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz": 1,
		"3_164W1rFVD9Bm7poGJWvjVUjvkbhhFC5nnt": 1,
		"4_164W1rFVD9Bm7poGJWvjVUjvkbhhFC5nnt": 1,
		"33_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": 1,
		"34_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": 1,
		"22_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": 1
	}
}