{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1_1L14vSk76tujfNoqrcRuFk2tBBZgUPy92t": [
			{
				"comment_id": 1,
				"body": "> [armageddon](#comment_4_1Je6ZLuzvFihQPFFhveQ7GBU2FBWE28zDv): http://www.jta.org/2016/06/07/news-opinion/united-states/echo-symbol-added-to-adl-hate-symbols-databaseThe triple parentheses, originally used by anti-Semitic social media users to designate Jews, has been appropriated by Jewish social media users.\n> WikiLeaks removed tweets that described some of its Jewish critics as “establishment climbers.”“Most of our critics have 3 (((brackets around their names))) & have black-rimmed glasses. Bizarre.”http://www.jta.org/2016/07/24/news-opinion/world/wikileaks-removes-anti-semitic-tweetsNow the Jewish lobby marked Assange as racist because he used  3 brackets.\n> The Antichrist will be born soon and the world will be enslaved.\n\n'In recent days, Jewish users on Twitter have co-opted the parentheses and used them around their names in a show of solidarity with those targeted by neo-Nazis and other extremists on social media.\n\nOver the past several weeks, the echo has been used by white supremacists and others as part of a pattern of harassment against a group of journalists including Jeffrey Goldberg of the Atlantic, Jonathan Weisman of The New York Times, Julia Ioffe of GQ, Bethany Mandel of the New York Post and Ben Shapiro of The Daily Wire.'\n\nJews may use parenthesis around their names but others may not.",
				"added": 1478877406
			}
		],
		"2_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": [
			{
				"comment_id": 2,
				"body": "Jews may do whatever they want and others may not even know about that.\nJews may suck baby penis because it is holly for them. Other must go to jail even for looking on such pictures.\nOh moment. Gentiles must go indefinitely to jail even if it is supposed that they have pictures with Jewish perversions on their computer.\nhttp://www.zdnet.com/article/suspect-jailed-indefinitely-for-refusing-to-decrypt-hard-drives/",
				"added": 1478877776
			}
		]
	},
	"comment_vote": {}
}