{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": 1,
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": 1,
		"1_1AQwGx5xyBi5Fvv9WHJFMCMNtQhUc8UhQF": 1,
		"1_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"2_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1,
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_1yk1FeoNn1RmZRtCXcsgL59nNp7xs3aYu": 1,
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": 1,
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": [
			{
				"comment_id": 1,
				"body": "> [docp](#comment_3_178bUCUrfXeVvkFHfFBeZ8my1tputpjF2Z): Prince Charles, heir to Draculas blood linehttp://www.telegraph.co.uk/news/uknews/prince-charles/9656769/Prince-Charles-heir-to-Draculas-blood-line.htmlhttp://www.digitaljournal.com/article/336327\n\nHe is not saying that without reasons because the British royals are products of centuries of inbreeding and they suffer from porphyria.\nPorphyria\nIn humans, porphyrins are the main precursors of heme, an essential constituent of hemoglobin, myoglobin, catalase, peroxidase, respiratory and P450 liver cytochromes.\nThe body requires porphyrins to produce heme, which carries oxygen in the blood, but in the porphyrias there is a deficiency (inherited or acquired) of the enzymes that transform the various porphyrins into others, leading to abnormally high levels of one or more of these substances. \nIn clear text the body of royals have difficulties to produce blood.\n\nMethods of Treatment\nIn most cases of porphyria, blood or heme transfusions can supply some relief from the symptoms, and this is still the mainstay of treatment. \nInterestingly, the heme pigment is robust enough to survive digestion, and is absorbed from the intestine (even though the protein parts of hemoglobin are broken down). This means that, in principle, it is possible to relieve the symptoms of porphyria by drinking blood--another possible link with the vampire stories. \nhttps://www.scientificamerican.com/article/born-to-the-purple-the-st/\nhttps://en.wikipedia.org/wiki/Porphyria\n\nBlood transfusion helps.\nBut they are many stories that the royals still prefer the traditional ways of drinking child blood.\nPossibly they took over this habit from the Jews.(earlier Jewish populations showed the same signs of inbreeding)",
				"added": 1482277986
			}
		]
	},
	"comment_vote": {}
}