{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_19dfuqqdasCxD56Yn8KGcgcckbdkV9SZi4": 1
	},
	"next_comment_id": 12,
	"comment": {
		"1_19dfuqqdasCxD56Yn8KGcgcckbdkV9SZi4": [
			{
				"comment_id": 1,
				"body": "I see what you mean, but if you're a political dissident, why your machine wasn't heavily encrypted? If you want to refrain from being tortured until you spill out the encryption password, you should use a \"regular\" computer only for perfectly family safe things, while you leave the real deal (which must be heavily encrypted) either destroied or well hidden.",
				"added": 1491414916
			},
			{
				"comment_id": 3,
				"body": "> [13lucifer23](#comment_4_19dfuqqdasCxD56Yn8KGcgcckbdkV9SZi4): ^^^^^^^This is one reason why people are sketched out about every Zeronet site they visit^^^^^^^\n\nAs well they should. I personally use tails usb drives, if I ever get more paranoid, I'd leave the doors open so I can monitor the feds coming, back against the wall, and perhaps a 5 minute cronjob with /bin/shutdown that I have to turn off manually.\n\nStoring files in plaintext makes zeronet meant for what it's being advertised. I fully agree that you can't do safe surfing if you have to check every file being downloaded, or even if you don't use a ramdisk and you know that there is no easy way of erasing the content after it's been written to the disk already.",
				"added": 1491421099
			},
			{
				"comment_id": 7,
				"body": "> [13lucifer23](#comment_5_19dfuqqdasCxD56Yn8KGcgcckbdkV9SZi4):\n\nOn the other hand, given the popularity of zeronet, if it ever happens, it would be the \"ugly\" deep web that regular media keeps talking about, just on steroids.",
				"added": 1491426816
			},
			{
				"comment_id": 9,
				"body": "> [13lucifer23](#comment_9_19dfuqqdasCxD56Yn8KGcgcckbdkV9SZi4): That's where you're wrong, people don't use tor/deepweb because it's too complicated (derp) for most people whereas zeronet is insanely easy to setup and if further security measures are implemented, such as seeded site encryption for one, it has the potential to bridge all gaps! Think about how many people torrent.\n\nYou're correct, but since you corrected me, let me mention just that the example is wrong because in my reality, few people torrent and they're considered the die hard geeks, while \"regular people\" usualy need a wordpress filled with trojan embeded rar files (hei the anti virus iz screaming becuz were piratez doh) in order to get their entertainment.\n\nBut now that you mention it, for zeronet to work properly to a normal user, people would have to be running a tor browser and actually doing the suggested insecure behaviour (disabling proxy for 127.0.0.1), so in a way running zeronet is actually harder than running tor.",
				"added": 1491437269
			}
		],
		"1_1FNuZtJdubQVu1Mxs65nBVWKuE84pSsoBG": [
			{
				"comment_id": 2,
				"body": "All the things you're saying are already happening. Like it has been said, if you want to discuss politics, you have to start creating safe environments for it. In the case of zeronet, it can't involve censorship, so that's much harder. You'll eventually find out that there are more people thinking the same things and making efforts towards it.\nBut it is unecessary to say that they won't go out spreading the news aloud.",
				"added": 1491415204
			},
			{
				"comment_id": 10,
				"body": "> [darvy](#comment_27_1EqerKajfi14bzTkqwSfqVrxKmQW1w6Nzk): If it had a CMS I'd do something with my blog.\n\nWhat you are really asking is that you would require a web interface to do site management, like wordpress for instance. Don't get me wrong, I think that's reasonable to expect.\n\nAnd that is totally doable. Just look at this forum - you may push comments from a web form. It's no more difficult to make a full blown web admin for a blog, for instance. I've never looked at zeroblog, though.",
				"added": 1491437510
			},
			{
				"comment_id": 11,
				"body": "> [darvy](#comment_27_1EqerKajfi14bzTkqwSfqVrxKmQW1w6Nzk):\n\nCheck this out: http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:zerowiki",
				"added": 1491438217
			}
		],
		"1_172ALy9XgaQ3gJUx5zVzgeqp2oLsAoqo6m": [
			{
				"comment_id": 4,
				"body": "> [swagstika](#comment_17_1EgqAT7i9ipPjsMa5axHKjmLGbdttKd4E1): what? how am I looking for it? I just want to know which zite it is so I know not to click on that zeronet link. There just so many links on zeronet, and I dont want to click on the wrong one.\n\nThe best protection is not to know about it. That said, no one here will willingly advertise bad stuff. Just do a \"bouncing tits\" search on youtube and be done with curiosity.",
				"added": 1491421375
			},
			{
				"comment_id": 5,
				"body": "> [13lucifer23](#comment_8_19dfuqqdasCxD56Yn8KGcgcckbdkV9SZi4): Can't tell if stupid, skid, or trolling.........You've brought up this link several times now, I think you should talk to a therapist.\n\nIf it were stupid, it'll stop at the second negative. Just stop feeding, at this time, he probably made a whole new zeronet forum regarding bouncing tits already.",
				"added": 1491425431
			},
			{
				"comment_id": 6,
				"body": "So to answer the OP's question, you can't be safe at zeronet unless you visit strictly links which you trust. This will provide you with the benefits as advertised. If you \"surf\" the zeroweb, you'll find the regular shit that's available in the the deep web and even in the clearnet that you've probably seen already. That's not a zeronet issue.",
				"added": 1491425573
			},
			{
				"comment_id": 8,
				"body": "> [13lucifer23](#comment_10_19dfuqqdasCxD56Yn8KGcgcckbdkV9SZi4): inb4heunknowinglyseedchildpornandgetsraided [...]\n\nI fully agree with you, but I still don't see how zeronet is helping that happen faster than conventional internet or the deep web - for the sake of mentioning again that word.",
				"added": 1491437022
			}
		]
	},
	"comment_vote": {
		"1_19dfuqqdasCxD56Yn8KGcgcckbdkV9SZi4": 1,
		"2_19dfuqqdasCxD56Yn8KGcgcckbdkV9SZi4": 1
	}
}