{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": [
			{
				"comment_id": 1,
				"body": "Over 75% of the inmates in Auschwitz were not able to work and the SS took care of them.\nThe SS was very concerned about the well-being of Jews and other inmates in Auschwitz.\nThe German SS arrested Buchenwald Commandant, Karl Koch in 1943 for mistreating and even executing some prisoners. After an investigation Koch was found guilty by SS Judge Konrad Morgen and shot. Does this sound like a policy of \"extermination?\"\nThis is a historically known fact with Koch.\nWas any US or Soviet prisonary camp commander executed for mistreating inmates?\nLook by the INSTITUTE FOR HISTORICAL REVIEW on the\nPages From The Auschwitz Death Registry Volumes\nLong-Hidden Death Certificates Discredit Extermination Claims\nhttp://www.ihr.org/jhr/v12/v12p265_Weber.html\nThe death registry volumes fell into Soviet hands in January 1945 when Red Army forces captured Auschwitz. They remained inaccessible in Soviet archives until 1989, when officials in Moscow announced that they held 46 of the volumes, recording the deaths of 69,000 Auschwitz inmates.\nThese 46 volumes partially cover the years 1941, 1942 and 1943. There are just two or three volumes for the year 1941, and none at all for the years 1944 or 1945. [2] It is not clear why so many volumes are still missing. According to informed International Red Cross officials, the most likely explanation is that they were misplaced by the Soviets, and might therefore turn up later. (There is no indication that Auschwitz camp authorities made any effort to destroy any of the volumes.)\n\nChaim Richter, a Jewish salesman, was 81 years old when he died in Auschwitz on March 1, 1942, of \"weakness of old age.\"\nLook on the original death certificate of those old Jewish people. The German SS took care of them very respectfully until their natural death.",
				"added": 1484524672
			}
		]
	},
	"comment_vote": {}
}