{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "What about torrent trackers? (Torrent Shielding)",
			"body": "What if they start shutting down trackers? will the torrent system survive? is there any workaround over here? something like p2p sharing using this Zeronet network?",
			"added": 1470452224
		},
		{
			"topic_id": 2,
			"title": "is there any way to stop criminals for using this network?",
			"body": "I´m worried about the security of this net, it will end up like TOR? full of exploits/malware, psychopaths, drugdealers ,pedophiles and many other kind of criminals? i recently saw an user asking for child pornography on the spanish version of this page :(",
			"added": 1470456471
		},
		{
			"topic_id": 3,
			"title": "I´m developing an indie  game and i need some feedback, can you help me choosing a name for it?\n",
			"body": "Since i´m not a native english speaker im not sure if this names sounds good, are correct or even appealing for my game (or are just lame and stupid), i got some in mind: \"Wizardly Dungeons\" \"Wizarding Dungeons\" \"Arcane Maelstrom\" \"Wizardic\" \"The Underworld Tales\"  \"Spell Lord\" and \"The Doomed Scrolls \" which one is better? do you have any other good suggestion? Thanks a lot!\n\n\nPD: Thanks for your answers! i will update this post as soon as i can show something about the game, i´m really interested in your opinions :D\n\n",
			"added": 1470768988
		}
	],
	"topic_vote": {
		"1_1KCg4tQ1dBRfMWZ8ptrqXSSUKKR11rYb6P": 1
	},
	"next_comment_id": 18,
	"comment": {
		"1_1DjUq8hd2jYZgc5uNhQEtWUVZjMHkMQkpU": [
			{
				"comment_id": 1,
				"body": "me",
				"added": 1470455274
			},
			{
				"comment_id": 2,
				"body": "> [kallukalia](#comment_1_1GCkz1DwRMJBjoGbXeGwqeyFjbEbXzdfm7): and just how can we torrent, there isn't any torrent site with a decent UI like KAT or TPB\n\nUsing torrent search engines like: \"http://torrentz.filespook.com/\" \"http://www.toorgle.com/\" or \"https://torrentproject.se/\" by now, or going back to https://thepiratebay.org/ (still alive, is not mirror)",
				"added": 1470455601
			},
			{
				"comment_id": 3,
				"body": "> [testset](#comment_28_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp): No, a Diaspora* post lured me here.I stayed because my impression is that a new era of internet is being born here.\n\ni had the same feeling :)",
				"added": 1470455706
			}
		],
		"2_1AZjDLkfYwSmjM7ZJUf7HHnrF778augRMa": [
			{
				"comment_id": 4,
				"body": "> [armchairgenius](#comment_1_1DW9EhqZ7rndNKZTPbdxsttBU1jGtT2soT): Ah great, more of the \"only evil people use Tor\" mantra. Does better encryption and privacy allow people to access things like CP? yes it does, but that's the price of freedom.\n\ni´m not willing to pay my \"freedom\" supporting the suffering of rape, murder or even terrorism victims (they deserve freedom too, mine is not more important than their), i dont wanna host or promote any monstruosity that uses other people suffering, if using this net i´m supporting this monsters i prefer centralized net :(",
				"added": 1470525069
			},
			{
				"comment_id": 5,
				"body": "> [testingzeronet12](#comment_88_1CMjV2r4EBpFt8VCcWWZKDysZXPcPExRNN): Expect to see a lot more of this FUD as ZeroNet becomes more well-known and law enforcement become more concerned about ZeroNets uncensorable nature :)\n\nNot FUD intended, if i really have control over what kind of information is being stored and distributed from my PC then i am ok (since i wont distribute something i dont want/know about) but im not sure if it is the case or not, or if it will get to hard to manage when this grows up, we need (apart from common sense) a way to filter \"questionable content\" (voluntary of course, im not talking about imposing censorship)",
				"added": 1470534973
			},
			{
				"comment_id": 6,
				"body": "> [graveyardswatch](#comment_19_1HrRNH7KbdxMjwLmwrHmZqJrzVZVDKc9bF): Well, no, Tor, Zeronet, Freenet, Encryption, Steganography, even ice picks, kitchen knives, US dollars, etc. can aid the most evil criminals in this world, shall we ban cooking all together to prevent crimes? Shall we eliminate civilizations so nobody can commit a crime with these tools coming from civilization?\n> If you want to fight for world peace, go after Nuclear Bombs, Bio & Chem weapon researchers, terminator developers, etc. Your life can be much meaningful.\n\nI know bad things happens because bad people find the way to do it, tools are tools, is more about how we use them, I totally agree, what  I meant is that I don't wanna be a \"node\" if the net is using me to transmit something i don't want, is mandatory having some way to control what is being stored/transmitted in our PC using this decentralized networks, because if not we can end distributing terrible things like CP without even noticing it, contributing to the problem",
				"added": 1470535699
			},
			{
				"comment_id": 8,
				"body": "> [graveyardswatch](#comment_21_1HrRNH7KbdxMjwLmwrHmZqJrzVZVDKc9bF): There is NO WAY that you can be no part of it. \n> You work, you pay your tax, willingly or not, you support the social system, you enforce the institution, which then supports all criminals, or sinners according to your perception, who are willing to use the system.\n> To a more fundamental degree, you breathe, you shit, you metabolize, the simple fact that your life existing as a part  of all lives on earth, is to support the ecological system by offering very tiny contribution to the ecological cycle, which ultimately is an absolutely divine force supporting those STUFF you don't want to be a part of.\n> There is no personal Eden, to live is to sin. If you really want something peaceful to the soul, try writing some novels, building the world you want in your own tiny creation, instead of hoping a world not in your control to adapt around you.\n> Learn more, instead of dwelling on some solid concepts, will bring understanding.\n\nSome bad things can be avoided, while others don't, i prefer focusing in the first group, and no, i´m not willing to manipulate anybody, or creating a cult.. or imposing anything as you suggest lol xD",
				"added": 1470537402
			},
			{
				"comment_id": 9,
				"body": "> [graveyardswatch](#comment_21_1HrRNH7KbdxMjwLmwrHmZqJrzVZVDKc9bF): There is NO WAY that you can be no part of it. \n\nWe can´t choose not being a part of the World or not having impact on it, but sometimes we can avoid doing things  that in some degree could contribute in to harm to other beings (or doing them differently in order to achieve the same)",
				"added": 1470538417
			},
			{
				"comment_id": 10,
				"body": "> [teszt](#comment_21_1AdcxsExVKvxffQtEd72E5tckouzZHLEYC): The biggest criminals of the world already control most of the internet and don't need ZN for their crimes.But if there will be a way to control and censor networks like ZN then they can continue their crimes and nobody will know it.'True conformity is possible only in the cemetery' - Joseph Stalin.\n\nThey will, but not in \"our name\" and using our net resources if we were able to use a \"warning list\" that triggers a warning before entering (avoiding this specific content distribution from our PCs, since we could choose not hosting their data by simply  not loading the site in first instance) we really need this feature",
				"added": 1470616837
			},
			{
				"comment_id": 12,
				"body": "No, we don't.Did you actually read what he wrote?He wrote that the warning lists you suggest will be used against you by the same criminals you're concerned that will abuse zero-net.You're reply to that doesn't make much sense.\n> Is there a point to compromising the integrity and functionality of zero-net, with warning lists, when it accomplishes nothing, but make you feel good about yourself since they're not doing it in 'your name'?\n\n Where is the issue about creating lists that the people can opt to use or not? i just don't wanna aid criminals or expose myself to their content, how am i compromising the zeronet funcionability and/or security blocking the content i dont want? i´m getting tired of this crap, is simple, if i dont find a way to do it im leaving, and probably other \"moral fags\" like me will do the same.",
				"added": 1470669302
			}
		],
		"1_16urzDUk5S1EYSaL8XGaJav7BicYSnsxe3": [
			{
				"comment_id": 7,
				"body": "Are you developing this? voxel based games are great and a lot of people like them, just be sure to \"add something new\" an added value to your game",
				"added": 1470536691
			}
		],
		"9_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t": [
			{
				"comment_id": 11,
				"body": "Is not loading, it says: \"content.json download failed\"",
				"added": 1470629855
			}
		],
		"1_1JGTZxxkeZuhNBRfW6imTjeYbzjgqkU48N": [
			{
				"comment_id": 13,
				"body": "Probably yes, but maybe there is no possible way to do interstellar travel, or we are like \"animals\" to them, and they are just studying us silently, hiding from us without making any interfere",
				"added": 1470726614
			}
		],
		"3_1AZjDLkfYwSmjM7ZJUf7HHnrF778augRMa": [
			{
				"comment_id": 14,
				"body": "\n",
				"added": 1470769029
			}
		],
		"1_114c9kLxp6SPG4xhhHZEnoijFdYA8j23JE": [
			{
				"comment_id": 15,
				"body": "upload them here, is the Zeronet KAT version :) http://127.0.0.1:43110/1LBr1dHoXvJAMjDgW8Wcg5kbCoKyJnzo6p/",
				"added": 1472612779
			},
			{
				"comment_id": 16,
				"body": "> [zarty](#comment_8_1KzaKud9cUZB7HcgHnhrZqyuq2NnTeW6PR): For the uninitiated, what are unity assets?\n\nUnity is a 3D game Engine",
				"added": 1472612829
			},
			{
				"comment_id": 17,
				"body": "> [iamdeath](#comment_14_1DcE9QfZbfLZhXxgtQ8Ui3oMZvs9NVjqZB): Fuck off, man, that's fake crap.\n\nDo you have \"the real one\" then?  I thought this one was good :/",
				"added": 1476329742
			}
		]
	},
	"comment_vote": {
		"28_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp": 1,
		"7_1CTut2qbaj54ZjNoYeuWSGwV75iVieKY6N": 1,
		"58_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t": 1,
		"16_12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu": 1,
		"3_12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu": 1,
		"7_12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu": 1,
		"9_12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu": 1,
		"7_1H1SHzxnPJS3hBbKvfXLqf4QJnXEUgaVe9": 1,
		"1_15rVDNb7L1Kpzt3MCvkxFayqfMBw7yPxbk": 1
	}
}