{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_1E1fsmFRrsPsfiYVbXfifNMcaWwuk8iFcp": 1,
		"2_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1,
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": 1,
		"1_12Xj1w5HYu6w5xtEwwLyEiMYGuCqvYKL2q": 1,
		"1_1NU6gdra9qhUhdbYGLia1G3HYT87qUTA7w": 1,
		"1_1AQwGx5xyBi5Fvv9WHJFMCMNtQhUc8UhQF": 1,
		"1_1At4zensbxPGhXYbe5bnx9eGuE4V1vnbc8": 1,
		"2_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_1DqaWUpq6dRXfuXCokpjYoAkDj2nzZDnAn": 1,
		"1_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": 1,
		"1_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": [
			{
				"comment_id": 1,
				"body": "> [boney](#comment_1_1FgxwNhn5uKjAuydnChadFgkMAhzY1QS5y): Holly Jewish excrementation,holly Jewish child penis sucking,holly Jewish blood sacrifice.\n\nThis strange habits are essential parts of the Jewish identity together with a superiority and always victim feeling.\nEven a half Jew who is not religious at all has a strong Jewish identity feeling which gives him the right to do whatever is neccesary with a Gentile. Being always victim in his mind the Jew among Gentiles will mostly try to hide his Jewish identity and harm as much as possible to the others with covert methods.\nAs Jews consider all Gentiles not humans they will put all Gentiles on the same level, criminals, prostitutes, gays, idiots with normal honestly working citizens.\nThe Jew is always making a cost-win analyze for his action and supporting pedophils and criminals to be put in key functions because it is cheaper for him to bribe or blackmail them later. \nThe Jews is also creating a victim ideology for the scum of the society where the Jews appear to be their best friends. Look on the communist and gender ideology, created fully by Jews.\nThis way they have in every important position a Jew or a bribed Gentile puppet who disregards the moral values of the traditional human society and will obey only the Jews.",
				"added": 1491029006
			}
		]
	},
	"comment_vote": {}
}