{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1,
			"title": "Central Banker Jews are trying to take over the world by forming a One World Government behind the scenes",
			"body": "The rich Jews want to rule the world, and they already privately own the Federal Reserve Bank and thus create our currency, thus have unlimited currency to bribe all the politicians and start the wars, and terrorism needed to force the world to accept their One World Government. They are trying to steal our Freedom and National Sovereignty with trade deals like the TPP, CETA, and forced immigration, and transferred the Internet to themselves on Oct 1st via the UN.  These form the backbone of their One World Government that they want to use to enslave all of us.\n\nThe only thing the rich jews have to try to lord over us is that they control the creation of the currency, because they privately own the Federal Reserve Bank. This gives them unlimited currency to bribe all the politicians, and to try to damage us so we are too weak to challenge them. Therefore, We MUST take the power to create the currency back to the people as the Constitution intends, and NOT borrow the currency the rich jews create, which is the Federal Reserve Note currency.\n\nThe only thing they want is to keep control to enslave everyone.\n\nWe the People, as the Constitution mandates, must create a sovereign currency, rather then borrow “bank money” from them, which only enslaves us, and gives them reason to secretly attack us to make us too weak to challenge them!",
			"added": 1475886443
		},
		{
			"topic_id": 2,
			"title": "The Central Bankers are Jews and are trying to start a war with Russia",
			"body": "Russia who is the problem, and that it is the Central Bankers who are trying to start a war with Russia, because the Central Bankers ponzi scheme where they create unlimited currency for themselves and lend it out to countries is starting to fail. They think the people wont notice this if they start a war with Russia. However, We The People notice it, and will be creating a sovereign currency of for and by the people and NOT borrow it from the Central Bankers.",
			"added": 1475886509
		},
		{
			"topic_id": 3,
			"title": "What is the highest power in the world?",
			"body": "The only issue that matters is who has the power to create the currency. The Constitution says for the people to create the currency and not borrow from the central bankers thus being the central bankers slaves, like is happening right now. The Central Bankers are creating all the chaos so they can stop the people from taking the power to create the currency back.",
			"added": 1475886540
		},
		{
			"topic_id": 4,
			"title": "The Jew Central Bankers who own the Federal Reserve are trying to harm you badly",
			"body": "The Federal Reserve Bank is privately owned and they create the currency, thus they get unlimited currency for themselves. Do they ever want to lose this power? No, not a chance and they will do ANYTHING to keep it, like damaging you so you are too weak to challenge them.\n\nThe American Establishment, controlled by the Central Banker Jews, constantly purposely invents, creates, and runs all the public threats: wars, terrorists, diseases, black lives matter, poisoned food, air, water, vaccines, with the intention of keeping people subjugated and too weak to oppose them, so that they can retain power.\n\nThe problem with America is that the Central Bankers are creating the Currency and Americans and the government are borrowing it from them. \n\nThe Constitution says that the People, the Congress, is supposed to create the Currency and use it directly, NOT borrow it from a private banking group, because this will give such private banking group unlimited Currency to use to take over America. This was mentioned many times by the Founding Fathers. \n\nTherefore, the People, the Congress, must start creating the Currency by abolishing the Federal Reserve Bank, which is privately owned and is no more than a parasite that is actually trying to take over the entire world by destroying American Freedom and American National Sovereignty.\n\nThe United States government is currently no more than a huge conspiracy against the people, orchestrated by the private owners of the Federal Reserve Bank, who are bribing all the politicians to NOT follow the Constitution, so that these Central Bankers can themselves control the entire government and thus transfer everything of real value to themselves.\n\nhttps://www.youtube.com/watch?v=7OGPq6qG99Q\n\nhttps://www.youtube.com/watch?v=aVfaL4AWf8Q\n\nhttps://www.youtube.com/watch?v=KjPPG8FJPew\n",
			"added": 1475886582
		}
	],
	"topic_vote": {
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": 1,
		"3_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": 1,
		"2_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": 1,
		"4_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": 1,
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": 1,
		"2_18Sh2Z83C23xdd6pjCq6NGv7Y6svEBcUfb": 1,
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 1,
				"body": "At least to some degree, every Jew in the world has the mentality that their main goal is to subjugate, subvert, and enslave all other groups one way or another, this is because of their religious learnings.\n\nThe Jew mentality is the largest destructive force in the world today. Jews are running the Muslim Invasion.",
				"added": 1475886779
			}
		]
	},
	"comment_vote": {
		"2_1NTyunqMj3zioKiVtg9zxHjfyWjfXuYraV": 1
	}
}