{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Starting a pedophile support group on ZeroNet",
			"body": "I'm toying with the idea of starting a pedophile support group on ZeroNet. NOTHING ILLEGAL, but genuine support for pedophiles who don't touch kids, friends, those that want to understand and those that have been hurt by offenders. For context, this support group would be a continuation of one that was banned from reddit unjustly.\n\nI'm wondering how hostile the community would be towards it. Would anyone be willing to seed? Would I need to do my own identity and mail services if people didn't want us to use theirs?",
			"added": 1486460702
		}
	],
	"topic_vote": {
		"1_1GuYKebkQAqGJ4tNpNp4TD1UuoHHudCJLA": 1,
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1_1GuYKebkQAqGJ4tNpNp4TD1UuoHHudCJLA": [
			{
				"comment_id": 1,
				"body": "@nextbit: That's a good idea too, I'll have to think about that. A problem with that is that pedophiles tend to avoid support groups that aren't explicitly for them because of stigma and rejection.\n\nI also think I may have been unclear with what I meant by 'support', I did mean helping them deal with the illness. Not actually cheer them on and try and fix them. There are pedophiles out there that do want to abuse kids, and they're not welcome to anything I make.\n\nThanks for your civility.",
				"added": 1486493887
			},
			{
				"comment_id": 3,
				"body": "@nextbit There is actually a different word for it - 'minor attracted person'. It would probably be better to use this term.\n\nFree will is a complex topic in itself which we should probably educate people on more. It's not like anyone can ever choose something without being influenced by their situation (knowledge, skills, life experience.)",
				"added": 1486558155
			},
			{
				"comment_id": 4,
				"body": "Disgusting! I don't want to rape, torture or murder kids. What's wrong with you, telling people how to get to places to do that? Do you even care about kids?",
				"added": 1486603437
			}
		],
		"1_141BoRKHLRi8JjCtbJjqRjSvM61YE6jUhs": [
			{
				"comment_id": 2,
				"body": "@sealove and @daredevill: Hey there! Welcome to ZeroNet.",
				"added": 1486529570
			}
		],
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 5,
				"body": "ITT: nazis",
				"added": 1486680611
			}
		]
	},
	"comment_vote": {
		"6_1Mzjg3DjFFiUBz42zZa9w9oM2Lf4vHeLK3": 1,
		"4_1Mzjg3DjFFiUBz42zZa9w9oM2Lf4vHeLK3": 1
	}
}