{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1EWcSH8L4VBXvQVn4NB4s8HsJuJzNwATYD": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1_1EWcSH8L4VBXvQVn4NB4s8HsJuJzNwATYD": [
			{
				"comment_id": 1,
				"body": "Ancent Jews had darker skin but not so dark as negroes.\nThe curse of Ham:\n20 And Noah began to be an husbandman, and he planted a vineyard:\n21 And he drank of the wine, and was drunken; and he was uncovered within his tent.\n22 And Ham, the father of Canaan, saw the nakedness of his father, and told his two brethren without.\n23 And Shem and Japheth took a garment, and laid it upon both their shoulders, and went backward, and covered the nakedness of their father; and their faces were backward, and they saw not their father's nakedness.\n24 And Noah awoke from his wine, and knew what his younger son had done unto him.\n25 And he said, Cursed be Canaan; a servant of servants shall he be unto his brethren.\n26 And he said, Blessed be the Lord God of Shem; and Canaan shall be his servant.\n27 God shall enlarge Japheth, and he shall dwell in the tents of Shem; and Canaan shall be his servant. –Genesis 9:20-27\nThis storry is in the Torah, the Genesis book.\n\nIn the Babylonian Talmud is argued that Ham either castrated his father, or sodomised him.\nWhile Genesis 9 never says that Ham was black, he became associated with black skin, through folk etymology deriving his name from a similar, but actually unconnected, word meaning \"dark\" or \"brown\".\nIn the Jewish Talmud it is interpreted that all children of Ham became black because of this course of Noah and they are the negroes and their destiny is to be slaves forever.\n\nBut it is coming even worse by Jewish prejudice against negroes.\nAccording to  the Jewish holly books the black Jews are all from a sinfull relation of king Salomon with the black princess Saba, which brought unluck to the Jews.\n\nJews are very superstitious people and they try to avoid negroes but black Jews they hate at most because God punished them all and the black Jews are guilty for their suffering.",
				"added": 1491517550
			}
		]
	},
	"comment_vote": {}
}