{
	"comment": {
		"2_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": [
			{
				"body": "> [ancrap](#comment_1_1BUT1Fkg24g776hLUABjrQnPjHhXapSkjc): Why is this monster not punished ?\n\n\n\"kill one man and you're a murderer, kill one million and you're a politician\"\nThere is an analogy.\nSuck the penis of a child and you are a homosexual pedophile, suck 20 000 and you are a rabbi.",
				"comment_id": 1,
				"added": 1479212484
			}
		],
		"1_1AhXDbKvcLap7TcS2542J7bFYzKHM3xeRU": [
			{
				"comment_id": 2,
				"body": "You should be all brave and listen to the Queen Mum.\nPeople need stupidity and drugs like water.",
				"added": 1479293815
			}
		],
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 3,
				"body": "Blood sucking Jewish rabbis control illegal organ harvesting and trade worldwide\nhttps://www.youtube.com/watch?v=hBsAg0v4_ik",
				"added": 1479294514
			}
		]
	},
	"next_topic_id": 3,
	"topic": [
		{
			"body": "The English Queen Mum is a bastard. The Queen Mother was the illegitimate daughter of a French cook, and were born to family's French cook, according to the shocking book of aristocratic author Lady Colin Campbell. This book provoked much hate by the royal family. \nhttp://www.dictionary.com/browse/bastard\nhttp://www.huffingtonpost.co.uk/2012/04/18/queen-mother-lady-colin-campbell-french-cook-_n_1433853.html\nhttp://www.dailymail.co.uk/news/article-2123012/Queen-Mother-Fury-books-claim-her-brother-born-familys-French-cook.html\n---------------------------------------\nBut there is more hidden by the royal family.\nPrice  Oxford fucked his mother, the Queen and Henry Wriothesley was born from this relationship.\nThis theory is known as Prince Tudor Part II and is not widely accepted.\nhttps://en.wikipedia.org/wiki/Prince_Tudor_theory",
			"parent_topic_uri": "9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj",
			"title": "English Queen Mum is a bastard. The Queen Mum was the illegitimate daughter of a French cook, and were born to family's French cook, according to the shocking book of aristocratic author Lady Colin Campbell.",
			"added": 1479158356,
			"topic_id": 1
		},
		{
			"body": "Part 1 Baby Its Cold: https://www.youtube.com/watch?v=dTg4qnyUGxg \nPart 2 The Phantom Victory: https://www.youtube.com/watch?v=7QTaJ_ZVn-4 \nPart 3 The Shadows In The Cave: https://www.youtube.com/watch?v=WD1BRE-DBsA\nhttps://en.wikipedia.org/wiki/The_Power_of_Nightmares\n\nBilderberg is a Jewish Cabal under the surface of Global Banking. They developed the concept of 'war on terror' since decades to justify massive public spending and financing and profits for the war industry.\nMajor players of the Bilderberg group:\nBen Shalom Bernanke: Chairman of the privately held US Federal Reserve Bank.\nJames Wolfensohn: International Jewish financier. Chairman of Wolfensohn & Company Investments. A former World Bank President, this Jew has more than 140 employees and offices in London, Tokyo and Moscow. Wolfensohn also has a banking partnership with Fuji Bank of Japan and Jacob Rothschild of Britain.\nRobert Zoellick: Chairman of the US World Bank Group a covert subsidiary of the Rothschild run International Monetary Fund.\nJosef Ackermann: Chairman of the Executive Committee of Deutsche Bank AG of Zurich Switzerland. Ackermann is a Rothschild partner in white collar crime.\nKenneth Jacobs: Deputy Chairman Head of Lazard Bank North America. Lazard Bank, a Rothschild associate bank, operates in 39 cities throughout North America, Europe, Australia, Asia, and South America.\nDavid Rockefeller: Owner of Chase Manhattan Bank. Former Chairman of the Council on Foreign Relations & Founder of the Trilateral Commission. Though not a Jew, Rockefeller is a Rothschild stooge.",
			"parent_topic_uri": "9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj",
			"title": "Bilderberg is a Jewish Cabal under the surface of Global Banking. They developed the concept of 'war on terror' since decades to justify massive public spending and profits for the war industry.",
			"added": 1479203583,
			"topic_id": 2
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment_vote": {}
}