{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Samuel Maloney, 35, creator of the p2p network Morphis was shot dead by the police",
			"body": "Samuel Maloney was shot dead under unclear circumstances.\nMorphis, his creation, is a very well developed p2p network.\nMorphis is a free open source peer-to-peer high-performance distributed datastore written in Python.\nSimilar to Zeronet.\nI hope Morphis will not disappear. It should be downloaded as long available.\nWho knows if the free p2p network itself was the target.\nMaybe Zeronet could take some code from Morphis.",
			"added": 1484431548
		}
	],
	"topic_vote": {
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": 1,
		"1_12GaWA6iLCDZ2bfQ2QBBvrj3bY17HwFCgA": 1,
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1_12GaWA6iLCDZ2bfQ2QBBvrj3bY17HwFCgA": [
			{
				"comment_id": 1,
				"body": "http://www.lfpress.com/2016/12/26/ontarios-police-watchdog-has-confirmed-the-man-killed-in-confrontation-with-london-police-was-samuel-maloney\nhttps://morph.is/v0.8/",
				"added": 1484432139
			}
		],
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 2,
				"body": "I don't have anything against Jews but somewhere people must be informed about Jewish crimes.\nThe mainstream media is always downplaying it or totally suppressing it.\nIf you see some comments isolated they could appear antisemitic but if you see them only as complementary to the mainstream media what you hear anyway then it contributes just to the news ballance.",
				"added": 1484432942
			}
		],
		"1_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": [
			{
				"comment_id": 3,
				"body": "Why do we need kings and queens at all?\nIs a king better than a kalif?\nThe mainstream media is always speaking about the kallifate as something inherently bad and retarded but never puts in question the British kingdom.",
				"added": 1484433520
			}
		]
	},
	"comment_vote": {}
}