{
	"next_post_id": 4,
	"next_comment_id": 2,
	"next_follow_id": 2,
	"avatar": "jpg",
	"user_name": "Mara",
	"hub": "1White24UrrwQrD86o6Vrc1apgZ1x1o51",
	"intro": "Trying to make a standing port between i2p and zeronet, because who wouldn't want to use zeronet with tor, to access i2p? XD",
	"post": [
		{
			"post_id": 1,
			"date_added": 1492802958,
			"body": "Altering original post because why not. "
		},
		{
			"post_id": 1492803227,
			"body": "so, what would you call references that are made lacking the final piece with the expectation of people saying or referencing the final piece themselves? Like when people make those stupid “its gonna be may” references by saying it’s april then referencing the band, or noting the 5th month in regards to being the 5th month. Anyways, I want to make a collection of those style of references to lead to a secondary reference that’s never directly stated as a form of disassociation from a final notion. We’ll call it research purposes.",
			"date_added": 1492803225
		},
		{
			"post_id": 1492808350,
			"body": "Someone give me some reasons to stay on this network. Like, where's all the warez at? good shit people shouldn't have? Malwarz and aids and scripts galor? oh wait, there was some market junk. Screw that, needs to be free. \n\nBut really, trying to find more reasons to stay on here. give me all the links. <3",
			"date_added": 1492808347
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Krixano: Allusion, specifically in my case by revoking or redaction, using multiple things all based on social influence put together to make a new reference all together with the assumption that people would have to understand the social struct necessary for it to apply, just seems fun. ",
			"post_uri": "12YRGB3FqA45xAdU5ZE9wfGBeRQXxYPKme_1492803227",
			"date_added": 1492805890
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1White24UrrwQrD86o6Vrc1apgZ1x1o51",
			"auth_address": "12YRGB3FqA45xAdU5ZE9wfGBeRQXxYPKme",
			"user_name": "Mara",
			"date_added": 1492809808
		}
	]
}