{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": 1,
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": 1,
		"1_1AQwGx5xyBi5Fvv9WHJFMCMNtQhUc8UhQF": 1,
		"1_12Xj1w5HYu6w5xtEwwLyEiMYGuCqvYKL2q": 1,
		"1_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"2_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1,
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1
	},
	"next_comment_id": 2,
	"comment": {
		"2_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": [
			{
				"comment_id": 1,
				"body": "Don't click on this links only if you are on Tor.\nThe Jewish Bilderberg is sending killer commandos to all those who have evidence about their secret terrorist financing.\nYves Chandelon, the chief auditor of NATO relating to terrorism financing and money laundering, has been found dead in his car in an incident that raises suspicions.\n62-year-old Chandelon's death, resembling a suicide with a shot fired to his head, occurred on Dec. 16 and the body was found in his car the same day although the incident was largely kept away from the media. \nThe death of the inventor of Big Mack had much more media coverage.\nDespite Chandelon being left-handed, a gun was found in his right hand, and the gun was not one of Chandelon's three registered guns. These details raised suspicions about an assassination rather than a suicide.\nChandelon's death occurred three days before the murder of Russia's Ambassador to Turkey Andrey Karlov in Ankara on Dec. 19. The terrorist organization Al Nusra took the responsibility for the death of Russia's Ambassador. \nAl Nusra was referred as peaceful protest organization in the western media.\nYves Chandelon found a €250 Billion Black Hole in NATOs budget with connections to terrorism financing.\nChandelon was known to be a dedicated NATO employee who could not be bribed or extorted. Several such attempts had already failed in the past. In many cases in the past the Jews have killed those who could not be bribed or extorted.\nhttp://www.dailysabah.com/europe/2016/12/24/nato-chief-auditor-yves-chandelon-found-dead-in-suspicious-incident\nhttp://ir-is.org/2016/12/24/natos-e250-billion-black-hole-that-got-nato-chief-auditor-yves-chandelon-assassinated/",
				"added": 1482698867
			}
		]
	},
	"comment_vote": {}
}