{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Guo Wengui's Shocking Exposure",
			"body": "[HK Unite with Mainland China ！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)\n[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)\n郭文贵维权探讨—华夏命运和人类命运\nhttp://newera852.blogspot.com/2017/02/the-destiny-of-mankind.html \n                 — Guo Wengui's Shocking Exposure\n                 — 郭文贵的震撼爆料\n                 — GFW（网络鬼墙）是全人类的敌人\n\nGuo Wengui's Shocking Exposure and many human rights disasters in Asia show that the GFW has become the public enemy of the whole mankind.\n郭文贵的震撼爆料(https://www.youtube.com/watch?v=cN1LvZV3bkw&sns=tw )和在亚洲发生的各种令人震惊的人权灾难事件表明:\n中国的长城防火墙（GFW）已经成为全人类的公敌。\nDue to tighter and tighter control of data flow in the cyberspace, the notorious GFW (Great Firewall) used by the atheism regime in China is not only a trade barrier against all major western companies, such as Google, Apple, Microsoft, Twitter, Facebook etc., but also a major obstacle against peace and prosperity of the whole mankind, because under the disguise of atheism dictatorship, many evil things are carried out in east Asia, such as persecution of human rights lawyers by secret police, which is not only the biggest obstacle against bright religious faith, but also the most dangerous poison against the Chinese nation. Furthermore, under the disguise of the atheism dictatorship and the information barrier of the GFW, dangerous nuclear technology has been spread to North Korea in secret, posing biggest threat against the whole civilization of mankind. \n随着对网络空间的数据流越来越过分的专政，中国大陆的无神论独裁政权赖以苟延残喘的、臭名昭著的长城防火墙（GFW）不仅是畸形的贸易壁垒，给西方公司的贸易公平造成损害，包括谷歌、苹果、微软等，而且是全人类和平繁荣的主要威胁。在无神论独裁政权的包庇掩盖下，东亚发生了许多邪恶的事情，比如秘密警察不断地迫害人权律师，这不仅是对文明世界神圣信仰的侵犯，也是对中华民族的最大罪孽。与此同时，在无神论独裁政权和GFW的黑暗专政掩盖下，危险的核武器和导弹技术被秘密地传播到朝鲜，对整个人类文明构成巨大威胁。\n\nApparently, there’s fierce conflict among the atheism regime itself. Premier Li Ke Qiang emphasizes that reform be facilitated by further opening, while Xi Jin Ping coincidentally opened an account on Twitter (https://twitter.com/xijinpingchn) which is ridiculously blocked by the GFW itself, and resulted in the ironical fact that only a small number of well-trained pro-government netizens in China can follow Xi Jin Ping on Twitter. \n显然，在无神论独裁政权的内部本身存在着激烈的冲突。总理李克强重视以开放促进改革，而习近平碰巧在推特（https://twitter.com/xijinpingchn ）上开立了一个页面，但荒唐的是这位泱泱大国的领袖也被很自信地封锁在网络鬼墙之外，只有少部分熟悉网络的高级五毛党能够为他支撑人气。\n\nWith Kim Jong Nam assassinated by North Korean dictator Kim Jong Un, more uncertainties are imposed on the Korean nuclear crisis.  At this critical stage of history, all people in the civilized world should unite together, and support one unanimous voice — Stop Blockade of Xi Jin Ping, Stop Violation of Human Rights.  \n随着金正男被北朝鲜独裁者金正恩暗杀，朝鲜核危机也被笼罩上更多乌云。在这个关键的历史阶段，文明世界的人民应该团结起来，共同谴责无神论匪帮 — 反对封锁习近平、反对侵犯人权。\nSince all people’s destiny is closely connected to each other in the global village, the logic is simple — unobstructed data flow in cyberspace will not only result in fair trade practice, but also facilitate the expansion of bright religious faith including democracy and justice, while better transparency in East Asia will automatically end the nuclear crisis in North Korea.  \n世界人民应该团结起来，逻辑很简单 —信息文明让地球村里所有人们的命运密切关联，畅通无阻的网络世界不只是有助于贸易公平、促进文明世界神圣信仰的传播，同时，民主正义的光辉必将促进东亚地区信息透明度的提升，而这也自然意味着北朝鲜的核危机将在文明转型中自动终结。\n\nFor the sake of the whole mankind, and for the honor of the Lord, everybody please speak up for the simple voice — No Blockade of Xi Jin Ping, No Violation of Human Rights; Better Transparency in Asia, End of Nuclear Crisis in Korea.\n\n为了全人类的福祉、为了文明世界的信仰，请所有的人们共同支持这个最简单的文明之声：反对封锁习近平、反对侵犯人权；亚洲信息透明，终结朝鲜核武。\n\nRemarks:\nDue to the special nature of the incident, all people are welcome to spread this post to anywhere in the cyberspace. If convenient, please indicate the relevant urls \nhttps://twitter.com/KwokMiles  \nso as to arouse as many people as possible, to order to support the bright course of humanity.\n备注：鉴于事件的独特性，欢迎所有人以任何形式帮忙传播。如方便的话，转发时请注明相关的链接（尤其是郭先生的）：\nhttps://twitter.com/KwokMiles  \n以便唤醒最大多数的人们共同支持人类文明进展。\n\n[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)\n[泸州事件—非常给力的分析](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:4)\n[信息流畅、法治流畅、去封锁](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:3)\n[东先生的ZeroBlog](http://127.0.0.1:43110/mydf.bit/)\n[零网技术](http://127.0.0.1:43110/tgzy.bit/?Toc=tag:%E9%9B%B6%E7%BD%91%E6%8A%80%E6%9C%AF)\n[陆公子 Blog](http://127.0.0.1:43110/windixz.bit)\n[有趣的零网 New GFW Talk](http://127.0.0.1:43110/NewGFWTalk.bit)\n[零网,零封锁，反对封锁习近平](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:1)\n[转：洗雪当代国耻、废除辱习法规！ 零封锁，广传播 ](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:10)",
			"added": 1494250474
		},
		{
			"topic_id": 2,
			"title": "HK Unite with Mainland China ！No Blockade of Justice!",
			"body": "HK Unite with Mainland China ！No Blockade of Justice!\n香港和大陆联合起来！零网 — 零封锁、广传播\n(零网图片见：\nScreenshots are available at \nhttp://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13 ) \n中国大陆的无神论政权使用骇客手段对付郭文贵的推特，各种乱象展示了无神论政权不择手段的末日恐慌，同时也说明，香港和大陆很有必要发起一场运动，公开要求拆除辱习反华的网络柏林墙。\nThe atheism regime in mainland China uses hackers to attack Guo wengui's twitter. Various phenomena reveal the big panic of the atheism regime, and at the same time, it indicates the necessity that both Hong Kong and mainland China should launch a campaign to openly demand removal of the GFW, which is also an insult of the Chinese nation besides Xi Jin Ping himself.\n\nThe number of followers was 154K on Apr. 30, 2017. \n2017年4月30日的关注者数量是154K.\nBut the number of followers changed to be 149K on May. 01, 2017. \n而2017年5月01日的关注者数量是149K.\n \nThis screenshot was taken on May 01st ,  at about 20:30 p.m. HK time. \n此截屏的时间是在5月1日，在香港时间约20：30左右。\n （截屏图片信息见：https://proxy.th3nd.com/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13 另外建议论坛功能允许上传图片，图片可定义为小于1MB，或小于500KB的空间。禁止在这里宣传黄赌毒的信息，就可以了)   \n\nBased on the trend at the end of April, there was at least an increase of more than 10,000 followers per day. Due to the unprecedented influence of the shocking exposure by Guo Wengui, it’s highly possible that a rapidly accelerating increase of followers is going ahead on the way, which clearly causes great panic among the atheism regime in mainland China. \n从四月底的趋势来看，每天至少增加一万多名关注者。 由于郭文贵前所未有的、极具震撼力的爆料，关注者的数量很有可能在急剧上升，在网络媒体的时代，这很显然给中国大陆的无神论政权造成巨大的恐慌。\n\nThis fact indicates clearly that information obstacles and barriers similar to Great Wall Firewall (GFW) are a a great threat to the civilized world!  \n这个事实充分表明：类似长城防火墙（GFW）的信息雾霾、信息障碍是对文明世界的极大威胁！\n\nThe atheism regime in mainland China issued regulations at the end of March 2017 which even defined the information services such as VPN facilities as economic crimes. This IT terrorism policy even forced Chinese leader Xi Jinping to suspend his Twitter account (https://twitter.com/xijinpingchn ) . Obviously, in a crazy environment similar to Nazi-style maneuver of media data flow, the great leader Xi Jinping’s power is running out of control.  \n中国大陆的无神论政权在2017年3月底发布了法规，把提供翻墙便利的信息服务也定义为经济犯罪，这种恐怖措施甚至逼迫中国的领导人习近平先生把他的推特帐号 ( https://twitter.com/xijinpingchn ) 都“煞斯崩掉”(Suspended)。很显然，在近乎纳粹般的信息恐怖气氛里，伟大领袖习近平先生已经被架空。\n \nIn this terrorism atmosphere, it’s understandable that HK people wanted to get rid of the dictatorship control by the mainland atheism regime. HK independence doesn’t win enough support from the UK or the majority of local people. In view of such special situation, it’s highly feasible for both HK and mainland Chinese people to launch a non-violent patriotic movement, to pass on President Xi Jinping’s favorite dream that often emphasizes patriotic love of the country, to get rid of the insult that is imposed on Xi Jinping himself by the notorious fascist rule that even suspended Xi Jinping’s twitter, to openly demand removal of the GFW, and let China be integrated into the civilized world, into the common human community of the global village! \n在这种恐怖气氛里，香港人很想摆脱大陆的控制而闹过独立，可以理解。 英国人不支持港独，港独的民意基础也不够高。既然如此，那就让香港和大陆的百姓一起发起一场非暴力爱国运动，传递习近平翻墙救国的习氏正能量、公开要求拆除网络柏林墙、废除辱习反华的反动法规、让中国融入文明世界、融入人类命运共同体！\n\nhttp://newera852.blogspot.com/2017/05/on-attack-of-guo-wenguis-twitter.html (部落格页面，须翻墙）\n(零网图片见：http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13 ) \n\n[泸州事件—非常给力的分析](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:4)\n[信息流畅、法治流畅、去封锁](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:3)\n[东先生的ZeroBlog](http://127.0.0.1:43110/mydf.bit/)\n[零网技术](http://127.0.0.1:43110/tgzy.bit/?Toc=tag:%E9%9B%B6%E7%BD%91%E6%8A%80%E6%9C%AF)\n[陆公子 Blog](http://127.0.0.1:43110/windixz.bit)\n[有趣的零网 New GFW Talk](http://127.0.0.1:43110/NewGFWTalk.bit)\n[中国数字时代 ](http://127.0.0.1:43110/147QaQk6nh6QwM5LJe6eNrTwxQgS1yVT6a/)\n[零网,零封锁，反对封锁习近平](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:8)\n\nhttp://127.0.0.1:43110/ ......  开头的零网本机页面，需要零网工具  https://zeronet.io/ 才能打开。\n请网友们享用无封锁技术，免费使用零封锁的零网技术。\n把公网页面转换为http://127.0.0.1:43110/ ......  开头的零网本机页面，是零封锁的网络创举！零网本机页面，需要零网软件浏览。\n为了帮助习近平废除辱习法规，请让更多网友们享用零封锁的网络，免费使用零封锁的零网技术吧。",
			"added": 1494251301
		}
	],
	"topic_vote": {
		"2_1PkZ7yY9mWov9ndHGG327hJSAEmfB5jj5": 1,
		"1_1PkZ7yY9mWov9ndHGG327hJSAEmfB5jj5": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1_1MvL3enXz7ZowhjvE7mkfdNLYQBtw8romr": [
			{
				"comment_id": 1,
				"body": "HK Unite with Mainland China！\n香港和大陆联合起来！\nhttp://127.0.0.1:43110/NewGFWTalk.bit/?Topic:2_1PkZ7yY9mWov9ndHGG327hJSAEmfB5jj5/\nGuo Wengui's Shocking Exposure\n郭文贵维权探讨—华夏命运和人类命运\nhttp://127.0.0.1:43110/NewGFWTalk.bit/?Topic:1_1PkZ7yY9mWov9ndHGG327hJSAEmfB5jj5/\n狗、习近平与中国人不该摆在一起吧？\nhttp://127.0.0.1:43110/NewGFWTalk.bit/?Topic:1_19DbcsQyB2YM8zQJCiyB8jPB7JxvuwnxYh/ ",
				"added": 1494251666
			}
		]
	},
	"comment_vote": {}
}