{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Jews and the Opium Wars. The Jewish Encyclopedia of 1905 states that Sassoon expanded his opium trade into China and Japan. He placed his eight sons in charge of the various major opium exchanges in China. According to the 1944 Jewish Encyclopedia: \"He employed only Jews in his business , and wherever he sent them he built synagogues and schools for them.\" In 1864, the Sassoons imported 58,681 chests of opium which brought in over 20 million pounds. By 1880 it had skyrocketed to 105,508 chests, making the Sassoons the richest Jews in the world next to the Rothschilds.",
			"body": "https://www.youtube.com/watch?v=4eRvKKDy6nM\nDavid Sassoon - China's own Jewish \"Merchant of Death\".\nhttp://www.biblebelievers.org.au/sassoon.htm\nThe Jewish Encyclopedia of 1905 states that Sassoon expanded his opium trade into China and Japan. He placed his eight sons in charge of the various major opium exchanges in China.\nAccording to the 1944 Jewish Encyclopedia: \"He employed only Jews in his business, and wherever he sent them he built synagogues and schools for them. He imported whole families of fellow Jews. . . and put them to work.\"\nSassoon's sons were busy pushing this mind-destroying drug in Canton, China, and their trade expanded alarmingly. Between 1830 - 1831 they trafficked 18,956 chests of opium earning millions of dollars. Part of the profits went to Queen Victoria and the British government. In the year 1836 the trade increased to over 30,000 chests and drug addiction in coastal cities became endemic.\nIn 1864, the Sassoons imported 58,681 chests of opium which brought in over 20 million pounds.\nBy 1880 it had skyrocketed to 105,508 chests, making the Sassoons the richest Jews in the world next to the Rothschilds.\nThe Sassoons were licensing opium dens in each British occupied area with large fees being collected by their Jewish agents.\n\nAnd many of these Jewish agents were the Chinese Jews of Kaifeng.\nThese Jews had immigrated to China along the Silk Road hundreds of years ago and had so intermarried with the Chinese that they looked entirely Chinese.\nBut they still were practicing Jews and were thus the perfect Chinese agents for the Sassoons.\nOpium was strictly a Jewish monopoly, but these Jews were working under British passports.\nThe corrupt British monarchy honored them with privilege and knighthood - to the disgrace of the Crown. To this day the Sassoons are in the history books as \"great developers\" of India, but the source of their vast wealth is never mentioned - the destruction and impoverishment of the population of China.\nAccording to a 1930s edition of Fortune Magazine (USA), the Sassoon Family monopolized more than 70% of the opium trade and controlled every nook and corner of opium traffic between India and China. This is also consistent with research and observations according to Edward LeFevour in \"Western Enterprise in Late Ch'ing Dynasty China\". According to these sources, in the middle 1800s, the Sassoon group was acknowledged to be the major holder (more than 70%) of all opium stocks in India and in China. \nDavid Sassoon the Opium Wars- Jew drug lords \nhttps://www.youtube.com/watch?v=PRDvHm-wa68\n\nJewish agents were the Chinese Jews of Kaifeng. \nKaifeng Jews from China still have close relationship with Israel and they are controlling the Chinese organ trade with organs from hundred thousands of innocent Non-Jew Chinese kept in concentration camps.\nhttps://en.wikipedia.org/wiki/Kaifeng_Jews",
			"added": 1482069138,
			"parent_topic_uri": "9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		}
	],
	"topic_vote": {
		"1_1NU6gdra9qhUhdbYGLia1G3HYT87qUTA7w": 1,
		"2_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": 1,
		"1_1AQwGx5xyBi5Fvv9WHJFMCMNtQhUc8UhQF": 1,
		"1_12Xj1w5HYu6w5xtEwwLyEiMYGuCqvYKL2q": 1,
		"1_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": 1,
		"2_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1,
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1
	},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}