{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": 1,
		"1_1AQwGx5xyBi5Fvv9WHJFMCMNtQhUc8UhQF": 1,
		"1_12Xj1w5HYu6w5xtEwwLyEiMYGuCqvYKL2q": 1,
		"1_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"2_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1,
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1
	},
	"next_comment_id": 4,
	"comment": {
		"2_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": [
			{
				"comment_id": 1,
				"body": "Goldman, Shalom. \"Leopold Weiss, the Jew Who Helped Invent the Modern Islamic State\"\nIn 1961 the eminent Muslim scholar Muhammad Asad(born Leopold Weiss; 12 July 1900), then living in Europe, published The Principles of State and Government in Islam. The central question posed in that book is whether Islam is opposed to the mixing of religion and politics—as is the modern West. Though Asad’s answers to this question are subtle and non-categorical, his overall conclusion is that in majority-Muslim states a mixture of politics and religion is necessary. Society must bind itself to the will of God, Asad stated, and “the organization of an Islamic state or states is an indispensable condition of Islamic life in the true sense of the word.”\nhttp://www.tabletmag.com/jewish-arts-and-culture/books/206221/jew-helped-invent-islamic-state\nhttps://en.wikipedia.org/wiki/Muhammad_Asad",
				"added": 1481886742
			}
		],
		"1_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": [
			{
				"comment_id": 2,
				"body": "Unbelievable what some people may do with money and influence.\nIf it would be only written without pictures and videos I wouldn't believe it.",
				"added": 1482441751
			}
		],
		"1_1yk1FeoNn1RmZRtCXcsgL59nNp7xs3aYu": [
			{
				"comment_id": 3,
				"body": "> [kaffie](#comment_220_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh):  Most trans women either just remove testicles, or get the full surgery.\n> In any case, trans women are still women and are referred to as such. Even if not all of the transition steps are done. As for 'biological', trans people change their biology through hormones.\n\nInteresting woman with penis. \nkaffie But even you are not modern enough under Obama and Clinton.\nUnder Obama's new rules, a male student does not have to be undergoing hormone treatment or surgeries to be considered \"transgender.\" Any boy can qualify by merely walking into the principal's office at his school and declaring himself a girl.\nWhat's more, a student's gender \"identity\" is considered \"fluid,\" so he could consider himself a boy one day and a girl the next. The burden is on the school to adapt and accommodate.\nThe fact that the U.S. Department of Justice's Civil Rights Division signed the new guidelines along with the U.S. Department of Education sends a message to schools.\nComply or be sued.",
				"added": 1482593535
			}
		]
	},
	"comment_vote": {}
}