{
	"next_topic_id": 12,
	"topic": [
		{
			"topic_id": 1,
			"title": "KOPY KATE - YouTube Alternative (Browser Torrent Streaming)",
			"body": "New site link updated!\nhttp://127.0.0.1:43110/1aCq7GiJfUfGZ4GftjYaYbsEngPFzcxvN/\n&nbsp;\n## _NEW SITE VERSION: v1.3 BETA_\n&nbsp;\n## Kopy Kate is back with a vengeance!\nv1.3 BETA comes with multiple bux fixes, improved uploader, and the Thumbnail option.\n",
			"added": 1472548211
		},
		{
			"topic_id": 2,
			"title": "How does one delete another user's topics on ZeroTalk (clone)?",
			"body": "I've tried doing it by manually erasing some rows on the database, but what happens is that these changes do not get published to other peers on other sites. (Which means that they can still see the topics.)\n&nbsp;\nI had a look at content.json and noticed that there's an Ignore: function that tells ZeroNet not to sign and not to publish anything inside the data/users/ folder, so once you click on Sign .. the console says [SKIPPED] data/users/zerotalk.db for example.\n&nbsp;\nIt is tempting to remove this Ignore function, but I'm afraid it will screw up the whole site. Might have to test this on a dummy site, but some input on the matter would be much appreciated. We really need a universal Admin interface.. otherwise we will succumb to spammers and trollers:\n\nhttps://github.com/HelloZeroNet/ZeroNet/issues/354",
			"added": 1473039893
		},
		{
			"topic_id": 4,
			"title": "South Park Season 20 Premiere - Stream on ZeroNet!",
			"body": "## Brought to you by Kopy Kate - Online streaming torrent site on ZeroNet, no extra software required!\n&nbsp;\nhttp://127.0.0.1:43110/123XVG3HV1q2mEjp15dEmrQk1ZGH4jTFgG/?Topic:1_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4/South+Park+Season+20+Episode+1+Member+Berries\n&nbsp;\n## Kopy Kate home page:\nhttp://127.0.0.1:43110/123XVG3HV1q2mEjp15dEmrQk1ZGH4jTFgG/?Home",
			"added": 1473938356
		},
		{
			"topic_id": 5,
			"title": "ARTICLE: Why I Stopped Pirating and Started Paying for Media",
			"body": "http://lifehacker.com/5990525/why-i-stopped-pirating-and-started-paying-for-media\n&nbsp;\nVery good article from Lifehacker.com\n&nbsp;\nSurprisingly enough, he didn't do it because he felt some kind of moral obligation to do so - _he did it because he felt it was cheaper in the long run._\n&nbsp;\nThat's right. Many torrent sites are now charging money for you to use their services. Like, dude .. give me a break - if you're gonna pay to watch movies or listen to music, just go on iTunes or NetFlix and pay for it legally. You save time also, because you won't have to dig through all the crappy stuff hoping to get a decent audio/video quality.. or worse yet, Portuguese subtitles!\n&nbsp;\nAlso, the whole concept of a seedbox is ludicrous. Torrenting is a hobby. It's about being part of the online community, about sticking it to the man. Seeding shouldn't be a chore - it's basically the same as being a DJ, you do it for the love of music, for the love of film .. and also for the status - you want to be known as the provider of all the dank music remixes and all the quality films that everybody wants to download. \n&nbsp;\nHope that soaks it in a little. **We torrent because it's FREE.** Torrenting should only ever be done because it's free, either because you're a broke college student who can't afford to go to the video store, who can't afford netflix, or working minimum wage, or whatever. Otherwise, you may as well go legal and pay for media, legally. Better yet - go to the movies.",
			"added": 1474945163
		},
		{
			"topic_id": 6,
			"title": "How to increase user size limit on ZeroNet site?",
			"body": "Been looking for a way to do it, with no success. :(\n&nbsp;\nI've essentially been locked out of posting on my own site, with my username, that is.. lol\nSome input would be greatly appreciated. Would be great if these admin configurations were available in the Zeronet site control panel, too.",
			"added": 1475083576
		},
		{
			"topic_id": 7,
			"title": "Solar Powered BitCoin Mine",
			"body": "https://www.youtube.com/watch?v=9AmMV-Bmhh8\n&nbsp;\nBeen recently thinking about dabbling into bitcoin, so I've spent a couple of days doing my research. lol\n&nbsp;\nIt's not like I have anything to lose, really. If anything, it would be a perfect way to channel my autism into something at least remotely useful. I'm pretty broke .. 23 years old, speak 4 languages .. have video editing skills, photo editing skills, sound editing skills, basic web design skills, soldering skills, advanced laptop & pc repair skills, basic knowledge in electronics, uh... can use power tools, can grow vegetables, can brew my own alcohol, can cook the best pizzas ever, etc.\n&nbsp;\nAnd yet, it often seems as if the more skills you have, the less attractive you become to an employer. The only work-experience I have is working in fast food, retail and construction, and I was lucky to be able to get those jobs because, I was referred to them by family members. I'll make a couple of bucks repairing laptops here and then, but most people just throw their computers away and buy themselves a new one.. it's a dying trade, really.\n&nbsp;\nHowever, despite the miserable job opportunities, globalization, automation, etc... the greatest thing about the 21st century is the digital world. Machines are our only hope, our only salvation, really. They may be taking our jobs, but that just means we have to work less. The sooner they take our jobs, the better, I'd say .. that way, we'll have no choice but to embrace a Universal Basic Income, to enable the survival of humanity.\n&nbsp;\n**Anywhoo .. back to the topic of bitcoin** - let's just say it's not going to make me a lot of money. Let's just also say, that my electricity is included in my rent bill, and is always the same, so if I could just make an extra 20 bucks a week, that would be a huge improvement in my quality of life. I could probably just use bitcoin in order to buy stuff online, and then re-sell it at a slightly higher price on auction sites. My living costs are ridiculously low, and I can also survive on $20 worth of food a week. \n&nbsp;\nI also have a lot of spare time on my hands. I share a house with 20 people.. have even grown weed in here before, and nobody even noticed the surge in my electricity usage. I could even re-use some of my weed-growing equipment for my bitcoin mine, now that's lying around collecting dust. ^^",
			"added": 1475375900
		},
		{
			"topic_id": 8,
			"title": "Will Adblock and Torrenting destroy content creators?",
			"body": "In my opinion, it probably will eventually. Why create film, video games, music, programs, websites.. if you're not going to get paid for it, anyway?\n&nbsp;\nThen again, this is why I'm an economic socialist / social libertarian, and support a Universal Basic Income. People WILL be happy to create new content, for free.. but only if they have enough spare time to do so, as well as food in the fridge. Nobody will have time to be a programmer if they have to rely on a crappy fast-food job to support themselves.\n&nbsp;\nTechnology isn't just destroying intellectual property, it will eventually take over ALL jobs.. but it doesn't necessarily have to be a bad thing.\n&nbsp;\nI think everyone who uses adblock, and anyone who torrents, will eventually arrive at the same conclusion. ;)",
			"added": 1476947387
		},
		{
			"topic_id": 9,
			"title": "Decentralized MMORPG",
			"body": "Would it be possible, and worth it, in theory.. to run an MMORPG on a decentralized blockchain.. like World of Warcraft, or Runescape.. or would it just lag like crap and not be worth anyone's time? Discuss. ^^",
			"added": 1476948134
		},
		{
			"topic_id": 10,
			"title": "KopyKate.bit - Streaming Video Torrents on ZeroNet",
			"body": "## _KopyKate - Streaming Torrents on ZeroNet_\nhttp://127.0.0.1:43110/kopykate.bit/\nhttp://kopykate.tk/\n\n## NEWS:\n** - 10 new movies to choose from in both 720p and 480p. 10000's more to come by the day! **\n** - Site is now available through a domain redirect on clearnet proxies. This is not to be relied upon, though! **\n** - KopyKate.bit is the new namecoin domain. **\n** - Site was just tested on smartphones. Turns out, it works on android, but not apple! **\n** - New promo video on YouTube: https://www.youtube.com/watch?v=tmNCfQDmab8 **\n** - The more people view the videos, the more seeds.. so do share kopykate.tk as much as possible **\n** - Site will use featured videos as main source of revenue. Featured videos must be free from obnoxious and malicious content. **\n** - Enjoy! **",
			"added": 1478953102
		},
		{
			"topic_id": 11,
			"title": "Calexit - could it happen?",
			"body": "Now that nobody seems to talk about programming and filesharing on here anymore ... I guess we can talk about politics!\n\nAnyway .. Calexit - what are your opinions of it? Could it happen or not?\n\nIn my opinion, I really think it could. Me and my mum were laughing our fucking heads off when Trump got elected.. anything goes these days, really .. anything is possible. America is doomed... .. but maybe it's for the better.",
			"added": 1479206254
		}
	],
	"topic_vote": {
		"2_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz": 1,
		"2_1BbxiDHKuFBkLxuGp8E18FeabHGQe6jYLL": 1,
		"3_1FTFKztuv4Z5uy6iS83k9hB2xtS6yFnDxx": 1,
		"7_1CHcEy3SYsQvrW9uskKTZxUWj97BmZmvfa": 1,
		"4_1CHcEy3SYsQvrW9uskKTZxUWj97BmZmvfa": 1,
		"1_1CHcEy3SYsQvrW9uskKTZxUWj97BmZmvfa": 1,
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": 1,
		"1_17q6Zhf7PFjrY3ddySK2F78JhAH3FVhmWr": 1,
		"1_1EnFfeVqTYtJfhzucfQB8Z7sCfUBipRRow": 1,
		"1_1AhXDbKvcLap7TcS2542J7bFYzKHM3xeRU": 1,
		"5_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": 1,
		"1_1L14vSk76tujfNoqrcRuFk2tBBZgUPy92t": 1,
		"1_1ANXCwkxieV453iigVj4d6FNNkQJCHaPwE": 1,
		"1_1BF9gEDMjApfYpXer7fwiX2s5BJnCfFoew": 1
	},
	"next_comment_id": 78,
	"comment": {
		"1_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": [
			{
				"comment_id": 1,
				"body": "> [tkarita](#comment_125_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t): A more recent TPB backup is less portable... 1.6GB.  Nobody expects them to stay offline, so the smaller versions are difficult to find.\n\nyep. \n\nWhich in turn got me thinking.. maybe the site should enable people to download external, custom magnet libraries.\n\nSort all videos according to a tag hierarchy, perhaps. Sort them by popularity, so that the most wanted videos are easier to find .. but if you're looking for more harder to find videos, you can download other magnet libraries.\n\nIt's basically like a yellow pages.",
				"added": 1472561419
			},
			{
				"comment_id": 2,
				"body": "Site currently is unable to play video files. This is because the site is refusing to load the new Java files that I added to the js folder.. siteSign refuses to sign these new java files, and also refuses to sign the content.json in the main folder.\n\nBeen trying to fix this all night, with no success. Just can't get my content.json to sign after changing the files inside the data folder ... no matter how many new sites I create. Extremely frustrating.",
				"added": 1472575814
			},
			{
				"comment_id": 3,
				"body": "http://127.0.0.1:43110/123XVG3HV1q2mEjp15dEmrQk1ZGH4jTFgG/\nJust updated the link to the site. Hopefully, everything should be in perfect working order now, ready for a fresh start.",
				"added": 1472581634
			},
			{
				"comment_id": 6,
				"body": "Site is in full working order at this point. Got some friends who will help me mass-seed all of the popular videos soon, so it'll be good for movies shows, as well. There will be no annoying ads, no viruses, no waiting for downloads!",
				"added": 1473042585
			},
			{
				"comment_id": 13,
				"body": "Alright, lets' go! \n&nbsp;\n**I'LL SEED YOUR VIDEOS IF YOU SEED MINE!**",
				"added": 1473156058
			},
			{
				"comment_id": 15,
				"body": "I've been doing lots of changes to the scripts lately, try to clear the cache. All videos are seeding now. \n\n**Remember that it's not working on Chrome.** Only works on Firefox. This is also the case for ZeroTube, and any site that uses the the WebTorrent script on ZeroNet. This seems to be an issue with ZeroNet's iframes, which means a lot of scripts that normally work on the web .. need to be re-written for use on ZeroNet, which is a pain in the ass.\n\nThere's also a bug on WebTorrent.desktop which causes torrents to randomly stop seeding. I've reported the issue to the creators, and they'll be working on it. The only work-around for that right now would be to have as many seeds as possible. \n\nNonetheless, I'll be getting some friends to do some mass-seeding for me this year, at least until the site gets going. ;)",
				"added": 1473319552
			},
			{
				"comment_id": 25,
				"body": "> [oracle](#comment_187_1ED3Ho3kmzaKiECtyuqSjDpoE47rKuXeP): Stupid question, do I have to install  Peerify and WebTorrent Desktop to use Kopy Kate?\n\nNo, just WebTorrent.Desktop. Peerify is just a site that allows you to upload files, and then get them temporarily webseeded, as well. This should help reduce the number of people losing their torrents and from creating dead video links that don't work. \n\nGonna make some tutorials on how do web-seed your videos on WebTorrent, as well. This will help with 24/7 seeding. Stay tuned. ;)",
				"added": 1474498419
			},
			{
				"comment_id": 40,
				"body": "**Kopy Kate is back with a vengeance!**\nNEW LINK: http://127.0.0.1:43110/1aCq7GiJfUfGZ4GftjYaYbsEngPFzcxvN/\n&nbsp;\n**v1.2 BETA** now features WedSeeded torrents. In other words - the site will take advantage of HTTPs files hosted on free cloud file uploading services (such as Dropbox) in order to provide backup seeding for torrents that are in desperate need of seeders.\n&nbsp;\n**Now streaming - South Park Season 20, Episode 3 - The Damned! ENJOY!!!**\n&nbsp;\nThe bad news is that Kopy Kate has had to start over with a new link, due to corrupted content.json files, and the noobiness of the site owner. All is working now..\n&nbsp;\n**(WEBSEED TUTORIALS COMING SOON)**",
				"added": 1475150159
			},
			{
				"comment_id": 46,
				"body": "## SITE UPDATED TO VERSION v1.3 BETA\nv1.3 BETA comes with multiple bux fixes, improved uploader, and the Thumbnail option.\n&nbsp;\n## NEW -- WATCH THE LATEST EPISODE OF SOUTH PARK - WEINERS OUT s20 e04 !!!",
				"added": 1476349472
			},
			{
				"comment_id": 68,
				"body": "## NEW TV SHOWS\n## South Park - Season 20, Episode 5 (Danishes for Denmark)\n## Real Time with Bill Maher - 2016/10/14 (currently encoding)\n&nbsp;\n## If you would like me to stream any other shows, please write down suggestions! Thanks - KopyKate",
				"added": 1477103159
			}
		],
		"6_1KzaKud9cUZB7HcgHnhrZqyuq2NnTeW6PR": [
			{
				"comment_id": 4,
				"body": "Seed as much as possible!!!",
				"added": 1472744523
			}
		],
		"1_16RxPB8u2PPvMvASMreEvH3q7S5xm2LzjP": [
			{
				"comment_id": 5,
				"body": "First troll on ZeroNet? ^^",
				"added": 1473040023
			}
		],
		"2_1AZjDLkfYwSmjM7ZJUf7HHnrF778augRMa": [
			{
				"comment_id": 7,
				"body": "We need a universal admin interface, like .. as soon as possible .. especially for sites that feature databases like ZeroTalk, ZeroBlog, etc.\n\nhttps://github.com/HelloZeroNet/ZeroNet/issues/354",
				"added": 1473043795
			}
		],
		"4_1C6qdRAX8iYqSB7TfUxk91yW8Y2SBKNgfA": [
			{
				"comment_id": 8,
				"body": "Make sure these computers are all on a completely different network altogether, otherwise it won't make a difference.\n\nInstall ZeroNet on each of them and open up the sites, leave ZeroNet running. There's no need to log in with your identity to do this.",
				"added": 1473043948
			}
		],
		"1_1DcE9QfZbfLZhXxgtQ8Ui3oMZvs9NVjqZB": [
			{
				"comment_id": 9,
				"body": "In my country, New Zealand, most women are paid for by the government. ;)",
				"added": 1473045135
			}
		],
		"1_18WbbZHfRWnk1ufSw4EBywk6KTocZiydUE": [
			{
				"comment_id": 10,
				"body": "I really think the problem with democracy is that most people just don't care about politics. They're happy enough just to be able to come home from work and eat takeaways in front of their TV's while watching Oprah.. and vote Hillary just to keep things the same. Sad, but true.\n&nbsp;\nEven if you could get some fancy, rebel candidate elected .. he or she will get bought, one way or another. Would you refuse 1 billion dollars if somebody told you to stop talking about global warming? I'll let you answer that for yourself.",
				"added": 1473046796
			}
		],
		"1_1DBjD2Xf1DymmjxEi5K7aeoaRByAAXBvFW": [
			{
				"comment_id": 11,
				"body": "Nah. It's only going to encourage circle-jerks, just like on YouTube. . . where a group of users get together and mass-dislike a post just because they disagree with it, or because it's controversial. Majority != Right",
				"added": 1473078512
			}
		],
		"7_13Cqt2MSFS6eu4cbVuByZBuULrEAcZAqFG": [
			{
				"comment_id": 12,
				"body": "Hey there. Just to get the word out - so far, there's currently two video sharing site projects happening, which you might like to check out: ZeroTube and KopyKate. \n\nhttp://127.0.0.1:43110/1FUQPLXHimgCvYHH7v3bJXspJ7bMBUXcEb/\nhttp://127.0.0.1:43110/123XVG3HV1q2mEjp15dEmrQk1ZGH4jTFgG/\n\nI had a look at your site, it seems like there's some issues with the content.json, but I'm familiar with this type of error. I'm also having trouble making sense of all the folders that have been added to my ZeroBundle folder .. it's too much data for a single site. What's going to happen the day your page becomes popular? Are users going to have to download a page for every one of the million channels available?\n\nHaving said that, there's a lot of things on the site that are brilliantly done, especially the video player and the channel pages. We really should all get together and work on a single site, but sometimes competition seems like the only path toward progress. lol\n\nAre you using WebTorrent by any chance .. or are you just directly playing .mp4 files from a folder?\n\nEither way .. so far, so good!",
				"added": 1473079558
			}
		],
		"2_1DcE9QfZbfLZhXxgtQ8Ui3oMZvs9NVjqZB": [
			{
				"comment_id": 16,
				"body": "> [kingbudgie](#comment_23_17nphNHoGtz9EzvvTSSbZn7WHfM1ynpdsL): What does it mean to be libertarian?\n> You probably do not understand that running the government like a business it will throw you under the bus in the end no matter how rich you are how hard you pull those boot straps. Also you are probably either a rich man's wife or just a spoiled rich kid with chubby cheeks and braces. (like the cahracter \"bling bling boy\" from the show johnn test)\n> Dawg, I got people with boot straps pulled up to their asshole, they are still hurting. Our economy is that bad and getting rid of \"handouts\" like the police, firedepartment, FDA, and public education seems nice but if you are REMOTELY worried about \"corruption\" who do you think is currently corrupting people in our government? Running it like a business only skips that \"annoying\" lobbyist and goes straight to the donor. \n> But yeah, FREEDUM!\n\nI think both communism and capitalism could work if human nature weren't corrupted.\n\nCommunists will always make excuses to justify their ideology and say that it's the corporations and rich people that is the problem.. and that if only people stopped being greedy, everything will fall in line ... but we just have to try it! Yeah, Soviet Russia is not real communism, you know!\n\nCapitalists will make excuses to justify their ideology and say that it's the government that is the problem, that if only people stopped being lazy ... everything would just fall in line .. but we have to try it ! Yeah, corporate America isn't real capitalism, you know!",
				"added": 1473334447
			}
		],
		"4_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": [
			{
				"comment_id": 17,
				"body": "Just recently replaced the mp4 with another one with better audio quality. Everything going now - 2 peers connected and seeding!",
				"added": 1473938694
			},
			{
				"comment_id": 19,
				"body": "> [zyber](#comment_2_14TpgjZ45qVUmFjp848YUhqtWKPYYrSkUW): Ok, I clicked play, then dragged and dropped the Copy Magnet link into Web Torrent. It was that easy. Though I'd recommend having the links display without the need to click play.\n\nHaven't been able to figure out how to do it without getting 50 errors, to be honest. Javascript won't let me execute functions on page load, something to do with CORS and Same Origin Policy.\n\nI'll let somebody else figure it out. The site is easily clonable. Have fun!",
				"added": 1474297520
			},
			{
				"comment_id": 20,
				"body": "oh wait .. window.onload works now! must have been fixed in the new ZeroNet updates.",
				"added": 1474297888
			}
		],
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 18,
				"body": "Kick all muslims and jews out of _all_ countries? So which country would you deport them _to_?",
				"added": 1474297273
			},
			{
				"comment_id": 48,
				"body": "> [photon](#comment_3_17a8xsj4Ds61C9wcox4Yqjp4GKD3qNdmdf): Why is it that where libertarians and ancaps gather together racist rhetoric isn't far behind? What a load of crap.\n\nIt all started with Donald Trump announcing that he's running for presidency. Since Libertarians are ideologically related to Conservatives, it's only natural they'll want to hang out more with the Trump crowd than with the liberals and hippies.",
				"added": 1476435721
			}
		],
		"2_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz": [
			{
				"comment_id": 21,
				"body": "Why is America so obsessed with gay people?\n\nIt seems to me like Americans either worship gays, or they hate them and wish them death. Here in New Zealand, nobody gives a fuck what people do with their personal lives.",
				"added": 1474459550
			}
		],
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": [
			{
				"comment_id": 22,
				"body": "Damn .. I'm actually surprised to find out that ZeroNet isn't full of right-wing nationalists.. despite being the perfect free speech platform .. lol\n\nFunny, it's always the Politically Correct media platforms where you see all the hate posts, such as YouTube, Twitter, Facebook, Reddit, etc.",
				"added": 1474460208
			},
			{
				"comment_id": 42,
				"body": "The white race was already 'genocided' long ago. Nobody is 100% ethnically pure.. especially these days .. and frankly, there's better things to worry about. All races will eventually be genocided as more and more people travel and have sex with each other, so..",
				"added": 1475201614
			}
		],
		"1_1LE1ngFyG62KJC1Q7G2xyZGjaB2QubXSi9": [
			{
				"comment_id": 23,
				"body": "pretty much. ^^\n\nI think the solution to that would be to have multiple people who know the private key, all over the world .. and have a backup of the site on their hard drivers. It shouldn't be that hard to backup the database.. it's basically just raw text.",
				"added": 1474463280
			},
			{
				"comment_id": 24,
				"body": "> [tkarita](#comment_155_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t): There are two experimental sandbox sites, where the private key is public.  It turns out that anything deleted tends to reappear when the next person signs, because deletions aren't published and everyone else still has the files.  Instead, content has to be overwritten to destroy it.\n\nThat's true for individual files only, I think.\n\nWhen it comes to messages, such as here on ZeroTalk .. all the information is stored on data/users/XXXXXXXXXXXXXXXXXXxxx/data.json, which is constantly overwritten every time changes are published. All of your comments and topics are stored on that file.\n\nTorrent sites work the same way on here .. most of which are clones of ZeroTalk. All magnet links are stored on the data.json files in the user folders, and once they're overwritten, there's no going back, unless somebody has a backup.",
				"added": 1474464466
			}
		],
		"4_1MCsyW6W243LY69ZYm99XbV3M8Gbbrp5hF": [
			{
				"comment_id": 26,
				"body": "I never understood the point of having to pay, in order to download torrents. If you're gonna pay to watch movies, just pay for a legal movie streaming site.",
				"added": 1474527327
			}
		],
		"1_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 27,
				"body": "> [rythyrix](#comment_7_18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y): For ZeroTorrent, please embed site's banner logo in the zite's Zeronet content, not request from clearnet, even over HTTPS. It generates metadata that can be tracked, which is always a bad thing.\n\nWhere there is a will, there will always be a way for people to track you. The Pirate Bay is on clearnet, and millions of people are still using it without trouble.\n\nPeople on here can be so paranoid sometimes - I find that it's better to just enjoy yourself and just stick with basic common sense safety measures.... such as, don't post your home address, your real name .. try to hide your IP whenever possible.. etc.",
				"added": 1474764393
			}
		],
		"1_1JgHfDK4eojCkVZHKey9hiMAcAc9mxMUK2": [
			{
				"comment_id": 28,
				"body": "In reply to the commends below .. NullFolder is practically the same as Instant.io. There is absolutely no difference or greater benefit between using one, and using the other.. the javascript and WebRTC still works the same.\n\nWebTorrent is the future, and is not going to go away anytime soon. WebRTC is also open source, and anyone who's bold enough and has the right amount of spare time will eventually fix the IP-leaking security flaw, so that in itself is no excuse to dismiss this technology altogether.\n\nWhen it comes to Torrents, the main benefit of ZeroNet is _Magnet link storage. _ Every client is essentially responsible for storing these magnet links in their harddrives. You can't store magnet links in centralized servers, they're easy to take down. All the rest, such as the trackers and the torrent clients .. that has nothing to do with ZeroNet.\n\nZeroNet will never entirely replace the clearnet. ZeroNet is mostly a symptom of all the stupid censorship and non-sensical, outdated copyright laws we have in this world, although it does come with hidden benefits such as being able to host a website with little to no running costs. You won't need ads to fund yourself - people will power your website on your behalf using their share of their bandwidth.",
				"added": 1474906244
			},
			{
				"comment_id": 30,
				"body": "Regarding ZeroNet apps, I can't really think of anything that has already been done, to be honest.. lol\n\nMaybe a free Dating Site. Then again, the obscurity and anonymity of the network would certainly make people a lot of people feel unsafe. :p\n\nNow that I think about it, people don't pay for dating sites because they're expensive to run - - people pay for dating sites, as a way of proving that they're serious about online dating.",
				"added": 1474906842
			},
			{
				"comment_id": 34,
				"body": "> [phr34kz](#comment_22_1NGTMtN8816KeCtNqy6W4fCQduU4P8iwty): Dark Market. Better zeronet search engine and probably tons others besides just movies and tv series. I don't see Animes and whatnot. There's room for improvement and one that doesn't lead to content.js can't be download or index.html not found. Not everyone here has a seedbox nor have any time to webtorrent their videos to be streamed at KopyKate. \n> When it comes down to Dating Sites, think of the end users that's gonna use them, are they even savvy enough to even run ZeroNet? I doubt so let alone run this whole thing on their mobile.\n\nDark Market? You mean, along the lines of Silk Road?\n\nThat'll just attract law enforcement like a swarm of wasps. They'll come over pretending to be buyers, and then go on sting operations to track down drug dealers, or anyone selling anything illegal like guns, etc.",
				"added": 1474943167
			},
			{
				"comment_id": 35,
				"body": "Also, seedboxes defeat the whole point of decentralization. \n\nThey also defeat the whole point of torrenting movies. The whole point of using torrents to download copyright material is that it's FREE. Why pay for a seedbox, when you can just go legal and subscribe to a cheap online streaming service like NetFlix and watch all the movies and shows you like as soon as they're released? Or better yet .. go to the video store?\n\nPeople these days .. lol",
				"added": 1474943651
			}
		],
		"4_1NGTMtN8816KeCtNqy6W4fCQduU4P8iwty": [
			{
				"comment_id": 31,
				"body": "Who even uses Yahoo these days anymore? lol\n\nMy faintest memory of Yahoo was in 2004, back when I was a kid playing on my dad's computer, trolling online chatrooms.",
				"added": 1474907218
			},
			{
				"comment_id": 32,
				"body": "> [phr34kz](#comment_21_1NGTMtN8816KeCtNqy6W4fCQduU4P8iwty): Doesn't need for anyone to use and nobody even cares even if you use because the whole internet is an archive. It's a company willing to pay for the 500 million  leak dated back since 2012.\n\nFortunately, I don't use the same passwords on Gmail that I used in Yahoo .. hehe ^^",
				"added": 1474942869
			}
		],
		"1_1ASFMANgCvtRUuZbz3GmxCsvRAJ4iHb6r2": [
			{
				"comment_id": 33,
				"body": "Copy the old folder from your previous computer, put it on a USB stick, then transfer it to the new computer. The easiest and best way to do it, so you can keep all of your sites as well.\n\nThe more complicated way to do it is to copy the Masterseed in Users.json, but even I have had trouble getting it to work .. not worth the effort, haha.",
				"added": 1474942948
			}
		],
		"6_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": [
			{
				"comment_id": 36,
				"body": "> [mynameislegion](#comment_16_1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV): Have a look at the help guide, under user_contents:\n> http://127.0.0.1:43110/17Kom2G5qNDc6NaQwv445h1gFzxkY3ZtZe/site_development/content_json/\n> user_contents\n> Rules of allowed user content of current directory.Node     Descriptioncert_signers     Accepted domains and it's valid signer's addressespermission_rules     Allowed file names and total directory size based on cert domain or authorization methodpermissions     Per-user permissions. (false = banned user)\n> Example:\n>   \"user_contents\": {    \"cert_signers\": {      \"zeroid.bit\": [ \"1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz\" ]    },    \"permission_rules\": {      \".\": {        \"files_allowed\": \"data.json\",        \"max_size\": 10000      },      \"bitid/.@zeroid.bit\": { \"max_size\": 40000 },      \"bitmsg/.*@zeroid.bit\": { \"max_size\": 15000 }    },    \"permissions\": {      \"bad@zeroid.bit\": false,      \"nofish@zeroid.bit\": { \"max_size\": 100000 }    }  }\n\nAlready looked at that actually, even tried adding it to content.json (in the data/users/ folder of my account) .. but it didn't work. :/\n\nDo I add that whole block of code to the content.json of my username.. or just the section with the permissions? For some reason I can't find the User_contents in it.\n\nMight just have to keep trying different combinations. Maybe there's a tiny detail I'm missing.\n\nThanks, either way. :)",
				"added": 1475123567
			},
			{
				"comment_id": 37,
				"body": "Got it to work now. The file you have to modify is inside **/data/users/content.json.** That's where you'll find user_contents. Wish this was made more specific on the docs.\n\nIn this case, I added Kopykate@zeroid.bit to the permissions.. and set the max_size to 100kb (100,000 bytes, as shown below). \n\nThe size limit applies to basically everything that is inside your user-specific folder, except for the content.json. The data.json file will include topics and comments, as commonly employed on blogging/talk site clones. Everything else such as gifs and videos will also take up space.\n\n \"user_contents\": {\n  \"cert_signers\": {\n   \"zeroid.bit\": [ \"1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz\" ]\n  },\n  \"permission_rules\": {\n   \".*\": {\n    \"files_allowed\": \"data.json\",\n    \"max_size\": 40000\n   },\n   \"bitid/.*@zeroid.bit\": { \"max_size\": 40000 },\n   \"bitmsg/.*@zeroid.bit\": { \"max_size\": 15000 }\n  },\n  \"permissions\": {\n   \"bad@zeroid.bit\": false,\n   \"kopykate@zeroid.bit\": { \"max_size\": 100000 }\n  }\n }\n}",
				"added": 1475124656
			},
			{
				"comment_id": 38,
				"body": "Ok, actually.. that didn't quite work out. New comments fail to publish now.. my entire site is corrupted.. lol\n\nMight have to start everything from scratch in a new link. Live and learn..",
				"added": 1475128033
			},
			{
				"comment_id": 39,
				"body": "IMPORTANT: Never change the Zeroid.bit input in User_contents. It'll just cause all of your future content to fail publishing, for some reason. Just keep it as 1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz.\n\nI could probably spend hours writing a Fool-proof ZeroNet guide. lol... there's so much information that is missing in the docs.",
				"added": 1475133713
			},
			{
				"comment_id": 41,
				"body": "> [1984traveller](#comment_2_1Psc4YYyrL4T8gnPfQCTyh1b7kTuBuDAEY): BUMP!\n> Error in signSite:Site:1BmDLy..2WPh content.json: Site too large 23216231 > 10485760, aborting task...\n> Site:1BmDLy..2WPh Sign failed: Invalid content\n> By: ZeroRandom: http://127.0.0.1:43110/1BmDLy9bzNM33GuJCtwH1V5LN3KygH2WPh/\n\nThat is a huge site .. lol\n\nIt's very easy to increase the size limit of the site as a whole .. just go to the site control panel and set the new size limit. What's tricky is increasing the kb allowance of individual users.",
				"added": 1475200549
			}
		],
		"1_1F8FQhrqzBj3TP1YH5MGpa1qNptyoKQtTn": [
			{
				"comment_id": 43,
				"body": "Create the kind of site that people desperately need. Torrent sites were among the first.",
				"added": 1475202177
			}
		],
		"2_1NGTMtN8816KeCtNqy6W4fCQduU4P8iwty": [
			{
				"comment_id": 44,
				"body": "I've done javascripting while high on weed before, lol\n\nI find it only helps if you get stuck and you've spent weeks trying to get your code to work but still get the same bugs and errors. It helps get you out of that repetitive mindset, and helps you think outside of the box.\n\nBesides that, I find it very distracting.. especially while browsing folders and files. I wouldn't recommend it as a habit. Redbull is much better, and chocolate.",
				"added": 1475202566
			}
		],
		"2_1BbxiDHKuFBkLxuGp8E18FeabHGQe6jYLL": [
			{
				"comment_id": 45,
				"body": "Hail the KING DOT COM !! FROM NEW ZEALAND !! ~~ ## <3",
				"added": 1475202972
			}
		],
		"3_1FTFKztuv4Z5uy6iS83k9hB2xtS6yFnDxx": [
			{
				"comment_id": 47,
				"body": "That would be great. That way, we can all contribute. The admin can then review the contributions, and decide whether he wants to commit them.",
				"added": 1476352068
			}
		],
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 49,
				"body": "Alex Jones uses ZeroNet?",
				"added": 1476435947
			}
		],
		"2_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 50,
				"body": "All I can say is .. stay calm and use Bitcoin. ;)",
				"added": 1476454026
			}
		],
		"1_1FZEtMSz2tKFZPmBtjhD7JgR4awtAMD47G": [
			{
				"comment_id": 51,
				"body": "I think the owner was just tired of having ZeroTalk flooded with posts about Trump and White Supremacy. Once in a while it's fun and stuff, but too much is just going to put off newcomers. You can create your own red pill site and talk about Trump, Brexit, muslims, jews, gays, and all the white-nationalist-related stuff you want. There's also 0chan, as suggested below.",
				"added": 1476538056
			}
		],
		"1_1CHcEy3SYsQvrW9uskKTZxUWj97BmZmvfa": [
			{
				"comment_id": 52,
				"body": "It will eventually need a search engine, but so far so good. You should be able to simply copy the code of either Play, ZeroTorrent or even the code on my site.",
				"added": 1476538200
			}
		],
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": [
			{
				"comment_id": 53,
				"body": "We all descended from Africans, anyway. There is literally no such thing as a 'pure race'. White people are essentially just black people who have mutated over the centuries and adapted to cooler climates with less sunlight.",
				"added": 1476538280
			}
		],
		"1_17q6Zhf7PFjrY3ddySK2F78JhAH3FVhmWr": [
			{
				"comment_id": 54,
				"body": "It all dates back to Occupy Wall Street, the 2008 financial crisis, money in politics, the bank bailouts, etc. People just don't trust Democrats anymore.. but the republicans are no better. People have lost trust for the American government in general.. so they'd much rather have The Joker in the white house.",
				"added": 1476618224
			}
		],
		"8_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": [
			{
				"comment_id": 55,
				"body": "> [ulrichard](#comment_19_1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ): Rather than use DRM, content creators could add a qr code for BitCoin donations to their work.Then people who like it could encourage them to create more of it.People who want to pirate can remove every DRM easily.But people who want to legally view content, but not on a Kindle or Netflix or whatever crappy bundle, are often left in the dark.The Brave browser is a step in the right direction, but there needs to be more of it.\n\nThe problem with donations is that most people don't donate, though. Otherwise, sites like YouTube and Facebook would have already employed that model of revenue. It's not a realistic way to pay the rent of small content creators.",
				"added": 1476950154
			},
			{
				"comment_id": 56,
				"body": "> [nutomic](#comment_20_1FEikAyxCNPJcW996B69r5UFg29yfq579m): I don't know how you can believe that. Just look at sites like DeviantArt, Steam Workshop, Github or many others, to see how many people create content without receiving any money. I think most content creators do it primarily because they like it, and not for the money.\n> Sure, if people don't pay for content, companies will earn less money from it, so there will be less commercial content. But that's a good thing, because it subverts corporations. Fuck capitalism!\n\nSo you support a Universal Basic Income like I proposed?",
				"added": 1476950970
			},
			{
				"comment_id": 58,
				"body": "> [nutomic](#comment_22_1FEikAyxCNPJcW996B69r5UFg29yfq579m): I support socialism. Here's an introduction:http://monthlyreview.org/2009/05/01/why-socialism/\n\nSocialism is a bit outdated though in my opinion. I say this as a Venezuelan who has left the country to start a new life in New Zealand. \n\nMy proposal is to have a mostly libertarian society, no welfare, no subsidies, no bank bailouts. The only social safety net will be a Universal Basic Income, where all citizens are paid a weekly or monthly sum that will be enough to cover all of their basic survival needs. People will still receive this money regardless of whether they're working or not, so that means that the people who work, will receive both their work income, as well as the UBI. That in turn will increase work incentives, because people who work will always have more money than those who don't.. but it also means that those who don't work, won't be punished with poverty.",
				"added": 1476954800
			},
			{
				"comment_id": 61,
				"body": "Torrenting and ad blocking are obviously not the same thing. I was referring to them in the context of loss of revenue, as well as loss of incentives for content creators to produce.",
				"added": 1476955243
			},
			{
				"comment_id": 63,
				"body": "A Universal Basic Income will be paid for through taxation, though.. not charity. So that's mild socialism, in a way, but it won't affect the market economy as a whole. The sole purpose of the UBI is to eliminate Poverty, not to get rid of rich people.",
				"added": 1476955534
			}
		],
		"1_1JLptrZjV8VrpvMBex8CnCHGjNpCizYq1x": [
			{
				"comment_id": 57,
				"body": "You can't take over a site, but some sites can simply be cloned. It'll be yours.. it's just not gonna have any of the content, assuming it contains a database with stored information.. it'll be completely different from the original site, but it'll work the same way and have the same code.",
				"added": 1476951961
			}
		],
		"4_1BFTNXtYQDMCurqyg45KLmsV6oJD7bQSsH": [
			{
				"comment_id": 64,
				"body": "ugh, I have mixed feelings about this, though maybe I'm unsure about what exactly you're proposing. ZeroNet is pretty good as it is right now, I don't feel any need to filter out any sites that I don't like .. if I don't like a site, I just don't visit it again.\n&nbsp;\nJust create a site where you can review and rate other sites.",
				"added": 1476960736
			}
		],
		"1_1EnFfeVqTYtJfhzucfQB8Z7sCfUBipRRow": [
			{
				"comment_id": 65,
				"body": "> [phr34kz](#comment_27_1NGTMtN8816KeCtNqy6W4fCQduU4P8iwty): Bruh... fuck donations. I run a VPS too with ZeroNet. Get a job and donate to the Zero Creators instead. Smfh\n\nRiiight.. so people are providing you a free service for you that you can use whenever you please, forking out their own time and money for it.. and you mock them for requesting donations?\n&nbsp;\nMaybe OP should feature solid embedded advertisement on his site, just to rattle some common sense back into people.",
				"added": 1477098616
			}
		],
		"1_1AhXDbKvcLap7TcS2542J7bFYzKHM3xeRU": [
			{
				"comment_id": 66,
				"body": "In my opinion, leadership is hard-wired in human nature. Is it any surprise that even the hard-core libertarians and anarcho-capitalists have come out in support of Trump? I think not.. we all want our leaders, we just want leaders whose policies suit us.",
				"added": 1477099214
			}
		],
		"5_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": [
			{
				"comment_id": 67,
				"body": "The sooner we produce self-driving cars, the better. I've been T-boned on my motorcycle on more than one occasion.. you can't trust human drivers, sober or drunk, day or night.",
				"added": 1477099695
			}
		],
		"1_19PZ9UFRdpRcbCJ35HKSJoF8PjqQGMfQey": [
			{
				"comment_id": 69,
				"body": "http://127.0.0.1:43110/0list.bit",
				"added": 1478955989
			}
		],
		"2_1AeoDwzudke45NR3b6LfU4LsmPFs8AXUvi": [
			{
				"comment_id": 70,
				"body": "Eh. It depends on what kind of video quality you're aiming for? Jeez man .. beggars aren't exactly choosers, but whatever .. lol",
				"added": 1478956638
			}
		],
		"1_1ANXCwkxieV453iigVj4d6FNNkQJCHaPwE": [
			{
				"comment_id": 71,
				"body": "I know. All of the sudden, people care more about that trashy election than filesharing .....",
				"added": 1479044265
			},
			{
				"comment_id": 72,
				"body": "> [ancap](#comment_105_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz): That's the meaning of decentralization. Instead of the (lying) mainstream media experts, here we have true decentralization and freedom of speech. 10% of the content is racist garbage, 70% mediocre, 20% is good. \n> \n> You're linking to racist posts and preach the need to improve.Why did you even visit that post? Insane.\n> I already told you: you can create and moderate and censor your own forums. You can't and won't tell others what they may or may not post. Live with it or go back to Facebook.com.\n\nRacist posts really aren't anything special, and decentralization doesn't make any difference. You're already allowed to post racist stuff on 4chan and on YouTube. I think that's what really annoys people here. .. they're not saying they want racist posts to be censored.. they're just saying they're annoyed by it .. and quite frankly, they have just as much of a right to express the fact that they're feeling annoyed as the racists have the right to post racist stuff .. lol",
				"added": 1479109368
			}
		],
		"4_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz": [
			{
				"comment_id": 73,
				"body": "It's already possible to delete posts on ZeroTalk, it's actually pretty easy. \n\ne.g. Copy the browser URL:\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:4_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz/DIY+workaound+for+blocking+the+spammers+and+crap+creators\n\nAfter the '?Topic:' string you will find the Topic_Id which is\n4_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz\n\n4 represents the topic number and the address next to it is the ZeroID address of the user.\n\nYou then go to your site folder > data > users > and look up this address, which is basically a folder. Inside this folder you'll find data.json. Modify this data.json and remove any topic and comments you want, save the file.. then go back to your browser, open up your ZeroNet site .. go to the menu on the right. Write this into the field where it says 'content.json' : data/users/1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz/content.json  ... and then click Sign and Publish.\n\nOf course, you need to be the site owner to do this. If site owner doesn't want to deal with spam, that's his choice, and maybe its time to create your own site with its own rules.",
				"added": 1479110138
			}
		],
		"1_1BF9gEDMjApfYpXer7fwiX2s5BJnCfFoew": [
			{
				"comment_id": 74,
				"body": "Good job",
				"added": 1479111446
			}
		],
		"10_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": [
			{
				"comment_id": 76,
				"body": "updates..",
				"added": 1479911953
			},
			{
				"comment_id": 77,
				"body": "**UPDATE: KopyKate now uses TorrentMedia as the standard client for new film releases. This should speed up torrents significantly. TorrentMedia is better than WebTorrent.Desktop for mass-seeding, but it surprisingly works faster if it is minimized compared to Windowed mode. This might have something to do with the CPU and bandwidth consumption of certain Node.js modules. **",
				"added": 1479989209
			}
		]
	},
	"comment_vote": {
		"125_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t": 1,
		"23_1DcE9QfZbfLZhXxgtQ8Ui3oMZvs9NVjqZB": 1,
		"172_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx": 1,
		"4_17d3S7saDQP5phkkWS9F7tMJTymqLCQmig": 1,
		"23_17nphNHoGtz9EzvvTSSbZn7WHfM1ynpdsL": 1,
		"1_12XqJsGMG5dUrxjGtGKrjwg4DFKfXtEkg3": 1,
		"1_1aBSgjQmJ9gZnYNbc6BaFAhPDqRJFHS6F": 1,
		"2_14TpgjZ45qVUmFjp848YUhqtWKPYYrSkUW": 1,
		"1_1DPfmiScSYzwEFHdzYpJcUxu3b8tmv7AYa": 1,
		"17_1FEikAyxCNPJcW996B69r5UFg29yfq579m": 1,
		"4_1F1zfoai6i629oFmUa6EyQyQR8Atj7XjnV": 1,
		"155_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t": 1,
		"205_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"15_1NGTMtN8816KeCtNqy6W4fCQduU4P8iwty": 1,
		"19_1NGTMtN8816KeCtNqy6W4fCQduU4P8iwty": 1,
		"20_1NGTMtN8816KeCtNqy6W4fCQduU4P8iwty": 1,
		"21_1NGTMtN8816KeCtNqy6W4fCQduU4P8iwty": 1,
		"27_17nphNHoGtz9EzvvTSSbZn7WHfM1ynpdsL": 1,
		"24_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT": 1,
		"4_1KgQuToz1c1PBEHhZjijgdVfgBW1BEETd8": 1,
		"3_17a8xsj4Ds61C9wcox4Yqjp4GKD3qNdmdf": 1,
		"34_1LfQ8dwqkqkGQNCg1kBevHPxjvTRJTQYBz": 1,
		"1_1MrRShZ9dp1stuYhAyzguqFXv8X4E4AjCn": 1,
		"6_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"804_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"33_1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC": 1,
		"30_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": 1,
		"1_1L14vSk76tujfNoqrcRuFk2tBBZgUPy92t": 1,
		"1_1Pwcc1Fk7bKMA1uayUTvZaUuaGBpvGMTRg": 1,
		"91_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt": 1
	}
}