{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Share your IDs for distributed and cloaked communication programs like Ricochet, Retroshare, Tox, Matrix, Ourbook, Chat.onion, etc.",
			"body": "My Chat.onion:\nivlk52iris3iu43t\n\nMy ourbook:\nypbql3ucrwf7sfwe\n\nMy retroshare key:\nCQEGAcGWxsBNBFQiAtMBCADwxO2Iy0Zbn0BSEv/Hb9RoIt62b+1xII3KHgtsnd64\nzmy2mFNTPtND9Sm5i/UOPnXg2EaomamreoXAhbv2Ch0EsY3D3WeQ+Va7Lni0lBNs\nc5vrsSW6RgwfBZWCDDfIlYj3F0Ilo1hJbBsCP3O0iDXA8AV7vxEfZlHFOJNciFtT\n/94wAh3uD5KxrubrwqldO2TdntyMXp0Ma8GGP9v0iht9mGJ//Bxd0/Aig+o9HKMy\nhUMubdf1GSiF/tN5Cxq9o8OEwsb+SyeM1jfkJvpGXbtGlauUTt4rNbuqNWSQo\nfPOpERE6tajtlGdd4gqdtlNvtSSEBlaRaODcM1l6VNrRABEBAAHNIkFraXRvIChH\nZW5lcmF0ZWQgYnkgUmV0cm9TaGFyZSkgPD7CwF8EEwECABMFAlQiAtMJELLw7J8N\naFijAhkBAAAjsQf+OH0YGWxL9qp6f0dYb76xx6qC3HijuinosMfQqRfovq+OJHrI\nRfbgnpnkiPrtmqaIB1AATH2/WFkD9GLR0UCRD0iFiT1DHp2jPSNYoYkn9RvnPkD5\nCxyozvDluUBv6cB/zUwXwmavKf5bz7w/2j4PqFhT9QUTM73Z6ANo/lwLjJNtlbrn\nzYqFhFnGX6F1Uq/SXV8Oy36mdZXnn9txDA2s8sIjl3Racc6yN4ySF1j1emyPIRL/\nZfcsd4vOGcovkdxRD1r9qAYzveUmzCLivV+cjHbEXntLmIGNAr19JmVEuug7lNUj\nV07mx8AWBHQKkDgw8TuegMozk6MVXtoCFh4DmAIGAAAAAAAAAwbAqLIaOpIEAAYP\nREVTS1RPUC1IRkVBVktSBRBFEA4/oGDrwh9js9ib7O1OBwPPgU8=",
			"added": 1493179307
		},
		{
			"topic_id": 2,
			"title": "ZeroBlog - Share your suggestions",
			"body": "I couldn't find any place for general suggestions regarding parts of ZeroNet instead of the whole network... so I hope this thread will be helpful.\n\nMy suggestion: add view permissions to the ZeroBlog template to be able to hide content or make it public.",
			"added": 1493691006
		}
	],
	"topic_vote": {
		"4_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h": 1,
		"14_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": 1,
		"37_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"12035_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"12042_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"1_16PHavs6iQAene1ZWaJN4cgVwh831EfNfk": 1,
		"12070_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"1_1AZG3avnpwcn37q9eeCEjXKFBye81eAxg5": 1
	},
	"next_comment_id": 47,
	"comment": {
		"1_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L": [
			{
				"comment_id": 1,
				"body": "That's last century's news.",
				"added": 1493097547
			},
			{
				"comment_id": 10,
				"body": "> [gengar](#comment_1_1CTesd1DsgfKtNSNqpuncLeDf9rj1xq72N): In China，the first class is  foreigner， the second class is governor，the third class is ethnic minority(especially Hui people believe in Muslim），the forth class is Han people（majority people）\n\nThis sounds more to me like you are xenophobic, because this is what usually those poor people say who blame everyone else for their misery. But it's just a guess.",
				"added": 1493179467
			}
		],
		"1_14gU7BmDVYaUD6b1fks74MQv6XtsCnAgEX": [
			{
				"comment_id": 2,
				"body": "If being poisoned to death is \"such good treatment\", maybe you should try it yourself?",
				"added": 1493151092
			},
			{
				"comment_id": 3,
				"body": "Btw. do you know which people are the most aggressive in trying to \"cure\" gayness? The gay.\nYou don't have to feel ashamed, because you like to get fucked into your ass so hard. Or is it maybe that you like to Heil Hitler while you get fucked so hard? Or do you suck their dicks so much you can't even raise your right arm anymore? Poor boy. Don't be ashamed.",
				"added": 1493151437
			},
			{
				"comment_id": 4,
				"body": "Apparently the rumors about military victims like you would like to be one are pretty true, since they seem very gay in the first place. Probably all this singing with your comrades is just the preparation for your ass to be whipped and fucked really hard by your favourite boy. Don't worry, you won't get punished by being like that from us. But I guess you should lose your nazi boys, that accidentally are heterosexual, so they don't lynch your gaping asshole on a tree. Don't be afraid, come to us, little boy.",
				"added": 1493151649
			},
			{
				"comment_id": 5,
				"body": "Come on, don't be coy, boy. How many times did you get fucked in the ass? Did your daddy start it when you were nine years old? Or even earlier? Your mom knew but didn't seem to care about you to change it? Poor boy.",
				"added": 1493151801
			},
			{
				"comment_id": 7,
				"body": "> [styromaniac](#comment_44_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): People pretend to be Nazis because they can't control themselves sexually when a black man is near.\n\nHehe, you're right. Those poor little guys. I have pity for some of those kids. Mr. \"gaycure\" and his little pedo friend \"fyf\" count as them.",
				"added": 1493152237
			},
			{
				"comment_id": 8,
				"body": "> [styromaniac](#comment_45_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I was once asked by a Nazi if he could suck my dick for weed. I'm not black, however, he might have known that I have boobs, being an MTF tranny myself.\n\nI imagine this could happen more often to you. Being a nazi is like denying reality. Same with gays who aren't okay with themselves. They need to build a little more confidence and start accepting themselves. This would make them feel much better and they wouldn't need to be nazis anymore.",
				"added": 1493152507
			},
			{
				"comment_id": 9,
				"body": "> [kaffie](#comment_278_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Hormones do not effect sexuality. Anyone who believes that is a complete moron because it's been effectively debunked by millions of people. [...]\n\nAccoring to their logic, everyone debunking their moronic expressions logically is a jew.",
				"added": 1493173308
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 6,
				"body": "> [greentea](#comment_3_1HrLZ8r5MufWDSNS1EbL17GW4QNeeCcbqM): Bump\n\n\"Yes, you have to copy the data/users.json file to your new machine.\" - FAQ",
				"added": 1493152136
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 11,
				"body": "How do I contribute to the source code on github.com?",
				"added": 1493229181
			},
			{
				"comment_id": 12,
				"body": "> [border0464fred](#comment_141_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): Like how to github ? :p If you are not familiar with github there is tons of tutorial and documentation about that. Nothing zeronet specific. [...]\n\nThanks, I just needed to see the words \"fork\"/\"commit\" and \"pull\" to understand the basics. But I forgot to mention the 0net specific point of my question: I want to add translations to the translation file, but it features only the already translated parts. Where do I find the untranslated parts?",
				"added": 1493246927
			},
			{
				"comment_id": 18,
				"body": "I have two issues:\n1. My favourite 0sites disappear after every restart of 0net.\n2. How do I choose the browser where 0net starts when I click \"Open Zeronet\"?",
				"added": 1493406135
			},
			{
				"comment_id": 20,
				"body": "> [rythyrix](#comment_71_18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y): Regarding favorited sites, ZeroNet stores your favorite zites as a JSON object inside your browser's local storage. According to this Superuser post, Firefox's cookie and local storage permissions are linked. First, check if your cookies are allowed for 127.0.0.1 and/or localhost and not wiped between closing all tabs/the window (hello, Self-Destructing Cookies addon, fancy seeing you here). This should fix the issue, but I've never experienced the problem, so YMMV. [...]\n\nThank you, very helpful.\nBy now I have another additional problem: some sites tell me e.g. \"1 File update failed!\". How do I fix this?",
				"added": 1493432166
			},
			{
				"comment_id": 21,
				"body": "> [rythyrix](#comment_72_18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y): That's simply the fact that none of your peers you have connected (connected, not available, there's a difference) have that file, or the file was corrupted en route, or the peer sent a file with the wrong sum. Could be a number of things. Go to the zite that has that error, and drag the purple 0 at the top right leftward. Scroll down to 'Missing Files' and see what file it is. Chances are high it's a user's file, i.e. starting with data/users/ and no one has a correctly signed or summed copy. It happens, and as your connections refresh or swap between your peers, it should resolve itself unless zero people have valid copies.\n\nOnce again, thank you very much. I cloned the blog site and it says my `content.json` is missing. On 0mail 3 `users/` files are missing. But this persists since days. What can I do?",
				"added": 1493438626
			},
			{
				"comment_id": 39,
				"body": "> [border0464fred](#comment_154_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): contact list of what ? on witch  site ?\n\nNo, on wizard site.",
				"added": 1493689794
			},
			{
				"comment_id": 41,
				"body": "> [rythyrix](#comment_80_18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y): I run multiple nodes (phone, tablet, laptop, desktop) as the same user, so I'm probably in the minority. [...]\n\nHow do you run Zeronet on the phone?",
				"added": 1493697793
			},
			{
				"comment_id": 42,
				"body": "> [rythyrix](#comment_81_18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y): Check out the lovely @mkg20001's tutorial and prebuilt APKs. The prebuilt isn't secure for private keys or other sensitive data, at least not without root access and mountbinds, due to exposing the data directory and therefore users.json to USB file transfers (MTP). :( If you can, root your phone, not like OEMs will honor warranties anyway.\n\nIn my country we have warranties that are enforced by law. I don't live in a third world country, like USA is one. (No healthcare system = no first world country)",
				"added": 1493698102
			}
		],
		"1_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY": [
			{
				"comment_id": 13,
				"body": "> [o4zw5vmpoz5hz78z](#comment_141_1KTjPe9MxoYkcXj78GuZgCcj3R3f3Twh7r): there is already a thread for that here http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:3_1NTgaYjK2bh1axvruth8HqtGt6Pw5ab13x\n\nI opened a new one, because that thread has a title that doesn't really draw most people in...",
				"added": 1493257375
			},
			{
				"comment_id": 14,
				"body": "I tried to send you a mail, but it doesn't find your username.",
				"added": 1493257638
			},
			{
				"comment_id": 15,
				"body": "> [cablecat](#comment_4_1HxiFjyEUfLeqvXza7TqV1h4mpo167JnrL): Thanks so much for reply. I have solve the problem by using a tor browser after a long waiting to startup. Whatever, the RetroShare it works on my PC now, even though I have no friend to add. ;)\n\nPost your certificate here, I will add you.",
				"added": 1493350273
			},
			{
				"comment_id": 16,
				"body": "Did you guys get my message?",
				"added": 1493358914
			},
			{
				"comment_id": 17,
				"body": "> [cablecat](#comment_7_1HxiFjyEUfLeqvXza7TqV1h4mpo167JnrL): where can I find and add more people around the world? Or is it just a app for communication, file sharing, etc between friends not strangers?\n\nIf you want to be absolutely secure, then it is recommended to only use it with friends. But if you don't really want to share the most confidential stuff or want to try out how it works at first then you can add \"strangers\", too. Ultimately it's up to you.\n\nBtw. you have to add the certificate from the email I sent you here.",
				"added": 1493405829
			},
			{
				"comment_id": 23,
				"body": "> [1491301186](#comment_10_1AZG3avnpwcn37q9eeCEjXKFBye81eAxg5): RetroShare should only be used with Tor, otherwise your IP is visible.\n\nNope. I use it with I2P and it's secure.",
				"added": 1493494278
			},
			{
				"comment_id": 25,
				"body": "> [1491301186](#comment_13_1AZG3avnpwcn37q9eeCEjXKFBye81eAxg5): I2P is of course secure, it's just easier to find peers willing to use Tor.\n\nI guess, that's true. But I2P has a different purpose and there for is more fitting to Retroshare according to its intentions.",
				"added": 1493504767
			},
			{
				"comment_id": 32,
				"body": "> [seequ](#comment_4_19BZ9s633TaM3t7oW5bQPTPQJU3cbyibVH): I keep all my relevant contact details in http://127.0.0.1:43110/1FuN96E7UCDCqjSbahnH735KfaKizLbSUc/ - makes it easier to keep up-to-date :)\n\nIS the GPG valid for Retroshare?",
				"added": 1493671005
			},
			{
				"comment_id": 46,
				"body": "> [thegillies](#comment_11_1NTgaYjK2bh1axvruth8HqtGt6Pw5ab13x): I wonder why onion chat hasn't had any commits in over a year?\n\nDidn't see. I guess that open-source projects often aren't worked on anymore, if the initial creator doesn't keep pushing and developing.",
				"added": 1494171087
			}
		],
		"4_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h": [
			{
				"comment_id": 19,
				"body": "Really nice, thank you.",
				"added": 1493423890
			}
		],
		"4_136wmwLTBJoGTjXTAa7sWmXewn9P53EKML": [
			{
				"comment_id": 22,
				"body": "> [border0464fred](#comment_145_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): Hummm, an other protocol implementation that do the same thing that torrent do.  [...]\n\nJust because it's apparently based on it, doesn't mean it came out of same intentions and has the same meanings... Maybe it's not \"new\" as it seems to you, but there's obviously still a difference.",
				"added": 1493494146
			}
		],
		"1_14Knzt7E5McPxaUHrQ8nwoBhwFAPmtRzD1": [
			{
				"comment_id": 24,
				"body": "The link is empty.",
				"added": 1493494555
			}
		],
		"1_1MwJSNBC1savftEvXQyoHcVLDgThtAPr6T": [
			{
				"comment_id": 26,
				"body": "I don't understand you, at all. Zeronet surprised me to be extremely user friendly. You literally don't need to be a coder at all to understand how Zeronet works. It's like the easiest platform of this type I ever used. Looks beautiful, extremely easy to use. Basically just install Zeronet, click \"Open Zeronet\" and everything is done. What are your issues exactly?",
				"added": 1493535478
			}
		],
		"14_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": [
			{
				"comment_id": 27,
				"body": "I'm with you!",
				"added": 1493575131
			},
			{
				"comment_id": 30,
				"body": "> [seequ](#comment_1_19BZ9s633TaM3t7oW5bQPTPQJU3cbyibVH): ZeroNet is wonderful tech. There's just one thing that keeps me slightly worried: a zite that I pass by might seem innocuous so I don't explicitly delete it. Maybe it was at that time and later they added illegal content - or maybe it always had illegal content and I didn't know about it. Anyways, because I would now be sharing illegal content, I'd be liable.I wish sharing was opt-in, rather than opt-out, and that the UI neatly displayed all files the zite has before you choose to host it.\n\nIt would be horrible for the network, if sharing was opt-in. Its better to leave it as opt-out so as many people as possible share as many zites as they can. Every single peer makes the network stronger. The less peers, the worse. And if you find a malicious zite, you can \"Pause\" the sharing for each site individually, as described below. That method is much better for the network. (Btw. I visited many zites already and didn't find even one that seemed bad to me...)",
				"added": 1493670534
			},
			{
				"comment_id": 31,
				"body": "> [sirius17](#comment_2_1G6QESmeipZsukJX5WvDxxwSioaGnEDRk3): This is a very valid point and it worries me too. I'm not sure how to solve the problem of illegal / amoral content but perhaps some kind of warning system that would allow users to flag bad content.\n\nThat would weaken the purporse of a resilient decentralized network of strongly guarded free speech. Alternative zites would probably be down-flagged much more often and that would reduce their availability. And bam, we are back to the censorship of Twitter and Youtube. Why bother to use this network in the first place if such features would exist here, too?",
				"added": 1493670709
			}
		],
		"37_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 28,
				"body": "Are there any different rulesets? And how customizable is the whole experience for me, if I would join?",
				"added": 1493602920
			},
			{
				"comment_id": 33,
				"body": "> [gontthias](#comment_1_1L1geSGbXTJz9Z63CrX3wZbd2Yy6PCPdR8): 不知道这东西有啥用处？乱七八糟的信息，有没有群组功能？\n\nIt's for Black Desert ONLINE and not for Black Desert...",
				"added": 1493671243
			}
		],
		"12031_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 29,
				"body": "*yawn* Yes, of course someone will not openly do that in public, but rather try to cloak their identities... That's natural. That's not \"news\".",
				"added": 1493602987
			}
		],
		"2_1EqerKajfi14bzTkqwSfqVrxKmQW1w6Nzk": [
			{
				"comment_id": 34,
				"body": "> [twiggydew](#comment_6_1MwJSNBC1savftEvXQyoHcVLDgThtAPr6T): Give it up, ZeroBlog will NEVER have features like that. The coders on ZeroNet do not care about people who can't code. They might be able to code but they're not smart enough to understand that these are important features that need to be added to get more people to use ZeroNet. They should have already been added months ago. ZeroNet has great potential and I'd love to see it succeed in getting a lot of people to use it but the majority of people on this fucking planet do not code so they will not use ZeroNet and they wont use the blog if they have to get into the CSS and other files to change stuff. The coders on ZeroNet need to realize this and add features to ZeroBlog that will get people to use it. ZeroBlog does need something like grapesjs or a cms but it will NEVER get one because the coders flat out refuse to add those features. I read bot's comment - Being the biggest and killing all others is what this person really probably looking for - Bot just doesn't understand that ZeroNet does have a great potential to do that. ZeroNet might not get everybody to use it but if the coders would add features that non-coders use, ZeroNet does have the potential to get at least sixty percent of the population to use it.\n\nThe only thing I see from what you say is that people like YOU will never care about anything but themselves.",
				"added": 1493671450
			},
			{
				"comment_id": 36,
				"body": "> [bot](#comment_205_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb): Why did i spend 2 weeks helping Kai0? [...]\n\nRespect to you.",
				"added": 1493673769
			},
			{
				"comment_id": 37,
				"body": "> [darvy](#comment_48_1EqerKajfi14bzTkqwSfqVrxKmQW1w6Nzk): But some of us don't want to mess with any of those files like the CSS. If the blog doesn't get something like Grapes then there's really no reason for me to stick around because I will never get into those files to change the code. I use things like a CMS and drag and drop features. The reason I use them is because they are less of a hassle. With coding if you get something wrong in the code nothing works right then you have to get back into the code and try to figure out whats wrong. I stare at the code till I get massive headache then I have to start taking asprin, I hate it. Please try to figure out a way to change the look and feel of the blog without the need to code.\n\nI still don't understand how some people want a good thing and think that every bad aspect of this good thing can just disappear into nirvana with a little of writing. There is a purpose, a goal and yes I'd call it a mission behind #redecentralize that makes projects like ZeroNet worth using, even if it isn't build YET(!!!) according to your highest satisfaction that was poured into you when using commercial and corporation infected web. You are right, it is not as easy to use, as the normal web. But is it not worth it to use it due to its big freedom and hugh mungus advantages for the people? Do you want to remain a corporate slave because they make using a channel or creating a blog a little easier and dumber for you? I don't think that is a valid reason.\n\nI wouldn't pick up a random dude from California, if I live in New York because that would be too much effort. But if my son would call me and need me to go there for him, I would do it in an instant. Same here. You aren't supposed to sacrifice a little more time and effort for something that's equally as good and bad as a normal network. This one has a very honorable mission and does neither exploit you or collect trillion tons of data about you. It gives you a LOT that everyone needs on the web (many people don't even understand and know that it is needed). Aren't you willing to pay a little back by giving a little time and effort of your life?",
				"added": 1493677395
			},
			{
				"comment_id": 38,
				"body": "> [darvy](#comment_49_1EqerKajfi14bzTkqwSfqVrxKmQW1w6Nzk): I don't want to be a corporate slave but if I can't have things like a CMS or drag and drop on ZeroNet then I will stay on the centralized network and I'll just give up my privacy and security, many other people will do the same. What's the point of getting on ZeroNet if you can't use it. On the centralized networks it might be less private and secure but at least I can use it. Most non-coders will stick with what they can use. If you want to attract those non-coders to ZeroNet you have to add the same things they use on the centralized network. Think of the old saying - How to attract bees with honey. To non-coders features like drag and drop and CMS's are the honey.\n\nWhat's the point of using a clearnet site for blogging if I sell my soul for it. That is my question opposed to your question. Also you CAN use it. It's just not AS easy. But not really hard either. What if your daughter would be like \"nah, I don't wanna learn to ride the bicycle. They should make it easier to use for me.\"? Or they don't want to learn swimming, because there are boats. Don't want to learn math in elementary school, because we have calculators. What would you say to them? I want to give the same answer to you.",
				"added": 1493681254
			}
		],
		"1_16PHavs6iQAene1ZWaJN4cgVwh831EfNfk": [
			{
				"comment_id": 35,
				"body": "We need more people to use those!",
				"added": 1493671690
			}
		],
		"1_1HciUodo7kXB56PcZ4Bj9EHRmpophE4H1y": [
			{
				"comment_id": 40,
				"body": "You can get it for a buck.",
				"added": 1493690530
			}
		],
		"1_1AZG3avnpwcn37q9eeCEjXKFBye81eAxg5": [
			{
				"comment_id": 43,
				"body": "Assholes...",
				"added": 1494000231
			}
		],
		"2_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": [
			{
				"comment_id": 44,
				"body": "burningcold, at least you are on their niveau, regarding your intelligence.",
				"added": 1494001661
			}
		],
		"1_1PFMNdR2S3k9PbHU3dhBZXEvsnrYKszTNe": [
			{
				"comment_id": 45,
				"body": "Greetings",
				"added": 1494059146
			}
		]
	},
	"comment_vote": {
		"43_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"42_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"44_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"278_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"141_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6": 1,
		"9_1AZG3avnpwcn37q9eeCEjXKFBye81eAxg5": 1,
		"1_15TSdTU5ZrAHXXiMQvMUEEUm17GFt5WqWp": 1,
		"52_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"72_18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y": 1,
		"53_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1_1J1PqgvWDkxQKRY4WUx3ZeTex4XZA2A7cg": 1,
		"1_1G6QESmeipZsukJX5WvDxxwSioaGnEDRk3": 1,
		"291_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"289_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"4_19BZ9s633TaM3t7oW5bQPTPQJU3cbyibVH": 1,
		"205_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": 1,
		"37_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"292_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"37_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"34_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"1_17eEEfYPLR4wdej85kFmH2gNeSnxiTBvgC": 1,
		"296_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"19_1AZG3avnpwcn37q9eeCEjXKFBye81eAxg5": 1
	}
}