{
  "comment": {
    "1_17q6Zhf7PFjrY3ddySK2F78JhAH3FVhmWr": [
      {
        "body": "> [communahara](#comment_3_1M29UgKTUcDsSHafheTS2W8Ec9RZiNMvRk): Fuck all politicians. Full communism is the way to go. No masters, no states.\nMaybe. But you should read before this message from your ideological great-grandfather:\nOn The Jewish Question - Karl Marx\nWe recognize in Judaism, therefore, a general anti-social element of the present time\nhttps://www.marxists.org/archive/marx/works/1844/jewish-question/", 
        "comment_id": 5, 
        "added": 1476716286
      }
    ], 
    "1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": [
      {
        "body": "The great-great nephew of Adolf Hitler is greeting you as Jew from Israel.\nAlois Hitler had two sons who lived until maturity - Adolf Hitler(the Führer) and Alois Hitler(junior).\nAlois Hitler, the half-brother of the Führer then produced an illegitimate son called Hans.\nHe(having a Jewish name) is the grandson of Hans.\nHis great grandfather was the half-brother of Adolf Hitler and is called in Israel as the Jewish Hitler.\nOne of his sons makes Hitler greetings - as joke.\nHe believes that Germany is doomed, only the Turks make children in Germany. But the Jews will never die.\nhttp://arhiva.dalje.com/en-world/hitlers-relative-found-happiness-in-israel/171010\nhttp://www.timesofisrael.com/when-family-ties-lead-straight-to-hitler/", 
        "comment_id": 2, 
        "added": 1476558100
      }
    ], 
    "1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
      {
        "body": "Jews Promote Homosexual Marriage in America but Outlaw it in Israel\nhttp://nationalvanguard.org/2015/07/jews-promote-homosexual-marriage-in-america-but-outlaw-it-in-israel/\nJewish Leaders Behind The Homosexual and Lesbian Movement\nhttp://www.intmensorg.info/hlm.htm", 
        "comment_id": 1, 
        "added": 1476344179
      }, 
      {
        "body": "The internationally recognized Jewish professor of Jewish history Ariel Toaff claims that the Jewish ritual murdering of Gentile children to take their blood may have been true and not a legend(blood libel).\nhttp://bloodpassover.com/\nhttp://bloodpassover.com/tbook.htm\nhttps://archive.org/details/BloodPassoveredited\nThe focus of the book is set on the figure of 2-year-old Saint Simon of Trento, also called Simonino da Trento, who was kidnapped and murdered by Jews. His body was found in a cellar of a Jewish owned house in Trento, Italy by local magistrates.\n\nAriel Toaff is a professor of Medieval and Renaissance History at Bar Ilan University in Israel, whose work has focused on Jews and their history in Italy.\nAriel Toaff is the son of Elio Toaff, late former Chief Rabbi of Rome.", 
        "comment_id": 4, 
        "added": 1476688687
      }
    ], 
    "9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": [
      {
        "body": "> [jewish](#comment_3_1K92Q9FtzTWLQC6x5wUQBanNniZTb45wEH): Don't fool yourself. Both candidates have been approved by Israel.\n\nTrump made a trip to Israel because he is not racist, he regards the Jews as equal with all other humans and he hoped to find some honest Jews who would support him in his fight against corruption.\nBut he didn't succeeded to find this category in Israel and he was humiliated because the Jews want to have  more rights then all others. This way of taking money from the poor and giving to the rich still worked somehow by Obama but continuing this way will end in a total bankruptcy.", 
        "comment_id": 3, 
        "added": 1476641587
      }
    ]
  }, 
  "next_topic_id": 2, 
  "topic": [
    {
      "body": "2. Adolf Hitler is likely to have had Jewish and African roots, DNA tests have shown. \nhttp://www.telegraph.co.uk/history/world-war-two/7961211/Hitler-had-Jewish-and-African-roots-DNA-tests-show.html\n\n2. In 1933, the London Daily Mirror published a picture of a gravestone in a Jewish cemetery in Bucharest inscribed with some Hebrew characters and the name Adolf Hitler.", 
      "parent_topic_uri": "9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj", 
      "title": "Was Hitler Jewish?", 
      "added": 1476517673, 
      "topic_id": 1
    }
  ], 
  "topic_vote": {}, 
  "next_comment_id": 6, 
  "comment_vote": {}
}