{
	"next_post_id": 63,
	"next_comment_id": 99,
	"next_follow_id": 38,
	"avatar": "jpg",
	"user_name": "Martinv",
	"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
	"intro": "Don't mind me. I'm just a peer.\nEnglish/Spanish\nSecurity, p2p, Linux and stuff.\n[Un kaiju ocupa mucho espacio](http://127.0.0.1:43110/1HtvVoDg372JsV8iRH2YGwtaCmL2vEihV6/)",
	"post": [
		{
			"post_id": 1,
			"date_added": 1481470904,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1481472758,
			"body": "Why do you think people still write stuff that nobody is going to read...?",
			"date_added": 1481472756
		},
		{
			"post_id": 1481552977,
			"body": "So... I don't know if I'm soing something wrong or I somehow broke it, but my clone site of ZeroBlog doesn't seem to allow comments... (maybe I don't see that functionality because I'm the owner...? but that would be weird...)\n\nFeel free to say hi, even if you don't understand what you read:\nhttp://127.0.0.1:43110/1HtvVoDg372JsV8iRH2YGwtaCmL2vEihV6/\n\nUPDATE: Some kind sould already left a comment. It's working, yay.",
			"date_added": 1481552974
		},
		{
			"post_id": 1481553258,
			"body": "First time I learned about ZeroNet was because of a post by someone on ZeroNet that I accessed via a proxied URL.\n\nI don't remember exactly if it talked about going 100% p2p or 100% off-cloud and owning your own data. It presented many alternatives for most of ones needs, like btsync, owncloud, and of course ZeroNet.\n\nIf you know what post I am talking about (I know it's a stretch...), please let me know, because I want to follow the author to see what he's up to.",
			"date_added": 1481553254
		},
		{
			"post_id": 1481585160,
			"body": "[Feature request] Blocking a user in ZeroTalk should hide all the users' posts on the stream... I don't just want that user to not be able to talk/follow me, I just want him/her gone.\nI'm not even sure what blocking actually does...",
			"date_added": 1481585155
		},
		{
			"post_id": 1481643413,
			"body": "I just installed ZN on another computer and copied the \"data\" folder from the computer where I have been using it until now and **it seems to be working**.\n\nIs there any chance of conflicts/errors in doing this (other than having my private keys in multiple places)? I don't have much to lose (yet), but I would like to keep my current identity, sites, blogs, etc...",
			"date_added": 1481643407
		},
		{
			"post_id": 1481653032,
			"body": "This reminds me a lot of the first days of Diaspora* <3",
			"date_added": 1481653025
		},
		{
			"post_id": 1481654354,
			"body": "So... what is the correct way to post zeronet links?\nIs there a better way that posting the 127.0.0.1... ?",
			"date_added": 1481654346
		},
		{
			"post_id": 1481738088,
			"body": "[Feature request] [ZeroMePlus]\nI don0t know if this is plausible, but it would be nice to be able to filter/hide posts by language. Detecting the actual language of a post is a bit tricky, but maybe the language of the ZN client used by the poster can be used, or something like that...?",
			"date_added": 1481738079
		},
		{
			"post_id": 1481738544,
			"body": "Let's say I publish a blog post so awesome that somebody sends me a fraction of a #bitcoin to the address of my blog (which is technically a btc wallet, right?).\n\nHow would I know about that transfer and how could I use those bitcoins, either to transfer them to another wallet I have in my computer, or to pay something online...?",
			"date_added": 1481738534
		},
		{
			"post_id": 1481825996,
			"body": "##Geo-locking makes no sense in today's world.\n\nIt imposes imaginary restrictions based on the idea that the Internet has the same boundaries that the \"physical\" world, only it doesn't.\n\nThe sooner people and businesses realize that restricting contents/services by geographical location is destined to fail, the better.\n\nGeo-locking is not only capricious, but it also punishes those who are conscious about their privacy online (VPNs, Tor, Proxies and other methods of obscuring one's identity, location, etc).",
			"date_added": 1481825985
		},
		{
			"post_id": 1481828833,
			"body": "## Worried About the Privacy of Your Messages? Download Signal\n### BY the time you finish reading this column, you would be foolish not to download the messaging app Signal onto your smartphone and computer.\n\nVia **The New York Times**\nhttp://www.nytimes.com/2016/12/07/technology/personaltech/worried-about-the-privacy-of-your-messages-download-signal.html?_r=0",
			"date_added": 1481828821
		},
		{
			"post_id": 1481914359,
			"body": "¿Alguien pudo conectarse remotamente a un servidor ZeroNet desde un navegador en Android?\nCuando intento hacerlo, explota el consumo de memoria...\nMás info:\nhttp://nostromo:43110/1HtvVoDg372JsV8iRH2YGwtaCmL2vEihV6/?Post:6:Usar+ZN+remotamente+(ej:+desde+un+celular)\n\nUPDATE: Forget it, the problem was Firefox for Android. If I use the default web browser it loads correctly.",
			"date_added": 1481914346
		},
		{
			"post_id": 1481914447,
			"body": "Is anyone able to access a ZeroNet server remotely from a web browser in Android?\nWhen I try to do it, it starts devouring memory until other apps running in the background start closing to free memory, and ZN never actually loads.\n\nUPDATE: El problema era Firefox para Android. Con el navegador por defecto de Android funciona.",
			"date_added": 1481914433
		},
		{
			"post_id": 1481937036,
			"body": "Les dejo una humilde reflexión sobre la auto-referencia en ZeroNet:\n[META](http://127.0.0.1:43110/1HtvVoDg372JsV8iRH2YGwtaCmL2vEihV6/?Post:10:META)",
			"date_added": 1481937021
		},
		{
			"post_id": 1482087685,
			"body": "*ESPAÑOL*\nEstoy consideerando correr #Nextcloud en un VPS en DigitalOcean que tiene algunos recursos disponibles para usar. Un par de clientes decidieron no renovar sus sitios y en lugar de bajar de plan, prefiero intentar hacer algo interesante en el servidor ;)\n\nNextcloud es ideal para correr en un servidor propio en casa, pero no todo el mundo tiene un servidor o sabe cómo hacerlo, y además Nextcloud corriendo en un VPS ahí fuera es accesible desde cualquier parte, no sólo desde casa, sin necesidad de también montar una VPN en casa.\n\n¿Alguien puede estar interesado en tener una cuenta? \n¿Qué funcionalidades/plugins les gustaría que hubiera disponibles?\n\n\n*ENGLISH*\nI am considering running #Nextcloud on a VPS I have on DigitalOcean with some spare resources. A couple of clients decided not to renew their websites and instead of downgrading I want to do something cool with it ;)\n\nNextcloud is cool for running it in your own server at home, but not everybody has a server or know how to do it, and also having Nextcloud running on a VPS out there makes it accessible from anywhere, event outside your home, without having to also run a VPN in your house...\n\nWould anyone be interested in having an account? \nWhich features/plugins would you like to be available?",
			"date_added": 1482087669
		},
		{
			"post_id": 1482151961,
			"body": "ZeroMePlus #FeatureRequest\nAn auto-load more posts in the stream would be nice...",
			"date_added": 1482151944
		},
		{
			"post_id": 1482152290,
			"body": "Is a cloned #ZeroBlog updated if the original is updated (like, adding new features, changing styles or fixing errors, not updating the content of the blog) ?\n\nI believe not, but just to be sure...",
			"date_added": 1482152272
		},
		{
			"post_id": 1482152693,
			"body": "I keep getting \"1 file upload failed\" in #ZeroMail. All other sites work fine.\nAny ideas?",
			"date_added": 1482152674
		},
		{
			"post_id": 1482239941,
			"body": "###No puedo contener el horror\nhttps://twitter.com/mis2centavos/status/811055857630871552",
			"date_added": 1482239921
		},
		{
			"post_id": 1482240480,
			"body": "I can see the images imbedded if I use ZeroMe but I don't if I use ZeroMePlus. I messed up, how do I fix it?",
			"date_added": 1482240459
		},
		{
			"post_id": 1482776402,
			"body": "I don't remember if I got this link from here, but anyway, here's a bunch of #self-hosted apps and services for y'all:\n\nhttps://github.com/Kickball/awesome-selfhosted#file-sharing-and-synchronization",
			"date_added": 1482776380
		},
		{
			"post_id": 1482776868,
			"body": "### Feature Request for #ZeroMe\n\nJump up and down to the next and previous post using keyboard shortcuts. For example, in Diaspora you can use the letters j and k for that.\n\nSince I have very bad sight, scrolling and reading, and scrolling and reading makes me dizzy. Jumping to the next post would make the first line or the title of the post appear always on the same spot on the screen, which makes it much more comfortable to read, specially if I'm not interested in something, I just skip it almost without moving my eyes from that first line.\n",
			"date_added": 1482776845
		},
		{
			"post_id": 1482805514,
			"body": "",
			"date_added": 1482805490,
			"meta": "{\"img\":\"900,506,000532764865753631641521965ca8db8c97a87a86853211,0123333425064746446504748884550129ABC467073A9CDE67F1233D2241\"}"
		},
		{
			"post_id": 1482861407,
			"body": "Am I the only one waiting for the 0 on the top right corner to change into another number, meaning you have new items in the connected sites stream?",
			"date_added": 1482861382
		},
		{
			"post_id": 1483402793,
			"body": "Anyone who actually knows a little about infosec has seen Zero Days?\n\nIs it worth my time?\n\nhttp://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/?New&page=3&imdb_id=tt5446858&title=Zero+Days",
			"date_added": 1483402767
		},
		{
			"post_id": 1483455080,
			"body": "Yo mama is so fat\n\nno punchline\nI'm lazy.",
			"date_added": 1483455053
		},
		{
			"post_id": 1483466772,
			"body": "### Quick Poll\nYou...\n1- leave ZN running all the time.\n2- open ZN when you want to use it.",
			"date_added": 1483466744
		},
		{
			"post_id": 1483495956,
			"body": "Any artists here who share their work on ZN?\nDesigners, painters, writers, photographers, filmmakers, musicians....?\nI crave original content...",
			"date_added": 1483495927
		},
		{
			"post_id": 1483496176,
			"body": "I just realized the title of my blog had a stupid typo since like forever.\n\nOh! such humilliation in front of the billions and billions (in Carl Sagan's voice) of readers.",
			"date_added": 1483496146
		},
		{
			"post_id": 1483567650,
			"body": "So you want the #Bitcoin price to go up? Just ask me. I'll sell and it will rocket to the moon.\n\nYou want it to go down? No problem, I'll just buy a bunch and the price will go see how's Cthulhu doing down there.",
			"date_added": 1483567619
		},
		{
			"post_id": 1483712097,
			"body": "I think I'm done with trading #bitcoins.\nI'm not ready to stay up 24/7 in order to sell before everything goes to shit and buy before it starts to rise again. \nDamn it time zones!",
			"date_added": 1483712065
		},
		{
			"post_id": 1483717659,
			"body": "Remember when having an automatic \"Hello ZeroMe!\" message was cute?",
			"date_added": 1483717626
		},
		{
			"post_id": 1483726459,
			"body": "##Children's song\nIf you're happy and you use a VPN\nIf you're happy and you use DNSCrypt\nIf you're happy and use Tor, and you really want to show\nIf you're happy is because you are secure.",
			"date_added": 1483726425
		},
		{
			"post_id": 1483752168,
			"body": "Virtualizing MacOS Sierra on Proxmox, because why the fuck not.\n\\#FridayNight #PartyHard",
			"date_added": 1483752132
		},
		{
			"post_id": 1483887936,
			"body": "So last night I was at a restaurant when some guy came in wearing an Arch Linux t-shirt.\nI wanted to hug him.",
			"date_added": 1483887899
		},
		{
			"post_id": 1483907815,
			"body": "Optimus on Linux sucks so hard... *sigh*",
			"date_added": 1483907777
		},
		{
			"post_id": 1484070194,
			"body": "@nofish Might we have a Reddit/Voat clone on Zeronet some day? :D",
			"date_added": 1484070155
		},
		{
			"post_id": 1484092319,
			"body": "### Holy crap, the Shadow Brokers are using zeronet to offer the exploits! (I shouldn't be surprised at all really)\nThis might bring quite a lot of attention to ZN. Good or bad, we need more atention...\nhttp://127.0.0.1:43110/theshadowbrokers.bit/",
			"date_added": 1484092279
		},
		{
			"post_id": 1484096314,
			"body": "## How would you destroy ZeroNet?\nLet's think about it, so we can prepare for it.\nI say:\n- Spam\n- Illegal porn, extreme/shocking content, and so on.\n- Malware (and this one is scary)\n\nBy destroying ZN I don't mean break it necesarily. I also mean turning it into a shitstorm of undesirable content, viruses, comments and posts floods so that nobody sane would want to bother coming in here.\n\nI think we need to address these problems before it's too late, before ZN gets \"too much\" atention.\n\nWhat do you think?",
			"date_added": 1484096273
		},
		{
			"post_id": 1484174131,
			"body": "### Where do I get a 'defrag' for this?",
			"date_added": 1484174089,
			"meta": "{\"img\":\"900,675,332221211100422764321444454666432543423554655,0011233234563331112202216789A6320AB90CBA160BD9EAED660AB999EB6606ABE9EB7A000ABDDB\"}"
		},
		{
			"post_id": 1484347318,
			"body": "This project is only 2 years old, this is fucking crazy.\nOr maybe @nofish is a robot.\nYeah...",
			"date_added": 1484347275
		},
		{
			"post_id": 1484397981,
			"body": "Well, the moment is now. We need to be able to block spammers like @noti0news@zeroid.bit at least on the client side, c'mon.",
			"date_added": 1484397937
		},
		{
			"post_id": 1484400964,
			"body": "No mercy for the spambots.",
			"date_added": 1484400919
		},
		{
			"post_id": 1484401612,
			"body": "Like Soylent Green, some spambots are people.",
			"date_added": 1484401566
		},
		{
			"post_id": 1484506886,
			"body": "\\#Fre3neT <-- así!",
			"date_added": 1484506839
		},
		{
			"post_id": 1484593500,
			"body": "Back to ZeroMe+\nAs I anticipated, the \"block\" option is not optional any more.",
			"date_added": 1484593452
		},
		{
			"post_id": 1484666949,
			"body": "Check this Tumblr of a friend of mine who is going back into drawing. He needs some incouragement.\nI also told him he needs to post directly here on ZN ;)\n\nhttps://tyranosapiens.tumblr.com/",
			"date_added": 1484666900,
			"meta": "{\"img\":\"560,700,dcdccc999879bbb888aaabaacbb767667877656444333434,0012340000522300005246000067720016286974425A127665826422549BBC6578DA2D8681DEFD11\"}"
		},
		{
			"post_id": 1484747643,
			"body": "Hey @catalunya, you posting a million times the same link in 0List really made me agree with you. Good job.",
			"date_added": 1484747593
		},
		{
			"post_id": 1485390085,
			"body": "So *politicians* are going to review the work of *scientists*. \n\nCan somebody tell them is the other way around?\n\nMore: https://twitter.com/AP/status/824374557893083146",
			"date_added": 1485390034
		},
		{
			"post_id": 1485462406,
			"body": "#\\#DefendScience",
			"date_added": 1485462354,
			"meta": "{\"img\":\"560,700,555744223423434754666c75a99ccabbae95988888e74844,0122223232222414223254634722484337549A422969B4C2460C8643436000565D7EBEEE40FFFFFF\"}"
		},
		{
			"post_id": 1485522796,
			"body": "I ran out of disk space last night and now ZN is acting really weird, even after I freed space and restarted...",
			"date_added": 1485522743
		},
		{
			"post_id": 1485702633,
			"body": "Has anyone heard/used [Blockstack](https://blockstack.org/) ?",
			"date_added": 1485702579
		},
		{
			"post_id": 1485968439,
			"body": "Something's wrong with my ZN install... I cannot leave comments, but I can create new posts.\nAnyone else has this problem?",
			"date_added": 1485968384
		},
		{
			"post_id": 1486046513,
			"body": "###How did you hear about ZeroNet?\nI found out about it when listening to Steal This Show podcast. I had heard of it before but never tried it, because I thought \"this is just too beautiful to really work\".",
			"date_added": 1486046457
		},
		{
			"post_id": 1486307064,
			"body": "I keep having this problem where I cannot post comments. \n\nHere's an example. I tried replying in this thread and my response stays greyed out, no notification pops up on the top right corner as usual, not even an error message, and in the console I get no output related to that post.\n\nI don't know what else to try :(",
			"date_added": 1486307007,
			"meta": "{\"img\":\"900,473,b99eddeeefeefeffffeef,01223454552222555555555555555552222234444122222655\"}"
		},
		{
			"post_id": 1486503540,
			"body": "The blured images in ZeroMe make me think they are all pr0n.\n\\#MindFuck",
			"date_added": 1486503482
		},
		{
			"post_id": 1486575436,
			"body": "NextCloud + nginx + Letsencrypt + Cloudflare = Major Pain In The Ass",
			"date_added": 1486575377
		},
		{
			"post_id": 1486677938,
			"body": "If muting users is censorship then I guess we all should just swallow all the shit anyone throws down our throats and be happy about it because freedom.\nIf you are one of those, you don't have a place on my stream, so feel free to keep talking to a wall.",
			"date_added": 1486677878
		},
		{
			"post_id": 1486690967,
			"body": "Muting spammers, the jewel of the east of all updates.",
			"date_added": 1486690906
		},
		{
			"post_id": 1486691863,
			"body": "I feel kinda racist for muting *most* asian speaking users on ZeroMe. It's not personal, believe me.\n\nI predict someone is going to come up with a list of \"most muted users on ZeroNet\" and propose to use that list as a way to bloacklist/filter/moderate Zeronet automagically, which I think is a *bad idea*, because of the use people like me are going to give to the mute option.\n\nEveryone will have their own criteria for muting others: Spam, porn,  fuck you motherfucker you deserve to die porn, long posts, too many posts, language one does not understand, ugly avatar and so on.\n\n\\#mute #muting",
			"date_added": 1486691801
		}
	],
	"post_like": {
		"1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp_1481848569": 1481854088,
		"1Q5jmQE4Jd9uTQrSc9fPoWpFp87JBgLFK3_1481903845": 1481912734,
		"1qA5PLyTTNtJjaK1zRz1fnyQMgiDpv5td_1482449482": 1482776324,
		"18NrcMdtcpfn5h4XcfQAfouCspstq1jcW6_1482865165": 1482888248,
		"1CR3B1Bwx6umZqL7H6hrbyPdXKJR7j8Mfn_1483209435": 1483495730,
		"18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1483726459": 1483733152,
		"16osdFmHgwgy9sgBws1po2zP5PxwMALvZa_1483868984": 1483887277,
		"18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1484070194": 1484070306,
		"1AfMv5MuNfa3BfmdsvGiHn9fnrEsCwxhhC_1484577538": 1484594048,
		"18VBc2ZtepiJ8efvcNBwZSPvsd6RtZkFgt_1484731023": 1484747339,
		"18d5Zv5xUX1PCJyuWV9RWJuQH25aKFQGMf_1484723304": 1484747400,
		"1AYyXGe2tuKtFpsC6ALa5qZx1vhnHpKUsz_1484791709": 1484919574,
		"1BveGph5Wo4D9orwp2FXiUeNKokommbB3c_1486305987": 1486307308,
		"18a6gNwuyrSufgW76tsgCtyHfJRmqmqnak_1486252343": 1486307781,
		"1BveGph5Wo4D9orwp2FXiUeNKokommbB3c_1486310524": 1486311437,
		"1DnhwsShChvDmLiG3hMnPHCgMj2nJbxG8J_1486980008": 1487008323,
		"18d5Zv5xUX1PCJyuWV9RWJuQH25aKFQGMf_1487194630": 1487210093
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "I didn't think anyone would read this, ehm, \"tweet\" :D\nI guess its easier to have visibility in ZeroNet than I initially thaught, which I find very interesting and encouraging.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1481472758",
			"date_added": 1481552512
		},
		{
			"comment_id": 2,
			"body": "Sorry, I meant ZeroMe, not ZeroTalk",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1481585160",
			"date_added": 1481585207
		},
		{
			"comment_id": 3,
			"body": "1. I do now...\n2. I am actually using ZeroMePlus, and still see a blocked user everywhere, that's why I posted this.\nUPDATE: 2. I had to check \"Mute Blacklist\", now it's working :D",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1481585160",
			"date_added": 1481635671
		},
		{
			"comment_id": 4,
			"body": "Yeah, that's what I thought. Anyway, I'll be running the server on a single machine and then use it remotely enabling the UI password plugin, and problem solved (right?)",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1481643413",
			"date_added": 1481652826
		},
		{
			"comment_id": 5,
			"body": "I think the responsiveness needs a little work in general...",
			"post_uri": "1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA_1481502888",
			"date_added": 1481652964
		},
		{
			"comment_id": 6,
			"body": "Hey!",
			"post_uri": "1PuEpLmGzwDtWzVn96wr8iyzyubM5YFQoX_1481626487",
			"date_added": 1481653081
		},
		{
			"comment_id": 7,
			"body": "@Th3B3st you need to enable a plugin in the server that adds a password to the dashboard, and then you can access it from another computer on the same LAN or even over the Internet if configured properly.\n\n[FAQ Zeronet](http://zeronet.readthedocs.io/en/latest/faq/)",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1481643413",
			"date_added": 1481653605
		},
		{
			"comment_id": 8,
			"body": "You can flag posts with thos buttons and then in the configuration menu you can check them to hide them or show them. it's pretty useful.",
			"post_uri": "1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA_1481650144",
			"date_added": 1481654683
		},
		{
			"comment_id": 9,
			"body": "I don't see what's bad with having the tools if you want to use them...",
			"post_uri": "1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA_1481650144",
			"date_added": 1481655005
		},
		{
			"comment_id": 10,
			"body": "Wou do you know what other users are blocking or censoring? I think you are generalizing in base or your own prejudices about other people.",
			"post_uri": "1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA_1481650144",
			"date_added": 1481656360
		},
		{
			"comment_id": 11,
			"body": "Is port 15441 opened? Maybe you need to manually redirect that port on your router to the machine running ZN.",
			"post_uri": "16osdFmHgwgy9sgBws1po2zP5PxwMALvZa_1481732993",
			"date_added": 1481733256
		},
		{
			"comment_id": 12,
			"body": "@Nofish thanks a lot ;)",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1481738544",
			"date_added": 1481766951
		},
		{
			"comment_id": 13,
			"body": "Agreed",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1481738088",
			"date_added": 1481767036
		},
		{
			"comment_id": 14,
			"body": "@Flyman: that's right ;)",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1481738544",
			"date_added": 1481818838
		},
		{
			"comment_id": 15,
			"body": "Signal has a chrome extension that works as a desktop client, but it needs a phone in order to verify your identity in SOME way. It's private, not anonymous.\nAbout Telegram, yeah, it's convenient, but actually, since Whatsapp now encrypts the messages using the Signal protocol, it's actually safer than Telegram. Telegram created it's own encryption, which is bad bad bad.\nTox and Ricochet are ok, only that nobody uses it and are a little harder to use than Signal.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1481828833",
			"date_added": 1481910963
		},
		{
			"comment_id": 16,
			"body": "Yes yes yes. Thank you.",
			"post_uri": "1Q5jmQE4Jd9uTQrSc9fPoWpFp87JBgLFK3_1481903845",
			"date_added": 1481912746
		},
		{
			"comment_id": 17,
			"body": "Para nada, te agradezco. No me tomé el trabajo de hacerlo yo mismo.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1481914447",
			"date_added": 1481926548
		},
		{
			"comment_id": 18,
			"body": "You mean markdown?",
			"post_uri": "13zWkqwCxJ9i7bbgBEW2D2HEoovzmgoivR_1481975038",
			"date_added": 1481987243
		},
		{
			"comment_id": 19,
			"body": "Corregido! Se me pasó.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1481937036",
			"date_added": 1482013499
		},
		{
			"comment_id": 20,
			"body": "Amateur self-taught wannabe pentester counts?",
			"post_uri": "1Hw29Ubsa8ER1BffmTP3m5NqMTqUZtH5JB_1481997469",
			"date_added": 1482013594
		},
		{
			"comment_id": 21,
			"body": "I am",
			"post_uri": "1KpzeuZ3d96iT2LyvgHXacwmrdsu5MgbVs_1482091268",
			"date_added": 1482096630
		},
		{
			"comment_id": 22,
			"body": "Are they made of antimatter or what?",
			"post_uri": "17Xo25emK8WXkrWouD5DsuLrcRnkrREfTa_1482145130",
			"date_added": 1482151854
		},
		{
			"comment_id": 23,
			"body": "Do you mean by using the \"manual\" method explained here? http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:3:How+to+have+a+blog+like+this",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1482152290",
			"date_added": 1482152830
		},
		{
			"comment_id": 24,
			"body": "Yay",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1482151961",
			"date_added": 1482152852
		},
		{
			"comment_id": 25,
			"body": "Ok. I created my blog very recently. I guess when new features are added nofish will explain how to make the update.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1482152290",
			"date_added": 1482153343
		},
		{
			"comment_id": 26,
			"body": "Well, in my case I got the response from Echobot, but I keep getting the response in my inbox even if I delete it many times. I guess the deletion is not updating...",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1482152693",
			"date_added": 1482154808
		},
		{
			"comment_id": 27,
			"body": "Everything you mentioned IS MADE OF CHEMICALS.",
			"post_uri": "17Xo25emK8WXkrWouD5DsuLrcRnkrREfTa_1482145130",
			"date_added": 1482180842
		},
		{
			"comment_id": 28,
			"body": "Well, there are better words to explain the idea without being plain nonsense...",
			"post_uri": "17Xo25emK8WXkrWouD5DsuLrcRnkrREfTa_1482145130",
			"date_added": 1482181591
		},
		{
			"comment_id": 29,
			"body": "@weakish: gotcha, thanks.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1482152290",
			"date_added": 1482235238
		},
		{
			"comment_id": 30,
			"body": "@weakish: ok, the icon is a little misleading them, but ok, makes sense.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1482152693",
			"date_added": 1482235306
		},
		{
			"comment_id": 31,
			"body": "It's about the Stuxnet worm, but the trailer smelled a little too like fear mongering. Not that it's a very serious issue, don't get me wrong, but the way it was portrayed in the trailer seemed a little anoying. Maybe because I'm more interested in the technical details and consequences, and not in all the WELCOME TO THE COLD WAR 2.0 stuff.\nI'll lgive it a try...",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1483402793",
			"date_added": 1483413294
		},
		{
			"comment_id": 32,
			"body": "Ok, I'm listening...",
			"post_uri": "15wgnZATbmpptpAx6PQgkUnNQZCBMMhCQs_1483452784",
			"date_added": 1483456175
		},
		{
			"comment_id": 33,
			"body": "@ks: wow, you're a good citizen XD",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1483466772",
			"date_added": 1483495325
		},
		{
			"comment_id": 34,
			"body": "We meet again Dr. Jones.",
			"post_uri": "1CR3B1Bwx6umZqL7H6hrbyPdXKJR7j8Mfn_1483480988",
			"date_added": 1483495715
		},
		{
			"comment_id": 35,
			"body": "Half-Life 2 probably...",
			"post_uri": "1CR3B1Bwx6umZqL7H6hrbyPdXKJR7j8Mfn_1483170122",
			"date_added": 1483495753
		},
		{
			"comment_id": 36,
			"body": "You forgot the #humor tag",
			"post_uri": "192RrVMsT8jyw5HqeoPkcoBzDyu1GTeQ3M_1483528930",
			"date_added": 1483556310
		},
		{
			"comment_id": 37,
			"body": "@Durand: I actually WAS expecting that to happen around that time, only that I had to leave for an hour, and when I came back all hell was loose. With Bitcoin you have to ve watching ALL THE TIME because it is still very unstable. Unstable is great for trading, but you can't take your eyes out for a minute...",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1483712097",
			"date_added": 1483712512
		},
		{
			"comment_id": 38,
			"body": "@ulrichard: Big asterisk on that *usually*",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1483712097",
			"date_added": 1483720001
		},
		{
			"comment_id": 39,
			"body": "He's virtual firewall is top notch, he's jumping from nodes to nodes. We're dealing with a professional here.\nENHANCE!",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1483726459",
			"date_added": 1483727745
		},
		{
			"comment_id": 40,
			"body": "@ks: just let me put my virtual reality gloves aaaand... I'M IN!",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1483726459",
			"date_added": 1483733042
		},
		{
			"comment_id": 41,
			"body": "@ks: ESC ESC ESC",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1483726459",
			"date_added": 1483733226
		},
		{
			"comment_id": 42,
			"body": "Can't wait until mobile phone manufacturers implement a \"feature\" that will make mesh networking impossible.",
			"post_uri": "16osdFmHgwgy9sgBws1po2zP5PxwMALvZa_1483868984",
			"date_added": 1483887274
		},
		{
			"comment_id": 43,
			"body": "Buenas",
			"post_uri": "1DunM8CUWAxBcf3RWvweEke85AMqhVoTUs_1483820871",
			"date_added": 1483887528
		},
		{
			"comment_id": 44,
			"body": "After 1 or 2 minutes of running with optimus my system freezes to death...",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1483907815",
			"date_added": 1483966213
		},
		{
			"comment_id": 45,
			"body": "I recommend you read the FAQ and use it. It's the best way to un derstand it.",
			"post_uri": "1AVKCwdRbgFB5U1pL5eeNKgM2Hbo2nuezd_1484067864",
			"date_added": 1484068837
		},
		{
			"comment_id": 46,
			"body": "@Ekodjtal: Yeah, that's kind of close, but I meant more like literally a clone, with upvote, downvote of posts and comments, and actual 'ZubReddits' (see what I did there ;) ?)",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1484070194",
			"date_added": 1484088397
		},
		{
			"comment_id": 47,
			"body": "This has been happening for a while, but 2016 was a really shitty year for security. On the other hand, I think 2017 is going to be the year of \"let's start caring for security\". It doesn't mean it's going to be enough. Probably it's going to be a lot of PR and publicity, but in the end some things are gonna stick.",
			"post_uri": "17tQX9J2fScN9APmweSUnzEU4EfTG1ojYb_1484075705",
			"date_added": 1484097112
		},
		{
			"comment_id": 48,
			"body": "@Emeraude: About the malware part, ZN will make almost impossible to stop the spreading of such malware. It's so easy to click on a ZN link, leave, and forget that now you are a peer that is also hosting and spreading that Zite.\nAnd about the blacklisting of users, I really miss that from ZeroMePlus. Some blocking feature should be available on every main ZN site. Some people say what's the point in having \"censorship\" in ZeroNet, and my answer is NOT to swallow any kind of shit anyone throws out there. It's not censorship, it's just a personal  customization. A place where no one can choose what not to see is a heaven for spam and advertizers > shit content.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1484096314",
			"date_added": 1484097430
		},
		{
			"comment_id": 49,
			"body": "@Durand: Yeah, maybe, but then the criteria on which that spam identifiers decide what is spam and what is not gets a little tricky. I think both solutions would be useful if everyone has the option to use one or the other or both.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1484096314",
			"date_added": 1484099029
		},
		{
			"comment_id": 50,
			"body": "@Durand: I don't know. What to some people is spam for others might not. People might just tag anything they don't like as spam, just like a downvote button and so on. My point is, make it optional, and don't try to decide what's good or bad for the user, let the users decide themselves, and let them also choose if they want to do it manually or want an algorythm do it for them.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1484096314",
			"date_added": 1484101117
		},
		{
			"comment_id": 51,
			"body": "@Facineroso: ¿vas a hacer eso con todo lo que publique en inglés? Es un poco irritante...",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1484096314",
			"date_added": 1484156442
		},
		{
			"comment_id": 52,
			"body": "@Jackofspades: http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj/1484306799",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1484347318",
			"date_added": 1484351362
		},
		{
			"comment_id": 53,
			"body": "No, just someone with too much free time and low self esteem looking for atention.",
			"post_uri": "1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci_1484396876",
			"date_added": 1484397626
		},
		{
			"comment_id": 54,
			"body": "Spam",
			"post_uri": "1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci_1484396838",
			"date_added": 1484397670
		},
		{
			"comment_id": 55,
			"body": "Spam",
			"post_uri": "1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci_1484396791",
			"date_added": 1484397674
		},
		{
			"comment_id": 56,
			"body": "Spam",
			"post_uri": "1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci_1484396121",
			"date_added": 1484397682
		},
		{
			"comment_id": 57,
			"body": "Spam",
			"post_uri": "1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci_1484396090",
			"date_added": 1484397686
		},
		{
			"comment_id": 58,
			"body": "Spam",
			"post_uri": "1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci_1484396049",
			"date_added": 1484397690
		},
		{
			"comment_id": 59,
			"body": "Spam",
			"post_uri": "1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci_1484395573",
			"date_added": 1484397694
		},
		{
			"comment_id": 60,
			"body": "Spam",
			"post_uri": "1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci_1484394705",
			"date_added": 1484397698
		},
		{
			"comment_id": 61,
			"body": "Spam",
			"post_uri": "1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci_1",
			"date_added": 1484397702
		},
		{
			"comment_id": 62,
			"body": "well, maybe it is a bot made by soneone with that description...",
			"post_uri": "1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci_1484396876",
			"date_added": 1484397782
		},
		{
			"comment_id": 63,
			"body": "#Spam",
			"post_uri": "1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci_1484397837",
			"date_added": 1484397841
		},
		{
			"comment_id": 64,
			"body": "#Spam",
			"post_uri": "1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci_1484397806",
			"date_added": 1484397845
		},
		{
			"comment_id": 65,
			"body": "#Spam",
			"post_uri": "1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci_1484397783",
			"date_added": 1484397849
		},
		{
			"comment_id": 66,
			"body": "#Spam",
			"post_uri": "1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci_1484396876",
			"date_added": 1484397855
		},
		{
			"comment_id": 67,
			"body": "#Spam",
			"post_uri": "1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci_1484397871",
			"date_added": 1484397869
		},
		{
			"comment_id": 68,
			"body": "Go away, spammer.",
			"post_uri": "1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci_1484397871",
			"date_added": 1484400029
		},
		{
			"comment_id": 69,
			"body": "Publicar capturas de pantalla como un robot es SPAM.\nProducí algo original, no escupas contenido basura como un robot si no querés que te llamen robot.",
			"post_uri": "1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci_1484396876",
			"date_added": 1484400595
		},
		{
			"comment_id": 70,
			"body": "@ks: I'm not following, but in no time the Everyone stream where I like to see what's new and who to follow will be impossible to use.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1484397981",
			"date_added": 1484400640
		},
		{
			"comment_id": 71,
			"body": "@Durand: ZeroMePlus is no longer under development and it already lacks other features that are available on ZeroMe.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1484397981",
			"date_added": 1484400679
		},
		{
			"comment_id": 72,
			"body": "But I guess I'll go back to ZeroMePlus anyway. I'm too old to tolerate spam.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1484397981",
			"date_added": 1484401071
		},
		{
			"comment_id": 73,
			"body": "@Noti0-News: O sea que robas las noticias de RT para que la gente debata en tu stream?",
			"post_uri": "1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci_1484396876",
			"date_added": 1484401257
		},
		{
			"comment_id": 74,
			"body": "@Durand: Improving ZeroMe would be great, but if we need an alternate client, I'm for it.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1484397981",
			"date_added": 1484403410
		},
		{
			"comment_id": 75,
			"body": "I end up spending most of my time on ZeroMe. I think it's the most active of the social sites.",
			"post_uri": "1CcxneoJY75e7CFFjXMHZmELraPBJmntsd_1484348984",
			"date_added": 1484408632
		},
		{
			"comment_id": 76,
			"body": "Estudié ingeniería en sistemas y licenciatura en ciencias de la computación. Abandoné ambas. ¿Qué dudas tenés?",
			"post_uri": "18EjLHTadBR6ci3XRWyMfsGeWVtXTR8xx_1484189226",
			"date_added": 1484410950
		},
		{
			"comment_id": 77,
			"body": "@Eibriel: thanks, that sounds ok, but I'm too old for this shit. \nYet I can wait for an \"official\" fix or feature. In the meantime I can wear my anti-troll armor and kick some spambot's ass ;)\nMaybe @durand might be interested in that piece of code...",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1484397981",
			"date_added": 1484437954
		},
		{
			"comment_id": 79,
			"body": "Varias razones. La primera vez abandoné Lic. en Cs. de la computación por frustración (matemáticas), la segunda vez abandoné Ing. en sistemas por cuestiones económicas (universidad privada) y la tercera, nuevamente Lic. en Cs. de la computación, por cuestiones personales (también estudié Lic. en Letras XD).\nCada persona es un cosmos. Yo tengo un perfil demasiado heterogéneo y mi destino es ser autodidacta. Me interesan demasiadas cosas distintas y me aburro muy rápido de lo que no me sirve o no me interesa, por eso la especialidad en algo puntual no es lo mio.\nNo estoy aconsejándote que hagas lo mismo, depende de cada uno. Lo que sí quiero mencionar con respecto a las carreras es:\n1- A veces quisiera tener un título universitario. Me hubiera abierto algunas puertas y facilitado otras, principalmente en cuanto a conseguir trabajo.\n2- La mayoría de la gente que conozco que estudió Ing. en Sistemas tiene un conocimiento muy limitado a lo que vieron en la facultad y en cuanto a cuestiones de trabajo, me dicen que no les sirvió para mucho (son opiniones). \nA corto plazo un título te va a facilitar un poco el camino. A largo plazo lo que importa es que seas sincero con vos mismo y decidas estudiar (en una carrera o por cuenta propia) algo que te guste y te interese. \nEntrar en una empresa no es la única forma de trabajar. Hoy en día el ser freelancer remoto (programador, diseñador web, soporte técnico, etc) está cada vez más difundido y además te da la posibilidad de tener clientes en otras partes del mundo en donde paguen mejor y valoren tu trabajo.\nEs un tema que da para largo. Espero que te sirva.",
			"post_uri": "18EjLHTadBR6ci3XRWyMfsGeWVtXTR8xx_1484189226",
			"date_added": 1484568555
		},
		{
			"comment_id": 80,
			"body": "@Juansantiago: no sé cómo escribir sarcásticamente en catalán.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1484747643",
			"date_added": 1484783173
		},
		{
			"comment_id": 81,
			"body": "@ks: Nope, not yet.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1485702633",
			"date_added": 1485968009
		},
		{
			"comment_id": 82,
			"body": "Test",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1485968439",
			"date_added": 1486045472
		},
		{
			"comment_id": 83,
			"body": "@Martinv: Damn it!",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1485968439",
			"date_added": 1486045480
		},
		{
			"comment_id": 84,
			"body": "Private keys are going to replace username and passwords stored on a centralized server in many cases, like in ZN.",
			"post_uri": "1BveGph5Wo4D9orwp2FXiUeNKokommbB3c_1486305987",
			"date_added": 1486307354
		},
		{
			"comment_id": 85,
			"body": "This is not a problem with Zeronet necesarily. You only need to find or create a zite that has moderation of some kind. What I mean is you CAN have a p2p network like the one you are talking about.",
			"post_uri": "1BveGph5Wo4D9orwp2FXiUeNKokommbB3c_1486305712",
			"date_added": 1486307435
		},
		{
			"comment_id": 86,
			"body": "Post something original and I might ;)",
			"post_uri": "13RamsLvfoBKUrP6Z3KR5UeRrVwfYrygiS_1486240987",
			"date_added": 1486307815
		},
		{
			"comment_id": 87,
			"body": "@Rebelb0y11: this is why it attracts all kinds of content that would be censored more easily by third parties in other types of networks, but it doesn't mean we can't have everything else too.",
			"post_uri": "1BveGph5Wo4D9orwp2FXiUeNKokommbB3c_1486305712",
			"date_added": 1486308568
		},
		{
			"comment_id": 88,
			"body": "@Rebelb0y11: ok, I might try this if no other solution appears. Any idea why this might have happened?",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1486307064",
			"date_added": 1486308788
		},
		{
			"comment_id": 89,
			"body": "@Rebelb0y11: it's a matter of time until that changes, and that's why I think zites need to be prepared for when that happens.",
			"post_uri": "1BveGph5Wo4D9orwp2FXiUeNKokommbB3c_1486305712",
			"date_added": 1486309394
		},
		{
			"comment_id": 90,
			"body": "@Dogman: In my country there is at least one place where people have made this (but with a gateway to access the Internet too).\nIt's in spanish, but you might find it interesting, try Google Translator:\nhttp://docs.altermundi.net/RedesMiniMaxi",
			"post_uri": "1BveGph5Wo4D9orwp2FXiUeNKokommbB3c_1486310524",
			"date_added": 1486311434
		},
		{
			"comment_id": 91,
			"body": "@Rebelb0y11: Nope, nothing. But I can post comments here, I don't know if it has something to do with the original creator of the post or with me...",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1486307064",
			"date_added": 1486311964
		},
		{
			"comment_id": 92,
			"body": "@Rebelb0y11: I CAN comment on other people's posts, but not in all of them, as you can see. I think that means some problem with hubs, as your solution suggests. I might give that a try if I keep having this problem.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1486307064",
			"date_added": 1486313255
		},
		{
			"comment_id": 93,
			"body": "YEEEEESSSS, I DID IT!!!!!!!!!!!!!!",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1486575436",
			"date_added": 1486678167
		},
		{
			"comment_id": 94,
			"body": "@urgeless: well, it's not open for registration (for now) It's just for me and my small company's crew :D",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1486575436",
			"date_added": 1486691967
		},
		{
			"comment_id": 95,
			"body": "@Eibriel: Well in that case we're safe, but I suspect maybe some traces of the muting process can be aquired from the hubs or something, but I'm just guessing.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1486691863",
			"date_added": 1486692141
		},
		{
			"comment_id": 96,
			"body": "I understand and share your concern. Yet I believe that we are facing a change in the rules of the game that we are not going to be able to stop.\nAnonimity, uncensorability and descentralized networks are here and they are never going away. Instead of trying to apply the same reasoning and rules of the \"clear web\" to networks like ZeroNet (there are others too) is just nonsensical. I agree and welcome this debate. I think we need to talk about this, but also we need to understand that evils like pedophilia exist in the real world and exist in the clear web too. In the clear web we have some ways of tracking and taking down that content, but at the same time those same tools are used every day to censor and persecute innocent people for political or economic reasons, so there is no perfect solution.\nLike they say in the Philosophy of Freenet page, for a democracy to be healthy, you need free speech, and to have free speech you need to have a place where people can be anonymous and where what they say cannot be censored. There is no good censorship. Censorship has always *somebody* who determines what is good and bad, and it can always be misused.\nI am interested to see how ZeroNet and other networks of the kind evolve and face this problems. I don't have the answer, but I know for sure that in the end we will strike some balance.",
			"post_uri": "1DnhwsShChvDmLiG3hMnPHCgMj2nJbxG8J_1486980008",
			"date_added": 1487008052
		},
		{
			"comment_id": 97,
			"body": "I think you don't fully understand how ZeroNet, censorship or the Human Race works.",
			"post_uri": "1DnhwsShChvDmLiG3hMnPHCgMj2nJbxG8J_1487019777",
			"date_added": 1487022398
		},
		{
			"comment_id": 98,
			"body": "@Nekololi: not even that. I'm sure there's already many forks and clones of the ZeroNet repository and anyone could continue it's development, and even if that is not the case, all the clients today would still keep running and creating new content.\nOnce it's out there, there is no going back. The only possible death to networks like ZeroNet is if *ALL* the clients go offline, and I'm afraid that is not very plausible to happen anytime soon.",
			"post_uri": "1DnhwsShChvDmLiG3hMnPHCgMj2nJbxG8J_1487019777",
			"date_added": 1487090059
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1qA5PLyTTNtJjaK1zRz1fnyQMgiDpv5td",
			"user_name": "Grae",
			"date_added": 1481552552
		},
		{
			"follow_id": 2,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN",
			"user_name": "Flyman",
			"date_added": 1481552761
		},
		{
			"follow_id": 4,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx",
			"user_name": "ks",
			"date_added": 1481592431
		},
		{
			"follow_id": 5,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1A2pTbDfU7P1JLSw3SZTiA1Lf7SRSu4Nn9",
			"user_name": "Callmypants",
			"date_added": 1481592506
		},
		{
			"follow_id": 6,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi",
			"user_name": "Eibriel",
			"date_added": 1481592711
		},
		{
			"follow_id": 7,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1ACc4pa2pJam33SkSE1zF1seF3LQKWR24v",
			"user_name": "Punkcoder",
			"date_added": 1481593263
		},
		{
			"follow_id": 8,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1G22SgXJtdx9D6BfvXgjknD57Mi1wjnZX3",
			"user_name": "Pablo Arroyo",
			"date_added": 1481593390
		},
		{
			"follow_id": 9,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "15ySnmVuP2xGCWGxfbDdpjQxajSndfkmyL",
			"user_name": "ku4rt4m",
			"date_added": 1481593460
		},
		{
			"follow_id": 10,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1KkA3C1iVDfieotYpuPUCpUtKzdFcfHMRy",
			"user_name": "cryp7ix",
			"date_added": 1481593719
		},
		{
			"follow_id": 12,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj",
			"user_name": "Nofish",
			"date_added": 1481646828
		},
		{
			"follow_id": 14,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA",
			"user_name": "Gremious",
			"date_added": 1481652976
		},
		{
			"follow_id": 16,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR",
			"user_name": "weakish",
			"date_added": 1481912699
		},
		{
			"follow_id": 17,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "19M1DT5vruSATEcbEczYRwCk2uPuLcATBa",
			"user_name": "Talnicrom",
			"date_added": 1481987403
		},
		{
			"follow_id": 18,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS",
			"user_name": "ZAlex",
			"date_added": 1482152879
		},
		{
			"follow_id": 19,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh",
			"user_name": "Kaffie",
			"date_added": 1482235171
		},
		{
			"follow_id": 20,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "13AvYD3hX888Ey6y8kFEce3Ak8hVNLcdrg",
			"user_name": "Dergatt",
			"date_added": 1482240341
		},
		{
			"follow_id": 21,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1JwPBvZYXLJzrA6YisjpsyTuuieFLCARS6",
			"user_name": "Emeraude",
			"date_added": 1482805611
		},
		{
			"follow_id": 22,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "17gYTAVrDNhJAH4RN6WXWXu4AqGwusNajG",
			"user_name": "Elena Zimmermann",
			"date_added": 1483495822
		},
		{
			"follow_id": 23,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "12aUNK5oaVy24PUFxevXvh63iDvVyncGHx",
			"user_name": "Durand",
			"date_added": 1483713177
		},
		{
			"follow_id": 25,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV",
			"user_name": "Mynameislegion",
			"date_added": 1483732476
		},
		{
			"follow_id": 26,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92",
			"user_name": "Fre3neT",
			"date_added": 1483797776
		},
		{
			"follow_id": 27,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1AYyXGe2tuKtFpsC6ALa5qZx1vhnHpKUsz",
			"user_name": "Zit",
			"date_added": 1483887416
		},
		{
			"follow_id": 28,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC",
			"user_name": "Firebox",
			"date_added": 1483887492
		},
		{
			"follow_id": 29,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1GucgDmfpJrHZmG6ukrM1Wjq5Cs6oXevzu",
			"user_name": "Xeers",
			"date_added": 1483908203
		},
		{
			"follow_id": 30,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "18EjLHTadBR6ci3XRWyMfsGeWVtXTR8xx",
			"user_name": "Thekiller66",
			"date_added": 1484410965
		},
		{
			"follow_id": 32,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "18VBc2ZtepiJ8efvcNBwZSPvsd6RtZkFgt",
			"user_name": "Blurredgerbil",
			"date_added": 1484747361
		},
		{
			"follow_id": 33,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1G2F1tV2cdZVDMsPWaVdENX6G9xhE3gnHE",
			"user_name": "Akku",
			"date_added": 1486046221
		},
		{
			"follow_id": 34,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1BveGph5Wo4D9orwp2FXiUeNKokommbB3c",
			"user_name": "Dogman",
			"date_added": 1486308579
		},
		{
			"follow_id": 35,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1CVh9d8ZZTapTPT7NZTYuM1yb3sHHfNafj",
			"user_name": "Lexvore",
			"date_added": 1486311628
		},
		{
			"follow_id": 37,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ",
			"user_name": "ulrichard",
			"date_added": 1487992571
		}
	],
	"settings": {
		"reverse_comment_order": true,
		"mute_ugly": false,
		"mute_spam": false,
		"mute_blocked": true
	},
	"blocked": [
		"1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp",
		"1BwGNVyjmbqbuofH5WbwHgPUBtxZBvLQ7K",
		"17zvGKq1Vft7Fp8HhqgD7rpqcGi5wDDSQ4",
		"1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci"
	],
	"flags": {},
	"comment_like": {
		"1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA_7": 1481652829,
		"16osdFmHgwgy9sgBws1po2zP5PxwMALvZa_3": 1481654530,
		"1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj_4": 1481766930,
		"1JwPBvZYXLJzrA6YisjpsyTuuieFLCARS6_2": 1481767031,
		"16osdFmHgwgy9sgBws1po2zP5PxwMALvZa_16": 1481827169,
		"1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92_1": 1481926531,
		"1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS_7": 1482152844,
		"1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR_10": 1482235251,
		"1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR_11": 1482235279,
		"1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS_9": 1482247712
	}
}