{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": 1,
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd": [
			{
				"comment_id": 1,
				"body": "> [warlock](#comment_40_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): To find out who rules over you, simply find out who you are not allowed to criticize. --Voltaire\n\n+1",
				"added": 1485000977
			}
		],
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": [
			{
				"comment_id": 2,
				"body": "Chorlton, Manchester, 1928\nA school-boy named O'Donnell was murdered on 1st or 2nd December, just before the Jewish feast of Chanucah, which commemorates the recovery of Jerusalem by the Maccabees.\nThe throat had been cut; the body was drained of blood; it was found on some waste ground and it was remarkable that there was no blood on the boy's clothes and hands. There was a pool of blood seven yards from the body. The wound was pronounced by experts as not being self-inflicted. A police witness said the body seemed to have been dragged along the grass; the Coroner suggested that someone had washed the boy's hands.\nThe police were completely baffled; it was certain that the work was not that of any maniac, but that the crime was premeditated, and was in fact, \"the perfect crime.\" The verdict at the inquest was an open one.\nThe affair was reported in The Times, 3rd, 4th and 6th December 1928, and in the early edition only of that of 23rd February, 1929; also in the Manchester Evening papers, 6th to 13th December, 1928.\nThe murder could not have been done on the spot where the body was found, since the boy's clothes and hands were not stained with blood, indicating that the boy must have been naked when the throat was cut; therefore, some blood was probably poured onto the ground a few yards away to mislead the detectives.\nRitual murders have several times been discovered by the fact that no blood has been found at the place where the corpse, bled white, has been recovered.",
				"added": 1485001128
			}
		]
	},
	"comment_vote": {
		"2_1148wCktvuDqVoncpvJMP7gAG8J7QMp5oh": 1,
		"2_1L2WRfy63ic4pcUe8r9paJpXrYNkoYNhCd": 1,
		"1_1Ff377LZT1D55MtsaidUHtuR4ZzmmecT8z": 1
	}
}