{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_1At4zensbxPGhXYbe5bnx9eGuE4V1vnbc8": 1,
		"2_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_1DqaWUpq6dRXfuXCokpjYoAkDj2nzZDnAn": 1,
		"1_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"2_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1,
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": 1,
		"1_1KLTeqiNMx1QNWTqBzJsjTQp112dDZPeqZ": 1,
		"1_1AQwGx5xyBi5Fvv9WHJFMCMNtQhUc8UhQF": 1,
		"1_1NU6gdra9qhUhdbYGLia1G3HYT87qUTA7w": 1,
		"1_12Xj1w5HYu6w5xtEwwLyEiMYGuCqvYKL2q": 1,
		"1_1E1fsmFRrsPsfiYVbXfifNMcaWwuk8iFcp": 1,
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1_19Z8aJ32x4pE2iGvVssPJazJgpGe5L32rq": [
			{
				"comment_id": 1,
				"body": "Wo is the racist ?\n\"The Jews are called human beings, but the non-Jews are not humans. They are beasts.\" (Jewish Talmud: Baba Mezia 114b)\n\"The Akum (Negro) is like a dog. Yes, the scripture teaches to honor the dog more than the Akum.\" (Jewish Talmud: Ereget Raschi Erod. 22 30)\n\"A pregnant non-Jew is no better than a pregnant animal.\" (Jewish Talmud: Coschen Hamischpat 405)\n\"Sexual intercoms between non-Jews is like intercourse between animals.\" (Sanhedrin 74b, Sanhedrin is the religious court for Jews)\n\"It is permitted to take the body and the life of a non-Jew.\" (Jewish Talmud: Sepher Ikkarim IIIc, 25)",
				"added": 1490636669
			}
		],
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": [
			{
				"comment_id": 2,
				"body": "The voluntary statement was made by the young Jewess Ben Noud who made it to the French Count Durfort-Civrac. The confessions were made by the following rabbis who truly converted to Christianity: Drach and Goschler, Fra Sifto of Siena, Paolo Medici, Giovanni da Feltre and by the former chief rabbi Neofito, who later changed his name to Teofito and became a monk. These men more or less confirmed the existence of Ritual Murder. In 1803 the former rabbi Neofito published a sensational book in the Moldavian language. In it he gives details about the terrible Jewish secret of the blood mystery. This book was translated in 1843 into Greek and later in 1883 into Italian, under the title \"Il sangue cristiano nei riti ebraici della moderna Sinagoga,\" causing the Jews to become very excited the world over.\n\nOn page 19 of this work the Jew Teofito confesses how he was initiated into the knowledge of Ritual Murder. And how the Jews for thousands of years have concealed it from the Christian and non-Jewish world. Teofito writes:\n\"This secret of the blood is not know to all the Jews, but only to the Chakam (doctors) or the rabbis and the scholars, who therefore carry the title ?Conservatori del mistero del sangue' (Conservators of the mystery of blood!). They pass it on by word of mouth to the Jewish fathers. They in turn reveal it to their sons who regard this as a great honor. At the same time they make terrible threats of punishment if one of them betrays this secret...\n\n\n\"Thereafter followed the curses and threats of punishment if I should ever reveal this secret to anyone, neither my mother nor my sister nor brothers or future wife; but only to one of my future sons who was the most wise, eager, and most suitable. In this way the secret shall be inherited from father to son until the farthest descendant.\"\nThis is a part of the monk and former Chief Rabbi Teofito's confession. From other confessions and admissions there is a remarkable agreement on the following points:\n\n1). The laws demand the Jews to butcher non-Jews from time to time. (The Laws of The Talmud and the Law of Human Sacrifice)\n2). The sacrifice shall take place chiefly:\na. At the Purim Festival\nb. At the Passover Festival\nIt is demanded of the Jews to butcher an adult Christian if possible, or a black non-Jew for the Purim and to butcher a child for the Passover. The child must not be over seven years old and must die in agony.\n3). The blood of the victims must be violently drained. It is to be used at Passover in wine and in the Massen (bread). What this means is that a small part of the blood is mixed into the dough and the wine. The procedure is to be performed by the Jewish father.\n4). The procedure takes place in the following manner: The father pours a few drops of fresh or dried and powdered blood into a glass, dips a finger of his left hand into it and sprinkles (blesses) everything which is on the table, saying: \"Dam Issardia chynim heroff Jsyn prech harbe hossen mashus pohorus.\" (Erod, VII, 12) Which translated is: \"We therefore beg God to send down the ten plagues upon all the enemies of the Jewish religion (This means the Christians. With this they dine and afterwards the father cries):\"Sfach, chaba, moscho kol hagoym!\" Which translated: \"Thus (like the child whose blood has been mixed in the bread and wine) may all Goyim burn in hell!\" (This wicked Jewish ritual is suspiciously similar to Christian Communion. In this the wine is taken in place of the blood and the bread as the body. What Christians do symbolically, the Jews do in reality: this is the unique difference. But it is like all Jewish teachings, it is the reverse of what is taught by God Almighty and the Lord Jesus Christ in the Bible).\n5). The ritual blood is also used other ways:\na. The young married couple is given a hard boiled egg which is seasoned with dried blood which has been pulverized.\nb. It is also given to pregnant women in the same way in order to ease their child birth.\nc. It is mixed with egg-white, put on a linen cloth and placed on the chest of dead Jews so that they will enter heaven without atonement.\nd. At circumcision powdered blood will be sprinkled on the wound so it will heal quickly.\ne. Dip fruits or vegetables into it and then eat them, (Schuldran arch Orach cajjim 158,4) or\nf. A dying or decrepit Jew can be saved with it. (Jore Deah 155,3)\nThe Jews have a superstition which originates from the Orient. They believe that old people can become younger by drinking the blood of young children.\n6). The remainder of the blood is preserved with the greatest of care by the local rabbis and sold in small bottles by appointed wandering Jews at neighboring synagogues. This same rabbi certifies that the blood is genuine pure Christian blood.\n7). The Ritual Murder and the Blood Mystery are acknowledge by all Talmudic Jews, and practiced whenever possible. The Jew believes that he will be \"atoned\" by it.",
				"added": 1490637365
			}
		]
	},
	"comment_vote": {}
}