{
	"next_comment_id": 58,
	"user_name": "Flyman",
	"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
	"post_like": {
		"1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB_1481655618": 1481711872,
		"18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1481738544": 1481795723,
		"18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1481825996": 1481873332,
		"18d5Zv5xUX1PCJyuWV9RWJuQH25aKFQGMf_1482052226": 1482059657,
		"16osdFmHgwgy9sgBws1po2zP5PxwMALvZa_1482592432": 1483111443,
		"18d5Zv5xUX1PCJyuWV9RWJuQH25aKFQGMf_1483178023": 1483184118,
		"1PWfDicbFhYs196zg9tsiNMA9utxik9jJB_1487427918": 1487432668,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1488996787": 1489143143,
		"1JpWmfyZFm8k2BYTCvUNTzAmrDhkHjKRKT_1489472541": 1489481380,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1489822440": 1489822534,
		"17tQX9J2fScN9APmweSUnzEU4EfTG1ojYb_1489855338": 1489913280,
		"1L8waPPVatA855bU6SjqWs2K1DbwnUZbEp_1490597040": 1490604578,
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1490677441": 1490684102,
		"1tsN2NZ2odhDRXK6gwDHxWV87UH4dk6bx_1490658977": 1490684813,
		"15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1490920951": 1490945061,
		"17LS9KpShAY7QM9kcHoDGkcZCFNbnkwrCq_1491167345": 1491204837,
		"17LS9KpShAY7QM9kcHoDGkcZCFNbnkwrCq_1491094090": 1491204914,
		"17LS9KpShAY7QM9kcHoDGkcZCFNbnkwrCq_1491093728": 1491204941,
		"17LS9KpShAY7QM9kcHoDGkcZCFNbnkwrCq_1491093596": 1491204966,
		"15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1491208160": 1491379477,
		"15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1491894886": 1491898374,
		"15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1491899732": 1492186746
	},
	"comment": [
		{
			"comment_id": 1,
			"body": ".1. You can't be sure nobody is going to read stuff you write. So writing stuff can be used to figure out will or will not somebody read your stuff.\n.2. Writing stuff is a skill. More you doing it, more trained you become. Especially when you writing stuff in foreign language. And it doesn't relative to fact somebody will read it or not. :-]\n.3. Writing stuff is fun. You can learn better about things you think you know. Some times you try to write stuff about something and !BANG! - you realize you actually do not understand good enough this subject you trying to write about.\nP.S. So go for it. Write some stuff even if you think nobody is going to read.",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1481472758",
			"date_added": 1481534258
		},
		{
			"comment_id": 2,
			"body": ".1. Do you know you can edit/delete your posts? Just move cursor around your avatar to get pencil sign, click it to get options.\n.2. Do you know about ZeroMePlus? You can add/remove people to/from blacklist there. http://127.0.0.1:43110/1Lj1oPcN7oZQL8HkS5KbkzQuKqs42zQWY6/",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1481585160",
			"date_added": 1481614738
		},
		{
			"comment_id": 3,
			"body": "is that so? Is having zeronet site equals having bitcoin wallet?",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1481738544",
			"date_added": 1481795823
		},
		{
			"comment_id": 4,
			"body": "what type of picture you trying to use? I made 128x128 bmp picture, then converted it into jpg. It worked for me.",
			"post_uri": "1Q5jmQE4Jd9uTQrSc9fPoWpFp87JBgLFK3_1481903039",
			"date_added": 1481972052
		},
		{
			"comment_id": 5,
			"body": "@Piskel: did you try to \"refresh\" ZeroMe page or whole ZeroNet (by stopping and then start it?). I do not know what else... maybe try to clic \"update\" on ZeroHello at buttons of ZeroMe/ZeroMePlus sites.  Interesting things happens. For me there was one day, I couldn't see anything on ZeroMe (or was it ZeroMe+?), as if my ID didn't exist. I didn't do anything and next day this problem was gone. Maybe try tomorrow do same things you tried today and it will work.",
			"post_uri": "1Q5jmQE4Jd9uTQrSc9fPoWpFp87JBgLFK3_1481903039",
			"date_added": 1481981802
		},
		{
			"comment_id": 6,
			"body": "Где?",
			"post_uri": "12WQDNaLtaBR35Fe3aZ3Ks3ZW8E8oix4eF_1",
			"date_added": 1483108655
		},
		{
			"comment_id": 7,
			"body": "Use \"Everyone mode\" to see posts from everyone. \"Following\" mode doesn't work for me. I still can't see post from people I follow that way. Maybe you experience same bug. So click on \"Everyone\".",
			"post_uri": "1AGVA4J3Gq43u4pdudot73SxDuy1yabzjU_1482892827",
			"date_added": 1483109221
		},
		{
			"comment_id": 8,
			"body": "@橙色名字: Use ZeroMePlus. It has it, but it has no picture feature, so I use them both.",
			"post_uri": "19BHxREFyyDejQPMrmhz2FgE2djzjWSLgm_1482877885",
			"date_added": 1483109340
		},
		{
			"comment_id": 9,
			"body": "You will reach your limit that way soon. :-] It's about 100Kb.",
			"post_uri": "1PvAednzaMJiuMz1SD5wF3m3Hx7SK75zHv_1482685344",
			"date_added": 1483110525
		},
		{
			"comment_id": 10,
			"body": "I'm Flyman, just Flyman. :-] Ohh, ZeroMePlus shows no pictures. Nice picture! :-]",
			"post_uri": "18d5Zv5xUX1PCJyuWV9RWJuQH25aKFQGMf_1483178023",
			"date_added": 1483183239
		},
		{
			"comment_id": 11,
			"body": "In clearnet I can't easily make my own web site. In Zero I can, and I did. It is glitchy for now, but it's just because I am not experienced in html/css/whatever. And it is very hard to ban it.",
			"post_uri": "1CR3B1Bwx6umZqL7H6hrbyPdXKJR7j8Mfn_1483176326",
			"date_added": 1483183659
		},
		{
			"comment_id": 12,
			"body": "Now I playing again \"ChuChuRocket\" (Gba) and \"Monstania\" (Snes). Recently I found and was playing \"Henry\" (Atari). I have seen \"Henri\" about 25 years ago on machine in entertainment center. Few months ago I found name of this game, downloaded and enjoyed very much playing it.",
			"post_uri": "1CR3B1Bwx6umZqL7H6hrbyPdXKJR7j8Mfn_1483170122",
			"date_added": 1483184633
		},
		{
			"comment_id": 13,
			"body": "@Ebanator: looking at your name and smiling very widely. :-]",
			"post_uri": "1B4mGfgJm7xyFCRyaUbLSUwBKxKZRiyb6Q_1480466021",
			"date_added": 1483194205
		},
		{
			"comment_id": 14,
			"body": "Go for it, you can do it! Here is first comment for you. :-]",
			"post_uri": "1MeWAokNjdMJQNU6JGCBRVEuStt9i7ynwa_1483269011",
			"date_added": 1483270413
		},
		{
			"comment_id": 15,
			"body": "How could you met some guy if he wasn't there at time you met him? Are you achron? Can you see different variants of same \"present\" time? Or you talking about perception of parallel universes, maybe?",
			"post_uri": "12xuek61U3dS3fTneDn7h6mTEWdeA5Nfgn_1483617210",
			"date_added": 1483621518
		},
		{
			"comment_id": 16,
			"body": "One of my favorite ways of humiliation is to say \"My grandma does this better than you!\". It works in many cases, but I think I just found case where this method fails. :-] Imagine you say this after having sex. It backfires on you. Wha-ha-ha!\nP.S. Oh, I want to post this as a joke...",
			"post_uri": "192RrVMsT8jyw5HqeoPkcoBzDyu1GTeQ3M_1483605899",
			"date_added": 1483622302
		},
		{
			"comment_id": 17,
			"body": "Be sure you tried \"everyone\" mode to see posts from everyone.",
			"post_uri": "1CR3B1Bwx6umZqL7H6hrbyPdXKJR7j8Mfn_1483480988",
			"date_added": 1483626056
		},
		{
			"comment_id": 18,
			"body": "You will never get warnings like \"You can't read your main because special agent currently is not present on his work place to watch over you!\". Because (Because I'm Batm... wrong thought process) it is p2p/encrypted/etc/blablabla. :-]",
			"post_uri": "1MT8mV16KRehARLL4iayCR5XXq2hczayiW_1484142293",
			"date_added": 1484145255
		},
		{
			"comment_id": 19,
			"body": "Try this: http://127.0.0.1:43110/zerosearch.bit/",
			"post_uri": "12i3YHUHEQg24zGPuXupBoezyaYMbCXYYU_1485024780",
			"date_added": 1485029231
		},
		{
			"comment_id": 20,
			"body": "@Lazyguy: Try to refresh zero hello page (main zeronet page), there is some search there in case someone mentioned you recently (you can mention yourself if you need).",
			"post_uri": "12i3YHUHEQg24zGPuXupBoezyaYMbCXYYU_1485029751",
			"date_added": 1485030813
		},
		{
			"comment_id": 21,
			"body": "Yes, I am one of them! :-]",
			"post_uri": "1HRnhpg4tdCn6PtjbwdbrDKyvXQizPeLCn_1488731263",
			"date_added": 1488793954
		},
		{
			"comment_id": 22,
			"body": ".1. You can create zerosite (web cite on ZeroNet) and ask some of your friends to support this zerosite. And this zerosite can contain any files you want. At least one seeding friend will be enough to restore your site (with all you backup(s)) in case of some disaster.\n.2. Another way I like is to ask some friends to use with you BTSynch or similar soft to synchronize specific folder.",
			"post_uri": "1Mzjg3DjFFiUBz42zZa9w9oM2Lf4vHeLK3_1489066819",
			"date_added": 1489141505
		},
		{
			"comment_id": 23,
			"body": "You forgot to mention ZeroNet still works even if disconnect (form internet) is happened. First time it tricked me. It is no difference, except zites are not updating. You can even post something and it will start to propagate to other people when your internet connection is on again.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1488996787",
			"date_added": 1489143316
		},
		{
			"comment_id": 24,
			"body": "And being happy makes me go and read something. :-]",
			"post_uri": "1JpWmfyZFm8k2BYTCvUNTzAmrDhkHjKRKT_1489472541",
			"date_added": 1489481372
		},
		{
			"comment_id": 25,
			"body": "Slap. I wish I could deal with all of those zombie-people (who trouble me) that way. :-] But I am not powerful enough (at least for now), so I use \"ignoring\" skill, it works well for me.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1489822440",
			"date_added": 1489822809
		},
		{
			"comment_id": 26,
			"body": "Someone told me (and showed me, but I am not sure about it because it was long time ago) there is \"emulator\" of life cells written in life game. You can call it \"meta life\". You need check status of cells every about 100 generations.",
			"post_uri": "17tQX9J2fScN9APmweSUnzEU4EfTG1ojYb_1489855338",
			"date_added": 1489913496
		},
		{
			"comment_id": 27,
			"body": "why fight for what is potentially dead already (for example, usual internet), lets build something new which is uses different technology (for example, p2p zeronet) which is much harder to \"compromise\". And what can be compromised, lets think it is compromised already!",
			"post_uri": "18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y_1490285129",
			"date_added": 1490346832
		},
		{
			"comment_id": 28,
			"body": "They like spermatozoids: millions live for few days, and only one survives to live little longer. :-]",
			"post_uri": "1L8waPPVatA855bU6SjqWs2K1DbwnUZbEp_1490597040",
			"date_added": 1490604512
		},
		{
			"comment_id": 29,
			"body": "YouTube must die! Err... correction (construction \"op1 must op2\" is macro for \"someone wants op1 to op2\"): I want YouTube to die! ...Oh, that sounds better. :-]",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1490677441",
			"date_added": 1490684278
		},
		{
			"comment_id": 30,
			"body": "Hi! Unleash your fury upon all who will dare to follow you! :-]",
			"post_uri": "1M4nWY25xvYBMQVBr8wnjf88qbUntxpGT8_1490664148",
			"date_added": 1490684485
		},
		{
			"comment_id": 31,
			"body": "I already provoked (or invoked) discussion on that topic. Go check for yourself: http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN/1483362547",
			"post_uri": "1tsN2NZ2odhDRXK6gwDHxWV87UH4dk6bx_1490658977",
			"date_added": 1490684810
		},
		{
			"comment_id": 32,
			"body": "@Styromaniac: do you mean this? https://youtu.be/zfBG0d5Oj3c",
			"post_uri": "1tsN2NZ2odhDRXK6gwDHxWV87UH4dk6bx_1490658977",
			"date_added": 1490685214
		},
		{
			"comment_id": 33,
			"body": "Another way to follow yourself: https://youtu.be/Yy3Rz2tfKzY?t=245",
			"post_uri": "1tsN2NZ2odhDRXK6gwDHxWV87UH4dk6bx_1490658977",
			"date_added": 1490690101
		},
		{
			"comment_id": 34,
			"body": "Are you a robot?",
			"post_uri": "15dUSMQUxi86Bpzi8hWFA3v7kMMkvEQVK2_1490929149",
			"date_added": 1490944936
		},
		{
			"comment_id": 35,
			"body": "I do not know about masons, but I do believe there is some group of people which is parasitizes on stupidity of most people. And somehow (secretly, cowardly, e.t.c) rules whole world, feeding whole world bullshit. So, emotional state you're expressing now, is resonating in me. I do not know who THEY are (aliens, masons, mages, spirits), but hell yes! We will not be afraid! I'm 50% serious!",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1490920951",
			"date_added": 1490945530
		},
		{
			"comment_id": 36,
			"body": "I strongly do not like censorship in any variation.",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1490910974",
			"date_added": 1490946098
		},
		{
			"comment_id": 37,
			"body": "@Nicholas Scourgefury: mmm... resisting manipulators... it is one of vaforite themes for my paranoidal part. Do you know something interesting to read? Here is some \"magical\" questions I using last years. You can ask yourself multiple times in different situations: \"What is purpose of this action?\", \"Who wants me to do this?\". If you can't answer yourself, then something suspicious is going on. And answers which starts from word \"because\" is bullshit. If you doing something because bla-bla-bla, good chances your are zombie. If you doing something to (or for) bla-bla-bla it is a good sign.\nI think it is good to have some set of simple rules to be more resistant to manipulators. To be aware. Where are those mental technics to recognise typical patterns **they** use?",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1490931381",
			"date_added": 1490947479
		},
		{
			"comment_id": 38,
			"body": "Oh, you just explained for me, why I do not like when some of my friends use words \"good luck\" as good bye. I didn't understand why I feel something wrong about it. :-]",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1490917500",
			"date_added": 1490948068
		},
		{
			"comment_id": 39,
			"body": "@Nicholas_Scourgefury: .1. double bind - I know about this technic. But \"double bind\" is good name for it, I didn't know. I was naming it \"schizophrenization\" or \"neurotization\", but these words are too general. It is always good to learn really good label for something, thanks.\n.2. People I call \"manipulators\" often try to use these two patterns. If they wand something from you, they rarely tell you directly, at first they try to: 1) blame you in something, awaiting from you reaction of \"guilt feeling person\" and/or 2) remove you from your stabilized/calm/cool emotional state into something unbalanced and/or negative and use it to empower pattern n1: blame you you're not calm now. Oh and 3rd thing: they will devaluate thing they want from you (It is not hard for you, it is not big deal).\nSo I think \"be calm as long as you can\" skill is very important. And when it works it makes you feel great! Some time some people want something from me, and it is very funny how angry they become when they fail to \"dispell\" my calmness. It is like some people can't ask you something unless you are not calm. And if they fail to do 1st part they not event try to do 2nd. :-]",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1490931381",
			"date_added": 1491035694
		},
		{
			"comment_id": 40,
			"body": "@Monday: Yes, I found it interesting. Nice lecture. Just watched it from start to end. \"Everything you do, you do by standing on the shoulders of giants, or big pile of dwarfs - it works either way\" :-]. Yes, \"mind virus detection\" idea is good.\nP.S. does he looks like Sheldon Cooper at \"Big Bang Theory\" tv-show?",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1490931381",
			"date_added": 1491040895
		},
		{
			"comment_id": 41,
			"body": "@Mynameislegion: thank you for the link. I am currently in a mood to watch some long lectures or long documental movies. https://www.youtube.com/playlist?list=PLWndNqsVs3R4IIJdSxWULGjrJQl-F1vUn is link to \"Century of The Self\" on Youtube. I'm about to watch 1st of 4 part.",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1490931381",
			"date_added": 1491041362
		},
		{
			"comment_id": 42,
			"body": "@Mynameislegion: Nice documental, thanks. I enjoyed those black`n`white videos from deep past. Do not need magnet link, since all can be easily found on Youtube and can be downloaded by \"ss\" method. :-] Although this film is little boring for me (about ten years ago I hated historical films), in the present day it looks like I can enjoy such kind of films. I plan to watch other parts somewhere in next days.",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1490931381",
			"date_added": 1491046010
		},
		{
			"comment_id": 43,
			"body": "@Plasmmer: about 50% serious. Every good joke is based on reality. And every good serious thing can be interpreted as a joke. Here is foundational principle \"fun is learn, learn is fun\", fun and learn is the same thing or two sides of same coin. 50% serious, 50% joke. 50% learn, 50% fun. The glass is filled at 50% or glass is 50% empty.",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1490920951",
			"date_added": 1491046632
		},
		{
			"comment_id": 44,
			"body": "@Plasmmer: it looks like idiots in power gather this power from huge pile of idiots without power. But I do not know about exact mechanism how stupid masses \"empower\" \"idiots in power\". I think if critical mass of people will be cured from stupidity (or \"mind viruses\", or whatever), they automatically stop feeding \"idiots in power\" end last ones will extinct in short period of time. It is hard to distinguish politics from patients of mental hospital. And really smart people are labeled \"nerds\" as something disgusting by \"stupid masses\". Hey, stupid masses, I want you to love nerds instead of politicians. :-]",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1490910974",
			"date_added": 1491047590
		},
		{
			"comment_id": 45,
			"body": "I'm using ZeroMe+ from time it was created. Because in ZeroMe (not plus) \"following\" doesn't work for me. In other words, I can't see only posts from guys I follow, it shows only my posts in that mode. And I can not \"unfollow\" using ZeroMe. As if it thinks I am following no one. Strange, isn't it?",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1491208160",
			"date_added": 1491379761
		},
		{
			"comment_id": 46,
			"body": "Psychological projection... I observe this phenomenon a lot. And it is tricky to be aware of it inside myself. Here is a trick. Pay attention when something in other people triggers activation of negative emotion inside you, especially when they don't do something that harms you or your stuff. Maybe you do the same thing, but ego protection mind mechanism hides that from your awareness!\nP.S. \"Blame shifting\" - nice label. First they do projection, then they blame you in something that is more applicable to them than to you. So it is two step \"distorted self blaming\" which is pretending to be \"blaming somebody\" through \"projection\". :-]",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1491367755",
			"date_added": 1491381375
		},
		{
			"comment_id": 47,
			"body": "@Styromaniac: that is kind about me. :-] I am quite social to my friends, and can be antisocial to people I do not know. It reminded me one episode in my life. Some old woman at bus stop asked me something like \"how do I get to --input_some_place_here--?\" But I didn't like a tone of her voice, as if I owned to her something, or if I have contract with her to be city guide, or as if she was a queen and I was filth. :-] So I decided to act as if she doesn't exist. She started to say something angry, and in the and she told me \"You are rude talker\" (I didn't say a word!). Oh, how happy I was. But that was antisocial behaviour. :-]",
			"post_uri": "17LS9KpShAY7QM9kcHoDGkcZCFNbnkwrCq_1491363527",
			"date_added": 1491385029
		},
		{
			"comment_id": 48,
			"body": "I do not want to become ant and eat slugs! :-[",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1491854863",
			"date_added": 1491894249
		},
		{
			"comment_id": 49,
			"body": "@Plasmmer: \"You think I got my attention\"... Mmm... It doesn't compute. I always have attention of myself. Or do you mean I got someone's attention, and I can consider this attention as my own... Brrr... it's too sophisticated.",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1491854863",
			"date_added": 1491897629
		},
		{
			"comment_id": 50,
			"body": "Understand word \"understanding\". It means \"standing under\". It is better not to stand under some heavy weight (like at some construction site). Fun is Learn. Learn is Fun. Same with understanding and joking. Great idea, thanks.",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1491894886",
			"date_added": 1491898193
		},
		{
			"comment_id": 51,
			"body": "I am one of them, I have not realized that here is not Facebook. I do not even know what is Facebook. And I do not want to know. You can mute me if you want.",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1491899174",
			"date_added": 1491899119
		},
		{
			"comment_id": 52,
			"body": "That is true. I am psychopath and I do use philosophy as a weapon. Oh, thanks, you reminded me one huge red flag of stupidity. I'm on kind of quest to gather red flags of stupidity.",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1491899433",
			"date_added": 1491899375
		},
		{
			"comment_id": 53,
			"body": "\"Fools ignore\". From my experience it is something quite opposite. It is more like \"Fools can't ignore\". To do something it is better to shut you off from as many distractions as you can, meaning \"ignoring\" things. In other words, to do one things you need to ignore other things.\n\"Sages ask\". For me it looks like \"Sages observe\". I am not sage, but often fun thing happens: I am about to ask a question, then I decide to think about 1 minute, then someone from my environment tells something that is answer to my question, so there is no need to ask anymore. :-]\n\"Geniuses guess\"... no associations for now, that worth to mention... oh, wait. Here is one just popped. I am guess a lot, but I'm not genius.",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1491899732",
			"date_added": 1491903137
		},
		{
			"comment_id": 54,
			"body": "All things people do, they do to fulfil principle \"do whatever you want\". And whole life is \"falling to the abyss\". And it is ongoing process (it is highly unlikely it will ever stop).",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1491900491",
			"date_added": 1491903426
		},
		{
			"comment_id": 55,
			"body": "Persona 3 quotes (few letters are changed): \"Give me a sec. I'll analyze the target\". \"Flyman, it has a multiple weaknesses. Use mute skill!\". \"Good job, everyone\".",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1491901454",
			"date_added": 1491903905
		},
		{
			"comment_id": 56,
			"body": "I was thinking about that. Here what came to mind.\n\"Fools - ignore them\". Paying attention to fools is waste of time and other precious resources.\n\"Sages - ask them\". They supposed to be wise, so they might be able to answer some questions that seem difficult for you.\n\"Geniuses - you need to guess\". Because it is hard to distinguish genius from insane person. So you have to guess.\n...or something like that.",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1491899732",
			"date_added": 1492186737
		},
		{
			"comment_id": 57,
			"body": "I think it can be useful for you. I do it myself. I review my most old posts (jokes, questions, youtube links, e.t.c), some of them I copypaste to some better place, then I delete them (posts) from ZeroMe. Oh, and you can check limit size and how much you used it by going to your hub's page, sliding \"0\" in top right corner, and seek line \"IDENTITY ADDRESS limit used: 159.00k of 329.00k\".",
			"post_uri": "15XeFY67fYKCKxQPfeo246ELto2Gff1hAe_1492586215",
			"date_added": 1492587189
		}
	],
	"flags": {},
	"comment_like": {}
}