{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "ZeroMail 1 File Update Failed",
			"body": "I receive always the error 1 file update failed on ZeroMail. I'm the only with this issue?",
			"added": 1469315737
		},
		{
			"topic_id": 2,
			"title": "ZeroNet Search Engines",
			"body": "If you know any ZeroNet search engine. Reply with the link. Thank you!",
			"added": 1469365690
		},
		{
			"topic_id": 3,
			"title": "Gender statistic. How many women and girls here?",
			"body": "Often newspaper speak about how low is the number of women that work in technology sector compared to men accusing companies of some sexist discrimination. But according to me(and not only me) the reason is there are WAY LESS geek girls that loves technology and innovation due to some intrinsic difference in the approach to some matters.\nSo an innovative place as ZeroNet where everyone can access freely without any registration, can be the good place to confirm or contradict this theory. Post your gender.",
			"added": 1469380532
		},
		{
			"topic_id": 4,
			"title": "We need a reputation system",
			"body": "I think that we need a reputation system to allow the users to give a good or bad reputation to some zite and users, with a feature that allow everyone to decide to filter bad users and bad 0-websites from lists and discussions. This would avoid that all the shit can ruin the user experience since many people can abuse of the non-censorship policy.\n\nA reputation system is NOT a censorship and cannot be abused to censor contents. Everyone would be free to see whatever he wants despite bad reputation if he wish, and users that want to filter bad reputation contents are free to filter them according their personal settings. I'm not talking about publishing only approved contents or remove them from ZeroNet, what I'm saying is giving an option to the community to democratically classify them that is a totally different thing and can opens the doors also to decentralized ZeroNet e-stores and activities otherwise at high scam risk.\n",
			"added": 1469400390
		}
	],
	"topic_vote": {
		"1_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1
	},
	"next_comment_id": 24,
	"comment": {
		"1_1HSYZBuHU5DifpWgGBsZMf5km2VF31wpfs": [
			{
				"comment_id": 1,
				"body": "Siamo ovunque. Ma usa l'inglese visto che siamo in un forum internazionale :D",
				"added": 1469375971
			}
		],
		"4_1HDGK4rrMzuouF8hNnxfMNpWyR8qAtP4HR": [
			{
				"comment_id": 2,
				"body": "Ethereum is the most overrated cryptocurrency project ever",
				"added": 1469379737
			}
		],
		"3_1BFTNXtYQDMCurqyg45KLmsV6oJD7bQSsH": [
			{
				"comment_id": 3,
				"body": "I don't see any pool option in ZeroTalk> [ks](#comment_138_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): You should make a poll.",
				"added": 1469386438
			},
			{
				"comment_id": 4,
				"body": "If I click on the word pool I'm redirect to another page that doesn't show anything> [ks](#comment_139_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): Did you try to click the word poll?",
				"added": 1469387299
			},
			{
				"comment_id": 5,
				"body": "I get a dark grey empty page> [ks](#comment_140_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): Really? I'm taken to http://127.0.0.1:43110/ZeroPolls.bit/ where I can create polls.",
				"added": 1469387686
			},
			{
				"comment_id": 6,
				"body": "My javascript and my browser are ok.> [ks](#comment_142_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): Look at this pic: https://ipfs.pics/QmdhJxCT1EJrb3ZaQ63XZbyx4qzRfvHmxkCd64Z4kyZcpR",
				"added": 1469389111
			}
		],
		"4_1BFTNXtYQDMCurqyg45KLmsV6oJD7bQSsH": [
			{
				"comment_id": 7,
				"body": "I mean a simple switch that hides the users with a bad reputation, so if someone want to see all is free to do it otherwise you can avoid to see shitty contents. Now to know if some content is good or bad you are forced to open the site (and\\or download it  before in case of shared media). If some bastard pervert put child porn movies or similar contents I don''t want to see his crap when I surf in ZeroNet. > [bon](#comment_4_1CZhapKybCk4VkGiSso1YzXZd1oG5C3oAw): What do you mean by \"filter bad users\". If you don't agree with some content can you be content with not looking at it?",
				"added": 1469407267
			},
			{
				"comment_id": 8,
				"body": "A reputation system is NOT a censorship and cannot be abused to censor contents. Everyone would be free to see whatever he want despite bad reputation if he wish, and users that want to filter bad reputation contents are free to filter them according their personal settings. I'm not talking about publishing only approved contents or remove them from ZeroNet, what I'm saying is giving an option to the community to democratically classify them that is a totally different thing.\n",
				"added": 1469413289
			},
			{
				"comment_id": 10,
				"body": "reputation doesn't mean centralization or censorship. You seem a bit confused about the meanings of these terms.> [creator](#comment_3_12MydFwy7wYEPvxC5j3oQnp2zoqkdxLJzj): Decentralized and No Censorship means DECENTRALIZED, NO CENSORSHIP.Having a so called “reputation” system is Centralising, creating a heirarchy which is the opposite of Decentralized. It ultimately leads to censorship!Fuck Censorship!",
				"added": 1470440470
			},
			{
				"comment_id": 11,
				"body": "You don't like to discuss but you are here to write your crap and insult like a frustrated kid. With a reputation system people can see the low level of people like you giving a look to feedback assigned by others users and freely decide to not waste time to pay you any attention. There are no cons. > [pyschopomp](#comment_17_1D7uESYtAKV36MVPGJZXuE7LUKbLwfo4dX): Hahaha, same faggotry all ove again. This IS NOT reddit.If you don't like something, just walk away. Don't be an idiot",
				"added": 1470785437
			},
			{
				"comment_id": 12,
				"body": "There are tons of ways to implement a reputation system also in a decentralized network, ignorant. People like you that like disturb discussions screaming and insult other users when are hidden by a nickname in real life are frustrated pussy with erection problems that poop in their pants. > [rkshow](#comment_4_1HvZzixBMnPehyouwx83zNYK3E97MrUVxS): to all the homos, that want reputation system, please open you butt hole and slid in your finger inside while you exit ZeroNET.  the developers already said NO to reputation systems.",
				"added": 1470953657
			},
			{
				"comment_id": 14,
				"body": "@pyschopomp I have already explained the many reasons why a reputation system is very important, If you aren't able to understand them, just leave this discussion and don't waste kb to post senseless comment. Go with other pedophiles, shitty commenters and scammers that know that with a reputation system will be immediately ignored.",
				"added": 1471003155
			},
			{
				"comment_id": 15,
				"body": "> [teszt](#comment_27_1AdcxsExVKvxffQtEd72E5tckouzZHLEYC): A reputation system is not necessary to view sites or create sites but could be used for payments in a ZN extension with online bazar functionality or commentary permissions on specific sites.\n> \n> But no user should be put on a centralized blacklist.\n> Reputation should be on a voluntary basis for those who wish it.\n> Anonymity should be preserved.\n> \n> Possible solutions:\n> \n> weighted Namecoin identity(deposited Namecoins on a specific address given in a Namecoin id/user namespace) - higher amount - higher reputation\n> donation for ZN development- higher amount - higher reputation\n> combination of the above\n\nIsn't need any centralized system to implement a reputation system. The reputation could be implemented using a blochchain but must not depend on payment or donations, to preserve fairness reputation must depend only on the rating given by others users. The blockchain eventually should be used only to certify your ID anonymously and make more difficult to create gazillion of new identities to cheat the ratings.",
				"added": 1471030908
			},
			{
				"comment_id": 16,
				"body": "> [teszt](#comment_30_1AdcxsExVKvxffQtEd72E5tckouzZHLEYC): They are two issues to be separated:\n> \n> a decentralized identity system which doesn't exist at the moment and have a higher priority(an improoved nanasi would be enough without blockchain - but could be also a simple Namecoin based ID)\n> a decentralized reputation system with lower implementation priority on voluntary and  plugin basis(those who are against it would not install it simply)User Rating could be manipulated with fakes but money not even if it seems less fair at the first sight. Donation could finance further ZN development from which we all users will benefit. Deposits would be not blocked just the public key stored. The reputation would be valid only as long as the coins(free movable for the depositor) are not moved away.\n\nIn your previous comment seems you want to relate the good reputation of an user according the **amount** of money the user deposit. This would be very unfair, despite how much cryptocoins an user decide to give the reputation must start from the same level for all users, no difference if you give 10000 coins or only 1. \n\nTo avoid scammer is enough to use a transaction only to certify the ID... yes an user could create fakes but many fakes would need many transactions so will not sustainable, in addition could be added many measure to discourage fake voters from cheating the reputation system, eg:\n- User ID registered only by few days can start to give rating to others users only after a reasonable amount of days\n- All users have a limited amount of good reputation that can give in a day, with an higher amount if they have a positive reputation and lower amount if they have neutral or bad reputation\n- The transaction accepted to verify ID must come only by a wallet that hasn't already send coin to certify another ID",
				"added": 1471033890
			},
			{
				"comment_id": 17,
				"body": "> [teszt](#comment_31_1AdcxsExVKvxffQtEd72E5tckouzZHLEYC): Deposited coin amount based reputation is not unfair it is just business oriented and is realistic like in real life. If you have more money you have more creditworthiness and more respect by the banks.I am sure such a reputation is useful for business.But nothing speaks against a second, merit based reputation also. Here the ZN creator could get the highest reputation on start, other ZN contributors with donation, programming or content could also get ranking according to their contribution for ZN. Voting could be part of the merit system.But voting somebody for issues (like personnel friendship or how many accounts he can make) not connected to ZN activity wouldn't be usefully for others.We could have both(merit and creditworthiness) reputations, but both need first a decentralized identity system on which should be built. Most users would feel more comfortable with a decentralized identity.The ID system could have much influence on the reputation system built on it so we must choose this very carefully.In conclusion I would suggest to concentrate first on the creation of the decentralized ID.(but keeping in mind that should be able to support a flexible reputation system)\n\nRelate the reputation according the deposited amount of money will introduce a **plutocratic system** in a network born to be free. This is VERY unfair. With your propose\n- the rich users automatically get high reputation despite they are total assholes. \n- a future e-comerce zite can decide to invest an amount of coin to get a good start reputation to scam tons of users to earn\n\nReputation measure how an user is reliable, if I deposit more than you doesn't mean that I'm more reliable and polite, means that I'm more rich and can afford larger deposit, and no more. \n\nWith my propose you can discourage scam voters with no unfair richness based system.",
				"added": 1471036530
			},
			{
				"comment_id": 20,
				"body": "...",
				"added": 1475360853
			},
			{
				"comment_id": 21,
				"body": "Wondering how some people can be so idiot to not understand the difference between \"rating\" and \"censorship\" and the fact that you cannot never see any activity where you need to know the reliability, and scammers are a problem. Too much stupid kiddy here.",
				"added": 1477189204
			},
			{
				"comment_id": 22,
				"body": "I have said 1000 times that I'm not speaking about some ban or censorship system rating based. If you don't give a fuck about rating, you can simply ignore it, contents will be always available for all despite the bad rating, and users that want to know what is the community opinion about the user, can freely decide to hide his content from their personal Zeronet client according their settings or pay more attention in case they decide to purchase something.",
				"added": 1477883408
			}
		],
		"2_13y1BVkYsWXbNMjdk2PrRVwpuXqohTRNHi": [
			{
				"comment_id": 9,
				"body": "Everything can be broken. The question should be \"how difficult is\".",
				"added": 1469449151
			}
		],
		"1_1HvZzixBMnPehyouwx83zNYK3E97MrUVxS": [
			{
				"comment_id": 13,
				"body": "People like you that like disturb discussions screaming and insult other users when are hidden by a nickname in real life are frustrated pussy with erection problems that poop in their pants.",
				"added": 1470953758
			}
		],
		"1_1JGTZxxkeZuhNBRfW6imTjeYbzjgqkU48N": [
			{
				"comment_id": 18,
				"body": "I'm an alien and I have kidnapped you to put a microdevice hidden in your brain. You cannot remember because I have cleared your memory. When we start the invasion all microdevices systematical implanted in many people will be activated and you will be our slaves.",
				"added": 1471120551
			}
		],
		"4_17Cs2auSHSVjKaYMXqbNMApRQrgXcwJUpL": [
			{
				"comment_id": 19,
				"body": "here the official announcement with all links\nhttps://web.archive.org/web/20160816004542/http://pastebin.com/NDTU5kJQ",
				"added": 1472167338
			}
		],
		"1_1yvSQH5Z7aJra4y9s6KG2kjLeGXYhNgn7": [
			{
				"comment_id": 23,
				"body": "Really stupid question. Having a decentralized system that is free from government censorship isn't possible if you leave some authority your IP and the possibility to identify, block and persecute you. I find really offensive a statement where anonymity is seen only as a thing for unethical activities for criminals and perverted.",
				"added": 1484152349
			}
		]
	},
	"comment_vote": {
		"6_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6": 1,
		"28_1CTut2qbaj54ZjNoYeuWSGwV75iVieKY6N": 1,
		"23_1HrRNH7KbdxMjwLmwrHmZqJrzVZVDKc9bF": 1,
		"4_18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj": 1
	}
}