{
	"next_comment_id": 4,
	"comment": [
		{
			"comment_id": 1,
			"body": "I strongly oppose the \"We are on our own\" point. It is understandable that companies may profit off personal data, but it is not helpful to exclude them. Tor survives because of not only volunteers, but also money from US government. All for-profit companies also have their own data that they want to protect. \n\nBusiness is as about survival as decentralized web. It is impractical for the web to be totally decentralized, because of economy of scale. OTOH, decentralization is inevitable to ensure truly reliable service, beating network division (censorship) and congestion (DoS). That's why CDNs and AWS available zones exist. You might ask, how can division of labor inside corporations count as decentralization? I just want to point out that what they are doing might not be so different technically from what we are doing.\n\nIn addition, decentralized web cannot be all about \"users\". Even on current web, compensating IP authors is a problem not yet fully solved. All the black boxes, DRMs and such, they attract \"creators\" with money. Centralization, as a social problem, falls back to money. If decentralized system wants to beat centralized one, it must be more profitable. \n\nIn short, we are not on our own. If we can do things right, we can have the world at our back. This interface is already the fastest I've ever loaded, and I believe it is a great step in the right direction of web technology. But we must not seclude ourselves from the rest of the world in the first place.",
			"post_id": 86,
			"date_added": 1467862243
		},
		{
			"comment_id": 2,
			"body": "> [p2p](#comment_54_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ): Tor is funded by US gov does NOT mean it is profit oriented. Further more, Tor is totally open-sourced, which is essentially different from those profit oriented company.Similarly, ZeroNet can be funded, but never be profit oriented, or \"profitable\". Facebook attract users because it can give users money? Non-profit project can not attract users because it can not give users money?\n\nWe are not profit oriented, but we should not give up on those who are. Creating a new web is no easy task so we need every bit of help.\n\nProfitable for me is equivalent to sustainable. For a platform to be sustainable, it needs to also make participants sustainable = profitable. For now, uncensorable publication is supporting it, but it cannot forever, and it is not meaningful for most people. \n\nImagine if ZeroNet is incorporated into mainstream browsers, and utilizes the caches that's already there anyway. \n\nIn fact there's this thing called [Hola](https://hola.org/), that's installing into people's browsers and \"hijacking\" them to serve as a CDN, in return of proxy service. We can definitely do better than that. ",
			"post_id": 86,
			"date_added": 1467916908
		},
		{
			"comment_id": 3,
			"body": "> [p2p](#comment_55_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ): as linux grows, they have to adopt it, rather than asking them to adopt it. years ago, someone might say linux is not meaningful for most people. however, today, most people have linux-powered devices, e.g. android devices, routers...\n\nWe largely have Google to thank for Android, Red Hat to thank for CentOS and Canonical to thank for Ubuntu. As much as I respect FSF, FSF certified OS never reached the popularity of Ubuntu. Receiving contribution and cooperation are different in the level of engagement. Adoption is further more engaged. The momentum of growth only comes after you've got some heavy-weight initial adopters.\n\nNow, are we aiming at Ubuntu and Red Hat, as questionable as some of their decisions, or FSF, as honorable as its insistence?\n",
			"post_id": 86,
			"date_added": 1467954281
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}