{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "IRC?",
			"body": "Is there IRC on ZERONET?",
			"added": 1478987872
		},
		{
			"topic_id": 2,
			"title": "Libertarianism",
			"body": "General discussions about libertarianism, decentralization, minarchism and anarchism. Libertarianism is a social doctrine that upholds individual liberty above collectivism and seeks to maximize autonomy and freedom of choice.",
			"added": 1479782522
		}
	],
	"topic_vote": {
		"2_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG": 1,
		"1_1Cxt2k3farSSee7HTkJKJ7eCTKxfFGNXe6": 1,
		"3_1PVcdu7USZH2kHMETbqDYLPjJZKCDWM52k": 1,
		"7_137PNA5gLgCTLZTBtzUqCmMoZ752NQGQSJ": 1
	},
	"next_comment_id": 28,
	"comment": {
		"1_18jipjDsfAxAuq4ixbi2w24xJrYVfTYFPn": [
			{
				"comment_id": 1,
				"body": "South Africa",
				"added": 1479869333
			}
		],
		"2_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG": [
			{
				"comment_id": 2,
				"body": "> [thisweb11](#comment_91_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Libertarianism depends on state violence.  Anarchy does not.\n\nLibertarianism does not depend on state violence, and rather considers that the state should stay out of an individual's life as much as possible. It is possible to be a libertarian anarchist, in fact.\n\nThat would usually be anarcho capitalism, or anarcho syndicalism,, depending on your personal perception of freedom and liberty. The very basis of libertarianism however is limited state role in all aspects of an individual's life, which means minimal taxes and limited state role in social services. Social services from a libertarian standpoint should be maintained by the individual or private groups (commercial or not), because they are less likely to infringe on personal liberty than the state. Private groups don't impose taxes on the individual and don't impose a certain service on people (state education, for instance), which is why libertarians believe that private groups are naturally better than the state in this role.\n\nI mentionned anarcho-syndicalism as a form of libertarianism, and I say that because it is naturally free association between people to attain the highest quality of life possible, without imposing it on anyone, which is what the state does.",
				"added": 1480139423
			},
			{
				"comment_id": 4,
				"body": "> [thisweb11](#comment_118_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): It is possible to be a libertarian anarchist, in fact.\n> No it isn't.  Thats an oxymoron. (like anarcho-capitalism)  Anarchists reject all forms of authority.  Its the very foundation of anarchy.   .  When you say the state should stay out  'as much as possible' it doesnt answer when it should interfere? This is often the way with libertarians - they can tell us where the state doesnt interfere (same answers as anarchists) but rarely wish to mention where they think they should intefere - my concern is that a small/non-brurocratic state isnt the same as a weak one - you can abuse an entire nation with just one law and one department (eg the police/prison system).   I think theres a lot of good libertarians, whose ideas are well intended, kind and visionary, but when the state is there, any small role will still require extreme structural power (though violence - as with all current state systems)  to enforce it.   Also, if the state is small, how do we ensure any democracy is fairly overseen? ( I assume thats what you want the state to draw power from?)\n\nYou dodged my answer quite quickly. I will tell you where the State should interfere from a general libertarian standpoint: Defense and Immigration. The other domains will vary from people to people, but for almost every libertarians, defense should be held by the State as they view defense managed by private militias inefficient and the same for immigration.\n\nAs for democracy being fairly overseen from a modern liberal standpoint, and a reasonable one I think, would be confederalism and direct democracy. Swiss is a perfect example of a country that has achieved both, and that has a rather minimal State, yet not minimal. The States closer to the people should have more power than the central government, because they know better on which issues their citizens are concerned, and the federal government should work hand-in-hand with the States, as opposed to work against them. I think Swiss is truly a great example of such a country, but it is not a true confederation. It does have a lot of confederation-like features, and I think is a good example on how such an utopia could be achieved.\n\nI should immediatly note that I am an anarcho-capitalist, not a minarchist, but I believe that reducing the State's size until it is essentially irrelevant, as corporation and private initiative takes over what ought to be bureaucrat's work happen. I think socialism is what is wrong with classical anarchism, and if socialism should be achieved in a state-less society, I feel like we'd be no more advanced than we are now, have replaced the state by begging barbarians. Of course, examples of very short-lived anarchic societies have happened in the past, but these were essentially composed tribes, and didn't live long enought to prove anything about classical anarchism. A lot of anarchic socialist belief is that participatory anarchism would work, but the problem with that narrative is that most of today's anarchists are simply Tumblr-kids having found out that it's hard to live in a capitalist society. Yes, it is, and this is why private initiative is so well compensated in a capitalist society, because hard work gives out great yield. In a participatory anarchistic society, we wouldn't have hard work, in fact hard intellectual work would probably not be compensated at all, unless you believe large scale anarcho-socialism is possible, but it is not. Intellectual work which would not immediatly benefit the society would likely be shunned, and the rations of the individual working on, for instance, programs, would likely be cut until they do something immediatly beneficial. People want to see immediate results, and it is in fact in the human nature, and this is why I do not believe in any other anarchistic societies than anarcho-capitalists societies.",
				"added": 1480647693
			},
			{
				"comment_id": 9,
				"body": "> [binero](#comment_137_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Every state depends on a monopoly on violance. When it doesn't, it gets toppled by one that does.\n\nPlease define state violence. You anarchists use it a lot and don't look to know what it is.\n\nTo me state violence is the punishment for crimes against the state, now what constitute it depends from governments. In totalitarian governments, it can be pretty much anything you say, do or else. In democratic government, it's limited to terrorism, crime against individuals in the state, and antichristian things (pedophilia, bestiality, child porn, and the like), but also limited to taxes. Taxes are the ultimate form of state violence in a democracy, and should be absolutely cut for everyone, not just the rich or the poor. Eveyone, because it is the single most harmful thing to personal liberty. Libertarians wish to limit state violence to these roles anyways, and to uphold individual liberties such as but not limited to: freedom of press, freedom of religion, lower taxation, the transfer of certain roles of the state(economy and education) to privately owned alternatives, and the limitation of social programs, as a way to permit the lower taxations and the arrival of competent privately owned alternatives in social programs. This means private insurances, in short.\n\nLibertarianism wish for the transfer of the State's roles to be done peacefully, and not by violent means like anarchism and communism do, so I do not know where the State violence has anything to do with libertarianism..",
				"added": 1480825044
			},
			{
				"comment_id": 12,
				"body": "> [thisweb11](#comment_137_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): the swiss economy depends on a attracting foreign investment by offering low corp tax rates and the same slave wage labour and forien  imports ( slave wages ) as the rest of the west.  It depends on exploitation of others to help itself.\n\nWhat are slave wages? You're able to pay a place to live in, food, clean water and education in an occidental country, alongside with the occasional funzies you might want to pay. In the anarchy thread, you kept using your social sciences terms quite horribly, and I am now curious to know what they mean.",
				"added": 1481146822
			},
			{
				"comment_id": 13,
				"body": "> And yet time and again its been shown  that private businesses create and depend on bureaucracy more than the state.  (read David Graebers book a - The Utopia of Rules: On Technology, Stupidity, and the Secret Joys of Bureaucracy).  Gooles terms and conditions, your banks or your telphone companies, are pages long, and virtually no one understands them fully.  Its the whole point.  And none of those were written by the state. The state just enforces them on their behalf.\nI did not say that lazy corporations were the holy grail of coporations. Lazy corporations, in a true free market, will simply run out of fund and go bankrupt if they do not change their behaviors, and as such they will remain competitive until they earn a monopoly, usually granted by the state, through \"social programs\" or other ways to \"help the less fortunate\".",
				"added": 1481147107
			},
			{
				"comment_id": 14,
				"body": "> [thisweb11](#comment_139_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Again this is not backed up by evidence.  What do you think zeronet is if not intellectual work, not driven by profit?   Also read about Catalonian Revolution, the anarchists increased food yields and distribution was MORE effective under them than the state.\nThe internet was created by the United States DEFCON, computers were created by CAPITALISM, the computer on which you are saying this was created by CAPITALISM, how is this not evidence? The 19th century was the golden age of capitalism, considering the number of economic progresses we made there, and the number of scientific advancements made, all driven by CAPITALISM. Anarcho-communism is a great idea on paper, but in practices it would lead to Neo-tribadism, highly-corporate and organized mafias, and if we look at history, looking at Rome, we would see the formation of new \"Kingdoms\", driven by profit. Maybe I'm paranoid, but all socialism did in the past was creating highly-corporate mafias, that socialism tries to oppose but does not succeed at, because all socialism does is promote crony capitalism. En masse.\n\nI am not saying that capitalism solves all problems, I am saying that profits drives the world more than social justice, trans right, black lives matters and poorness of culture regroupement.",
				"added": 1481147496
			},
			{
				"comment_id": 15,
				"body": "> [thisweb11](#comment_140_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Taxes are state violence when they are enforced by state violence (they are eventually) .  But so is debt from private corps.  If you dont pay a debt they enforce violence (via the state).  And if no states exist they do it themselves (private cops) .  How is owing my bank money differnt to owing the state money  (tax) in terms of violence?   It isn't.  That's why nobody can be anarcho-capitalist.   Capitalism needs to enforce DEBT.  Tax is another word for debt when its govnt.  The difference is that tax is used (in theory) to support everyone.  Debt to capitalists is used to support only the capitalist to gain more power and violence over you.    Capitalists and govnts are interchangeable, they are the same thing, only nominally we are supposed to have a democratic say over state powers.  Not so for private states (corps). Corporations are private states that use violence like the govnt state to get what they want.  And they even 'make' the govnt use violence on their behalf. \n> And to top it all of, a HUGE amount of your TAX goes to pay private corporations demanding debts be paid! (see banking crisis of 2008).  What backs up their 'demands' do you think?  Nothing?  Or Violence? Either way its proof that either 1) the capitalist corporations are the state OR 2) that the corporations will use violence.\n\nThe difference between debts from private corporations is that debts from private corporations do not impose you debts, unless you live in a fascist country. Of course private corporations needs their debts paid, it's the way they make their profits. Taxes, on the other hands, are simply imposed, to all. Progressive taxes makes making profit nearly impossible, sales taxes makes the local market uncompetitive and drives smuggling rates up, drug restrictions (a social program) imprisons tons of people under the pretense they make the world safer, when in fact they do not, government standardized education created an horrible schooling system.\n\n Our taxes funding private corporations is crony capitalism, it is not free market economy and is opposable by anybody who has a bit of self respect. \n\nCapitalism and government are not interchangeable, and capitalism can work without a government, but a government cannot work without capitalism. Capitalism is a mean of production, a government is an organisation with an holier than thou attitude.",
				"added": 1481147903
			},
			{
				"comment_id": 16,
				"body": "> [thisweb11](#comment_141_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): most of taxes (eg in US)  go toward defence and immigration control (which you say you want) .   How exactly do you think the state will pay for this with no taxes?\n\nNo, that is bollocks. Take a look: http://www.cbpp.org/research/federal-budget/policy-basics-where-do-our-federal-tax-dollars-go\n\n24% goes to social security, 25% to healthcare (already nearly 50% don't go to defense and immigration), 10% to social security, 6% interest on debt.\n\nIf we look at defense, it is 16% of the budget. The taxes are way too high, and I strictly oppose all the programs i highlighted up, simply because they are not representative of the free market, at all. The free market leaves the individuals pay only for what they want and truly need, and lets people voluntarily fund social programs if they so need to. This is not oppression, this is liberty.",
				"added": 1481148197
			},
			{
				"comment_id": 17,
				"body": "> [thisweb11](#comment_142_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Are you serious?  Actually I dont think theres any person , dictator, socialist, anarchist libertarian or capitalist in the world who doesn’t want transition of the world to their ideology without violence.  Everyone wants to gain wins  peacefully over risking violence.  It just doesn’t work out that way.  And as far as I can see I don't see how  libertarianism can either (at least no more than anarchists who also want peace not violence) .    But peace at the price of keeping the status quo?  Not even you want that.  Not if your really a libertarian.  The status quo is not libertarian.  The status quo wont hand it to you on a plate.  And you just said anarchists would fight you, so what will you do if they really did (not to mention the state cops who oppose libertarianism even more)?\n\nI would rather let them hit me than hit back, because violence is in not way going to solve their ideological inconsistencies and disagreements with me. I think keeping the status quo but having great arguments is better than to kill thinking it will solve any problem.",
				"added": 1481148376
			},
			{
				"comment_id": 18,
				"body": "> [thisweb11](#comment_143_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): What about incompetent privately owned alternatives (as we already have) ?  You dont mention them, you seem to imply they wont exist but why?  they do exist right now, so what will change?\nThere will always be incompetent private alternatives, but there are also very competent ones. I am not saying they won't exist, I'm saying they will be very uncompetitive if the government was to step out of the social domain.",
				"added": 1481148505
			},
			{
				"comment_id": 19,
				"body": "> [binero](#comment_148_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Disgusting. Too often the profit of a company and the best interest of the people do not align.\n\nThe profit of a company and the best interest of the people never align, but so do the government and the interest of the people. I am saying that private alternatives are naturally better, because they have to be competitive, while the government is the law, and can do as he wish.",
				"added": 1481148586
			},
			{
				"comment_id": 20,
				"body": "> [planespherev3](#comment_31_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Excellent example! However, i have even better: the wheel was invented by the slavory mode of production, proof that the slavory mode of production is even better!\n\nNo the wheel was not invented by slaves, nobody knows who and when the wheel was invented.",
				"added": 1481233287
			},
			{
				"comment_id": 21,
				"body": "> [planespherev3](#comment_32_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Could you give me one example of capitalism working without government in the past?\n\nCan you give me an example of socialism working without government in the past? Me neither.",
				"added": 1481233314
			},
			{
				"comment_id": 22,
				"body": "> [planespherev3](#comment_33_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Also, i understand that anarcho capitalism would be more feasible than anarcho communism in the near future (in the far future anarcho communism is obvious for me), however, even if it is the more practical mode of production, aren't you disgusted by money, private property of the means of production, the separation of society in 2 classes, and hierarchy? \n> Is that completely all right for you?\n\nThis is all right to me, the ascension of social classes can be possible with the right opportunities, with anarcho-capitalism leaving quite a lot of them. Social classes always have existed, even in \"communist\" countries. I would say they are natural in human societies, in all of our history we have had them. I do not have an issue with them.\n\nI am not in any way encouraging class division however, I am just saying it is natural.",
				"added": 1481233477
			},
			{
				"comment_id": 23,
				"body": "> [planespherev3](#comment_34_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): And also great IRL for 95% of human history.\nAnarcho communism was never achieved, WTF are you speaking about?\n> Rome is a slavory mode of production. It has nothing to do with anarcho-commuism. Quite the opposite in fact. \n> As for Neo-tribadism, if there is no tribe anymore in the future, it can't happen. In the future, there would be no antagonism left since the capitalistic mode of production destroys all identities and ethnicities, and is cosmopolite by nature. \nRome used slaves as a replacement for machines. The point was not for the method of production however.\n\nRome was divided in tribes for all of history, as with all human civilizations. In all states of all history, tribes did exist. Today, in the western world, it is hard to see where there are. In the rest of the world, we see them very clearly. Clear family values and traditionalism remaining a fact.\n> Get your concepts right. Socialism isn't anarcho-communism. Socialism is state capitalism. \nFollowing this concept, socialism is crony capitalism, not state capitalism. The state should not interact in the economy. I will argue that I don't have a problem with your idealogy so much if it wasn't a naturally collectivist ideology.\n> What does anarcho-communism has to do with the progressive ideology? Progressive ideology derivate from capitalism (Guy Debor, Michel Clouscard, Francis Cousin). Because capitalism needs to isolate individuals and split groups,  in order to weaken them. \nCapitalism doesn't divide, being merely an economical model.\n> No, capitalism don't solve problems, it creates them since the 13th century A.D.\nCapitalism does solve problems, having fixed a lot of countries economical problems in the past. Chile is a good example, being the third richest country in america, and having been capitalist since the 1960s.",
				"added": 1481233920
			},
			{
				"comment_id": 24,
				"body": "> [binero](#comment_159_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): The government represents the people. It does as the people wish. For quite a lot of industries, nationalised industries perform better than privatised ones, usually things like water, electricity and such.\nNationalised industries will always be state monopolies, and if they aren't, they will become. Look up Hydro-Quebec.",
				"added": 1481234008
			},
			{
				"comment_id": 25,
				"body": "> [thisweb11](#comment_182_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): you didnt include state taxes.\n\nStates taxes don't go to fund defense.",
				"added": 1481234041
			},
			{
				"comment_id": 26,
				"body": "> [thisweb11](#comment_183_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): https://www.theguardian.com/commentisfree/2016/dec/06/if-republicans-want-to-cut-fat-start-at-the-pentagon\n> the defense budget is astronomical whatever way you look at it.  You didnt answer the question.  If taxes are violence against the people how will you pay for defense?\nI did do doublethinking there, but it is because I spoke of two different possibilities (being minarchism and anarchism). Minarchism would allow the government to tax the people, but astronomically less than today. Anarchism would result in the absence of taxes, and participatory capitalism that could well be organised in syndicates, communes and actual corporations.",
				"added": 1481234186
			},
			{
				"comment_id": 27,
				"body": "> [thisweb11](#comment_184_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): thats fine when you are comfortable  until your problem becomes life threatening poverty  (hunger, sickness ) which is the status quo for many.  Theres no one who wants to listen to your arguments, and what you need is practical help.\n\nHow do I need pratical help?",
				"added": 1481234218
			}
		],
		"1_1AhXDbKvcLap7TcS2542J7bFYzKHM3xeRU": [
			{
				"comment_id": 3,
				"body": "Wow, you're a bunch of communists, aren't you? Justifying state coercion, which is simply injustifiable. Taxation should not exist, or if it should it should be flat taxation. People finally getting off of the poverty line should not be taxed more than those living on welfare, and in fact anarchism should not coerce people into taking their money any more than the state does, as if it did it would be roughly equivalent, or worse to the state itself. \n\nCoercion is coercion, no matter who is doing it, and if it had to be done in an anarchic society, I feel that the state would come back rather quickly, as the wealthier would organise to keep themselves away from the savagery so below. In fact, anarchy is only ever achievable if all are free, and free to collaborate and contribute. Not being coerced into contributing into any ways, because if that has to happen, the wealthier will just run off with their money. \n\nI firmly believe the only possible anarchy is anarcho-capitalism, with people-sponsored militias/corporate militaries keeping guard of the borders and terrorism, as an anarchic society without border would be equally as safe as walking into a ghetto with a platinum Visa card. Or said simply, not very safe.\n\nJust my two cents.",
				"added": 1480645980
			},
			{
				"comment_id": 5,
				"body": "> [planespherev3](#comment_11_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): You haven't read what's written a few posts below. During the Revolutionary Catalonia (1937), people were allowed to keep their real property if they wanted to. \n> I your post you talk about money, money, money and money. (quoting you: \"taxation, taking their money, wealthier, run off with their money, sponsored, platinium Visa card, two cents\"). \n> During revolutionary Catalonia there were some eras which functioned totally without money. So the problem about the wealthier fleeing or the visa in the Ghetto would simply not exist anymore. \n> Seriously, have you ever considered a world without money? Have you ever imagined how everything would be different in a positive way, regarding friendship, love, our activities, our studies, leisures, food, medicine, and almost everything else?\n\nMoney is merely a value attributed to common goods, and was that way ever since it was invented. Without money, we can not have an estimation of the value of items, wheter demanded or given, and that is all it is. And I did read about the revolutionary Catalonia, but to me it is not a good example, having lasted only a few years and being composed of communists and anarchists, which are naturally opposed to each others.",
				"added": 1480701646
			},
			{
				"comment_id": 6,
				"body": "> [thisweb11](#comment_134_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Firstly what did you think people did before 5000 years ago without money?  Did they not know how to value anything?  Nonsense.\n> Secondly, actually money does the opposite.  It leads to a society that knows the price of everything, and the value of nothing. \n> How much is a chicken worth?  (i can tell you its exactly £3.21 in my supermarket ).  But it tells us nothing of its value.   That IS the problem with capitalism.  Capitalism destroys value in place of price.  And money is price not value, because its backed by guns.  So if I owe you money thats the price, no matter what its worth its the gun that decides what the price is, and its value fades in the face of a gun.  - just like Orwells doublespeak and doublethink : 'how many fingers am I holding up? man holds up 5 fingers  pushes gun to his head 'six' came the correct reply.\n\nMoney does not destroy value in any ways, it is used to represent value. And money was actually used 5000 years ago, it just wasn't printed money. It was rather food. The idea behind the invention of money is that a gold coin would be equivalent to one bread, so that way trading would be easier. The whole idea behind money is to represent value, and value of consumption and value of productions are two whole different ideas. Value is the value attributed to people to items, if to one's perspective chicken is worth 1$ and not 3.21$ in a supermarket, he can just wait for a price drop, or at least one could believe so.\n\nAnd how the hell is capitalism backed by gun? Capitalism happens when mass production of goods begin, I am not an economist but capitalism has nothing to do with killing people. And if we needed to speak about people killed by capitalism, which is a number not even worth mentionning because it is non-existant, we could talk about the number of people killed by communism. Must be around an hundred millions, if not more. \n\nAnd money-lending has nothing to do with capitalism and industrial production, banks existed way before the concept of capitalism even existed. You see, Karl Marx wholly misrepresented capitalism by making it look like if it was the \"bourgeois class owning the poor\", but capitalism is in fact mass production and sale (e.g. industrial production). That's why we call people like Henry Ford big capitalists, by the way. \n\nHowever, big bankers (the actual \"Bourgeois class\") would rather be people like the Rothschild, who were big war profiteers in fact. I don't recall Henry Ford or Walter Disney financing wars... Weird right? \n\nThe fact is that capitalism is not what marxists make it seem it is. Capitalism rewards hard work, while communism, and especially marxist anarchism would reward no one, as each would be rewarded equally. This would ensure mass lazyness, and in the past it certainly did.\n\nMoney-lending is not capitalism, and that is a fact. Banks are certainly profiting from mass consumption, but the mass moneylending we see now is slowly being replaced by safer, less fluctuating alternatives like Ether based ones, and I don't see banks surviving in a few hundred years. But anyways, if your complain about capitalism is that it is state coercion, you couldn't be more wrong. Capitalism has nothing to do about state coercion, it is just an economic model. Capitalism does not take your home from you or kill your dog for as far as I know, it just means that corporation compete with each others to make the best product possible. Money-lenders would do if you don't pay your debt, but if you're smart about money you wouldn't have to worry about that. \n\nCapital is a word for object of value, capitalism is the mass production of objects of value.",
				"added": 1480808165
			},
			{
				"comment_id": 7,
				"body": "> [thisweb11](#comment_131_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Anarcho captalist makes less sense than calling yourself an Muslim Athiest.    (at least  muslims and atheists agree on what each others position is)\n\nHow does anarcho capitalism makes less sense than calling a muslim atheist? Anarcho-capitalism is the idea to found a libertarian society independant of government and big businesses, which is entirely possible. Anarchy in fact only means no ruler, and if capitalism in a ruler-less society is impossible, so would any economic model be. A muslim atheist on the other hand does not make sense at the core level. Islam is a religion, and one part of a religion cannot be at the same time an atheist. I'm sorry, your comparison does not make sense, and so do your arguments.",
				"added": 1480808419
			},
			{
				"comment_id": 8,
				"body": "> [thisweb11](#comment_130_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Hey Dud, I agree no one should be coereced.  But  Capitalism is the greatest coercion of all.  CAPITAL is power over others.    Anarcho-capitalism  is an oxymoron.    To gain profit you MUST (not optional)  exploit other's labour for more than its worth.   You can't exploit others and be an anarchist.  Exploitation is coercion\nHow do your determine a labour's worth? I know Karl Marx said that, I did read the manifesto. But the very idea that a labour has any word, at all, is stupid. The product of the labour has worth, the labour itself is nothing. I am currently typing an argument on my keyboard, which could be called \"labour\", does it have any worth? If it does, then the capitalist model in today's world would work very well to recompensated my arguments. Things like flattr permit to recompensate nearly everything one has done, and this model will soon move to cryptocurrencies, I believe. \n\nCapitalists do not exploit others labour, they recompensate other for the production of a product that is not their original idea. Capitalism recompensate ideas, and those who help them achieve their ideas. If it was \"exploitation\", then you likely wouldn't be paid. Marx called the product of a labour \"labour-power\", and that it was the item they were selling. They are not selling anything at all, they're helping the capitalist (Industrial owner, if you didn't get it) product items. In today's society, this could include selling those items, shipping them, because the industries need money to function, money being a representation of their buying power. And they get recompensated for it.\n\nIf labour had any value at all, then all labour would be equally recompensated, but what constitute labour and what doesn't couldn't be determined by Marx, and all Marx has achieved with his opposition to capital was the creation  of totalitarian states, which realized that money was necessary to represent the value of one's work and kept using money.\n\nDon't try to tell me I'm oppressed by working, I am not. I am a working class person and I don't think there's any wrong with that.",
				"added": 1480809004
			},
			{
				"comment_id": 10,
				"body": "> [planespherev3](#comment_17_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): I could refute most of your argument rationally, but this end of the week, i have no desire to do so. As anarcho-communists, the time is with us (because it's homo sapiens true nature (primitive tribe)). So whether our ideals prevail in 1 year or in 100, it doesn't matter.\n> Instead i'll just ask you  questions.\n> You said you're from the working class. \n> Are you happy to work for the owners of the means of productions, who make (the real) profit from your work? Wouldn't you prefer to work for yourself or at least for the whole community instead?\n> Do you like your job so much that you wouldn't do any other thing during the time you work? Or do you just work so you can pay your bills and your rent?\n\nIf you can refute my arguments, do so. I'm waiting.\n\nAs for your questions: I am happy to work for the owners of my not-for-profit enterprise, yes. And I don't want to work for myself or the community right now, I have no interest to do so. I do like my job enought that I wouldn't do anything else during the time I work, I found myself a job that I like. It doesn't take a lot of effort to find a good job, really.",
				"added": 1480825264
			},
			{
				"comment_id": 11,
				"body": "> [binero](#comment_136_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): A worker is exploited when the return they get on their labour is worth less than the product they produced. Why should one guy at the top benefit from all the profit? Most of the work is done by the employees.\n\nBut how do you determine the value of a labour? That's the main question.",
				"added": 1480825327
			}
		]
	},
	"comment_vote": {
		"4_1AjxW1N844WRpscEFSotfsqLXsQurz83xc": 1
	}
}