{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1_1MwJSNBC1savftEvXQyoHcVLDgThtAPr6T": [
			{
				"comment_id": 1,
				"body": "I am not a coder either but have years of experience with multiple OS's. So, I am not the average user. However, my interest is also to find systems which are user friendly. I find zeronet to be very promising in this regard:\n1) It provides end to end encryption without having to force strong passwords, in communication, which, IMHO will be the most significant contribution by the project. ZeroMail is easy to use with ZeroID but I have noted one user quite rightly pointing to lack of the broader e-mail features of bitmessage.\n2) Zeroblog is a relatively easy blog format to clone and use. I have just created my site by cutting and pasting from already created web-pages and everything appears to work including images (http://127.0.0.1:43110/1JrJrctcfn34L88eNtZ32ja16HHgDmDv1E). All this without original coding. Admittedly it is a static site and no doubt there are issues to be ironed out in dynamic sites.\n3) Zeronet has enormous scope to grow especially as it is already integrated with Tor and is likely to work well with Whonix and Qubes OS which are both on the verge being production level projects. I have also read that there is an intention to integrate i2P with Zeronet. Thus Zeronet may be the glue which we have all been waiting for. All these projects are free and should be supported to remain so. I think that we are not far from realizing the integration of such projects into a production platform which will automatically protect the user security and privacy while still being user friendly. Unlike the days of Apple and Microsoft in their infancy, the emerging technology has had decades of thought put into them and have been shaped very much by the broader sociological impact wrought by the Internet I.\nThere may be other positives I have not considered here but the constructive critique by users (especially those who are not coders) may be helpful in shaping the future of Zeronet. I hope coders are reading such criticisms and take them on board. My observation is that they have and do but the progress has necessarily been an evolution.",
				"added": 1493541358
			}
		]
	},
	"comment_vote": {}
}