{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": 1,
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"2_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_1NU6gdra9qhUhdbYGLia1G3HYT87qUTA7w": 1,
		"1_1DqaWUpq6dRXfuXCokpjYoAkDj2nzZDnAn": 1,
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": 1,
		"1_1AQwGx5xyBi5Fvv9WHJFMCMNtQhUc8UhQF": 1,
		"1_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"2_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1,
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": 1,
		"1_12Xj1w5HYu6w5xtEwwLyEiMYGuCqvYKL2q": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 1,
				"body": "> [urgeless](#comment_5_1GuYKebkQAqGJ4tNpNp4TD1UuoHHudCJLA): ITT: nazis\n\nMy friend, even if you are full of hate and you don't have arguments you may be honest.\nBut don't let yourself manipulated by your Jewish masters even if you are Jew.\nThe Jewish religion is like the Freemasonry. Those on higher level manipulate those on lower lewer.\nChabad is today one of the world's best known Hasidic movements and is well known for its outreach. It is the largest Hasidic group and Jewish religious organization in the world according to the Wikipedia.\nhttps://en.m.wikipedia.org/wiki/Chabad\nLook this site written by Jews for Jews about the Chabad mafia.\nhttp://www.chabad-mafia.com/\nChabad is a religious cult and a criminal organization. Why is this a problem for the Jews? Chabad poses as an Orthodox Jewish group. They say they are more religious, more strict in their religion, than regular Orthodox Jews.\nSo, why is this bad for the Jews? Chabad is a criminal organization. Chabad is mostly involved in white collar criminal activities such as financial fraud, tax evasion, and money laundering.\n\nChabad has also been linked to various Jewish child abuse cases.\nAlso, many of Chabad victims are Jewish. Mostly, Jewish children. Chabad runs several schools around the world. The objective of these schools is NOT to provide a good Jewish education for their students. The objective of these schools is to MAKE A PROFIT at the expense of the Jewish children.",
				"added": 1486767203
			}
		]
	},
	"comment_vote": {}
}