{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1_17q6Zhf7PFjrY3ddySK2F78JhAH3FVhmWr": [
			{
				"comment_id": 1,
				"body": "> [planesphere](#comment_13_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C): Jews are not plotting to impose capitalism on people. Jews are merely capitalism elite. \nThat is true. But they have the proper scammer genes and the proper ideology concealed as religion to use others.\nAnd they have their puppet leaders like Obama and Hillary and their pawn soldiers in American uniform to make all humans their slaves.\n> Would the jews disappear, there would be an other elite to take their place, and they wouldn't be better.\nThis scenario is so hypothetical like would be now dinosaurs the top predators in the food chain.",
				"added": 1476775720
			}
		],
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": [
			{
				"comment_id": 2,
				"body": "Dominant and recessive genes. Hitler had good scammer and demagogic abilities like Lenin had and this is  characteristic for Jews. Even if their Jewish part was small, this part came on the surface as dominant gene.\nJews always appreciate good scammers because they are Jew-like and Israel more likely will accept their conversion even with little Jewish blood.",
				"added": 1476776941
			}
		],
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": [
			{
				"comment_id": 3,
				"body": "shit feminist sluts with silicon tits\nTRUMP IS GREAT",
				"added": 1476869420
			}
		],
		"3_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 4,
				"body": "John F. Kennedy was speaking in his last speech about a secret society, who is controlling America and shortly after that he was killed.\nThey are some hints that he intended to make public how the Jews and the Jewish controlled Freemasons control us.",
				"added": 1477038351
			},
			{
				"comment_id": 5,
				"body": "Fact is that Jack Ruby, born as Jacob Leonard Rubenstein was Jew.  Jack Ruby killed Lee Harvey Oswald.\nhttps://en.wikipedia.org/wiki/Jack_Ruby",
				"added": 1477045746
			}
		]
	},
	"comment_vote": {}
}