{
	"next_post_id": 3,
	"next_comment_id": 1,
	"next_follow_id": 1,
	"avatar": "generate",
	"user_name": "Mingtianzhaowei",
	"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1485863070,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1485863290,
			"body": "新年第一枪！肖建华被抓 疑因赵薇杠杆收购再度引发监管 被删全文\n\n作者：深度金融\n\n2017鸡年过年前，中国大陆资本界曾经的“三大系”：“涌金系”、“德隆系”和“明天系”，硕果仅存的惟剩下肖建华领衔的“明天系”。\n\n而这个过年后，明天系也将成为历史。据海外多家媒体报导，肖建华过年期间已被抓捕回国内。\n\n中国资本市场是一个鱼龙混杂的大江湖，有江湖的地方就有江湖大佬，肖建华就是其中一个。\n\n当年，中国大陆资本界曾经的“三大系”：“涌金系”、“德隆系”和“明天系”，如今硕果仅存的，惟剩下肖建华领衔的“明天系”——“涌金系”的魏东，既是“涌金系”的台前老大，也是赫赫有名的“中财系”的领袖，在部里会里都有诸多人脉，但也因证监会前副主席王益的腐败案而被迫跳楼自杀，“涌金系”分崩离析；“德隆系”曾经如日中天，出身草根的唐氏兄弟手法凌厉四处出击，但野心太大蛇吞象，反而锒铛入狱；唯独，毕业于北京大学法律系的肖建华，在王益案发后一度远走加拿大避风头，近年又重出江湖。\n\n“明天系”被外界称为“最神祕的金融集团”，创始人肖建华毕业于北京大学，曾被市场喻为股市一代“枭雄”。截至目前，明天系已经控股、参股及曲线持有几十家上市公司，还构建了涵盖证券、银行、保险、信托、期货、PE、基金等机构的完整金融产业链。\n\n\n\n肖建华，山东人，15岁考上北大法律系，18岁成为北大学生会主席，27岁成为最年轻的上市公司总经理。在不到10年内，构筑起控股6家上市公司、参股和控股9家商业银行、4家证券公司、4家信托公司的庞大金融帝国。之后经商结交大批高官家族，终成亿万富翁，外界估计其个人身家至少有千亿元。2016年胡润百富榜，肖以400亿财富排名第32位。\n\n肖曾被大陆市场喻为股市一代“枭雄”，自2014年逃港后，为遥控指挥其大陆庞大的财富王国，故长期包住香港的四季酒店。\n\n肖建华有句口头禅：“每个人都有价码。”正因为出得起价码，他借助与证监会前副主席王益的深厚关系，以及高超财技，不但令3年累计亏损8428万元的太平洋证券得以上市，并惹来大批股民疯狂跟风炒作。太平洋证券一案也成了中国股市的“三大奇案”之一。\n\n有人说，肖建华是继涌金系掌门人魏东之后，王益着力栽培的第二个“学生”。然而，“明天系”扩张的步伐伴随着魏东的自杀以及王益被“双规”而停滞，2010年4月15日，随着王益被判处死刑、缓期二年执行，4月30日，肖建华的明天科技披露亏损9.6亿元，随即被带上*ST的帽子，5月4日复牌后，*ST明天直接封于跌停板。\n\n失去了王益这座靠山的肖建华，只得潜逃加拿大，并逐步隐身幕后。\n\n\n\n更令人称奇的是，作为这个数万亿财富的掌舵者，竟然找不到肖建华及其夫人直接掌控痕迹。如果不是上交所反覆问询赵薇杠杆收购万家文化原因，媒体层层报导分析后，公众才知道这个杠杆交易背后竟然与明天系扯上了关系。尽管肖建华通过律师声明否认参与此项交易，但这从另一个侧面表明肖建华强大的资金调集和几乎呼风唤雨的能力。\n\n如今的赵薇，已经被刻意包装成了一个“女版巴菲特”。一个从演艺圈出来的人，嫁给了一个好老公，当起了导演，玩起了投资，还每玩必中，一点点积累起了几十亿身家，多么励志的故事！\n\n但这样的故事往往是经不起考究的，是一个吹出的泡沫，一戳就破。就像电影《华尔街》里，华尔街那些光鲜的人，总有不能言说的一个侧面，那才是华尔街该有的样子。赵薇作为一个被捧向台前的人，顶著明星光环，靠着朋友圈和内幕消息在投资中获利，这才是那个更真实的故事。\n\n赵薇通过一个壳公司以6000万撬动50倍杠杆，以30亿元并购上市公司，这种空手套白狼、以小博大的玩法，如果不是高人指点，是玩不出来的。\n\n确实如此，给赵薇做财务顾问的机构，正是明天系下属公司，这是连明天系的辟谣公告都承认了的。争议点在于，给赵薇提供了15亿原始借款作并购弹药的西藏银必信公司，到底是何方神圣。\n\n\n\n西藏银必信工商资料\n\n根据万家文化的公告，赵薇的30.6亿元收购资金，其中6000万元来自其自有资金，剩余30亿元，15亿元来自西藏银必信资产管理公司的借款，15亿元来自于未来用万家文化股份进行的股权质押融资。\n\n从披露的信息来看，银必信执行力极高，对赵薇堪称慷慨。\n\n12月8日，赵薇丈夫黄有龙开始与万家集团控制人孔德永接触，谈到控股万家文化的想法。不到三周时间，12月26日，银必信就与龙薇传媒达成了总额15亿元的借款协议，而且发放了第一笔1.9亿元借款。\n\n不仅如此，银必信给的条件也相当宽松。15亿元现金，年化10%利率，三年时间无需付息，只需要三年到期后一次性还本付息共19.5亿元即可，如果有必要，还可以申请延期，而且没有要求任何抵押，只需要赵薇提供个人信用担保即可。\n\n如此优厚的条件，通常来说背后有三种可能：第一，赵薇两个字，真值钱；第二，银必信公司是“活雷锋”；第三，赵薇聘请的财务顾问恒泰长财证券真给力。第四种可能，赵薇此次收购万家文化，背后站着的不是阿里系，而是与资本市场鼎鼎大名的“明天系”。\n\n层层穿透之后，发现西藏银必信及其关联公司，此前曾与资本市场鼎鼎大名的“明天系”有过多次交集。而恒泰长财证券证券，正是明天系旗下公司，恒泰长财证券是恒泰证券全资子公司，恒泰证券则是“明天系”旗下券商。\n\n银必信曾与明天系旗下的新时代信托公司等，在2015年6月共同收购了A股公司圣莱达19.9%的股份，圣莱达2015年年报显示，上海银必信、新时代信托分列其第三、第四大股东。除此之外，与西藏银必信有相同股东的深圳东升峥嵘公司，在上市公司吉林化纤的2016年三季报中，又与“明天系”同出一门的“北京郁金香天玑资本管理中心”分列第七、第六大股东。\n\n明天系明确辟谣了其跟西藏银必信的关联关系。当然，你懂的，即便没有规则上的关联，也无法证明它跟明天系完全无关。\n\n西藏银必信背后的投资人指向一个自然人秦博，一个33岁的年轻人，并关联了上海银必信，秦博，实际上是“明天系”的代言人。野马财经援引了圣莱达不愿具名的知情人士表述称，在圣莱达的董事会上从未见过秦博出席，沟通事情都是和“明天系”的专业管理团队沟通。\n\n而上海银必信在层层穿透之后，背后的出资人指向一个叫常占惠的老者。这个人是北京航天航空大学一个已经退休的老师。你很难想像这样一个人，会掌控着一个规模达数十亿、上百亿的投资集团。这个常占惠只是一个台前人物，代人持股而已。\n\n上海银必信跟明天系的关系，它虽然不直接属于明天系，但很明显属于利益进退者。但这种泛泛的关联其实才是最关键的，也是股坛玩家最常见的套路。\n\n此次在赵薇入主万家文化的过程中，全程参与的财务顾问恒泰长财证券，同样是恒泰证券的全资子公司。\n\n“明天系”与文化娱乐领域的渊源，不止赵薇。它与另外一家香港上市公司的关系更为密切，而在这家公司的交易过程中，“明天系”又与阿里巴巴发生了关系。\n\n2014年，阿里巴巴巨资入股了香港上市公司文化中国，而文化中国的创始人董平，在资本圈与“明天系”有多年合作关系。\n\n通过入股文化中国，阿里巴巴与“明天系”在北大文化上形成了间接的合资关系，北大文化则被外界视作“明天系”的媒体投资平台，直接或间接入股了多家知名媒体，“明天系”实际控制人肖建华的得力下属、原北京大学公共政策研究所所长助理郭庆涛，担任了北大文化的董事长。\n\n顺便说一句，赵薇夫妇在2016年的12.56亿港元投资收益，绝大部分来自他们对阿里影业的投资退出。而阿里影业的前身，就是文化中国。\n\n扒到这些，是不是很有趣？\n\n本公众号金融深度（ID：tmtreport）深扒过此事几次，每次的10w+都是被删，所以讲到这里，就只能点到为止了。如果本文被删，回覆公众号后台“明天系”即可获取图文版",
			"date_added": 1485863288,
			"meta": "{\"img\":\"394,700,46a469eeeffefeffffedceedddddcdddeede,0010112222342452456733358559A5555555224222222225B24444A888A2\"}"
		}
	],
	"post_like": {},
	"comment": [],
	"follow": []
}