{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": [
			{
				"comment_id": 1,
				"body": "Hilary Clinton: The Jewish Lobby’s Candidate\nProof that Hilary Clinton is completely under the direction of America’s Jewish lobby has emerged with the news that all seven of her biggest political donors are liberal American Jews—who all support Israel, which has immigration and social policies directly opposite to those they seek to impose upon America.\nhttp://newobserveronline.com/hilary-clinton-jewish-lobbys-candidate/",
				"added": 1476513665
			},
			{
				"comment_id": 6,
				"body": "Hillary was very exalted during the last TV debates.\nShe could have take drugs.\nWhen the Jewish doctors don't give her the wonder pills she looks like here:\nhttp://www.thegatewaypundit.com/2016/08/ben-stein-hillary-not-well-looks-like-mother-took-drugs-lupus-video/",
				"added": 1476608393
			}
		],
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 2,
				"body": "The Jewish lobby controls the US Congress to such a degree that the National Security Agency’s (NSA) surveillance of the Israeli government ended up effectively spying on the House and Senate, it has emerged.\nhttp://newobserveronline.com/nsa-spies-reveal-congressjewish-lobby-link/",
				"added": 1476513834
			}
		],
		"4_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 3,
				"body": "Here is the list of Jew scams with the amounts scammed remember this only covers the scams which were uncovered and it covers only individual fraud. It does not include mega massive institutional fraud by the Rothschilds etc.\nPonzi Scheme Largest fraud in human history all three participants are Jews.\nhttps://wideawakegentile.wordpress.com/2013/11/28/the-jew-scam-list/",
				"added": 1476514274
			},
			{
				"comment_id": 4,
				"body": "Israel: World Online Fraud Center\n“The wolves of Tel Aviv” is the headline on the Times of Israel—an article published by the Jerusalem-based newspaper which openly admits that Israel is the center of the world’s “binary options” fraud scam—a practice so illegal that the US has outlawed it.\nThe Israeli binary options “industry” specifically targets non-Jews in Europe, Africa, and the Middle East, brings in over a billion dollars, and employs thousands of Jews cheating “naive would-be investors via a range of corrupt practices.”\nhttp://newobserveronline.com/israel-world-online-fraud-center/\nhttp://zionistreport.com/2016/09/commentary-jew-scam-list/",
				"added": 1476607222
			}
		],
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": [
			{
				"comment_id": 5,
				"body": "Hitler was only 1/4 Jew and the other Jews didn't want to share money with him.\nThis made him angry, took revenge on them and took their money.",
				"added": 1476607666
			}
		]
	},
	"comment_vote": {}
}