{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 1,
				"body": "The authenticy of The Protocolls of Elders of Zion\nhave been verified by US secret agency in 1919 and is NO FAKE as clamed by the Jewish media.\nThe document shows such incredible geniality, vision and detail that is impossible to be fake as stated by the US intelligence analists.\n\nCLASSIFIED US INTELLIGENCE DOCUMENTS investigating international financial issues surrounding WW I were compiled in August 1919. These sensitive documents were given SECRET classification until 1973.\nA hard copy of this document may be obtained from US National Archives in Washington DC - its number is 245-1.\nOn page 5 of the document, the public writings of Theodore Herzl, hailed as the father of world political Zionism, are cited as having “identity of thought found in the Protocols.”\nhttps://vaticproject.blogspot.fr/2010/07/protocols-of-elders-of-zion-part-iii.html\n\nIn 1884, a Mademoiselle Justine Glinka, the daughter of a Russian general, was engaged in Paris in gathering political information for the court of Tzar Alexander III.\nGlinka employed a Jewish agent named Joseph Schoerst, alias Shapiro, who had passed himself off as a Freemason and a member of the Mizraim Lodge, a Jewish Masonic order with its own particular rites and protocols. None other than Solomon Rothschild, scion of the Jewish banking dynasty, was a prominent member of the French Freemasons.\nSchoerst offered to Glinka for the sum of 2,500 francs, a document which he said would interest her greatly. This document contained extraordinary dictated writings from assorted speeches which would later be included in the final compilation of the Protocols of Zion.\nGlinka quickly passed the document to her immediate superior in Paris, General Orgeyevski, who sent them, in turn, to General Cherevin, Minister of the Interior, for transmission directly to the Imperial Court in St Petersburg.\n\nFrom The Protocols: “Only force and cunning conquers in political affairs. Therefore we must not stop at bribery, deceit, and treachery for the attainment of our end. In politics one must know how to seize the rule of others if by it we secure submission and sovereignty.”\nThe document shows how the Jews conspired to scam all Gentiles, take controll over the World and to kill millions of Gentiles if they oppose.",
				"added": 1484695814
			}
		]
	},
	"comment_vote": {}
}