{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Collective Intelligence",
			"body": "Hey all; I've been reading through the \"Handbook of Collective Intelligence\", a collection of studies, essays, and papers all about the way groups of insects, people, and computers can function collectively in ways that appear intelligent. While in recent years it has focused on the emerging fields of neuroscience and computer science, it goes as far back as Adam Smith's notion of the Invisible Hand of the free market in the 1770s, and it was my love of ZeroNet and the idea of decentralized, P2P internet that really made me interested in the study of collective intelligence in the first place.\n\nIf any of you guys are also interested in it, or the way in which human intelligence has been augmented with computers and networks, I'd recommend giving it a read, plus it points to a lot of extra reading (the more interesting material sourced for the handbook).",
			"added": 1472509032
		},
		{
			"topic_id": 2,
			"title": "THE GATES ARE OPEN",
			"body": "ICANN is fubar, and everyone mindful of free speech is wondering what comes next, aprticularly on right-wing community sites and especially on /pol/ boards on 8ch and 4chan. I've been hopping onto threads and directing people to zeronet, as we have a 0chan with a /pol/ board of our own, and I'm hoping it gets a lot of people interested in the future and bpossibilities of P2P internet. \"Alternative internet\" is something that just seems unlikely to a lot of people but it's where we are now: election scandals spiked interest in alternative media, and alternatives to twitter in the form of gab.ai, then there was interest in alternatives to youtube, and now people want--need--an alternative to the internet, to express ideas that are now under uncurbed scrutiny. So, I encourage users to find areas of discussion, shill the hell out of Zeronet, and we can seriously capitalize on this opportunity to grow.",
			"added": 1475309560
		}
	],
	"topic_vote": {
		"4_1CoVAt2jBzV4Na6nX3VG1JSfjS8fwse1Z9": 1,
		"1_1CJoRKtTrkCDDExSc2YDyJew3SNm943rK": 1,
		"1_114c9kLxp6SPG4xhhHZEnoijFdYA8j23JE": 1,
		"18_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": 1,
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1_1GcHyprZfthQCYjj26euQ3K1XCDBdTagqY": [
			{
				"comment_id": 1,
				"body": "He's a non-regressive who is capable of addressing issues without hypocrisy, which I think is a rare trait at times. I don't mean this as your typical \"He says what's on his mind, he's so genuine\" argument. But because of the rise of things like fortress liberalism, where one party only exists to oppose another, a lot of platforms have conflicting ideals. Think neo-conservatism: the government should control a powerful and invasive military able to maintain order and control wherever it is deployed, but the government should also not regulate businesses as much, even though military advancement and expansion is powered by the state-funded, military-industrial complex ... Just so, \"We need diversity, but also we're all equal in the first place.\"\n\nPersonally I feel like his sense of personal strength, and rejection of strict political ideology keeps him free from a lot of basic hypocrisy.",
				"added": 1469667724
			}
		],
		"1_1CJoRKtTrkCDDExSc2YDyJew3SNm943rK": [
			{
				"comment_id": 2,
				"body": "p2p is how multiplayer games all started out, yeah. Now, they don't really do it anymore because it has its limitations ... But you could do something with it.\nWere you thinking of something very graphical like a WoW? Or a text-based multi-user dungeon like Tapestries?",
				"added": 1469668395
			}
		],
		"1_17bo4yV2YQ8qERFytHMogwancQzQmzzaDM": [
			{
				"comment_id": 3,
				"body": "> [qu363c](#comment_20_112GGMvUJbBTCtQu8UUSYpo8UjLdo1B73n): is there a pdf somewhere ?\n\nI haven't seen one; the MIT Center for Collective Intelligence does publish a lot of documents as free PDFs on the department site.",
				"added": 1472614672
			}
		],
		"18_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 4,
				"body": "Haven't seen this show but my girlfriend has been really into it, but without any kind of TV license it's a bit harder to get new episodes day-one in the UK. Perfect excuse to get her onto ZeroNet if you ask me. ;)",
				"added": 1472719005
			}
		],
		"2_1AZjDLkfYwSmjM7ZJUf7HHnrF778augRMa": [
			{
				"comment_id": 5,
				"body": "My fiance suffers from gender dysphoria, mind, and I say suffers because it causes an immense amount of distress for her. It's a mental disorder, linked to a small but consistent abnormality in the brain, and like most mental disorders and illnesses (i.e. clinical depression) there isn't a cure either, only treatment.\n\nI could point you to a dozen books written by certified, professional psychiatrists, but they all say the same thing: avoidance and denial are absolutely, completely ineffective at treating anyone with a mental disorder: anxiety, PTSD, eating disorders, whatever. And indulging in a disorder, i.e. normalizing suicide, or chemically and surgically imitating the opposite sex hurts people, badly, and permanently, and it's absolutely reprehensible for any medical professional to permit it.\n\nSo you know what my soon-to-be wife and I do, concerning dysphoria? Find an effective therapist, learn to live with it, not reject it, or indulge in it, and stay away from incredibly reckless practices like hormone therapy and surgery, the kinds of things that ruin people's lives. Because you know what kind of people are able to accept their problematic circumstances, recognize reality, and endeavor to be happy despite it? Grown up, fucking adults.",
				"added": 1472720091
			}
		],
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 6,
				"body": "I'm still just waiting for the go-ahead. Once we start kicking in Mosque doors and firebombing their death-cult temples, there's no stopping.",
				"added": 1474405423
			}
		]
	},
	"comment_vote": {
		"120_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t": 1,
		"1_1DcE9QfZbfLZhXxgtQ8Ui3oMZvs9NVjqZB": 1,
		"5_1DcE9QfZbfLZhXxgtQ8Ui3oMZvs9NVjqZB": 1,
		"29_1JF3eQjW4voiKdcvCkMXvUx5bLmZAiVdyi": 1
	}
}