{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1,
		"1_1AQwGx5xyBi5Fvv9WHJFMCMNtQhUc8UhQF": 1,
		"1_12Xj1w5HYu6w5xtEwwLyEiMYGuCqvYKL2q": 1,
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": 1,
		"2_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": 1,
		"2_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 1,
				"body": "VOLTAIRE (Francois Marie Arouet) 18th century French philosopher, writer. \"Why are the Jews hated? It is the inevitable result of their laws; they either have to conquer everybody or be hated by the whole human race . . .\" \"The Jewish nation dares to display an irreconcilable hatred toward all nations, and revolts against all masters; always superstitious, always greedy for the well-being enjoyed by others, always barbarous -- cringing in misfortune and insolent in prosperity.\" (Essai sur le Moeurs)\n\n\"You seem to me to be the maddest of the lot. The Kaffirs, the Hottentots, and the Negroes of Guinea are much more reasonable and more honest people than your ancestors, the Jews. You have surpassed all nations in impertinent fables in bad conduct and in barbarism. You deserve to be punished, for this is your destiny.\" (From a letter to a Jew who had written to him, complaining of his 'anti-Semitism.' Examen des Quelques Objections . . . dans L'Essai sur le Moeurs.)\n\n\"You will only find in the Jews an ignorant and barbarous people, who for a long time have joined the most sordid avarice to the most detestable superstition and to the most invincible hatred of all peoples which tolerate and enrich them.\" (\"Juif,\" Dictionnaire Philosophique)",
				"added": 1481452568
			}
		],
		"1_1AQwGx5xyBi5Fvv9WHJFMCMNtQhUc8UhQF": [
			{
				"comment_id": 2,
				"body": "The real face of the orthodox Jew.\nNon-Jews are not human - teaching to children by orthodox Jews\nhttps://www.youtube.com/watch?v=cj5_bqmMhio\nKilling Gentile is permitted after Jewish Law(Sanhedrin) without any reason\nhttps://www.youtube.com/watch?v=mDNcnlFZEzc",
				"added": 1481452884
			}
		]
	},
	"comment_vote": {}
}