{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": 1,
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": 1,
		"2_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"2_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1,
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": 1,
		"1_12Xj1w5HYu6w5xtEwwLyEiMYGuCqvYKL2q": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 1,
				"body": "You may ask why are Jews so succesfull in their scamming of Gentiles and in hiding their secrets even with their lifes.\nSome former Jews who got disgusted of the Jewish lies and turned away from the Judaism revealed their  secrets.\nIn many cases where Jews were suspected of ritual murder, it was also discovered that they had moistened a piece of canvas in child blood and then divided it among themselves by cutting it in pieces.\nThis way they created between themselves a strong secret bond.",
				"added": 1484839919
			}
		],
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": [
			{
				"comment_id": 2,
				"body": "My father revealed to me the mystery of blood\n“When I turned 13 (the age of maturity for a Jew), my father revealed to me the mystery of blood, threatening me with fearful damnations if I would reveal this secret to anyone, even my brothers.\nBut if I have children, I shall be able to reveal this knowledge to only one of them, who is the most reliable, clever and deeply set in faith among them.\nI was and I am now in great danger for revealing this secret. But, having learned the true faith and having appealed to my Savior; I refer all my hope to him.”\n\nFormer rabbi who became a monk, Neophyte wrote in 1803, in the Moldavian language, the book Refutation of Jewish faith. The Jews, as they say, paid an extremely large amount of money to the ruler of Moldavia to destroy that book; in spite of that, however, a translation of it in the Greek language appeared in Yassi in print in 1818.\nHe explained in this book how his father taught him to consume Gentile blood as Jewish habbits demand it and to keep it secret.",
				"added": 1484840635
			}
		]
	},
	"comment_vote": {}
}