{
	"next_comment_id": 3,
	"comment": [
		{
			"comment_id": 1,
			"body": "I'm on OSX/Safari and while the scroll position indeed returns to where it was, I can't seem to scroll with my trackpad as usual. Instead, I have to manually drag the scroll bar until I navigate to a new page or refresh.",
			"post_id": 74,
			"date_added": 1456809142
		},
		{
			"comment_id": 2,
			"body": "Good luck!\n\nJust to give my input on the questions:\n\n>Why decentralization important to you?\n\nI've been seeing a worrying trend of a few monolithic websites/businesses owning the majority of internet traffic, ad space, content, userbase, etc. These sites do everything in their power to *remove* flexibility, customization, and the ability to freely choose the sites/services you use. You *have* to use their stuff, otherwise you get a gimped experience. Likewise, if they ever decide to kill the site, you're shit outta luck. Too bad if you relied on it, or made it a major part of your lifestyle. I've had this happen quite a few times on me. Having things decentralized means that I'm able to have control over the things I software I use when online. If I don't like it, I can change it, or use something else while still accessing the same content.\n\n>What's bad with the current internet?\n\nUsers lack control over data and how they view it. Want news? Time to visit 30 different news sites, each with their own leveling up system, clunky screen-hogging ads, lack of portability, ugly banners/headers, etc. RSS solved the problem with news a little bit, but not everywhere offers an RSS feed. And those that do just link you back to the article page. With video, I have to go to vimeo, youtube, vidme, facebook, twitter, or wherever else the video is hosted. I can easily say that hands down ZeroNet is my favorite video platform. Once uploaded, videos can be listed with *any* site, you don't rely on the list site to host the video, peers to the video from any site can help contribute to it's bandwidth, and you can easily change up the front end video player. Likewise, *all* videos are downloadable in their uploaded resolution with no tampering or injected ads. ZeroMe has something similar. If you don't like the frontend, you can change it and still get all the same content. This is where the decentralized web really shines: the ability to ditch or remix the popular sites if they start degrading for some reason.\n\n>Why are you using ZeroNet?\n\nZeroNet is simply how I want the internet to be. It's how it *should* be. Easy, accessible, future-focused, and user-friendly. There's no attempt at forcing users into a particular service, and there's no gatekeeping against people who may want to start controversial or otherwise 'business unfriendly' sites.\n\n>Or just what do you think, what should I talk about?\n\nI'd say talk about why *you* are working on ZeroNet. Why do *you* find it exciting? Why work on it? There's lots of good things here, which is why I stick around. It's hands down the easiest P2P experience I've had.",
			"post_id": 107,
			"date_added": 1489370474
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"89": 1,
		"90": 1
	}
}