{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "I dont even hate the blacks and mexicans, I HATE the Muslims and Jews.",
			"body": "Muslims and Jews BOTH follow Globalist religions that want to kill or enslave everyone who is not in it. Therefore, kick ALL Muslims and ALL Jews out of all countries !",
			"added": 1473728112
		}
	],
	"topic_vote": {
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": 1,
		"3_18Sh2Z83C23xdd6pjCq6NGv7Y6svEBcUfb": 1,
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": 1,
		"1_18Sh2Z83C23xdd6pjCq6NGv7Y6svEBcUfb": 1,
		"2_18Sh2Z83C23xdd6pjCq6NGv7Y6svEBcUfb": 1
	},
	"next_comment_id": 4,
	"comment": {
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": [
			{
				"comment_id": 1,
				"body": "> [kingbudgie](#comment_32_17nphNHoGtz9EzvvTSSbZn7WHfM1ynpdsL): As supposed to Trump who literally bribed two attorney generals?As supposed to a man who literally plagiarized, or  forced someone to do so, a doctor's letter?As supposed to people who have NO idea where the fuck they are in the world? (Trump, Hillary, and to lesser extent Johnson)\n\nThese are all Rothschild lies, you are a Rothschild.",
				"added": 1473725365
			}
		],
		"1_1PoA7YxWVZKoXWoD1PjdwByFqqCA8d2uqr": [
			{
				"comment_id": 2,
				"body": "Simply allow the user to call a decentralized page that doesn't use the key, then user enters their key by copy-paste, then this page sends the key to the other decentralized machines on the network where the key is inspected to see if it is bona fide, if yes, then access is granted, if not, then nope.",
				"added": 1473725993
			}
		],
		"3_18Sh2Z83C23xdd6pjCq6NGv7Y6svEBcUfb": [
			{
				"comment_id": 3,
				"body": "Banking gives the highest profit for doing almost no work at all, EVERY nation should create a National Bank and STOP borrowing from a privately owned Central Bank. Banks are allowed to create and lend 10x as much Currency as the worth of its assets, plus get interest on it. Currently, under the privately owned Federal Reserve Bank only a very small group of Jews, known as the Rothschilds are benefiting and STEALING Trillions from the American People because they privately own the Federal Reserve Bank !",
				"added": 1473726358
			}
		]
	},
	"comment_vote": {}
}