{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": [
			{
				"comment_id": 1,
				"body": "The Prince and the Pedophile: Charles’ Connections to Pedophilia Networks\nhttp://www.activistpost.com/2012/11/the-prince-and-pedophile-charles.html",
				"added": 1479735004
			}
		],
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": [
			{
				"comment_id": 2,
				"body": "Shalom Goldman’s God’s Sacred Tongue (2004)\n\"As late as the mid-nineteenth century influential British aristocrats . . . adopted a “British Israelite” ideology.. . . Though this group later discredited itself with its reactionary politics and thinly veiled anti-Semitism, certain of its ideas still persist in the upper reaches of British society.. . . some insist on a biological connection between English royalty and the ancient Davidic kingship. Queen Victoria seems to have subscribed to this Davidic theory and had her male children circumcised by a Jewish ritual circumciser, a mohel. Both Edward VII, the duke of Windsor, and Charles, the current Prince of Whales [sic], were circumcised by a well-known London physician and mohel, Dr. Jacob Snowman. \"",
				"added": 1479810769
			},
			{
				"comment_id": 3,
				"body": "Crown Prince Charles was Circumcised in Buckingham Palace by Rabbi Jacob Snowman, official Mohel of the London Jewish community.\nhttp://abundanthope.net/pages/Political_Information_43/Crown-Prince-Charles-Circumcised_printer.shtml\n\nPrince Charles wears Jewish skullcap at new chief rabbi inaugural\nhttp://abundanthope.net/pages/Political_Information_43/Prince-Charles-wears-Jewish-cap-at-new-chief-rabbi-inaugural_printer.shtml\nThis is not the first time the royal skullcap has made appearances as Charles has worn it at various other Jewish related events and ceremonies.\nThis is while, there are also huge speculations about vast covert links between British royals and the Israeli regime, which include reports of joint financial and political interests and go as far as drawing a Jewish lineage for the royals. ",
				"added": 1479811308
			},
			{
				"comment_id": 4,
				"body": "Jeffrey Epstein, Jewish American billionaire, sex-slave trader and convicted sex offender has closed relationship with many members of the British royal family.\nhttps://en.wikipedia.org/wiki/Jeffrey_Epstein\nPrince Andrew enjoyed sensual massages at sex offender friend's Florida mansion.\nAccording to friends, this first meeting with an underage girl probably took place during a holiday at the Mar-a-Lago Club in Palm Beach, owned by Donald Trump.\nhttp://www.dailymail.co.uk/news/article-2894970/The-Prince-paedophile-Andrew-enjoyed-sensual-massages-sex-offender-friend-s-Florida-mansion-Duke-invited-heart-Royal-Family.html",
				"added": 1479977008
			},
			{
				"comment_id": 5,
				"body": "Prince Andrew named in child sex slave case\nhttp://www.news.com.au/entertainment/celebrity-life/royals/prince-andrew-named-in-child-sex-slave-case/news-story/299a0de7b4cfe442ad14a822414f0a39\nBUCKINGHAM Palace has leapt to the defense of the Duke of York Prince Andrew after it was alleged in an American court he had had sex with an underage ‘sex slave’ kept by the notorious pedophile Jeffrey Epstein.",
				"added": 1479977299
			}
		]
	},
	"comment_vote": {}
}