{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "How to make ZeroNet better",
			"body": "",
			"added": 1473511043
		},
		{
			"topic_id": 2,
			"title": "The Government uses Geo Engineering to control the weather, YET it is the LARGEST cause of Global Warming !",
			"body": "Look at GeoEngineeringWatch.org for the TRUTH !",
			"added": 1473512547
		},
		{
			"topic_id": 3,
			"title": "The Federal Reserve Bank is privately owned and the owners are STEALING Trillions from the American People !",
			"body": "The United States must immediately start creating the currency and stop borrowing it from the privately owned Federal Reserve Bank, which gives its Globalist owners unlimited currency to totally bribe the government and finance criminal politicians! Further, the American People must NEVER pay back the 20 trillion dollars to the Federal Reserve, an UnConstitutional entity, therefore, this debt is also UnConstitutional.",
			"added": 1473512887
		}
	],
	"topic_vote": {
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": 1,
		"1_18Sh2Z83C23xdd6pjCq6NGv7Y6svEBcUfb": 1,
		"2_18Sh2Z83C23xdd6pjCq6NGv7Y6svEBcUfb": 1,
		"5_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": 1,
		"3_18Sh2Z83C23xdd6pjCq6NGv7Y6svEBcUfb": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1_15WJPhvY6MCRGdWoJXsLUE7FjhWXsTjN6V": [
			{
				"comment_id": 1,
				"body": "> [kaffie](#comment_198_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Copy the users.json file to the new computer. It has all your keys and such.\n\nToo hard. Users should be able to reuse ids they already created without having to copy files.",
				"added": 1473510841
			}
		],
		"1_18Sh2Z83C23xdd6pjCq6NGv7Y6svEBcUfb": [
			{
				"comment_id": 2,
				"body": "Users should be able to use the same user id without having to copy .json files over to the new device.\nThere should be a search engine.\nThere should be html5.\nPeople should be able to very easily clone their existing ShitNet(regular Internet) websites over to here, and then be able to administrate them from here, eventually allowing them to dump their ShitNet websites.\nEcommerce should be supported.\nBasically, you want ZeroNet to take over completely, and take all power away from the ShitNet.",
				"added": 1473511237
			}
		],
		"3_18Sh2Z83C23xdd6pjCq6NGv7Y6svEBcUfb": [
			{
				"comment_id": 3,
				"body": "> [icf20](#comment_7_1JARuoKjvXanUeKyPTXU9cus2jRzi4DZU5): nobody cares, this is not longer 2012, people that were chanting end the fed on ron paul rallies, now are in sanders camp chanting socialization of student debt \n> the fed did win the battle by bribing the population, ron paul have lost \n> gg move to mexico\n\nNope. When the economy and their Federal Reserve Currency fails, if you have any of it in one of their banks, since all the big banks together own the Federal Reserve, they will just take this from you. This is what happens when you give the Power To Create the Currency to a private group. They use this power to steal Trillions from the American People, by taking it through Income Taxes, or stealing it right from your bank account. \n\nAfter the Central Bankers create Currency out of thin air as debt to themselves, then lend it to you and you pay them back, they go out and buy gold and land with it, this is how they transfer everything of real value to themselves. This is precisely the reason why the top .00001% (the owners of the Federal Reserve Bank) owns 95% of the real wealth.",
				"added": 1473528116
			},
			{
				"comment_id": 4,
				"body": "> [reiayanami](#comment_1_1PUPAtDXeYJ8pvGiAkvzV6EmouqsaSKF3H): ((((I wonder who could be behind this goy-kun))))\n\nJews privately own the Federal Reserve Bank and ALL other Central Banks in the world, the name is Rothschild. A private group of people creating the Currency is COMPLETELY UnConstitutional.",
				"added": 1473530021
			}
		]
	},
	"comment_vote": {}
}