{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": [
			{
				"comment_id": 1,
				"body": "> [becoming](#comment_1_1FwTZnDZJjs2epEtq9yLy7m2P5kZ4TYqAR):  Every Jew, especially, gets a euphoric feeling at the idea of European people being genocided.\nA couple of non-Jews are needed as servants.\n\nIsrael’s Chief Sephardi rabbi, Yitzhak Yosef about non-Jews in Israel in 2016:\n“Who will be the servers? Who will be our assistants?” Yitzhak Yosef said. “Therefore, we leave them here in the land.”\n\nJehovah created the non-Jew in human form so that the Jew would not have to be served by beasts. The non-Jew is consequently an animal in human form, and condemned to serve the Jew day and night.\n Talmud: Midrasch Talpioth, p. 225-L",
				"added": 1475236448
			},
			{
				"comment_id": 3,
				"body": "> [becoming](#comment_9_1FwTZnDZJjs2epEtq9yLy7m2P5kZ4TYqAR): Anyone who hates Trump and is white + male, is a faggot. Everyone else are just retarded gooks, mestizos, niggers, kikes or cunts if they think a white man can't see through their shallow promotion of their [hedonistic gender]/ethnic/tribal interests - under a dishonest guise of 'enlightenment' and 'virtue'. In fact, proving that they are the very opposite of the sort of person they wish to present themselves as.\n\nDon't fool yourself. Both candidates have been approved by Israel.\nhttp://www.jpost.com/Israel-News/Politics-And-Diplomacy/Netanyahu-denies-Israeli-government-prefers-Trump-over-Clinton-462619\nHowever American Jews probably will support Hillary as they hope more money for Jewish banks.",
				"added": 1475650340
			}
		],
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 2,
				"body": "Jewish know how to make money and how to use others.\nBut frenchmen are idiots, especially from Quebec.\nI guess France would be just a bunch of beggars with their system without  being lead by the Jews. Like Greece.",
				"added": 1475408740
			}
		]
	},
	"comment_vote": {}
}