{
  "comment": {}, 
  "next_topic_id": 2, 
  "topic": [
    {
      "body": "Why are Ethiopian and Jemeni Black Jews persecuted by Israel ?\nBlack Jews are lured with promisses into Israel where they are jailed and sterilized upon arrival, their children are kidnapped and sold to rich Askenazi Jews(Soros and Rothschild are Askenazi Jews), where most of them disappeared forever.\nhttps://www.independent.co.uk/news/world/yemeni-jews-describe-their-holocaust-sarah-helm-in-yehud-reports-on-claims-that-israelis-stole-4500-1370515.html\nAccording to the Jewish controlled Wikipedia that happened only in the past because Israel was very poor at that time. Other sources are speaking about a running process to get rid of the Black Jews for all times to clean the Jewish race.\n\nBlack Jews make only 1% or less of the Jewry. Black Ethiopian Falasha Jews consider themselves Jews, they follow only the teachings of the Torah(old Testament) but they dont recognize the Talmud, they regard Gentiles as humans and they refuse to drink Gentile child blood.\nhttps://rehmat1.com/2013/02/09/israeli-jews-hate-black-people/\n\n1. Jews hate black people and consider them not humans, even less than a dog according to the Jewish Talmud.\n\"The Akum (Negro) is like a dog. Yes, the scripture teaches to honor the dog more than the Akum.\" (Jewish Talmud: Ereget Raschi Erod. 22 30)\n2. Black Jews dont fit in the Jewish superiority concept of the majority of the Jews, being much above all Non-Jew humans.\n\"The Jews are called human beings, but the non-Jews are not humans. They are beasts.\" (Jewish Talmud: Baba Mezia 114b)\nJews consider black people less intelligent to take part in their plan to control and rule the world.\n3. Black Jews not recognising the Talmud authority, they dont drink Gentile child blood, dont share the fecal praying habits of the most Jews and they endanger with it the power of the rabbis and the Jewish Chabad Mafia.\n\nThe Chabad Mafia is controlled by Askenazi Jews from Russia.\nHonest Jews created this site and warning other Jews:\nhttp://www.chabad-mafia.com/\nhttps://m.youtube.com/#/user/chabadmafia", 
      "parent_topic_uri": "9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj", 
      "title": "Why are Black Jews persecuted by Israel", 
      "added": 1491143236, 
      "topic_id": 1
    }
  ], 
  "topic_vote": {
    "1_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1, 
    "1_1NU6gdra9qhUhdbYGLia1G3HYT87qUTA7w": 1, 
    "1_1ER16jERiTJN3APCS3qvwx59E3Wk5V4EE4": 1, 
    "1_1DoE2oLDwVmMgdk56QaNB7khXJWuyZstnU": 1, 
    "3_12p3yAJYYbtSY226FLMaxXLMtFkBaLxu9a": 1, 
    "2_12p3yAJYYbtSY226FLMaxXLMtFkBaLxu9a": 1, 
    "1_1E1fsmFRrsPsfiYVbXfifNMcaWwuk8iFcp": 1
  }, 
  "next_comment_id": 1, 
  "comment_vote": {}
}