{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1AhXDbKvcLap7TcS2542J7bFYzKHM3xeRU": 1,
		"1_13G7h5b1e4Ch1vBfWvA4Nuttaqa8cf91W4": 1,
		"13_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1_1AhXDbKvcLap7TcS2542J7bFYzKHM3xeRU": [
			{
				"comment_id": 1,
				"body": "> [warlock](#comment_33_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): That's why communism comes short. You are dictators and you care not about what people want, only what you want people to want. \"Nobody needs an iPhone! You are stupid fucks! This Nokia from 1997 can perform phone calls just like an iPhone. You do not need an iPhone!\"\n> And there will most certainly not be a printable open hardware phone in 10 years. And probably I would still pay for a good phone, than to build my own. Why? Because I WANT to. I don't want a printed brick. I want a smooth sexy and sleek phone that I can buy with instant gratification. Not something I have to tinker with and spend time producing and fixing.\n\nThe thing is, you probably can't afford that sexy phone, not if you don't subsidize it with slavery.\n\nSo the question is, do you want to live in a world of free people with reasonable things, or do you want to have fancy things and tolerate slavery and human exploitation?\n\nThe fact of the matter is that you don't have to give up nice things in exchange for freedom, at least not forever.  The technology to offset slavery with automation has existed for a long time but its application has been constrained to preserve social classes.  These social limitations in turn constrain the velocity of technological development.   If we can get past the social obstacles,  conquering the engineering challenges will be elementary by comparison.",
				"added": 1484777638
			},
			{
				"comment_id": 2,
				"body": "> [warlock](#comment_44_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): No. I agree. But people are selfish. Even if you pretend not to be, you cannot make 7 billion people live in harmony. I'm being realistic. Try playing prisoners dilemma with 7 billion participants. I ain't gonna work out for you. So we have to make the best of it.\n\nI agree community size is key.  One thing I'm experimenting with now is simulating small (100-200 person) communities to see if it's possible to sustain the good things of modern life in community sizes that are compatible with the limits of human compassion.\n\nThe idea comes from observing and spending time with members of a nearby, successful, contemporary near-anarchist community: the Amish.\n\nThe Amish deliberately limit community size to about 150 people.  This happens to agree with research that people are capable of maintaining meaningful relationships with about the same number.  When an Amish community grows beyond this size, they send a group of members off to create a new one.  They stay connected (to the extent that they are connected to any other Amish community), but they are each separate autonomous communities.\n\nMy work is focused on determining if this (along with some other principles) could be applied to communities that don't have all the restrictions the Amish place on themselves.  I've been studying them and other similar communities and so far I don't see a reason to believe it's not possible.  Now I'm working on software simulations that will help me test these ideas and understand where they need to be tweaked or improved before involving groups of people IRL.",
				"added": 1484828297
			},
			{
				"comment_id": 3,
				"body": "So, are we practicing anarchists here or is this mostly theoretical?  If practicing, let's trade tips and tactics, because each day it looks like the world needs more anarchists :)",
				"added": 1485380408
			},
			{
				"comment_id": 4,
				"body": "> [planespherev3](#comment_136_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): We need 7 billion anarchist. There is nothing to do except making people listen reason. When we reach a critical mass (about 70-80%), then society will change itself without any use of violence. \n> Of course there is only one little problem: it will take decades, but for me it doesn't matter.\n\nI'm starting small and working my way out, like a bubble, or a virus :)\n\nI've (as I'm sure the rest of you have) been cultivating TAZ's for most of my life, and in general they have been useful but they don't benefit humanity at large in as direct a way as I would like.  So I've been taking baby steps toward first operating myself as an anarchist, and then repeating the process with the people and systems I interact with.\n\nMy thought is that it is a lot easier to show people the advantages of anarchy than it is to explain them, and they are more likely to accept the philosophy when they can hold the benefits in their hands.\n\nI'm also the type of person who prefers to try something and measure results directly than to spend too much time trying to guess what will happen (although I enjoy some of that, hence why I'm here).  Of course direct experiments are not always possible (especially when they involve humans) which is why I'm pursuing the simulation route as something of a compromise until I can answer some questions and demonstrate at least simulated positive results.",
				"added": 1485788327
			},
			{
				"comment_id": 5,
				"body": "> [thisweb11](#comment_332_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Why?  Because most people, the poor, middle class, even a lot of the rich, spend most of their day working for someone else.   Middle class woman goes to work,  she pays a poor woman to look after her kids whilst she is at work earning her boss money so he can buy nice things for his kids.   And then somehow the poor woman has to look after her own kids too!  Who benefits from this circular system - it makes more sense for everyone to look after  own kids and work for own family.  What is the point in this kind of productivity except for its own sake, which usually means doing bullshit jobs, to sustain people doing bullshit jobs looking after the fallout of the bullshit jobbers (eg, cleaners sweeping the shit from office floors, and fast food workers serving busy managers of bullshit jobbers).  A vicious circle.   Why dont we all clean our own toilets and cook our own food, look after our own kids and garden, and work LESS hours doing other peoples work.    Who the hell should want to flip burgers all day for other people? Or clean the bosses toilets.    It might be great if you are able to afford it, but not for the poor (ie the majority of all humans) .    But even the middle class who use these people have to do shit jobs , long hours, to get paid so they can afford to pay these people to do the things they'd be otherwise doing themselves!   Save for a holiday so you can take time of work which you do so you can afford a holiday.  Rinse repeat.  Capitalism is stupid.   Its dangerous.  Its mind numbing.  Its soul destroying.  It ruins the planet.  And wastes our time.  Did I mention it is stupid?  Its insane to keep going on like this  (unless your at the top of the pyramid).  It cannot be reformed.  And doing one job all day every day (as most of us do) is mentally unhealthy, we need to be generalist workers, working few hours on many things.  We will surely die of boredom doing the same job all our lives.  Even if thats a 'good' job, repetition always becomes boring.   No wonder people are so damn depressed.  Efficiency is a drag.  Work should be abolished.  'In praise of idleness' by Bertrand Russell is one of my favourite anti-capitalist essays.  (consider how long ago it was written)  Theres some other great essays on the subject here as well if you are interested :  \n> http://www.audioanarchy.org/antiwork.html\n\nYes.\n\nWhat I'll add to this is that I think specialization is healthy when it is voluntary.  Some people prefer some tasks, and I've been repeatedly surprised to find out that someone loves doing a thing I hate to do.  What's essential is that it has to be *truly* voluntary, and not coercive by using artificial incentives like currency.\n\nImagine a world where people do what they love to do for others, and do what they need to do for themselves, and fill in any \"gaps\" with automation.",
				"added": 1486039947
			},
			{
				"comment_id": 7,
				"body": "> [thisweb11](#comment_334_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): But so few people get to do a job they care more about than anything else they could be doing with their time.\n> \n\nVery true, in my experience most people *choose* out of need (or perceived need) to set aside work they love for work with higher financial reward, prestige, etc.  Of course in the long run any advantage this creates is negated by the dissatisfaction that comes with spending so much of your life doing unfulfilling work.\n\n> I can imagine it.  And its possible.  But we are trained to never use our imaginations.\n\nTrue.  This is why it's essential to communicate these ideas early, before they are hardened by \"education\", etc. and become much harder to change.\n\n> Unless it makes you rich that is.  Then its called entrepreneurship.\n\nMore importantly, unless it makes your *masters* rich :)",
				"added": 1486149681
			}
		],
		"13_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": [
			{
				"comment_id": 6,
				"body": "What's the best way to update?",
				"added": 1486040051
			}
		]
	},
	"comment_vote": {
		"46_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"47_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"48_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"1_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"52_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"2_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"53_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"6_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"57_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"2_1QH1N2BcCN6bQu1J98yUovsnnkvHn8TKhC": 1,
		"59_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"61_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"17_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"24_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"86_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"89_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"91_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"92_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"25_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"26_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"28_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"29_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"30_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"31_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"32_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"33_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"93_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"95_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"97_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"34_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"35_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"98_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"99_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"100_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"101_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"38_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"39_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"102_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"103_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"104_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"44_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"45_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"52_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"106_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"107_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"20_1NLj8uWHVf68dt53Wuz5HRqQvX7fScCXpD": 1,
		"591_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"270_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"109_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS": 1,
		"128_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS": 1,
		"229_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"332_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"336_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1
	}
}