{
	"next_comment_id": 6,
	"user_name": "Juansantiago",
	"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
	"post_like": {
		"17pnj2wEu5qFeRtQErmLVtCBvYuocGum82_1481737765": 1481743640,
		"18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1484747643": 1484762941
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Martinv:  ¡Que bonito es el botón de bloquear! y el que confunde censura con respeto medio-abmiental se pinta solo.",
			"post_uri": "1ArVAHkGKYqRo2jQ1oPHjkFVHkYDvuBoci_1484396876",
			"date_added": 1484403022
		},
		{
			"comment_id": 2,
			"body": "Millor en català. :)",
			"post_uri": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_1484747643",
			"date_added": 1484763081
		},
		{
			"comment_id": 3,
			"body": "Yo desde hace tiempo uso debian, antes usaba Mint y no me falta nada, solo tengo que trabajar media o una hora más para tenerlo a gusto... pero casi no juego :)\nPara jugar a algunos juegos necesitas todos los recursos posibles, por lo que te recomiendo:\nBajar mint con xfce o sobre otro mint  sudo apt-get install xfce4\nluego apt-get install openbox\nluego cierras sesión y abres otra con openbox\nluego consola otra vez e invocas xfce4-panel\nprescindes de iconos en escritorio, fondos de pantalla y demás sobrantes pero ganas recusrsos y estabilidad. ",
			"post_uri": "1DunM8CUWAxBcf3RWvweEke85AMqhVoTUs_1485371810",
			"date_added": 1485463640
		},
		{
			"comment_id": 4,
			"body": "@Facineroso: No te digo que no uses mint, pero con la receta que te doy,  no  notarás falta de interfaz gráfica, una vez instalado openbox solo tocarás la consola para invocar el panel  y eso es solo escribir en la consola xfce4-panel :) \n\nEstas son unas capturas solo con panel inferior no encentro con ambos paneles tendré que rehacerlas, pues ya te digo, no te lo digo para que lo hagas, pero si quieres hacerlo, verás que al final es eficaz e incluso divertido adaptar tu máquina y encontrás tus propias recetas.  \nhttps://framasphere.org/posts/1080140",
			"post_uri": "1DunM8CUWAxBcf3RWvweEke85AMqhVoTUs_1485371810",
			"date_added": 1485468747
		},
		{
			"comment_id": 5,
			"body": "@Facineroso: posdata, las capturas anteriores son con debian, pero lo hice con mint y es lo mismo. ",
			"post_uri": "1DunM8CUWAxBcf3RWvweEke85AMqhVoTUs_1485371810",
			"date_added": 1485468827
		}
	],
	"flags": {},
	"comment_like": {
		"18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj_62": 1484402903
	}
}