{
	"next_comment_id": 2,
	"comment": [
		{
			"comment_id": 1,
			"body": "Decentralization: It gives me this fantastic feeling of freedom. When I first got connected to the internet (rather late on really) around 2004, it was amazing. I didn't feel limited as to what I could find, share and interact with. I'd spend hours just clicking through links, seeing where it'd take me. I still have friends now that I encountered through this.\nDecentralization, and by association distribution is super-important to me. Less points of failure for services, less outside interference & censorship and when the networks get to a good size, transfer speeds are better than the centralized equivalents.\n\nCurrent internet: These days, it feels like everything tends towards a few major central sites. Some of which I actively avoid, like Facboook. It feels like a crappy shopping mall now. Horrid adverts that blatantly lie to you and all. Also adverts. They were unintrusive, then got bad enough adblockers became a thing. I understand that for some sites, ads help with running the site, but the number of times I've just skipped out on a site because of some awful fullscreen overlay that's so badly coded the close button doesn't even work. Ugh. Too many. (Related to this, I love that with a system like Zeronet if I wanted to help with a site's hosting, I can do.)\n\nI think what I've said here generally covers why I use Zeronet. Freeing, resistant to irritating things, no ads (yet, I hope never). I also have to say having a local copy of visited sites is great while traveling. Load up a load of sites of interest and even if there's no wifi (or it costs lots of $$$) you've still got a kind of access.\nSomething like StackOverflow, or a general questions & solutions site on Zeronet would be amazing. I think the benefits are obvious.\n\nHope this is of some use for your talk, I'm rather excited for it. \nAlso, best of luck :D",
			"post_id": 107,
			"date_added": 1489114902
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}