{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": 1,
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_1AQwGx5xyBi5Fvv9WHJFMCMNtQhUc8UhQF": 1,
		"2_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": 1,
		"2_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1,
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": 1,
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": 1,
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 1,
				"body": "This prophecy from Benjamin Franklin is authentic and was confirmed by many recognized historians.\n\n\"I fully agree with General Washington, that we must protect this young nation from an insidious influence and impenetration.The menace, gentlemen, is the Jews.\n\n\"In whatever country Jews have settled in any great number, they have lowered its moral tone; depreciated its commercial integrity; have segregated themselves and have not been assimilated;have sneered at and tried to undermine the Christian religion upon which that nation is founded, by objecting to its restrictions;have built up a state within the state; and when opposed have tried to strangle that country to death financially, as in the case of Spain and Portugal.\n\n\"For over 1,700 years, the Jews have been bewailing their sad fate in that they have been exiled from their homeland,as they call Palestine. But gentlemen, did the world give it to them in fee simple, they would at once find some reason for not returning. Why? Because they are vampires, and vampires do not live on vampires. They cannot live only among themselves. They must subsist on Christians and other people not of their race.\n\n\"If you do not exclude them from these United States,in their Constitution, in less than 200 years they will have swarmed here in such great numbers that they will dominate and devour the land and change our form of government, for which we American shave shed our blood, given our lives our substance and jeopardized our liberty.\n\n\"If you do not exclude them, in less than 200 year sour descendants will be working in the fields to furnish them substance, while they will be in the counting houses rubbing their hands. I warn you, gentlemen, if you do not exclude Jews for all time, your children will curse you in your graves.\n\n\"Jews, gentlemen, are Asiatics, let them be born where they will nor how many generations they are away from Asia, they will never be otherwise. Their ideas do not conform to an American's,and will not even thou they live among us ten generations. A leopard cannot change its spots. Jews are Asiatics, are a menace to this country if permitted entrance, and should be excluded by this Constitutional Convention.\"\n\n-Benjamin Franklin, 1787, at The Constitutional Convention, Philadelphia, Pennsylvania\nhttp://www.jewwatch.com/jew-references-gentile-benjamin-franklin.html",
				"added": 1481270553
			}
		],
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": [
			{
				"comment_id": 2,
				"body": "This is very characteristic for Jews how they hide their crimes.\nThey threat or bribe everybody and if they don't succeed with it they hire other criminals murders to eliminate all witnesses.\nIn Ukraine they have ritually killed a lot of Gentile children but the Jewish Bolshevik assault troops killed all witnesses of their crimes and even their families and neighbors. Millions died during this cleansing.",
				"added": 1481271176
			}
		]
	},
	"comment_vote": {}
}