{
	"next_comment_id": 10,
	"comment": [
		{
			"comment_id": 1,
			"body": "Great, thank you! I've just updated mine.\n```\n- Starting ZeroNet...\n[12:55:46] - OpenSSL loaded, version: 01000207F\n[12:55:46] - Patching sockets to tor socks proxy: 127.0.0.1:9050\n[12:55:46] - Version: 0.3.7 r1284, Python 2.7.9 (default, Mar  8 2015, 00:52:26)\n```",
			"post_id": 83,
			"date_added": 1462535833
		},
		{
			"comment_id": 2,
			"body": "@nofish, I can't suggest anything that's not yet registered (.bit) and from the names that are registered I could suggest only those I own (because I could donate it to the Project)... \nMaybe you could ask for suggestions what suitable domain names users are willing to donate to the project?",
			"post_id": 83,
			"date_added": 1462551954
		},
		{
			"comment_id": 3,
			"body": "> [nofish](#comment_86_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): the domain doesnt matter, probably it will be a subdomain of zeronetwork.bit like the other sites\n\nMaybe something short or telling, then: mix, social?",
			"post_id": 83,
			"date_added": 1462560545
		},
		{
			"comment_id": 4,
			"body": "1. Great, I need to load up on ZeroCoins and sell .. oh, wait.\n2. It's weird to offer this kind of help on ZeroNet (considering the anonymity and so on) but if you need input or help with review of the presentation, let us know. Maybe asking 2-3 trusted Github contributors would be better. \nHope it goes well!",
			"post_id": 84,
			"date_added": 1463627081
		},
		{
			"comment_id": 5,
			"body": "> [anomie](#comment_1_19jbACPsnTxWhqTnMYTfbxBBvx6xmD656r): To be really picky, you're not presenting to an English audience, but an American one.\n> Sorry, my pedantry must be satisfied. ;)\n\n:-)\nThought of that too, but the audience will likely be mixed. There will probably be few Englishmen among them.",
			"post_id": 84,
			"date_added": 1463810649
		},
		{
			"comment_id": 6,
			"body": "Great! Thank you!",
			"post_id": 85,
			"date_added": 1464937036
		},
		{
			"comment_id": 7,
			"body": "Exciting new stuff!\nTorrent vs IPFS: torrents are more interesting to me, but I'm curious what is the point of using IPFS with ZeroNet - personally I don't see it and the people who asked for it never really explained. \nTorrenting isn't great for Tor (which is how I use ZN), but for small and medium files (say, PDF articles of news that are normally blocked in the country where a ZN user lives) would be a nice use case for Torrents over Tor. \n\nAny chance to see this code uploaded to `master` this week?\n\n> [ivebeencensored](#comment_1_17vggMZJVHB4VPsv1iSNP5hqu3F5EmYihm): JPEGs remain in browser history and GIF Time keeps images on computer even after deleting JPEGS\n\nSo delete your browser cache after browsing or use Tor or disable your browser cache. \nWhat do you expect, that ZeroNet can access your browser cache and delete (or worse, add) files as it pleases?\n",
			"post_id": 95,
			"date_added": 1477987570
		},
		{
			"comment_id": 8,
			"body": "> [nofish](#comment_130_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj)\n\nExtra goodies - sounds great! I'm sure it's going be worth the wait.\n\n",
			"post_id": 95,
			"date_added": 1478369990
		},
		{
			"comment_id": 9,
			"body": "Awesome! It's going to take me weeks to explore all these goodies!\nThank you!",
			"post_id": 96,
			"date_added": 1478720167
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"85": 1,
		"87": 1,
		"89": 1,
		"95": 1,
		"96": 1
	}
}