{
	"next_post_id": 16,
	"next_comment_id": 1,
	"next_follow_id": 2,
	"avatar": "jpg",
	"user_name": "Fire1314",
	"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
	"intro": "新 ZeroNet 用户",
	"post": [
		{
			"post_id": 1,
			"date_added": 1489143994,
			"body": "你好 ZeroMe!"
		},
		{
			"post_id": 1489144717,
			"body": "[怀古伤今]中国历史十大名相\nTop1 才高齐天，谋深如海——秦朝名相李斯\n李斯，（约前280年－前208年），秦朝丞相，楚国上蔡（今河南上蔡县）人，中国历史上著名的政治家、文学家和书法家，千古一相。在我国历史上声名显赫，功绩卓著。他年轻时当过小穷，后拜苟子为师，学习帝王之术、治国之道。学业完成以后，他分析了当时的形势，认为“楚国不足事，而六国皆弱”，唯有秦国具备统一天下，创立帝业的条件，于是他决定到秦国去施展自己的才能与抱负。\n公元前247年，李斯来到秦国，先在函相吕不韦手下做门客，取得吕的信任后，当上了秦王政（赢政，即秦始皇）的侍卫。李斯利用经常接近秦王的机会，给秦王上了《论统一书》，劝说秦王抓紧“万世之一时”的良机，“灭诸侯成帝业”，实现“天下一统”。秦王政欣然接受了李斯的建议，先任命他为长史，后又拜为客卿，命其制定吞并六国，统一天下的策略和部署。\n公元前237年，秦国宗室贵族借口韩国水工郑国在秦搞间谍活动事件，要求秦王下令驱逐六国客卿，李斯也在被逐之列。李斯在被逐离秦途中，写了《谏逐客书》，劝秦王收回成命。他在《谏逐客书》中，列举大量历史事实，说明客卿辅秦之功，力陈逐客之失，劝秦王为成就统一大业，要不讲国别，不分地域，广集人才。秦王看了《谈逐客书》深受感动，立即取消了逐客令，并恢复了李斯的宫职，不久又提升了他当廷尉。《谅逐客书》不仅是具有重要价值的历史文献，而且也是一篇胎炙人口的代秀文章。鲁迅先生曾说：“秦之文章，李斯一人而已。”\n李斯重新受到秦王政的重用后，他以卓越的政治才能和远见，顺应历史发展的趋势，佐助秦王政制定了吞并六国，实现统一的策略和部署，并努力组织实施。结果仅仅用了十年的时间，就先后灭了六国，于公元前221年建立了我国历史上第一个统一的、中央集权制的封建国家，第一次完成了统一大业。秦朝建立以后，李斯升任丞相。他继续辅佐秦始皇，在巩固秦朝政权，维护国家统一，促进经济和文化的发展等方面屡建奇功。他建议秦始皇废除了造成诸侯分裂割据、长期混战的分封制，实行郡县制。把全国分为36郡（后增加到41郡），郡下设县、乡，归中央直接统辖，宫吏由中央任免。在中央设三分、九卿，分职国家大事。这一整套封建中央集权制度，从根本上铲除了诸侯王国分裂割据的祸根，对巩固国家统一，促进社会发展起了积极作用。所以，这一制度在秦以后的封建社会里一直沿用了近两千年。秦统一后，由于过去各诸侯国长期分裂割据，语言、文字有很大差异，对于国家的统一和经济、文化的发展极端不利。李斯及对地向秦始皇提出了统一文字的建议，并亲自主持这一工作，他以秦国文字为基础，废除异体字，简化字形，整理部首，形成了笔画比较简单、形体较为规范，而且便于书写的小篆（也称秦篆和斯篆），作为标准文字。他还亲自用小篆书写了一部《仓颉篇》，作为范本，推行全国。小篆的出现是汉字发展史上的一大进步。鲁迅先生说，李斯在我国文学史上是有“殊勋”的。今人遗憾的是，斯手书已汛大多散失。现在，中国历史博物馆还收藏有李斯亲书的琅玡刻石，山东泰山岱庙现存有李斯篆书的秦二世诏书刻石的残片，这些刻石虽己严重残损，但它是我国已发现的最早文字刻石，实为稀世珍宝。李斯还在统一法律、货币、度量衡和车轨等方面付出了巨大努力做出了重大贡献。\n此外，人们所熟知的“焚书坑儒”，也是李斯建议为打击儒生以古非今、诽谤朝政的倒行逆施，为巩固中央集权所采取的非常措施。这有当时历史条件下，不无积极作用，但它毕竟是我国文化史上的一次大浩劫，对我国秦以前文化典籍的破坏是极其严重的。\n公元前210年，秦始皇死后，李斯为保全自己的既得利益，附和赵高伪造遗诏，立少子胡亥为帝，赵高篡权后又施展阴谋，诬陷李斯“谋反”，将其腰斩于市，并夷灭三族。\n\n中国历史上十大名相Top2 功冠群臣，声施后世——西汉开国名相萧何\n萧何（前257年－前193年），汉族，沛丰邑人，汉初三杰之首。汉初谋略家，汉王朝开国名相，辅助汉高祖刘邦建立汉政权。\n萧何早年任秦沛县狱吏，秦末,天下大乱，萧何乃一刀笔小吏，也能乘势而起，拥立沛公，反了沛县，辅佐刘邦起义。攻克咸阳后，诸将皆争夺金银财宝，他却忙于接收了秦丞相、御史府所藏的律令、图书，掌握了全国的山川险要、郡县户口、财力、物力的分布情况，对日后制定政策和取得楚汉战争胜利起了重要作用。项羽称王后，萧何劝刘邦避项羽锋芒，劝说刘邦接受分封，屈尊汉中王，立稳脚跟，立足汉中，养百姓，纳贤才，收用巴蜀二郡的赋税，积蓄力量，然后与项羽争天下，为此深得刘邦信任，被任为丞相。他慧眼独具，极力向刘邦举荐韩信，认为刘邦要取得天下非用韩信不可，其月下追回韩信，使“汉兴三杰”到了刘邦一人手下，乃汉初开国两件大事，功在萧何，后来韩信在楚汉战争中的才干证明萧何慧眼识人。\n楚汉战争时，萧何留守关中，侍太子，为法令约束,安定百姓，征收赋税，供给军粮，使关中成为汉军的巩固可靠后方，不断地输送士卒粮饷支援作战，首功在萧何！对刘邦战胜项羽，建立汉代起了重要作用。\n汉代建立后，萧何以功最高封为“赞侯”，位次第一，食邑八千户。\n萧何治国安邦，颁法立规，采摭秦六法，重新制定律令制度。萧何在“约法三章”的基础上，参照秦法，摘取其中合乎当时社会情况的内容，制定了律法共九章，即为《九章律》（《盗律》、《贼律》、《囚律》、《捕律》、《杂律》、《具律》，增加《户律》、《兴律》、《厩律》）。\n这是汉朝制作律令的开端。萧何制定的汉律九章，删除了秦法的苛繁、严酷，使法令更为明简。 \n萧何在法律思想上，主张“无为”，喜好“黄老之术”。高帝十一年（前196年）又协助高祖消灭韩信、英布等异姓诸侯王,被拜为相国。为了避免高祖的诛杀，他以“自毁其名”的方法，以逃避被杀的危机。\n萧何身居相位，历时二主，善始善终。汉十二年（公元前195年）四月二十五日，汉高祖刘邦病逝于长乐宫，享年62岁。同年，太子刘盈即位，是为惠帝，萧何继任丞相。此时萧何年事已高，仍辅佐惠帝。萧何病危时，举荐曹参接替自己，保证了汉初政策的连续性，更有“萧规曹随”之誉。\n惠帝二年（前193年）卒，谥号“文终侯”。\n萧何不论在战争期间，还是在汉初恢复时期，都表现出了中国古代杰出政治家的风度和治国才能，几千年来都被人们所称颂。\n司马迁在《史记》中盛赞其为“功冠群臣，声施后世”，太史公受之无愧！\n\n中国历史上十大名相Top3 鞠躬尽瘁，死而后已——蜀汉名相诸葛亮\n \n    诸葛亮，（公元181年～234年），字孔明，人称卧龙，汉末徐州琅邪郡阳都县(今山东沂南县)人，父诸葛珪曾为泰山郡丞，叔父诸葛玄为当时名士。诸葛亮兄诸葛瑾仕于吴孙权，拜大将军、左都护，领豫州牧。亮从弟诸葛诞仕于魏，为吏部郎，累迁扬州刺吏、镇东将军、司空。兄弟三人“并有盛名，各在一国。于时以为‘蜀得其龙，吴得其虎，魏得其狗’”(《世说新语．品藻》注云：狗乃“功狗”之狗，虽非龙虎之比，亦甚有功之人，故曰并有盛名。)。\n  诸葛亮早年不得志，不为志向所屈，故结庐于襄阳城西隆中山中隐居待时。公元207年，思贤若渴的刘备三顾茅庐，请计于诸葛亮，诸葛亮精辟地分析了天下形势，提出了统一天下应走鼎足三分，联吴抗曹的道路，也称“隆中对策”。这是诸葛亮为刘备提出的一条正确的政治路线相军事路线，也是诸葛亮一生的行动纲领。从此，刘备的事业才出现了转机。\n  公元208年曹操率数十万大军南下荆州，诸葛亮以其大智勇出使东吴，说服东吴抗击曹操，取得赤壁之战的胜利，为刘备取得立足之地。刘备称帝后，谙葛亮任丞相。公元223年蜀后主刘禅继位，诸葛亮被封为武乡侯，领益州牧。他励精图治，赏罚严明，推行屯田政策，并改善西南各族与蜀汉的关系，有利于当地经济、文化的发展。他曾六次北伐中原。公元234年，因积劳成疾，病逝于五丈原，葬于定军山(今陕西勉县东南)。\n  诸葛亮的一生共两个二十七年。公元207年以前的二十七年，是他修身养性立志用世的准备阶段。他学有所成后没有北走曹操，也没有南归孙权，而是辅佐了“名微众寡”的刘备，这固然有客观原田，但也并非出于偶然。他之所以要选择兴复汉室的道路，说明他是一个维护封建纲常、崇尚儒家忠义道德的正统思想家。公元207年到234年的二十七年，是谙葛亮尽忠蜀汉的阶段。无论先主、后主都非常信任他。\n  诸葛亮没有恪守儒家教条，他尊王而不攘夷，进兵南中，和抚夷越，在三国中执行了最好的民族政策。他明法、正身、和吴、治军，以“鞠躬尽瘁，死而后已”的无私奉献精神战斗到生命的最后一息。他的忠公体国精神，生前就深受蜀人爱戴，死后更长期受到后人的敬仰，已成为中华民族传统文化的一份遗产。\n\n中国历史上十大名相Top4 道破天下事，一策定乾坤——唐初名相房玄龄\n    房玄龄，（579年～648年），别名房乔，字玄龄（一说名玄龄，字乔松），汉族，齐州临淄人（今山东省济南市章丘市相公庄镇人），父彦谦，隋司隶刺史。是中国唐朝时的开国宰相。\n  梁国文昭公房玄龄，唐代初年著名良相、杰出谋臣，大唐“贞观之治”的主要缔造者之一。他是一位出身“书香世家”的纯正儒生，跟随秦王十年艰辛征战；终生“效父清白”的饱学之士，辅佐太宗二十载稳任首宰。房玄龄智能高超、功勋卓越、地位显赫。但他善用伟才、敏行慎吉、自甘卑下、常行让贤。“群星捧月月隐平，治世夜空灿月明”，是对他特有的名臣气度、良相风格的赞言。作为一名雅士，他颇具可佩可学的典范；作为一代勋臣，他堪称可歌可颂的英贤。\n  房玄龄博览经史，工书善文，十八岁时本州举进士，授羽骑尉。隋末大乱，李渊率兵入关，玄龄于渭北投李世民，先后担任秦王府记室、陕东道大行合考功郎中。他屡从秦王出征，参谋划策，典管书记。每平定一，别人争着求取珍玩，他却首先为秦王幕府收罗人才。他与谋臣猛将密相交结，使他们各尽死力。他和杜如晦是秦王最得力的谋士。秦王弟兄间争夺皇位，太子建成在高祖前谮毁他和如晦，遂同被斥出秦王府。\n　　唐武德九年（626年）他参与玄武门之变的策划，与杜如晦、长孙无忌、尉迟敬德、侯君集五人并功第一。李世民即位（即唐太宗李世民），玄龄为中书令。贞观三年（629年）二月为尚书左仆射。十一年封梁国公。至十六年七月进位司空，仍综理朝政。十七年，与长孙无忌等二十四人图形于凌烟阁。晋王李治为太子时，他任太子太傅。太宗征高丽时，他留守京师。二十二年病逝。\n　　贞观前，他协助李世民经营四方，削平群雄，夺取皇位。李世民称赞他有“筹谋帷幄，定社稷之功”。\n  贞观中，他辅佐太宗，总领百司，掌政务达二十年；参与制定典章制度，主持律令、格敕的修订，又曾与魏徵同修唐礼；调整政府机构，省并中央官员；善于用人，不求备取人，也不问贵贱，随材授任；恪守职责，不自居功。后世以他和杜如晦为良相的典范，合称“房、社”。\n  房玄龄，大唐开国大臣，贞观名相，也是唐初居位最长的宰相。他为人多智，有奇谋，人称“房谋”。隋时，人皆言隋祚长久，唯房玄龄慨然而忧，一语道破天下事：“今虽清平，其亡跷足可待。”云破日出，便走马投身秦王李世民，成为幕府谋主，助李世民扫平群雄，一统江山，立下汗马功劳。玄武门事变，他是主谋，翦除太子党，助李世民得了帝位，可谓一策定乾坤！\n  作为大唐宰相的房玄龄，贞观元年，图治安民，不遗余力，得太宗殊遇，被誉为“汉之萧何”，也入凌烟阁二十四功臣，终至辉煌，儿子当了附马，女儿作王妃，如此功绩，也不枉其为大唐天下谋尽一生。\n\n中国历史上十大名相Top5 大器晚成，历任四朝——唐朝名相姚崇\n    姚崇（公元650年－公元721年），本名元崇，字元之，避唐玄宗“开元”年号讳，改名姚崇，河南三门峡陕县人。父姚懿，曾任硖石县令，祖籍江苏吴兴，因先辈世代在陕州为官，遂定居陕州硖石（今属河南三门峡陕县硖石乡）。崇出身于官僚家庭。年轻时喜好逸乐，年长以后，才刻苦读书，大器晚成。历任武则天、中宗、唐睿宗、唐玄宗四朝宰相，有“救时宰相”之称，是中国历史上的著名宰相。特别是在玄宗朝早期为相，对“开元之治”贡献尤多，影响极为深远。\n  姚崇自幼受父影响，孜孜好学，胸怀大志。长大入朝论政，答对如流，且下笔成章，得到武则天的赏识，初拜侍郎（四品官），后连续升迁，成为武则天、中宗（李显）、睿宗（李旦）、玄宗（李隆基）四朝宰相，是中国封建史上一位杰出的政治家。\n  武后时期，姚崇以门荫入仕，被授与濮州司仓的职务。他于武后时期，升为兵部郎中。当时正值契丹侵扰河北，战事频仍，姚崇向武则天剖析形势，分辨利害，受到武则天赏识，擢升为侍郎。698年再升为同中书门下三品（宰相加衔）。\n  中宗、睿宗时期，后来张柬之助中宗复位，这时姚崇外调为亳州及常州刺史。其后在睿宗时，再任宰相，但因为与太平公主发生冲突，结果被贬至申州任刺史，其后又不断调迁，但即使为地方官员，其为政仍甚得民心，可见他并没有因被外调而灰心。\n  玄宗时期，开元元年（公元713年），唐玄宗继位消灭了太平公主的党羽，巩固了地位，决定起用姚崇为相。姚崇出任宰相后，所做的第一件事就是向唐玄宗建议改除武则天晚年以来十几年间混乱政治的积弊十种。主要是罢免冗官，行法自近，禁绝贿赂等。玄宗很爽快地全盘采纳，并全力支持姚崇逐条落实。姚崇任宰相三年，实行了选贤任能、奖励清廉、精简机构、裁减沉员、惩治贪官、爱护百姓的清明政治，为“开元盛世”奠定了良好的基础。姚崇被誉为“救时宰相”，与唐太宗时的房玄龄、杜如晦并称为贤相。\nTop6 半部论语治天下，三入相者——宋朝名相赵普\n赵普（公元922~公元992），字则平，北宋初期的杰出政治家，中国历史上著名的谋士。他15岁随父迁居洛阳，自幼学习吏治，是赵匡胤“黄袍加身”的预谋者、“杯酒释兵权”的导演者，三度为相，为一代名臣，从政50年，终年71岁。普智谋多，读书少，有“半部论语治天下”之说。善吏道，后周显德年间，先后为永兴军（治今陕西西安）节度使从事，滁州、渭州（治今甘肃平凉）军事判官，同州（治今陕西大荔）、宋州（治今河南商丘县南）节度使赵匡胤推官、掌书记。显德七年（960）正月，普与赵匡胤发动陈桥兵变，以黄袍加于赵匡胤之身，推翻后周，建立宋朝（北宋），普受封为右谏议大夫，充职枢密直学士。是年四月，后周昭义节度使李筠反宋，普建议宋太祖亲征。宋得胜还师后，升普为户部侍郎、枢密副使。\n  宋太祖依普计，于建隆二年（961）“杯酒释兵权”，削夺朝中诸将兵权；建隆四年（963），加强中央集权；乾德三年（965），削弱地方财权；乾德五年（967），加强中央禁军建设；开宝二年（969），削夺节度使兵权；统一全国，先南后北。乾德二年（964），普任门下侍郎、平章事、集贤殿大学士，负宰相责任。乾德五年（967）春，普加职右仆射兼门下侍郎，同中书门下平章事、昭文馆大学士，成为名副其实的宰相。普入相后，坚于职守，对宋太祖忠贞不二。有当用者，普荐其为官，一奏不用、二奏、三奏，直至太祖准奏。有立功应升迁者，太祖不予升迁，普为其力请，直至宋太祖从其请。开宝六年（973），普接受吴越王钱俶所送十瓶瓜子金，又违法从秦陇买来木材营建官邸，庇护部下贪赃枉法，宋太祖大怒。普被罢相，出为河阳三城（治今河南商孟县）节度、检校太尉、同平章事。\n  太平兴国二年（977）三月，普升任太子太保，继迁太子少保。太平兴国六年（981）九月，普升为司徒、梁国公，二次入相。太平兴国七年（982），宋太宗依普计，不再传位于皇弟赵廷美。太平兴国八年（983）十月，普再次免相职，出任武胜军（治今河南邓县）节度、检校太尉兼侍中。雍熙三年（986）春，宋太宗伐辽久未班师，普上书力谏收兵息战。雍熙四年（987），普移山南东道（治今湖北襄樊）节度，改封许国公。\n  端拱元年（988），普被册封为太保兼侍中，三次出任宰相。普整顿吏治，惩治不法官员，直至戳其身。宋太宗按普建议，对党项人采取羁縻政策。淳化元年（990），普因病三次上表辞相职，宋太宗不准，任普为西京留守、河南尹、依前守太保兼中书令。淳化三年（992）春，普又三次上表，请求辞归故里，宋太宗不准，拜普为太师，封魏国公，给宰相俸禄。是年七月，普薨。太宗闻之震悼，废朝五日，赠普尚书令，追封真定王，赐谥“忠献”，亲撰并书写八分字神道碑赐之。咸平元年（998），追封普为韩王。次年，又诏普配飨太祖庙。 \n点评：个人觉得赵普可能与第一篇中的姚崇一样，有很多人不认识。其实主要还是对宋代的历史不太懂。宋代其实并不是像现在x党所宣传的那样各种不给力，而是各种给力，赵普作为宋早年的贤相，对稳定政局以及宋之后的很多政策都有深远影响。作为开国之相，显然要做的很多啊\n\nTop7 熙宁变法，争议不休——北宋名相王安石\n王安石(1021年12月18日--1086年5月21日)，字介甫，晚号半山，谥号“文”，世称王文公，自号临川先生，晚年封荆国公，世称临川先生又称王荆公，江西临川延寿乡(今东乡县黎圩镇上池村)人，中国杰出的政治家、文学家、思想家、改革家。王安石变法对北宋后期社会经济产生很深的影响，已具备近代变革的特点，王安石以“天变不足畏，祖宗不足法，人言不足恤”的精神推动改革，力图革除北宋存在的积弊，推行一系列措施富国强兵，是中国十一世纪伟大的改革家。在文学上具有突出成就，是唐宋时期八大家之一。\n  庆历二年（1042年）进士第四名及第。任地方官多年。王安石认为宋代社会贫困化的根源在于兼并。因此，在嘉佑三年（1058年）上宋仁宗赵祯的万言书中，要求对宋初以来的法度进行全盘改革，扭转积贫积弱的局势，立即实现对法度的变革。封建士大夫也把致国太平的厚望寄托于王安石，期待他能早日登台执政。由于深得神宗赏识，熙宁二年（1069年），王安石出任参知政事，次年，又升任宰相，开始大力推行改革，进行变法。王安石明确提出理财是宰相要抓的头等大事，阐释了政事和理财的关系，并认为，只有在发展生产的基础上，才能解决好国家财政问题。执政以后，王安石继续发挥了他的这一见解。在改革中，他把发展生产作为当务之急而摆在头等重要的位置上。王安石虽然强调了国家政权在改革中的领导作用，但他并不赞成国家过多地干预社会生产和经济生活，反对搞过多的专利征榷，提出和坚持“榷法不宜太多”的主张和做法。在王安石上述思想的指导下，变法派制订和实施了一系列新法，从农业到手工业、商业，从乡村到城市，展开了广泛的社会改革。与此同时，王安石为首的变法派改革军事制度，以提高军队的素质和战斗力，强化对广大农村的控制；为培养更多的社会需要的人才，对科举、学校教育制度也进行了改革。变法触犯了大地主、大官僚的利益，两宫太后、皇亲国戚和保守派士大夫结合起来，共同反对变法。因此，王安石在熙宁七年第一次罢相。次年复拜相。王安石复相后得不到更多支持，不能把改革继续推行下去，于熙宁九年第二次辞去宰相职务，从此闲居江宁府。宋哲宗元佑元年（1086年），由于司马光等保守派得势，此前的新法都被废除。王安石不久便郁然病逝。\n　　王安石在哲学思想方面，继承和发扬了老子的一些思想，是传统的朴素的辩证法思想，《洪范传》、《老子注》是他在这方面的主要著作，后者已经散佚。他的文章以论说见长，列于唐宋八大家。在诗歌方面，早年写了不少反映社会现实的诗篇。有集本传世，一是《临川先生文集》本，一是《王文公文集》本，两本都掺有他人的著作。\n  王安石曾封于舒、荆，死后又谥为文，故也称为王荆公或王文公。\n  王安石，北宋神宗时名相。这位不甘寂寞的政治家，领导一场轰烈和悲壮的熙宁变法，从此这位勇士独撑大旗步入历史漩涡，成了历史上最受争议的人物。变法之前王安石被誉为“当世圣人”，变法后，司马大骂其为欲谋朝篡位的大奸臣；后来的宋徽宗对王安石推崇备至，而到了宋钦宗那里，竟成了北宋灭亡的魁首。朱熹斥之为心怀叵测、沽名钓誉的伪君子，陆九渊赞其为“洁白之操，寒于冰霜”；而杨慎将之数落成“古今第一小人”，梁启超称他是“三代以下唯一的完人”；列宁赞之为“中国十一世纪最伟大的改革家”。作为文人的王石安，中国人妇孺皆知，而作为宰相，却争议不休，原因何在？\n很多人觉得王安石的诗歌比较理解，但是作为宰相很多人并不是太了解，由于宋的社会富裕，开始推行改革，本欲提升国力以备战北狄，但是保守势力过大还是失败了。不过此不以成败论英雄，只为奸贤语是非\n\nTop8 辅佐天骄，北国卧龙——元代名相耶律楚材\n耶律楚材（公元1190年—公元1244年），生于燕京（今北京），蒙古帝国大臣。字晋卿，号玉泉老人，法号湛然居士。蒙古名为吾图撒合里，意思是“长髯人”。出身于契丹贵族家庭，是辽太祖耶律阿保机的九世孙。\n耶律楚材，辽国皇族之后，元代开国大臣、名相。成吉思汗时，被召用，随后双扈主西征，观天象，卜吉凶，力劝成吉思汗不要妄杀无辜，得成吉思汗信任，遂为成吉思汗股肱大臣，尊宠至极。耶律楚材，上谏针贬时弊，保江山稳定，改革税制，武功文治，使蒙古统法者收到极盛之效。\n窝阔台汗即位后，耶律楚材倡立朝仪，劝亲王察合台（太宗兄）等人行君臣礼，以尊汗权。从此更日益受到重用，被誉为“社稷之臣”。初执掌中原地区赋税事宜，建议颁行《便宜一十八事》，设立州郡长官，使军民分治；制定初步法令，反对改汉地为牧场；建立赋税制度，设置燕京等处十路征收课税所。窝阔台汗三年（1231），任中书令（宰相）。此后，他积极恢复文治，逐步实施“以儒治国”的方案和“定制度、议礼乐、立宗庙、建宫室、创学校、设科举、拔隐逸、访遗老、举贤良、求方正、劝农桑、抑游惰、省刑罚、薄赋敛、尚名节、斥纵横、去冗员、黜酷吏、崇孝悌、赈困穷”的政治主张。在政治、经济、文化各方面殚精竭虑，创举颇多。主要有保护农业，实行封建赋税制度；改革政治体制，提拔重用儒臣；反对屠杀生命，保护百姓生命；禁止掠民为驱，实行编户制度；反对扑买课税，禁止以权谋私；主张尊孔重教，整理儒家经典。使新兴的蒙古贵族逐渐放弃了落后的游牧生活方式，采用汉族以儒教为中心的传统思想和制度来治理中原。使战争不断的乱世转为和平的盛世，使先进的中原封建农业文明得以保存和继续发展，也为后来忽必烈建立元朝奠定了基础。\n  耶律楚材还主张用孔孟之道作为治国之民的原则，还用儒士来担任各级官吏。耶律楚才不愧为“治天下匠”，为蒙古国的发展做出了重要贡献，是促进蒙古贵族接受中国传统文化的第一人。\n  作为元代的名相摒弃蒙古的制度，采用汉族的政策稳定了国家。北国卧龙当之无愧\n\nTop9 帝王之师，救时宰相——明朝名相张居正\n张居正（1525年－1582年），字叔大，号太岳，汉族，明朝湖广江陵（今属湖北省荆州市）人，死后遗体隆重葬在江陵城东门外，世人称他为“张江陵”,谥号“文忠”。明朝中后期政治家、改革家，万历初期的内阁首辅，辅佐万历皇帝进行了“万历新政”，使原已垂危的大明王朝生命得以延续，具有重大的历史功绩。当时神宗年幼，张居正得到当时摄政的神宗生母李太后的完全信任，一切军政大事均由他主持裁决，前后当国十年，实行了一系列政治经济改革措施，收到一定成效。\n  张居正，明朝名相。他机巧善谋，治世有方：创考成法，整顿吏治，清丈土地，推行“一条鞭法”，治黄整淮，修整边防，功在社稷，垂名后世。主政十年，使国家安定，经济发展，一时出现清明富强的景象，救了明王朝，而得“救时宰相”之誉。为官期间，张居正作为一名改革家，不在王安石之下，大胆地在政治、经济、军事各方面进行改革，且没有贸然全面整顿财政，避开了统治势力的“痛处”，改革成功，国富民安于一时。\n  张居正5岁入学，七岁能通六经大义，12岁考中了秀才，13岁时就参加了乡试，写了一篇非常漂亮的文章，只因湖广巡抚顾辚有意让张居正多磨练几年，才未中举。16岁中了举人，23岁经会试、殿试取中进士，并选为庶吉士，25岁升为翰林院编修，43岁进入内阁，当了大学士，48岁当了宰相。那时，封建统治阶级昏庸腐化，军政败坏，财政破产，农民起义，此伏彼起，阶级矛盾尖锐，危机严重。他为了巩固明王朝的统治，一方面，以“得盗即斩”的手段加强镇压，一方面采取了一系列富国强兵、使民“足食足衣”革新政治的措施。\n  （一）精简机构，裁汰冗员。当时行政机构雍肿，人浮于事。张居正把能合并的都合并了。如天下钱谷在户部原分属13个司掌管，他把它作了必要的归并，实行了统收统支；对不尽职或只拿钱又无事可干的官吏，尽行淘汰。据说，仅万历九年，即裁中央冗官419人；地方冗官902人。在精简机构时，还进一步划清了政府各部门的权限职责，严格官吏考核制度，加强了人事管理。这样一来，既减轻了朝廷支出，又鞭策着官吏们更好地工作，提高了行政效率。\n　（二）严肃法纪、信赏必罚。张居正认为“赏罚功罪，须至公至平，人心乃服，人心服，而后可责其用命。”因此，在他执政期间，凡是违法犯纪的人，不管是皇亲国戚，还是地方豪强，一概绳之以法。徐阶曾任过首辅，也是推荐他入阁的人，但当徐阶的亲属对清丈全国大地主隐瞒的庄田进行破坏时，他也决不宽恕。黔国公沐朝弼累次犯法，因是功臣世家，别人感到难办，但他仍然将沐朝弼逮捕治罪。他一面大刀阔斧地整肃吏治，一面带头不搞行贿受礼。比如被他推荐用的辽东总兵李成梁，后来被封为宁远伯。李为了报答他的推荐之恩，曾派人给他送去钱财。他严肃地对来人说：“而主以百战得功勋，我受其金，是得罪高皇帝也。”坚决不受。因此，他主持颁布的一切\n政令，“虽万里外，朝下而夕奉行。”\n　（三）蠲免积负，减轻人民负担。他对神宗说：“今尚有一事为民害者，带征税粮也。夫百姓财力有限，一岁之入，仅足供一岁，不幸岁歉，目前尚不能办，岂复有余力更完累岁积逋乎？有司避责，往往将今年所征，抵完旧逋，即今岁所欠，又为将来带征矣。”要求神宗责令户部“核万历七年以前积负，悉行蠲免”。神宗采纳了他的意见，免去了农民在万历七年以前积欠国家的钱粮田赋。\n　（四）重视人才，知人善任。他曾上书神宗说：“今后用人，但问功能，不可拘资格。他曾引用李成梁镇辽东，戚继光镇蓟门，使得“荒外詟服，边境坐拓。”他又用潘季驯黄河，使得“堤工早完、转漕无患”。所以史书称他“善知人”。在他执政的10年期间，“边境义安”、“太仓粟可支十年”、“太仆寺积金四百余”，“一时政绩炳然”。正当张居大力整顿吏治，实行政治革新的时候，御史刘台在神面前告了他一状，说他“专擅威福、罔上行私，横黩无厌”。张居正知道了，对神宗说；“臣之所处者，危地也；言者以为擅作威福，而臣之所行，正威福也。将巽顺以悦下耶？则负国；竭公以事上耶？则无以逃专擅之讥。”对那些攻击他的人以迎头痛击。万历五年，他\n的父亲去世。按照封建礼教，他应该回家“守制”。但他考虑到国事纷繁、主上年幼，仍然“吉服视事”，没有回家守制。这又引起了一些人的攻击，说他“忘亲贪位”。吏部尚书张翰甚至捶胸长叹道：“三纲沦矣!”但在他的坚决抵制和皇帝的支持下，这些攻击他的人，都一个个受到了撤职的处分。\n  张居正作为一代宰相，为国于民鞠躬尽瘁。身为帝王之师，力育天子，行非常之师德，可谓用心良苦。然而他尸骨未寒之时，朝野狼烟四起，一邦小人便开始秋后算帐，张被罢了官位，抄了全家！1582年，张居正去世了，过去因攻击他而受到处分的人，一个个官复原职。中官张诚在神宗面前说他与冯保“交结恣横”。并说他家“宝藏逾天府”。御史羊可立指责他构陷辽王。辽妃又上书为辽王辩冤，并说辽府金宝以万计，全部入居正家。神宗被这些谗言迷惑了，遂公布他的罪状，下令削去了他的官秩，剥夺了他的谥号，查抄了他的家产，几乎劈棺戮尸，他的长子张敬修被捕人狱，其他亲属都被送到“烟瘴地面充军”。抄家的结果，才知他的家产不及严嵩的二十分之一。到1621年熹宗朱由校即位，恢复了张居正的官秩，重新予以葬祭。直到崇祯三年（1630年）礼部侍郎罗喻义等为他鸣冤，他的冤案才逐步得到了纠正。他的子孙也官复原职。张居正不仅热心于革新政治，还留下了一些内容丰富的政治论文和感情真挚的诗篇。有《张文忠公全集》传世。\n      张居正辅政，稳定了朱明王朝，其实算是改变王朝的最后的机会了，可惜身死后的张居正绝没有想到等待他的竟是如此下场\n\nTop10 文胆武略，官场楷模——清代名相曾国藩\n曾国藩（1811年11月26日－1872年3月12日），初名子城，字伯涵，号涤生，谥文正，汉族，出生于湖南长沙府湘乡县杨树坪（现属湖南省娄底市双峰县荷叶镇）。晚清重臣，湘军之父，湘军的创立者和统帅者。清朝战略家、理学家、政治家、书法家、文学家，晚清散文“湘乡派”创立人。晚清“中兴四大名臣”之一，官至两江总督、直隶总督、武英殿大学士，封一等毅勇侯，谥曰文正。毛泽东曾说：“予于近人，独服曾文正。”表达出对这位已故乡人的推崇之情。\n  曾国藩，清代名相，也是个清官。他步入仕途后，曾十年七迁，37岁当上二品京官。他奉行“立言、立功、立德”。立言，他著述、家书、日记，广为流；立功，他挽救了大清朝；立德，他事事以身作则。因此，他除了“一品侯”头衔之外，还有“中兴第一名臣”、“洋务运动领袖”、“圣贤”、“近代史之父”诸等称谓。\n  他一生奉行为政以耐烦为第一要义，主张凡事要勤俭廉劳，不可为官自傲。他修身律己，以德求官，礼治为先，以忠谋政，在官场上获得了巨大的成功。曾国藩的崛起，对清王朝的政治、军事、文化、经济等方面都产生了深远的影响。\n    纵观其一生，他那变化无穷的谋略智慧，他那独特的修身之道，他那行之有效的权术哲学，他那居官不败的当官真经，他那一眼见底的观人秘诀，无不令人拍案叫绝。\n  曾国藩是中国历史上真正积极实践的第一人,在他的倡议下，建造了中国第一艘轮船，开启近代制造业的先河；建立了第一所兵工学堂，肇始中国近代高等教育；印刷翻译了第一批西方书籍，不仅奠定了近代中国科技基础，而且极大地开阔了中国人的眼界；安排了第一批赴美留学生，为国家培养了大批栋梁之材，其中民国第一任总理唐绍仪，中国“铁路之父”詹天佑、清末外交部尚书（部长）梁敦彦、清华大学第一任校长唐国安等就是此中佼佼者。可以说曾国藩是中国现代化建设的开拓者。\n  中国自古就有立功（完成大事业）、立德（成为世人的精神楷模）、立言（为后人留下学说）“三不朽”之说。而真正能够实现者却寥若星辰，曾国藩就是其中之一。他打败太平天国，保住了大清江山，是清朝的“救命恩人”；他“匡救时弊”、整肃政风、学习西方文化，使晚清出现了“同治中兴”；他克已唯严，崇尚气节，标榜道德，身体力行，获得上下一至的拥戴；他的学问文章兼收并蓄，博大精深，是近代儒家宗师，“其著作为任何政治家所必读”（蒋介石），实现了儒家修身、齐家、治国、平天下、立功、立德、立言“三不朽”事业，不愧为“修身齐家治国中华千古完人。”\n  “从政要学曾国藩，经商要学胡雪岩”。自近代以来曾国藩就被政界人物奉为“官场楷模”。这是因为，第一，他升官最快，三十七岁官至二品，在清朝独一人；第二，做官最好，政声卓著，治民有言；第三，保官最稳，历尽宦海风波而安然无恙，荣宠不衰。他熟读中国历史，对官场之道参深悟透，积淀一整套官场绝学，用之于中国官场，攻无不克，战无不胜。\n  曾国藩一生致力结交、网罗、培育、推荐和使用人才，他的幕府是中国历史上规模和作用最大的幕府，几乎聚集了全国的人才精华。为招揽人才，留住人才，他舍出谦逊的老脸，屡屡上书举荐部下，为部下谋官要权，争谋职位。他一生推荐过的下属有千人之多，官至总督巡抚者就有40多人。他们既有李鸿章、左宗棠、郭嵩焘、彭玉麟、李瀚章这样的谋略作战军需人才，也有像俞樾、李善兰、华蘅芳、徐寿等第一流的学者和科学家。堪称“网罗培育和善用人才的第一高手”。\n  中国传统文化持家教子的最大成功者。曾国藩是最好的儿子，能使父母宽心；是最好的哥哥，教导和照顾弟妹，体贴入微，曾国藩更是仁慈的父亲，是儿女的好榜样。他的《家书》讲求人生理想、精神境界和道德修养，在骨肉亲情日渐淡漠、邻里亲戚形同陌路的现代社会里，确实有劝世化俗的价值，值得每个人一读。大多数官宦之家，盛不过三代，而曾氏家族却代代有英才，出现了象曾纪泽、曾广均、曾约农、曾宝荪、曾宪植、曾昭抡等一批著名的外交家、诗人、教育家、科学家和高级干部。\n  中国传统文化人格精神的典范式人物。曾国藩在同辈士大夫中“属中等”，颇为钝拙，但他志向远大、性格倔强、意志超强，勤学好问，非常人所能及。他从少年起，就“困知勉行，立志自拨于流俗”，天天写日记反省自己，一生中没有一天不监视自己，教训自己。他待上、待下、待同事谦恕自抑，豁达大度，一生朋友很多，很受人尊重；他守着“拙诚”、埋头苦干，不论遭受多大打击，都不灰心丧气，而能再接再厉，坚持到底。这就是他成功的根本秘诀。\n  深刻影响数代人的精神偶像。曾国藩具有高深的学问素养，是一个“办事（干出事业）兼传教（留下思想学说）之人”（毛泽东）。《清史稿——曾国藩传》也说：“国藩事功大于学问，善以礼运。”他一生勤奋读书，推崇儒家学说，讲求经世致用的实用主义，成为继孔子、孟子、朱熹之后又一个“儒学大师”；他革新新桐城派的文章学理论，其诗歌散文主持了道（光）、咸（丰）、同（治）三朝的文坛，可谓“道德文章冠冕一代”。以至他虽已去世一百余年，提起曾国藩，人们仍然津津乐道。有的评论者说：如果以人物断代的话，曾国藩是中国古代历史上的最后一人，近代历史上的第一人。 \n曾国藩我就不多说了，作为“完人”，绝对是古今中外堪称第一人。可惜无力回天啊",
			"date_added": 1489144715
		},
		{
			"post_id": 1489145068,
			"body": "宋朝政府如何对待贩卖儿童\n\n\n奴婢贱口交易在宋代已不合法\n\n贩卖儿童妇女是一种非常古老的营生了。按《周礼》，先秦时已有合法的奴婢交易市场，政府设了“质人”一职，“掌成市之货贿、人民、牛马、兵器、车辇、珍异”，这里的“人民”，便指奴婢，跟“牛马、兵器、车辇、珍异”一样都是供交易的货物。\n\n东晋时，政府还从奴婢交易中征税。《隋书·食货志》载，“晋自过江，凡货卖奴婢马牛田宅，有文券，率钱一万，输估四百入官，卖者三百，买者一百。”税率为4%，其中3%由卖家承担，1%由买家承担。\n\n其实在宋代之前，中国社会一直存在着“奴婢贱口”制度，奴婢在法律上被划入贱民，不具备“国民”身份，而是视同主家的私有财产，可以牵到市场上买卖，如《唐律》便明文规定：“奴婢贱人，律比畜产”；“奴婢既同资财，即合由主处分”。贩卖奴婢是合法的，跟你牵头牛到市场上贩卖没有什么区别。\n\n此外，历代都有不合法的人口交易，叫做“略卖人口”，包括略卖良民、将别人家的奴婢拐了贩卖（相当于侵犯别人的财产权）。这种人口买卖是法律不允许的。\n\n入宋之后，奴婢贱口制度开始瓦解，宋代“奴婢”的涵义已不同于之前的“奴婢贱口”，不再是主家的私产，而是具有独立法律人格的自由民。奴婢与主家的关系也不是人身依附关系，而是经济意义上的雇佣关系，法律将这些奴婢称为“女使”、“人力”。雇佣奴婢必须订立契约，写明雇佣的期限、工钱，到期之后，主仆关系即解除。为了防止出现终身为奴的情况，宋朝法律还规定了雇佣奴婢的最长年限：“在法，雇人为婢，限止十年。”也就是说，从前那种合法的奴婢贱口买卖，在宋代已经不合法了。\n\n当然，奴婢贱口制度在宋朝的瓦解有一个过程，大致而言，北宋时尚有良贱制度的残余，所以还有零零星星的合法的奴婢贱口交易；到了南宋时期，良贱制度就基本上消亡了，不再有合法的奴婢贱口交易了。我们说，美国用一场南北战争结束了奴隶制度，宋朝则靠文明的自发演进逐渐告别了奴婢贱口制。可惜这个“去奴婢化”的进程在宋亡之后又中断了，元明清时期均出现了奴婢贱口制的回流。\n\n需要注意的是，宋人在语言习惯上还保留着“奴婢”的说法，也经常将“雇佣”与“买卖”混用。《宋刑统》由于照抄唐律的原故，也存留大量的“奴婢”字眼，容易让不明就里的读者误以为宋代还有奴婢贱口制度。这一点我们在读史时不可不察。其实，南宋人已经说明白了：“《刑统》皆汉唐旧文，法家之五经也。国初，尝修之，颇存南北朝之法及五代一时指挥，如‘奴婢不得与齐民伍’，有‘奴婢贱人，类同畜产’之语，……不可为训，皆当删去。”\n\n宋朝法律对买卖人口的严惩\n\n尽管奴婢贱口交易已在法律上宣告不合法，但是，这并不意味着宋朝就没有贩卖人口现象。实际上，宋代的略卖人口犯罪是相当猖獗的。如北宋末，福建的“生口牙人，或无图辈巧设计幸，或以些小钱物，多端弄赚人家妇女并使女，称要聘为妻，或养为子，因而引诱出偏僻人家停藏，经日后便带往逐处，展转贩卖，深觅厚利”。又如南宋初叶，四川“多有浮浪不逞之人，规图厚利，于恭、涪、泸州与生口牙人通同，诱略良民妇女，或于江边用船津载，每船不下数十人”。这里的“生口牙人”，是当时的职业人贩子，专门干拐卖儿童、诱拐妇女的勾当。\n\n宋朝法律对这种贩卖人口的行为是严惩不贷的，宋人自谓：“略人之法，最为严重。”按《宋刑统》，“略卖人（不和为略，十岁以下虽和，亦同略法）为奴婢者，绞；为部曲者，流三千里；为妻妾、子孙者，徒三年；因而杀伤人者，同强盗法；和诱者，各减一等。”宋政府将贩卖人口的行为区分为“略卖”与“和诱”，略卖相当于拐卖，和诱相当于拐诱。和诱的罪行比略卖减一等。但对十岁以下的儿童，即使是和诱，也按略卖人口罪处置。\n\n根据这条立法，我们可以确知，宋朝政府如果抓到一名拐卖儿童的人贩子，将按被拐儿童的遭遇给予不同的惩罚：凡略卖儿童为他人奴婢的，判绞刑；略卖为庄园童工的，流放三千里；略卖为他人子孙的，判徒刑三年；对被略卖人的身体造成伤害的，按强盗法处置，宋代的强盗法很严厉，为首者一般就是死刑了。\n\n我们知道，中国现行法律对人贩子的处罚较重，对买家却几乎不处罚，因而不少法律界学者都在呼吁修订刑法，加大对买方的惩罚力度。而按宋朝立法，如果你明知这孩子是被拐卖的，却掏钱买下来，那么你也要负刑事责任：“诸知略、和诱、和同相卖，及略、和诱部曲、奴婢而买之，各减卖者罪一等；展转知情而买，各与初买者同；虽买时不知，买后知而不言者，亦以知情论。”买家的罪责比人贩子减一等。对藏匿被拐人口的交易中介，法律也会给予严惩：“其知情引领牙保，若藏匿被略诱者，依藏匿犯人法。”\n\n那些被略买的儿童、妇女，一经发现，即由政府解救出来，送回原来的家庭，如宋太宗时的一道立法规定：“验认到（被略卖）人口，便仰根问来处，牒送所属州府，付本家。仍令逐处粉壁晓示。”宋仁宗时，“湖南之人掠良人，逾岭卖为奴婢。周湛为广东提点刑狱，下令捉搦，及令自陈，得男女二千六百余人，还其家，而世少知之。”广南东路提刑官周湛破了一个大案子，解救出被拐人口2600余人，送他们回到各自的家庭。\n\n政府出钱赎回被卖儿童\n\n除了不合法的略卖、和诱人口犯罪之外，宋朝社会还存在一种无奈却合法的贩卖人口行为：贫困家庭由于无力抚养未成年人口，只好将自己的孩子卖掉。如《夷坚志》讲述的一则故事：北宋末，有一漂亮少妇，“在民家生二子，荆楚岁饥，贫不能自存，其夫鬻之于田氏为侍儿。”\n\n如果按照今日某些“奥派”公知的胡扯，这叫做“儿童抚养权的流转”，应该受到法律的承认与保护，因为承认儿童抚养权可以自由转让，才可以杜绝拐卖儿童的黑市。\n\n宋朝政府当然不可能像今日“奥派”公知那样懂许多经济学名词，不过其人文关怀却可以将“奥派”公知抛出一百条街。在宋朝，因为贫穷而卖掉自己的孩子，尽管不是犯罪，却无疑是骨肉相离的人间悲剧。宋政府对此的应对举措是——动用公帑替那些贫困家庭赎回孩子。“赎买”的干预方式，也意味着宋政府默认这种人口交易为合法，只是非常不人道。\n\n让我们来看几个事例：《宋史·太宗本纪》载，淳化二年（991）七月，太宗“诏陕西缘边诸州饥民鬻男女入近界部落者，官赎之”。这件事在范仲淹的文章中也有记录：“臣闻淳化中，太宗皇帝以边户饥荒，多卖人口入蕃，颇悯恻之。特遣使以物货收赎，各还父母。”大中祥符三年（1010），宋真宗亦下诏：“前岁陕西民饥，有鬻子者，官为购赎还其家。”\n\n由于许多被父母卖出去的儿童都被政府赎回，导致不少人家均不愿意再掏钱收养孩子，因为收养后被政府发现，又会被赎回去，尽管经济上或无损失，却白白浪费了工夫。明道元年（1032），便有臣僚向仁宗皇帝提议，应默许民间的人口交易：“比诏淮南民饥，有以男女雇人者，官为赎还之。今民间不敢雇佣人，而贫者或无自存，望听其便。”这里的“以男女雇人”，实际上就是将家中的孩子卖给有钱人家当奴婢，否则政府也没必要代为赎回。\n\n宋仁宗尽管批准了这位臣僚的建议，但宋政府为贫者赎回被鬻子女的政策并未停止。庆历八年（1048），河北瀛、莫、恩、冀等州岁饥，民多鬻子，宋仁宗“赐瀛、莫、恩、冀缗钱二万，赎还饥民鬻子”。南宋隆兴元年（1163），宋孝宗也有诏曰：“中都、平州及饥荒地并经契丹剽掠，有质卖妻子者，官为收赎。”\n\n对于实际上被贩卖的宋朝儿童数目而言，宋政府的赎回政策可能是杯水车薪。但，政府出于仁者爱人之念，为贫困人家赎回无奈卖掉的孩子，正是大宋文明的过人之处。我见闻有限，不知其他王朝是否也有类似的人道主义表现。\n",
			"date_added": 1489145065
		},
		{
			"post_id": 1489225937,
			"body": " 西汉的三次外戚专政\n\n一\n\n外戚是历朝历代都有的现像，它对各朝各代的政治也会产生或大或小的影响，这种影响的大小取决于外戚对权力的控制程度。在我国封建社会还处于上升阶段的西汉，根据时间顺序可将西汉外戚分为三个时期：前期、中期、后期。\n\n汉高祖到汉武帝时期是外戚发展的前期，外戚有一定程度的发展，掌控了部分权力，但最终决定权仍牢牢握在皇帝手中，皇帝决定了这些外戚的一切，只要一句话就可以马上改变这些外戚的命运。总的来说外戚前期外戚的命运主要还是受皇帝控制。汉惠帝死后，诸吕当政，无论他们掌握了多少权力，都要听命于吕后。前期外戚的这种受控制被支配特点在汉武帝身上表现的最为明显。他开始有意识的提拔或铲除外戚，以维护自己的统治，加强中央集权。“一方面，他陪植外戚势力以削夺、分割列候和守旧大臣的军政大权；另一方面，当外戚势力发展起来后，他又施展阴谋，用亲近外戚打击疏远外戚，用新外戚打击旧外戚”，文景时窦太后的从兄子窦婴凭借军功封为魏其侯，王太后的同母弟即汉武帝的舅舅田蚡封为武安侯。汉武帝即位之初就任命窦婴为丞相，田蚡为太尉，此二人“俱好儒术”，上任后即实行改革，兴儒学，加强中央集权，他们“推豰赵绾为御史大夫，王臧为郎中令。迎鲁申公，欲设明堂，令列侯就国，除关，以礼为服制，以兴太平。举谪诸窦宗室无行者，除其属藕”，实际上这场改革是以推尊儒术，贬斥道家为理论先导的，这是因为这时候的黄老之学己由汉初的休养生息的指导思想蜕变为军功列侯、宗室贵族、诸侯王，及地方豪强势力维持发展其特权利益的理论，汉武帝是利用窦田二人通过改革从守旧派手中夺权。在窦太后死后，汉武帝又封田蚡为丞相，“当是时，丞相入奏事，语移日，所言皆听”，可见田蚡地位之高，权力之重，这也是汉武帝利用田蚡的丞相身份来摧抑折辱贵族大臣，以加强皇权。在窦婴、田蚡之后汉武帝又封外戚“卫后弟青为大司马大将军，后姐子霍去病为大司马骠骑将军，于是外戚又日以宠贵”，让他们统帅三军，以实现皇权对军权的领导。另一方面，一旦当外戚的权势发展到有可能威胁皇权时，汉武帝就毫不留情的利用种种理由予以铲除，重新提拔新外戚，以保证自己对政权的控制。窦婴虽然曾帮助武帝实行改革，打击旧军功大臣，但他骄横跋扈，以威胁到皇权，因此汉武帝决心铲除他，于元光五年将窦婴弃市渭城。田蚡曾贵为丞相，但武帝越来越不能忍受田蚡的骄横专权，于是在田蚡死后不久就以罪夺其子之爵。以卫皇后为首的卫氏集团，随着卫青、霍去病对匈奴作战的节节胜利，卫氏的权势也达到顶峰，当时有歌谣曰“生男五喜，生女无怒，独不见卫子夫霸天下”，这当然是汉武帝所不愿到的，于是他便利用巫蛊之祸，杀死太子刘据与卫皇后，一举消灭了卫氏集团。从这可看出，汉武帝对外戚的支持是有限度的，那就是不能威胁到皇权，一旦有威胁毫不留情的铲除。汉武帝不仅有意识的利用外戚，而且他对外戚势力膨胀所可能造成的危害也是很清楚的，因此汉武帝在立刘弗陵为太子后即死他的母亲赵婕妤，其原因是“往古国家所以乱也，由主少母壮也。女主独居骄蹇，淫乱自恣，莫能禁也。女不闻吕后邪？”而其它为武帝生子者，不分男女，其母莫不谴死。由此看来对于汉武帝来说，外戚只是他维护皇权加强统治的工具，军政大权仍掌握在自己手上。\n\n昭宣时期是外戚发展的中期，外戚已经掌握了朝廷大权，开始主宰政局。所幸昭宜二帝自身还比较英明，他们用外戚辅政，能做到自己不受外戚的控制，当外戚专权的局而逐渐威胁到皇权后，为了维护皇权，等到时机成熟，马上起而反攻，消灭外戚，夺回政权，重塑皇帝权威。这一时期外戚的典型代表是霍光，霍光是霍去病的弟弟，在汉武帝死时以大司马大将军受遗诏辅政。霍光在辅政期间，不但政事一决于光，就连皇帝的废立都由霍光决定，在昭帝死霍光对即将及位的昌邑王不满意，于是联合太后废掉昌邑王，改立卫太子孙为帝，是为宣帝。不但霍光自己是辅政之臣，霍氏一门也执掌大权。他的外孙女是昭帝皇后，他的小女又是宣帝皇后，后党势力很大，霍光的两个女婿是东四宫卫尉，他的昆弟诸婿外孙皆为诸曹大夫、骑都尉、给事中，霍氏在盘根错节，形成了庞大的权力网，所以《汉书》称霍氏是“党亲连体，根据于朝延”，这种情况下连皇帝都要对霍光礼让三分，《汉书》记载“光每朝见，上虚己敛容，礼下之己甚”，霍式也得到皇上的额外恩赐。但在霍光辅玫的昭宣时期，除昭帝在位时间短，无所作为外，宣帝因为从小在民间长大，高才好学，因此很有主见，“宣帝始立，谒见高庙，大将光从骖乘，上内严惮之，若有芒刺在背”，说明宣帝已经对霍光专权不满，只是在当时对霍光还有顾忌，不敢表露，霍光一死，宣帝看时机成熟，马上对霍氏动，剥夺霍家的权力，改封霍光儿子霍禹为大司马，但冠小冠，无印绶，同时罢免其右将军屯兵官属，将原霍家执掌的胡越骑、羽林及两宫卫将屯兵，都改由自己的亲信许、史子弟代领，更借霍禹谋反一罪，一举诛灭霍氏。此后宣帝大权独揽，所以“车骑将张安世代光骖乘”，宣帝才能“从容肆体，甚安近焉”，说明宣帝已摆脱了外戚专权的威胁。\n\n元成哀平四帝时期是外戚发展的后期。元帝即位权力落入皇后王政君手中，从元帝开始的四位皇帝或年幼或懦弱无能，根本无法处理政事，因此王政君先后凭借太后和太皇太后身份执掌政权近50年。在她当政期间，大肆提拔自己亲戚，成帝即位后尊王皇后为太后，以王凤为“大司马大将军领尚书事，封五千户。王氏之兴自凤始”，后来又封“舅谭为平阿侯，商成都侯，立红阳侯，根曲阳侯，逢时高平侯，五人同日封，故世谓五侯”。她的侄子王莽先后封大司马、安汉公、宰衡、居摄。当时王氏子弟“分据势官，满朝廷……郡国守相刺史皆出其门”，若王氏开口，连皇上也不得不听，成帝欲封刘歆，王凤以为不可，“乃止，其见惮如此”，平帝9岁即位，年幼懦弱，被王葬所控制“政自莽出”，平帝14岁死，王莽“恶其（嗣皇位者）长大”，立宣帝玄孙年2岁的刘婴为帝，实际由王莽行使皇帝实权。王家势力的显赫，为王莽代汉奠定了政治基础，“他看到汉家的天下正在土崩瓦解，渐至不可救药，而孝元皇后与平递又是孤儿寡妇，可以欺侮，于是大有取汉家天下而有之的野心”，终于在公元8年，一脚踢开名义上的皇帝，自立为帝。其实王莽并不是王氏中最显赫的，王莽“孤贫，……少运不佳”，就是这样都可以篡位成功，说明西汉确实走到了尽头。对于王莽的篡权，清代赵翼在《廿二史札记》中说：“成帝柔仁，专任王氏，而国祚遂移”。\n\n二\n\n由于西汉各时期外戚发展的特点各不相同，因此他们对西汉政治的作用也就颇有差异。在前期与中期，外戚们为维护自己的即得利益可能会广树党羽，铲除异己，任人唯亲。但就整个西汉历史发展而言，前期与中期外戚的所作所为在客观上对西汉发展起了积极的促进作用。以吕后为例，吕后掌权后，想立诸吕为王，问右相王陵，遭反对，于是“欲废王陵，乃拜为帝太傅，夺之相权，王陵遂病免归”。吕氏铲除掉意见不合的人之后，开始封诸吕为王侯，先后封吕种为沛侯，吕开为扶柳侯，吕台为吕王，吕禄为胡陵侯等等。刘氏子弟有丝毫的不逊，马上毫不留情的铲除，一是为了铲除异己，另外也是为护吕氏的权力。孝惠皇后无子，吕后杀了一个妃子，立她的儿子为太子，太子长大后知道此事，说：“后安能杀吾母而名我？我未壮，壮即为变”，太后听到后“恐其为乱，乃幽之永巷中”，不久便幽杀他。赵王友为诸吕女所谗，被吕后召至京，“令卫围守之，弗与食，其群臣或窃馈，则捕论之”，赵王也被幽死。燕灵王建死后，太后叫人杀了他的儿子，使他无后，于是国除。但另一方面，在吕后掌权期间，沿用汉高祖的休养生息策，使经济有所发展，人民安居乐业，是从汉高祖到文景之治的一个承上启下阶段，所以司马迁称赞她“孝惠皇帝、高后之时，黎民得离战国之苦，君臣俱欲休息乎无为，故惠帝垂拱，高后女主称制，政不出房户，天下晏然。刑罚罕用，罪人是希。民务稼穑，衣食滋殖”。霍光辅政期间，独断专权，为让自己的权力更持久，毒死了宣帝许后，让宣帝另立他的小女为后，但霍光在昭宣时期，政自己出，成就了昭宣中兴，《汉书》称赞霍光是“受襁褓之托，任汉室之寄，当庙堂，拥幼君，……因权制敌，以成其忠。处废置之际，临大节而不可夺，遂匡国家安社稷……虽周公、阿衡，何以加此！”可见从历史发展上说前中期外戚还是功大于过的。到了后期，即位的元成哀平四帝一个比一个昏庸，王势衰微，汉朝正逐渐走向末路，政权已完全由外戚主宰，这时外戚所做只是争权夺利，消灭异己，没有丝毫的进步作用，加速了西汉的灭亡。平帝即位后，王莽擅权，他首先将平帝舅舅卫宝等封为关内侯，不得至京师，使卫氏外戚与皇帝隔绝，后穷治与卫氏有关的吕宽之狱，借此诛灭卫氏，“连引郡国豪桀素非议己者，……死者以百数，海内震焉”，王莽在铲除异己后，已经成为朝廷中实际的掌权者，皇帝反而成为他的傀儡，最后更是夺位篡权，另立新朝，曾威震四方的西汉王朝便在他手中覆灭了。\n\n三\n\n在西汉历史上，外戚的发展导致发生了四次政变，企图改朝换代。第一次以吕后为首的吕氏集团。吕后在位时，已大封吕氏，让吕禄、吕产分掌南北军，大权在握使得吕氏产生了代刘氏而自立的野心，这样必然会遭到汉初立国功臣和刘姓王的强烈反对，吕后是清楚这一点，所以她在死前告诫吕禄等说：“高祖已定天下，与大臣约，曰'非刘氏王者，天下共击之'。今吕氏王，大臣弗平。我即崩，帝年少，大臣恐为变，必据兵卫宫，慎毋送丧，毋为人所制。果然，在吕后死后，太尉周勃、丞相陈平等汉初功臣和刘姓王集团就诛产、禄，”悉捕诸吕男女，无少长皆斩之。“第二、第三次是在昭宣时期，上官桀、上官安父子因与霍光争权失败而发动的叛乱，结果失败。霍光死后，宣帝马上就开始剥夺霍家的军政大权，面对这种日渐削弱的情况，霍氏被迫谋反，想废天子而立禹，但诸霍谋反失败，云、山、明友自杀。显、禹、广汉等捕得。禹要斩，显及诸女昆弟皆弃市。独霍后废处昭台宫，与霍氏相连坐诛灭者数千家”。第四次是王莽篡权，公元八年一脚踢开了2岁即位的孺子婴，自己登上皇帝宝座，立国号为新。王莽之所以可以成功有四方面原因，一是有姑母王政君支持，二是王氏外戚权重，三是皇帝幼小、懦弱，被王莽所左右，四是王莽不惜采用各种手段，拉拢群臣其呐喊鼓劲，夺得了刘氏政权。\n\n四\n\n从西汉历史上看外戚上台是有一定原因的，在任何一个封建王朝内，都要有一个权利中心，皇帝一般是这个权力中心的核心人物，但当皇帝年幼或懦孔无法担任这个核心人物时，这个任务便会自然而然的落到与皇帝关系最亲的人身上，与皇帝关系最亲近的莫过于他的母亲与妻子儿女，当皇帝的母亲妻子成为这个权力中心的核心人物后，她们出于“肥水不流外人田”的想法自然会提拔自己家里的人担任重要职务，掌握实权，这样便造成了外戚专权。即使即位的皇帝比较英明，但出于外戚与皇权是紧密相连的，是皇权的寄生体。因此只要有皇权存在，就必然有外戚掌权，而外戚作为皇亲国戚，在皇帝眼中自然要比那些非亲非故的大臣们来的放心信任，因此外戚便借助皇权发展起来，只要有一女入宫受宠，她的父兄子弟也可以得到重用。\n\n从西汉的外戚前、中、后三期的历史可看出，西汉外戚经历了一个从受皇帝控制到控制皇帝的发展过程，总的来说在西汉，外戚还是依附于皇权的，因此具有暂时性、脆弱性与不稳定性，往往皇帝的喜怒就可决定他们的荣辱，一般随着他们代表入物的起伏而起伏。如吕后，在位时大封诸吕为王，等吕后一死，功臣集团马上杀吕产、吕禄，灭掉吕氏一族，废吕后所立的少帝，另立代王为帝。吕后在时，吕氏无比隆盛，当她一死，吕氏曾有的荣华富贵就马上烟消云散。也因为西汉外戚的暂时性、不稳定性，因此“汉兴以后，至于哀平，外戚二十余家，保全者四家而已。”西汉外戚发展到东汉造成了更为严重的外戚之祸，正如《后汉书》所记：“东京皇统屡绝，权归女主，外立者四帝，临朝者六后，，莫不定策惟帘，委事父兄，贪孩童以久其政。”可以说西汉外戚是东汉外戚之祸的胚胎。",
			"date_added": 1489225933
		},
		{
			"post_id": 1489309444,
			"body": "张居正：政治就是谁的拳头硬听谁的\n\n　话说明代首辅张居正父亲死后，张居正选择了“夺情”，拒绝辞官守孝，这可惹恼了明代的士大夫们。尽管经过考成法的实施，爱挑毛病提意见的监察干部——给事中御史这类言官已被内阁控制，他们不发一声。可按倒葫芦起了瓢，冒出两位翰林词臣和两位刑部官员上疏弹劾张居正。他们是：翰林院编修吴中行(字子道，南直隶武进人)、检讨赵用贤(字汝师，南直隶常熟人)、刑部员外郎艾穆(字和父，湖广平江人)、主事沈思孝(字纯父，浙江嘉兴人)。这四人中，吴中行、赵用贤是张居正任主考官的门生，艾穆是张居正的同乡(当时湖南湖北还没有分省，都属于湖广)。这简直是在张居正伤口上撒盐，当初刘台弹劾他时，他伤心地说立国二百年无门生劾座师，这回又说，严嵩(嘉靖朝的权臣，江西分宜人)当政时从没有老乡弹劾他，我混得还不如严嵩。\n\n　　首先上疏的是吴中行，翰林院的官俗称“词臣”，既不用负六部九寺官员的行政责任，也没有科道官的监察责任，而是在文墨上供皇上差遣，但很清贵，基本上作为帝国重要的后备高官培养，翰林院出来的，升官比一般人要快。稳稳当当不惹事，外放做知府，或者进部院任要职，是指日可待的事情。吴的上疏以情取胜，说父子一别十九年，于今永诀，儿子不亲自凭棺临穴，不近情理，元辅当天下重任，正己才能正百官，然后可以正万民。这吴中行比较坦荡，他上疏后，抄了一个副本，送给老师过目，张居正看后，惊问：这上疏送进去了?吴回答干脆，不送进宫我是不敢告诉先生的。\n\n　　大家正为张居正守制问题争论不休时，彗星出现了，这种自然现象在古代被认为这是上天示警，另一位学生赵用贤抓住“星变”这件事，要求皇帝至少仿照先朝杨溥、李贤的成例，让张居正先回家守制，未满二十七个月时下诏让他提前回朝。艾穆和沈思孝联名上书，措词更为激烈，说陛下留张居正，声言为了社稷，可社稷所重莫重于纲常，而首辅大臣是维护纲常的表率，现在连纲常都不顾了，社稷怎么能安呢?这艾穆因为是张居正的老乡，张对他十分关照，他和海瑞一样，仅仅是个举人，这在重科第出身的明朝，是官场最大的劣势，但他名气大，张居正曾让他当诰敕房中书舍人——即中枢看管皇帝诰命敕书的机要秘书，位置很重要，艾穆谢绝了这番好意。不久，他提拔成刑部员外郎(最高审判刑罚机构的副司长)，有一年和御史一起去陕西录囚，即对死刑进行复核。 \n\n　　张居正推崇刚猛治国，惩治犯罪要用重典。在这种“严打”的指导思想下，每个省取决犯人都有名额，不完成任务的相关官员要受处罚，如此冤案自然难免。而艾穆那年复核死刑，只杀了两个人，同去的御史很担心上面怪罪，艾穆说，我总不能用人命来博取自己的官位。可以说，这上疏弹劾张居正的四个人，都是有一身正气的君子，他们的出发点是好的，为了维护纲常名教，不惜得罪皇帝和宰相。张居正未必不知道这几个人的品行，也未必不知道这些人并非专门给自己作对。但作为主持改革大局的政治家，他看得更远，他看到几位道德感很强的小官员后面的潜流。\n\n　　有人盼望着这潜流无限泛滥，直至否定新政。所以张居正必需用霹雳手段阻止这潜流。张居正曾对人说过：芝兰当路，不得不锄。意思说再高贵的花，挡在大路中间，也得把其锄掉。张居正便用廷杖——打板子的方法来“锄”这些芝兰，来应对他一生最大的公关危机。廷杖是明朝开国皇帝朱元璋创立的不人道、严酷的刑罚之一，主要用来对付不听话的官员。大庭广众之下，让校尉用棍子打屁股，这不仅是对肉体的伤害，也是对人格的侮辱。\n\n　　但事物总在不断地变化，因为触怒圣颜而被廷杖的多是耿直之士，往往获得舆论的同情，有辱斯文的廷杖便演变成一种荣誉性标志。黄仁宇评价道：“有的人却正好把这危险看成表现自己刚毅正直的大好机会，即使因此而牺牲，也可以博得舍生取义的美名而流芳百世。”正德朝的王阳明说得很明白：“为名与为利，虽清浊不同，然其利心归一。”廷杖通常由司礼监太监监督，行刑人和监督太监心有默契，看监督者站立姿势决定下手的轻重。若监督太监靴尖朝外成八字型，就下手较轻，高高扬起，轻轻地拍一拍;若朝内成八字型，则下手较重，往死里打。\n\n　　这番首辅很生气，后果很严重，当然要往死里打。掌管礼仪大事的礼部尚书马自强(字体健，陕西同州人)、翰林院的长官王锡爵(字元驭，苏州太仓人)两大重量级人物前来求情都没有用，连张居正儿子张嗣修的同年好友沈懋学(字君典，宁国府宣城人)拜托嗣修向父亲求情，也被拒绝。这沈懋学和张家的关系不一般，张嗣修中进士前，张居正物色天下的才子陪自己儿子读书，相互促进。沈欣然答应，后来中了状元，另一位大才子、《牡丹亭》的作者汤显祖(字若士，江西临川人)拒绝了，直到张居正死后才考取进士。 \n\n　　吴、赵两人被打六十棍后，发回原籍为民。打完后，吴中行口鼻流血，奄奄一息。中书舍人秦柱(字汝立，常州府无锡人)很仗义，带着医官赶来治理才救了一命。这要担很大的风险，亲朋好友前来探视受伤的吴中行，看管的士兵都要询问记录，朝廷要了解哪些人在同情他。赵用贤是个大胖子，廷杖时，一片片手掌大的肉脱落，他老婆干脆将脱落的肉腌制起来收藏，留给子孙做传家宝。现在想来这种方式真有些恐怖。艾穆、沈思孝骂张居正更厉害，因此他俩的刑罚更重。两人被杖八十，三天后才苏醒，然后被发配到边疆充军。被杖的四人一下子成为天下士大夫仰慕的楷模，当时皇帝经筵的讲官许国(字维桢，徽州歙县人)送给吴中行一只玉杯，上刻诗曰：“斑斑者何?卞生泪。英英者何?兰生气。追之琢之，永成器。”送给赵用贤犀角杯一只，上刻诗曰：“文羊一角，其理沉黝。不惜剖心，宁辞碎首。黄流在中，为君子寿。”对二人做出高度的评价和美好的祝福。\n\n　　可世事难料，张居正死后，吴、赵二人重新回朝廷做官，许国已做到内阁中仅次于首辅的二把手，和吴、赵成为政治上的对手，许国谴责二人，“意气感激，偶成一二事，遂自负不世之节，号召浮薄喜事之人，党同伐异，罔上行私，其风不可长。”真乃此一时，彼一时也。\n\n　　今天看来，张居正这种危机处理方式霸道残酷，但在当时他能找到更好的办法么?不像一个民主社会里，可以到议会替自己辩护，又没有一个中立的仲裁机构。当时只可能一方不惜自己的生命博取舆论，另一方利用国家权利进行惩罚。上疏弹劾张居正不丁忧，既不是个纯粹的道德问题，也不是个纯粹的法理问题，而是各种因素搅和在一起的政治问题，对万历帝和张居正而言，不快刀斩乱麻将搅得没完没了。\n\n　　被杖打的谏官们固然受到了羞辱，但是他们也以此赢得了巨大的名声，此后，张居正死后，万历皇帝被这群大臣们吵得头昏眼花，一头扎进了后宫之中，于是，士大夫们都傻眼了。\n",
			"date_added": 1489309439
		},
		{
			"post_id": 1489379680,
			"body": "山东第一巨匪孙美瑶的离奇求官之路\n\n1923年 5月 5日深夜，津浦路一列北上的列车进入山东境内，经过临城附近的时候，突然遭遇拦截，车头出轨，几百土匪，明火执仗，涌将上来。车上 200余名中外旅客(其中 26个洋人，一说 35人)，除个别逃脱外，扫数被掠走，全部成为“肉票”。这就是当时震惊中外的临城劫车案。\n\n　　临城劫车案的黑手是，抱犊崮的土匪头子孙美瑶。孙美瑶得手之后，将肉票押上抱犊崮，然后放掉几个洋人女票下山传信，提出条件，不要金不要银，只要求招安收编，弄个官军的师长旅长干干。抱犊崮是沂蒙山区很著名的一崮，山势险峻，但山顶却有地可耕，只是耕地之牛得在牛犊时抱上去才行，成年的牛，无论如何是赶不上去的，山故此得名，其易守难攻，可见一斑。雄踞于高崖险山之上，押着有二十几个洋票，孙美瑶自信手里有牌，官军不敢把他怎么样。在此后的一系列谈判中，孙美瑶的价码一会儿高一会儿低，翻云覆雨，弄得当时的曹锟政府很是狼狈。\n\n　　那个时候，国际上对于这种“恐怖主义”行为还没有像今天那样态度坚定，一致采取不妥协主义，而且也没有反恐的特种部队，有各种先进武器可以使。西方各国在事发之后，对自己国家公民的性命很是在意，一个劲地对中国政府施加压力，要求只许妥协，不许弄强，事件涉及国的公使一日三次跑中国的外交部，像是下命令一样，要求不惜一切代价保障人质的安全。说起来，当时当政的直系政权算是北洋军阀统治时期对西方最硬气的一届政府(因为民族主义情绪颇浓的吴佩孚的缘故)，因此也是得到外援最少的一届政府，害得政府上下闹穷，政府各部几个月开不出工资。北京大街上，尽是讨薪的政府官员在游行示威，驻外使馆因经费不继，纷纷下旗回国。 \n\n　　尽管如此，洋人依然得罪不起，对土匪，不能打，只能谈。毕竟，自晚清以来，洋人不仅代表着强大，而且意味着文明，洋人的命，无论如何都是金贵的。山上的土匪也十分清楚他们所倚仗的是什么，他们可以时不时地杀几个中国的肉票(土票)加压，却不动洋票一个指头，洋票在山上住的条件都比土票好，还允许洋票有“通讯自由”，让他们写“匪窟通信”，交到上海报上发表，让外国舆论压政府，外国政府再压中国政府。不过这么一来，一时间，办报的和读报的都兴奋莫名。\n\n　　唯一让外国人放心不下的是，当时的北京政府真正能管的地方并不多，山东地方，说起来并不是直系的地盘，压力加在北京政府头上，到底有多大用处，其实是个未知数。反过来，这一点也成了北京政府跟外国人谈判的价码，抵制他们要求对绑匪无条件妥协的压力。利害相关的洋人，面对如此错综复杂的局面，知道全指望中国政府估计也不行，自己也在想辙。最后还是在上海租界的中国通们厉害，说动了上海黑道很有势力、后来成为青帮三大亨之一的黄金荣，让黄亲自出马，带上各位黑道老大的亲笔信，上抱犊崮跟孙美瑶谈判。\n\n　　黑道的面子要比白道大，事实上，在当时没有土匪傻到跟帮会为敌，否则，他们贩毒走卖私货的勾当就没戏了(这可是土匪的最大宗的收入)。黑道中人沟通起来很容易，黄金荣上山之后，谈判渐入佳境，孙美瑶不再漫天要价，山东军阀田中玉却得以就地还钱，孙部编成一个旅，由山东地方解决给养，先送上大批的粮食和2000套军服。1923年 6月 12日，最后一批洋票被释放，孙美瑶下山接受改编，一场塌天大案，宣告结束。 \n\n　　不过，孙美瑶的旅长没有做上几天，到了年底，他就被新任的兖州镇守使在枣庄中兴公司设下鸿门宴(中兴公司有个北方著名的富豪俱乐部，吃喝嫖赌一应俱全，孙美瑶也是常客)诓过去，当场，一个石灰包打在孙美瑶的眼睛上(韦小宝的伎俩)，被熏得昏头的他，被一顿乱刀给捅了无数个透明窟窿，脑袋还给切下来传命各处，孙美瑶的部下群龙无首，在重兵包围下也只好缴械解散，四散而去，估计大部分还是当土匪去也。\n\n　　从晚清到民国，是乱世。其实兵和匪的界限不是十分清晰，一个地方，当官兵不太能控制局面的时候，就会有匪类出来“帮忙”，官兵要当家，匪兵也要当家，争斗的结果，往往达成一个均势，各收各的“保护费”，维持一个虽说是畸形的，但也是一种的秩序。不见得凡是土匪，就一律烧杀抢掠，道理很简单，都烧杀掉了，他们吃什么去 ?土匪的烧杀，往往针对那些不肯服软的地方，尤其是那些有地方武装、抵抗过他们的村镇，烧杀主要是为了杀一儆百。尽管如此，做土匪的，不管规模多大，最大的心愿还是受招安，从非法状态的收费转到合法状态来。\n\n　　从晚清开始，也的确不断地有地方官在剿匪不成的情况下，有意招抚一些匪帮，让他们变成官兵，再去打别的土匪，一如《水浒传》中受了招安的宋江去打方腊。这些受招安的土匪也在战斗中逐渐成长，变成一方具有官方身份的霸主，比如北边的张作霖，南边的陆荣廷，都是这个棋子，当时有谚日：若要官，杀人防火受招安。当然，这种情形下的秩序，肯定不会太好了，无论官兵还是土匪，有时纪律都差不多的坏，说匪来如梳，兵来如篦，可能有点夸张，但驻兵与驻匪都时常扰民却是真实的。那些由匪变兵的军队，比如张作霖的奉军，一直到小张 (张学良 )时代还以纪律差闻名，在老张时代，就可想而知了。 \n\n　　不管怎么说，南有干帅 (陆荣廷字干卿)，北有雨帅 (张作霖字雨亭)，榜样的力量是无穷的。各地的士匪都纷纷效法，也有条件效法。事实上，袁世凯死后，由于混战不止，各地军阀都在招抚土匪借以扩展势力，只是各地有各地的高招，招抚的方式，有收抚的，也有打抚的。不知出于什么原因，反正在 1923年，山东督军田中玉跟抱犊崮的土匪之间从原来的相安无事、各管一边，变成了真刀实枪地对打，两个混成旅开到兖州，其实，真实意图是剿是抚，还是以剿逼抚，还真说不清楚，然而，不幸的是，在冲突中，孙美瑶的哥哥孙美珠一个没留神丧了命，所以，激得孙美瑶使出了拼命的招儿，酿成一场大案。\n\n　　不过，在那个大家都怕洋人的时代，这招虽然很灵，足以让官方满足他的条件，拿到一笔做土匪的都想要的特别赎金，却犯了大忌，不光是白道的大忌，也是黑道的大忌——不动外国人，免惹大麻烦，黑道自道，殷鉴不远，都还记得义和团的教训。所以，事过之后，孙美瑶非死不可，官家即使用上韦小宝的下三滥的招数，也得让他死。\n\n　　于是，实力不够的孙美瑶只能含恨九泉了，他的离奇的求职之路也最终没人敢效仿了。\n",
			"date_added": 1489379674
		},
		{
			"post_id": 1489379777,
			"body": "曹操晚年因为何事错失了统一全国的最佳良机\n\n曹操二十余岁时于征讨黄巾军起家，以为国家讨贼立功为本愿，从此纵横马上近四十年，几乎无一岁不出征，可惜终究未能一统江山。\n\n若论原因，最直接是看军事，击败袁绍后，曹操至少有两次统一天下的机会──赤壁以及汉中之役。其中赤壁之战前夕是他最接近统一的时刻。当时北方初定，荆州投降。被他视为心腹之患的刘备一路逃亡，只剩下江东政权摇摆不定。从曹操写给孙权的信来看，他颇有已视江东为囊中之物的自大。\n\n但实际上他在收服荆州之后马上攻打江东，已是因冒进而失策。贾诩也劝他：“若乘旧楚之饶，以飨吏士，抚安百姓，使安土乐业，则可不劳众而江东稽服矣。”。而曹操之所以不听而冒进，一是他以孙权为孺子，低估了江东的决心和能力。未料孙权野心不比袁绍等人小，鲁肃曾当众对孙权说：“愿至尊威德加乎四海，总括九州，克成帝业。”孙权大笑，可见他早不讳言自己的称帝野心，又怎会轻易投降。刘琮之降承自刘表的不思进取明哲保身，而孙家父子兄弟都是极力开拓、野心勃勃之人，曹操未免想得太简单。\n\n二是他低估了刘备。刘备与他交手多年，向来被动，以走为上。但建安十三年的刘备已今非昔比，诸葛亮不仅能说服孙权抗曹，还能与之订立平等的外交联盟。后一点尤为重要，保证了刘备不像过去那样只能成为地方军阀的附庸，而拥有了争夺自己地盘的资格。刘备本已到穷途末路，却突然反败为胜，占据荆襄，联合孙权，奠定三分天下的基础。如果没有刘备的参与和定盟，曹操只面对孙权一个强敌，赤壁即便失败，后或可再度找到机会取胜，然而当三股力量彼此牵扯互相制约时，要打破平衡就殊为不易。如建安二十年本来孙刘两家就快为了荆州大打出手，张鲁一投降曹操，两家马上划分了势力范围，掉转枪口。刘备回师蜀中，而孙权以十万兵进攻合肥。曹操后来专门赠送名贵的鸡舌香五斤给诸葛亮，“以表微意”。这时候想到来挖墙角，显然已经晚了。谁让他当年煮酒论英雄时没除去刘备，留下后患无穷。\n\n赤壁之战后，曹操损失的数十万士兵（大部分是他的精锐青州兵）一时难以恢复，而马超、韩遂甚至趁机占领了潼关以西，他对北方的统治已经出现危机，亟需修补，无暇他顾，只能坐视刘备蚕食荆州挥师益州。此后他的战争性质已从扩张的统一之战转变为对战略要地的争夺，三家拉锯战开始形成。\n\n与刘备的汉中之战，则是另一个转折点。张鲁投降本是一个极有利的契机，曹操可以选择继续挥师入蜀，如司马懿所建议，刘备初得益州，根基不稳，曹操若借得汉中之势图西川，对方“势必瓦解”。而曹操答之以名言“既得陇，复望蜀乎”。曹操当然有其考虑，可能是受了赤壁时长线作战的教训，也不再寄希望于敌人自动瓦解。何况当时刘备已从荆州赶回，孙权也有可能犯境。年过六旬的他选择保险的做法，想凭借中原的富足徐图。孰料四年后汉中反为刘备攻占，失去汉中的第二年曹操即死去。\n\n这四年间为何曹操没有动作反而导致前功尽弃？不妨从曹操的朝堂上找找原因。以建安十八年曹操称魏公、如萧何故事为标志，曹操后期活动的重心更多地偏向了政治。他早年虽尽力勤王，并无不臣之心，但汉祚倾颓之无法挽回有目共睹。就算他自己有顾忌，群下出于自己的名位考虑，也多有劝进之心。而随着曹操年龄渐老，为子孙计，他亦不能不为代汉铺路。\n\n翻开武帝纪，建安十八年后，几乎每年都有天子对曹操超规格的册封和晋位记录，可以想见这背后复杂的正统之争和政治程序。与此相对应的是愈渐单薄的军事记录，到建安二十五年，比较大的军事行动只有平陇西凉州以及夺汉中两起，其中汉中得而复失。而两次征讨孙权都在有利情况下草草结束，究其始末，第一次回去后曹操登位魏公，第二次受了献帝赐予的天子旌旗。其中是否有关联？\n\n因称魏公之事，曹操还失去了最重要的谋士荀彧，这也多少影响了他的军事决策。荀彧当年力劝曹操迎汉帝至许都，目的却是希望曹操藉此“奉主上、秉至公、扶弘义”，扶保汉室是他的原则，他也为之而死。跟随曹操多年，忠心耿耿屡建功勋的荀彧尚且如此，曹操所能感受到的政治压力可见一斑。\n\n所谓的“挟天子以令诸侯”为曹操带来政治资本的作用，恐怕远远小于它所带来的政治压力。虽然毛玠劝曹操说“宜奉天子以令不臣”，但事实上建安元年曹操迎奉天子后，面对的形势是“袁绍内怀不服……太祖方东忧吕布，南拒张绣”，这还仅是中原一地，少数民族尚有乌桓鲜卑西凉，各地军阀尚有刘表张鲁孙策等人，未见一人因曹操占据中央而归附。而曹操几个最为得力的股肱谋士与猛将，也很少是因为响应朝廷征辟而来到他门下的。无论是吸引人才，还是攻城掠地扩大势力范围，用吕思勉的话说，都是靠他“政治清明，善于用兵”。\n\n反过来，既然是迎奉天子，那曹操就等于将汉室的责任揽在了自己身上，成为众矢之的。一边周瑜骂他托名汉相实为汉贼，一边荀彧还满心期待他重振汉纲。之前统一过中国的三位皇帝，无一人面临过如此复杂而矛盾的政治处境和法理难题。随着曹操权势的增大，政敌也越来越多，他不得不腾出手来解决这些问题──比如进献三个女儿、杀伏皇后一家、诛孔融，如何平衡汉朝与自身的关系，耗费了曹操的许多精力。比较两个对手：江东在赤壁战后便不以朝廷为顾忌，刘备以正统自居，两家几乎没有内部斗争，故可一致对外，巩固自身。\n\n士族对曹操的抵制也不容小觑。陈寅恪在《崔浩与寇谦之》中说，曹操的政权叫做“法家寒族之曹魏政权”。曹操出身士族最为歧视的宦官家庭，又以军功起家，用人唯才是举，不信天命，厉行法制，抑制兼并，每一条都与士族观念背道而驰。荀彧之死，也与他的士族背景有关。直到曹操死后，曹丕任用陈群实行九品中正制，由士族垄断做官权，然后在士族内部按照声望的高低、门阀的上下、势力的大小来分配官位官职，这才真正消除了士族的疑虑，交换来他们对曹丕代汉的认同。故而在曹操有生之年，他对全国的士族集团始终没有产生强大的凝聚力，虽然中原士族集团鉴于乡土与正统观念多有归附，但地方上如荆襄、益州、江东集团，便不大买它的账了。反观刘备与孙权政权，都得到士族集团强有力的支持。诸葛亮本身出自琅琊士族，又与荆襄士族多有联姻，刘备作为外来者，在荆襄地位的稳固，很大程度上仰仗于诸葛亮、庞统、马良等当地士族的支持，顿时翻身，与前期狼奔豕突的状况不可同日而语。\n\n所谓攘外必先安内，内部问题操心操肺，而孙刘皆为人杰非一时能攘除。曹操在这三人中年纪最大，就算天假以年，只怕他无心也无力统一了。",
			"date_added": 1489379770
		},
		{
			"post_id": 1489392849,
			"body": "民族英雄郑成功竟因内讧被毒死?\n\n郑成功，福建南安人。明隆武帝曾赐姓朱，名成功。因此后人也多称其为“国姓爷”。郑成功的父亲郑芝龙早年亦商亦盗，最后官至福建总兵。郑芝龙早年旅居日本平户时，与当地女子田川氏结婚，生下郑成功。郑成功7岁时从日本返回中国，开始接受儒家教育。顺治元年(公元1644年)，南明永历皇帝册封郑芝龙为南安伯，福建总镇，负责福建全省的抗清军务。次年，郑芝龙、郑鸿逵兄弟在福州奉明唐王朱聿键为帝，年号隆武，郑芝龙被册封为南安侯，负责南明所有军事事务。清军进军福建之时，郑芝龙降清，隆武政权也随之灭亡。郑成功得知父亲要降清，曾苦苦劝阻。眼见父亲执迷不悟，郑成功气愤之下单独跑到南澳岛，召募了几千人马，坚决抗清。清王朝几次三番派人诱降，都被郑成功拒绝。\n\n　　郑成功强大起来后，与抗清将领张煌言联合起来，率军分水陆两路进攻南京，一直打到南京城下，但是中了清军假投降之计，兵败退回厦门。郑成功回到厦门后，开始筹划攻占台湾，以此做为反清复明的根据地。恰在此时，在荷兰军队里当过翻译的何廷斌，赶到厦门求见郑成功，劝郑成功收复台湾。何廷斌还送给郑成功一张绘有荷兰侵略军军事力量布置的台湾地图。公元1661年三月，郑成功派他儿子郑经带领一部分军队留守厦门，自己亲率25000名将士，分乘几百艘战船，浩浩荡荡从金门出发。大军越过台湾海峡后，在澎湖休整，准备直取台湾。\n\n　　荷兰侵略军为阻止郑成功军队进攻台湾，将军队集中在台湾和赤嵌两座城堡，并在港口沉船，以此阻挡郑成功的船队登岸。郑成功在何延斌领航下，利用海水涨潮的时机，驶进了鹿耳门，登上台湾岛。经过激战，荷兰侵略军惨败，龟缩在两座城里不敢应战。他们一面派人到爪哇岛搬救兵，一面派使者到郑军大营求和，试图以十万两白银换取郑成功军队退出台湾。郑成功断然拒绝了荷兰侵略者的要求，并且采用切断赤嵌城水源的方式迫使盘踞在赤嵌的荷兰人投降。对盘踞在台湾城的侵略军，郑成功决定采取长期围困的办法逼他们投降。在围困八个月之后，郑成功下令向台湾城发起强攻。荷兰侵略军走投无路，只好投降。公元1662年初，郑成功将荷兰侵略者赶出了台湾。 \n\n　　郑成功收复台湾不久，却突然暴病而亡，年仅38岁。关于郑成功的死，有这样的说法:郑成功在收复台湾的同时，也接到凶信，说他父亲被家奴伊大器告发，伊大器称郑芝龙和郑成功之间不时有书信往来，图谋不轨。清朝廷震怒，将郑芝龙全家处死。郑成功听到消息后，捶胸顿足，望北恸哭道:“你要是听我的劝告，怎么会招来杀身之祸？”不久郑成功又得知，叛将黄梧在自己家乡挖了郑氏祖坟，郑成功更是捶胸拍案，整天哀伤恸哭。他咬牙切齿发誓说:“人活着结下怨恨，与死者有什么关系呢？要是有一天我领兵打回去，我不一寸寸地将你碎尸，我就枉作人间大丈夫了。”郑成功的愿望在14年后实现，郑经攻陷漳州时，也挖了黄梧的坟鞭尸，替父亲雪了恨。\n\n　　公元1662年4月，南明兵部司务林英削发为僧，从云南逃到台湾见郑成功，向郑成功哭诉道:“皇上(永历帝)听信奸相马吉祥、逆戚李国泰之话，避居缅甸。现在吴三桂攻缅，缅王已将皇上献给吴三桂，听说已经被吴三桂杀害了。”郑成功听罢，更是痛哭不已。\n\n　　谁知一波未已，一波又兴。郑成功的部下唐显悦告发郑成功的儿子郑经与乳母通奸，郑成功顿时气塞胸膛，立刻派人到厦门，欲斩郑经与其所生婴儿及乳母陈氏，但留守厦门的众将不执行命令。郑成功天天登高眺望澎湖方向有船来否，因而患上风寒，到了第八天，突然发狂地喊叫道:“吾有何面目见先帝于地下也？”既而用两手抓面而逝。所以，《台湾通志》上说郑成功是死于感冒风寒。 \n\n　　根据郑成功临终前的异常表现和当时郑氏集团内部斗争的背景，有人认为郑成功是被人投毒杀死的。这一说法主要的依据是:郑成功死前的情状与中毒后毒性发作的症状极为相似，与郑成功同时代的李光地《榕村语录续集》、夏琳《闽海纪闻》、林时对《荷闸丛谈》分别记载了郑成功之死。如《榕村语录续集》载:“马信荐一医生以为中暑，投以凉剂，是晚而殂”。《荷闸丛谈》道:“(成功)骤发颠狂，咬尽手指死”；《闽海纪闻》说，郑成功临终前将药投之于地，然后“顿足扶膺，大呼而殂”。郑成功大概察觉出有人谋害自己，但为时已晚。\n\n　　之前，清政府也的确有谋害郑成功的想法。《台湾外志》记述说，当时清政府派一高级军官，携带一枝孔雀胆混入郑军，用重金买通专为郑成功做饭的厨师，让他乘郑成功与部下开会时毒死郑成功和他的将领。这个厨师虽贪财，但害怕事情暴露，权衡再三，不敢下手，于是把这件事交给了他弟弟办理。他弟弟到了真正下毒时，“每欲下药，则浑身寒战”，恐怖之余，便把这件事告诉了他们的父亲。\n\n　　其父“闻言大惊”，怒斥他们两人说:“谋害主人，是不忠；答应了别人而不去做，是没有诚信。宁可没有诚信，也不能不忠心。诛灭九族的事情怎么能做呢？赶紧去自首也许还可能免罪。”于是带他们到郑成功住处自首。郑成功非但没有处罚他们，而且还对他们施以重赏，十分自信地说道:“我是天生的，怎么能被凡人毒害？”此后，郑成功加强了保卫措施。这样，即使有人“欲施毒，奈何不得其近(指郑成功)身也”。但这并不能排除郑成功被毒死的可能。 \n\n　　郑成功的部将马信神秘地死去仿佛也证明了郑成功有可能被毒死。马信是清降将，后来成为郑成功的亲信，郑成功去世当天，是由他推荐的医师开的处方，夜里郑成功死去，他本人也突然无病而卒。照李光地的说法，马信在郑成功去世的第二天就死去，江日升《台湾外纪》中记载，其死期距郑成功去世仅仅5天。因此马信可能直接参与谋害郑成功的活动，但后来又被人杀害以灭口。\n\n　　假若郑成功是被人毒死，那么作案者是谁呢？当然，清政府有重大的嫌疑，同时，还有人认为是郑成功兄弟辈的郑泰、郑鸣骏、郑袭等人，特别是郑泰。生性暴烈的郑成功，用法严峻，郑氏部下，包括他的长辈亲族因过被处以极刑者很多，众将人心惶惶，其中很多人在清廷高官厚禄诱惑下叛逃，郑氏集团内部关系极其紧张。郑泰早在郑成功率军攻打台湾时就与郑成功有矛盾。\n\n　　当时，郑泰为运粮官，当郑成功军队出现补给困难时，郑成功对郑泰的失职极为不满，他在座前写下了5个大字:“户失先定罪！”意思是，要是出了乱子，首先处分郑泰。郑成功去世后，郑泰等人伪造郑成功的遗命郑经，并抬出有野心但无才干的郑袭来承兄续统。最后，他们的阴谋被郑经挫败，郑泰入狱而死，郑鸣骏等率部众携亲眷投降清朝。据此分析，策划谋害郑成功的有可能就是郑泰等人。\n\n　　家和方能家和方能行万事，一代民族英雄郑成功竟然会因为家庭矛盾暴病而亡，实在是令人遗憾！",
			"date_added": 1489392841
		},
		{
			"post_id": 1489470009,
			"body": "毛泽东时代中国对外援助知多少\n                ------不为君王唱赞歌，只为苍生说人话\n\n\n中华人民共和国成立不到一年，在一穷二白的情况下，毛泽东开始决定对外提供经济援助。根据解密的外交部档案，1976年以前我国曾向朝鲜、越南、阿尔巴尼亚等110多个国家和地区提供过经济援助，其中人均gdp超过中国的有92个国家，毛泽东死后，中国政府以人民的利益为主，不谋求空有的虚名，大幅度减少对外不必要的援助。\n\n\n中共建政初对蒙、朝、越的援助力度\n中共建政后最早的对外援助是在1950年7月，我国首任驻蒙古大使吉雅泰刚到任，蒙古总理乔巴山就提出急需劳动力。这时新中国刚成立不到一年，国内战争还没有结束，动员工人出国有困难，但中国并没有拒绝，答应日后考虑。1954年11月，副总理乌兰夫率中共代表团访问蒙古，周恩来指示外交部了解蒙方的困难以及我国可能给予的帮助。蒙古毫不客气地提交了包括木匠、泥瓦匠、家具制造、厨师、裁缝、制靴、印染等近40个工种12250名工人的清单。当年中国派出8200名工人，帮助蒙古建学校、医院、疗养院、专家招待所、热电站、玻璃厂、造纸厂、养鸡场等，甚至修复古庙。中国不能制造蒙古提出的纺织厂设备，不惜动用紧缺的外汇到英国订购。\n\n1956年8月，中蒙两国签订经济和技术援助协定，中国从1956年至1959年，无偿援助蒙古1.6亿卢布。出工和物资折合黄金800万两，折合当时原油价格3亿桶。\n在中国“一五”计划期间，虽资金捉襟见肘，仍慷慨外援，援助最多的国家是朝鲜和越南。1950年朝鲜战争爆发，中国出动100多万志愿军，开支战费7万亿元人民币(旧币)。1953年11月金日成访问中国，中朝签订经济文化合作协定，中国不仅将战时费用一笔勾销，又无偿赠送朝鲜8万亿元人民币(旧币)。\n1950年1月18日，中国第一个承认越南民主共和国并与之建交。在胡志明主席的要求下，周恩来代表党中央表示：中国将拿出大量的作战物资帮助越南抗击法国殖民军。5月15日，越南以断炊为由，恳请中国再支援1500吨至2000吨大米。\n在繁重的抗美援朝战争中，中国仍念念不忘支援越南。从1950年至1954年，中国政府向越南政府提供1.67万亿人民币的援助。1953年3月13日，周恩来复电驻越南的中共中央联络代表罗贵波并转越南劳动党中央：越南要求中国援助的军事物 资，均可予以解决，即由军委总后勤部分批发货。12月，为协助越南具有决定意义的奠边府战役，中国派出军事顾问团，提供战役所需的全部武器弹药、通信设备、粮食、医药等，保证了此役大获全胜。\n1954年5月日内瓦会议结束越南北部战争，中国继续援助越南恢复和发展国民经济。12月，中越两国政府在北京签订关于援助越南修复铁路、恢复邮政电信、修复公路及航运、水利等议定书。\n1955年越南政府代表团在胡志明主席率领下访华，提出援助煤矿、水泥厂、纱厂、发电厂等。中国政府派出专家、技术人员和熟练工人，并无偿赠送越南8亿元人民币。在《关于中国1955年援助越南议定书》的附件中，中国不顾本国大米供应紧张，援助越南3万吨大米，以及300吨面粉、5吨葡萄干、1130箱酒及粉条、香烟、中成药、医疗器械等；还有电炉、轮船、电话机、卡尺、灯泡；农业援助项目从农作物栽培、选种育种、病虫害防治，到建兽医院、家畜防疫药剂制造厂、火柴厂、加固水坝等，还包括10个碾米厂、两个汽油库。这份清单给人的感觉是中国真把越南当成了兄弟，无所不给。\n1956年以后，随着“一五”计划的顺利完成，中国对越援助大幅上升。1959年2月18日，中越两国政府签订7份文件，中国向越南提供人民币3亿元的长期贷款和1亿元的无偿援助。\n\n\n\n注：中共党史专家丛进撰写的《曲折发展的岁月》中认为“1959年至1961年的非正常死亡和减少出\n生人口数，在4000万人左右”。中共中央党史出版社出版的《口号与中国》一书披露，大跃进时期，\n非正常死亡人数和减少的出生人口共有四千万。……\n\n\n\n\n萨马兰奇：要想***最好的体育建筑，请到非洲去  \n\n\n1950年代，除朝鲜和越南外，中国还援助了很多发展中国家。例如1956年6月，中国与柬埔寨签订关于经济援助和实施经济技术援助的议定书。中国将在1956年和1957年，无偿赠予8亿柬元(折合800万英镑)的物资，由柬埔寨政府自由使用，中国政府不加任何监督和干涉。这是中国对外经济援助不附带任何条件的具体化，此后成为范本。1956年10月，中国与尼泊尔政府签订经济援助协定……\n1956年12月12日，彭德怀关于援助埃及军事装备问题给毛泽东并中央的请示报告，说7日埃及大使来访，提到埃军在西奈半岛作战中，军事装备损失很多，希望中国给予援助。彭德怀说毛泽东主席曾说过，只要埃及需要的我国有的东西，我们都可以并愿意援助。毛泽东批：筹划的两项，可以进行筹划。具体援助事项，须经国务院统筹酌定。\n1958年底，中国与非洲国家陆续建交，建交前几个月开始援助中小型工业项目和农场。1959年到1960年，中国连续两年粮食减产，整个国家都在勒紧裤带，很多人饿死，但中国还是答应非洲一些国家的要求。1960年，中国援助几内亚一万吨大米，援助刚果5000吨至一万吨小麦和大米。中国向埃及等国提供经济援助，派出一大批工程技术人员。中国在非洲最著名的援建工程是坦赞铁路，这是当时中国最大的援外项目。坦桑尼亚和赞比亚刚开始向西方大国和苏联求援，被拒绝后才转求中国。虽然中国财力有限，还是承接下来。坦赞铁路的施工条件极为艰苦，中方59人牺牲。工程接近尾声时，铁轨告急，中国二话不说，将本国急需的铁轨运去，保证了按时完工。这样倾其所有的例子几乎遍及受援国。中国曾无偿为非洲国家建造了20多座体育场馆。国际奥委会主席萨马兰奇说：要想***最好的体育建筑，请到非洲去。截至1966年，中国援非金额累计已达4.23亿美元。\n1958年底，中国援外工作总结披露：估计(我国援建的)蔬菜农场生产的蔬菜比当地的肉价还贵。援助蒙古的个别项目规模过大、标准偏高。砖瓦厂的协定限期太紧，国内的设计和制造推迟了半年才完工。按协议，1958年中国应向朝鲜供应6万纱锭的纺织机械设备，但由于优质钢材缺乏，未能及时满足朝方要求。\n1960年7月1日，时任外贸部副部长的李强向全国外事会议报告：1950年至1960年6月底，中国无偿援助和贷款总额为40.28亿元人民币，大部分给了越南、蒙古、朝鲜。据《中国统计年鉴》的数字，“一五”计划中的援外占国家基建投资的1/10。10月5日，周恩来接见朝鲜副首相李周渊，说最近苏联把专家撤走了，这给我们带来了新的困难，但中国仍然同意供应朝鲜10万锭子的棉纺设备，也同意供应其他项目。周恩来建议朝鲜先上既快又短的项目，并同意分4年贷款4.2亿卢布。至于偿还期限，能还就还，不能还也可以延期，推迟10年甚至20年也未尝不可，等后代还也可以。\n1962年1月13日，中国政府和老挝王国政府在老挝临时首都康开签订航空运输和修建公路协定，中国负责修建云南孟腊至老挝丰沙里的公路。至1978年5月底，中国先后派出18个工程大队，3个民工总队共7万余人，投入各种施工机械2250多台。如果将路基作业完成的3100多万石，筑成两米宽、三米高石墙，可以环绕老挝一周。平均每公里公路造价为人民币31万余元，所有的修建费用都算作中国政府给予老挝王国政府无偿的、不附带任何条件的经济援助。中国同时派出2.1万人的高炮部队担负老挝的防空任务。\n1962年初，中国承诺对外援助69亿多元人民币，主要是越南、朝鲜、蒙古、阿尔巴尼亚，其次是柬埔寨、巴基斯坦、尼泊尔、埃及、马里、叙利亚、索马里等亚非拉国家。12月周恩来访问马里时，提出中国政府对外援助的8项原则，主要内容是：中国政府一贯根据平等互利的原则对外提供援助，从来不看作是单方面的恩赐，而认为援助是双方的。中国政府在提供对外援助时，严格尊重受援国的主权，决不附带任何条件，决不要求任何特权。提供外援的目的是帮助受援国逐步走上自力更生、经济独立发展的道路。\n中苏翻脸后，中国更加扩大了对外援助的规模。大饥荒的1961年，援外支出接近偿还外债的支出。1962年以后援外更超过了偿债。中共中央对外联络部部长王稼祥建议：我们实际许诺承担的义务超出了中国的实际承受力。国内还没有真正走出困境，国际环境明显恶化，两大阵营冷战继续，中苏关系紧张，中印边境冲突加据，蒋介石叫嚣反攻大陆，中国仍处于三面包围中。面对国内外的特殊形势，有必要调整对外政策，谋求某种缓和。1962年上半年，王稼祥在小范围几次谈了有关意见，毛泽东没有接受，以后，特别是“文革”中，王稼祥被视为提倡和主张“三和一少”、“三降一灭”的“修正主义”者，受到严厉批判，直到1979年才恢复名誉。\n\n\n\n\n中国对外援助的步伐越迈越大\n1962年夏，中越两国领导人在北京会商，中国向越南无偿提供可装备230个步兵营的武器。1964年6月，毛泽东对来访的越军总长说：我们两国两党要合作，共同对敌。你的事就是我的事，我们两家无条件共同对敌。7亿中国人民是你们的坚强后盾，辽阔的中国国土是可靠的战略后方。\n1965年5月，中共中央成立援越运输领导小组，组长是总长罗瑞卿，负责统一处理有关援越事务。周恩来在越南最困难时，5次出访越南，尽量满足越方的要求，还经常主动帮助越南解决困难。1965年10月，应胡志明主席要求，中国先后向越南派出防空兵、铁道兵、工程兵和后勤部队共计32万人，最高年份高达17万人。1970年，中国军队奉命全部撤回国内，而1442位烈士的遗骸至今仍留在越南。\n1971年中国与越南签订的无偿援助协议共7笔，援助数额达36.1亿元人民币。这年，中国还同朝鲜、阿尔巴尼亚、罗马尼亚等国签订了援外协议，总额度为74.25亿元人民币，是建国以来对外援助任务最重的一年。对外援助支出占国家财政支出的比重，由上一年的3.5%上升到5.1%。8月，越南北方发生特大水灾，危及数十万人。中国紧急调动飞机和火车，运送救灾物资到越南。9月27日，中越两国政府签订1972年中国向越南提供经济、军事物资援助协定，确定中国无偿援助越南27.98亿元人民币。\n1972年国家财政对外援助支出51.49亿元人民币，占国家财政支出的6.7%，比1971年上升31.6%。11月26日，中越签订1973年中国对越南13项无偿援助的协定，援助价值21.07亿元人民币。\n1973年中越南签署7笔包括一般物资、军事装备、成套项目和现汇在内的无偿援助协定，折合人民币25.39亿元人民币，加上同其他国家签订的援助协定，1973年国家财政对外援助支出达到57.98亿，占国家财政支出的7.2%，是建国以来对外援助支出最大的一年。\n1974年中国又签署了给予越南无偿经济和军事援助的协定。\n1975年5月，越南南方解放，中国逐步减少对越南的支援，但中国援建的鱼雷快艇修理厂、轻重机械厂、高射机枪厂及枪厂的扩建等工程还在继续。9月越南劳动党中央委员会第一书记黎笋访问中国，中越两国政府签署中国向越南提供无息贷款的协定和1976年中国向越南提供一般物资的议定书。\n周恩来对越南领导人说：为了支援你们，我们不惜承担了最大的民族牺牲。从1962年起，根据越方要求，中国提供各种旧式武器和中国生产的无汉字新武器。越南战争期间，中国生产的大型武器装备很多供应了越南，甚至从现役装备中抽调，而自己需要换装的坦克和大口径火炮却很少更换。1968年前，中国生产的63式电台3000余部，绝大多数支援了越南，自己仅留下少数样机。有的新武器生产不足，宁可自己缺编，先拿去支援越南。由于援越的野战输油管不够，中国推迟当时正在铺设的战备输油管线，将优质钢管运往越南。1968年6月，越南副总理范雄与中国副总理李先念谈1969年的援助，提出急需107毫米火箭炮，中国已停止生产这种型号，把库存全部给了越南。1971年至1972年，越南更是把中国当成了免费武器库，提出要1000架飞机，3个营的红旗二号地空导弹地面设备及导弹180枚(这些当时最先进的武器都是从苏联进口的，中国自己还没有这么多)，警戒雷达2部，水陆坦克20辆，舟桥2套，大口径加农炮204门，炮弹4.5万发。这张清单完全超出中国的军事和经济实力。\n在中国的对外援助中，对越南的援助时间最长，数量最大。截至1978年，中国援越的军事物资可以装备200万陆海空军队，各种物质折价200多亿美元。包括轻重武器、弹药和军需品，450个成套设备项目，346亿米棉布，3.5万辆汽车，500多万吨粮食，200多万吨汽油，3000多公里油管，6.35亿美元的现汇。这些援助不附带任何条件，绝大部分无偿，一小部分是无息贷款。李先念问，你们拿我们这么多东西，打算什么时候还？\n中国对外援助的另一个大户是阿尔巴尼亚。1949年11月，中国和阿尔巴尼亚建交。在1960年6月布加勒斯特会议上，阿尔巴尼亚劳动党不同意赫鲁晓夫攻击中国，此后，中阿两国更有了同志加兄弟的特殊关系。阿尔巴尼亚认为自己是为了中国才失去苏联的援助，理所当然向中国伸手。霍查对中国驻阿尔巴尼亚大使说，我们向你们要求帮助，就象弟弟向哥哥要求帮助一样。你们有的，我们也要有。谢胡也说，我们不向你们要，向谁要呢？\n1960年代初，中国把苏联援助阿尔巴尼亚的项目全部包下来，援助规模不断扩大，几乎有求必应。1960年底，正值中国最严重的灾荒时期，却还是紧急援助了阿尔巴尼亚5万吨粮食。\n1961年阿尔巴尼亚狮子大张口，3次派人来北京要钱要物，甚至提出很多不切实际的要求。周恩来卫士乔金旺回忆：阿尔巴尼亚劳动党中央书记科旬加来访，主要是伸手，给少了还不行。阿尔巴尼亚不理解我们也很困难，双方谈得不好，总理心情很不愉快。12月25日，周恩来对来华的阿尔巴尼亚领导人凯莱齐说：我们根据力所能及承担国际义务，但由于我国连续遇到3年灾荒，加上苏联撤退专家，所以我们遇到了极大的困难。因此援助不能像你们希望的那么多、快、大、好，不可能把苏联过去答应的援助全部包下来，你们自力更生还是主要的。尽管如此，1962年1月13日，中国还是与阿尔巴尼亚政府签定了5项议定书。\n从1954年起，中国政府向阿尔巴尼亚提供经济和军事援助折合人民币100多亿元。而当时中国人的年收入才200多亿元。中国还先后派出近6000名专家，并为阿尔巴尼亚培养了几千名技术骨干。中国援助阿尔巴尼亚急需的东西，甚至包括2100万美元的自由外汇，而阿方供应中国的如烟草、香烟、沥青等，中国并不需要。1969年，谢胡与到访的中国副总理李先念谈了6个多小时，全是要东西。李先念问，你们拿我们这么多东西，打算什么时候还？谢胡说根本没有考虑还。\n不断伸手，不断得到满足，阿尔巴尼亚形成了严重的依赖思想。中国帮阿建设纺织厂，而阿自己不种棉花，要中国用外汇替它买。织成布做成衣服，没地方卖，反过来卖给中国。中国援建了化肥厂，但阿方不放心中国的主机，提出要意大利的主机，结果意大利主机使用不长时间就坏了，又要中国用外汇买意大利的备件。优质钢材中国自己都极少，而阿方用中国援助的优质钢管做电线杆，优质钢板铺厂房地面，甚至铺路。中国自己都舍不得用的高标号水泥，援助给阿，而阿方竟用来建烈士墓——2.8万平方公里的国土上建了1万多座纪念碑。\n1970年8月，中阿的“政治恋情”降温。但阿尔巴尼亚仍厚着脸皮要求中国援助32亿元人民币，中国决定提供19.5亿元人民币的长期低息贷款。阿尔巴尼亚又要求中国更多接受香烟、烟叶和成衣等，中国不得不同意接受这些并不需要的东西。\n1974年10月，谢胡写信给周恩来，提出在阿第六个五年计划(1976至1980)期间，要求中国提供50亿元人民币的贷款。中国认为过去对阿的援助已不少，这次要求的数量过大，中国力不从心，很难满足。鉴于阿已有一定的自力更生能力，中国决定少给援助。阿方坚决要求增加贷款，还提出延期偿还1976至1980年的贷款。7月30日中阿双方签定贷款协定，中国贷款给阿尔巴尼亚10亿元人民币。阿尔巴尼亚还再三要求中国提供粮油，而此时的中国经济处于崩溃边缘，确实拿不出更多的东西。阿尔巴尼亚很不满意，表示决不会在外来经济压力下低头，并拒绝给中国需要的原油、沥青。在阿尔巴尼亚劳动党第七次代表大会上，霍查含沙射影攻击中国。如此这般，就不会再伸手了吧？但1975年6月，阿方又来中国要援助。7月3日，中阿签订长期无息贷款等议定书。\n1976年邓小平复出后，在外交领域的第一个重大决策就是结束中阿的畸形关系。1978年7月7日，中国外交部照会阿尔巴尼亚驻华大使馆，中国政府决定停止对阿尔巴尼亚的经济和军事援助，撤回专家。直到1983年，中阿两国才逐步恢复正常的国家关系。\n\n\n\n\n\n1970年至1976年，中国援非金额高达180.15亿美元\n1964年，周恩来在《政府工作报告》中说：前几年我们对苏联和东欧社会主义国家的贸易欠账，现在已经全部提前还清。我们还节衣缩食，拿出相当大的一部分资金和物资支援社会主义兄弟国家和民族主义国家。\n1965年3月，周恩来对来访的巴基斯坦总统阿尤布·汗说：在我们“三五”计划期间，除已经提供的6000万美元外，我们将继续向你们提供援助。1966年7月29日，中巴签订无偿军事援助议定书。仅此一年，中国对巴基斯坦的4笔无偿援助已经达到1.8亿元人民币。1968年12月26日，中国再次无偿援助巴基斯坦1亿元人民币。\n1970年11月13日，毛泽东会见巴基斯坦总统叶海亚·汗时说，“四五”计划安排的对外经济援助太少，特别是对巴基斯坦的经济援助很不够，要由原定的2亿元人民币增加到5亿元人民币。中国对朝鲜的援助一直未断，不断向朝提供物资援助。新华社报道：1970年中国向朝鲜提供石油15万吨，1972年增加到140万吨。1972年中朝商定共同建设输油管，1974年2月破土动工，1976年1月输油管竣工，年输油能力为400万吨。\n1975年4月23日，中共中央发出压缩和调整我国对外援助支出的文件。我国对援助支出占财政支出的比例，“一五”、“二五”期间为1%多一点。从1963年开始比例逐年有所提高，到1972年、1973年、1974年上升到6.7%、7.2%、6.3%，超过了国力所能负担的程度。中共中央决定，在第五个五年计划期间，对外援助占财政支出的比例将由“四五”时期的预计6.5%降至5%以内。对外援助总额基本维持“四五”水平，大约平均每年50亿元人民币。\n1970年至1976年，中国对非洲的援助金额高达18.15亿美元。1970年代后，又同31个国家签订了经济技术合作协定。1970年代，我国先后同智利、秘鲁、牙买加、圭亚那等国签订了经济合作协定。1975年8月18日，中柬两国政府经济技术合作协定在北京签字。协议规定，中国向柬埔寨提供价值6亿元人民币的一般物资和成套项目的无偿援助。1976年2月10日，签订中国向柬埔寨提供无偿军事援助协定，援助额折合人民币2.26亿元。\n1976年中国对外援助为300亿元人民币，占国家财政支出的37%，比上年降低1.2%。\n\n共建政后，对外援助被当作中国支援世界革命，越援越多。一些受援国从工农业、军事设施到日用品什么都要，还有些援助国伸手要外汇还债。1962年2月6日，周恩来在七千人大会上就说过：国际义务必须承担，现在我们承担的国际义务一天比一天重起来了。能做的做，不能做的要说清楚不能做或者以后做，不要使他们发生错觉，以为我们什么都行了。1967年8月，周恩来同马里代表谈话时说：如果拿我们的援助来满足法国的欲望，弥补财政赤字和贸易顺差，等于我们帮助你们重新回到殖民地(马里曾为法国殖民地，1960年独立)，我们不能做这种事。\n考虑到越南战争发生了很大变化，朝鲜、阿尔巴尼亚等受援国的经济已有一定的基础，有的受援国的生活水平比中国还高，而要求中国援助的第三世界国日益增多，需要统筹兼顾，同时中国国内建设也需要加强，1973年5月，周恩来在外事会议上说：国家现在力量有限，我们是力不从心，中国目前还是发展中国家，今后只能是有重点地适当地进行对外援助。6月7日，周恩来就中国政府1974年向越南提供无偿援助事致函毛泽东等：这几年由于越南抗美救国战争规模扩大，我国援助的物资和外汇也随着扩大。这次越方提了一个估计值为81亿元人民币的大计划，不切实际，我们也做不到。拟先定金额25亿元的援助计划，然后再分类计算。该项计划已同越南商定。毛泽东终于批准了修改后的方案",
			"date_added": 1489470000
		},
		{
			"post_id": 1489572509,
			"body": "煌煌大唐的覆灭源于一个想自治的念头\n\n公元755年12月16日至763年2月17日由安禄山和史思明组织发起了一场政治叛乱，史称“安史之乱”;又由于爆发于唐玄宗天宝年间，亦称“天宝之乱”。\n\n叛乱发生之后，安禄山将他占据的地盘变成了一个独立于大唐的国家。这就是“大燕”。安禄山自称“大燕”的皇帝，不会再听从李隆基的命令了。不过“大燕”在大唐的眼里也不过就是一个在玩过家家的小孩吧。\n\n安禄山和史思明会发起叛乱，就是看到大唐当时的皇帝李隆基不理朝政，专宠杨贵妃，使得国家混乱。最后安禄山和史思明虽然没有的到这个江山，也是逼得李隆基杀了自己心爱的女人——杨贵妃。\n\n安史之乱全过程是怎样的\n\n安史之乱往简单了说就是一场战争罢了。\n\n在755年时，安禄山就开始蠢蠢欲动。在同一年的11月15日，唐玄宗知道了安禄山叛乱的这一个消息。在几经犹豫之后，他决定任命安西的节度使封常清再同时去管理范阳、平卢的节度使，以此作为对这次叛乱防守的前期准备，还任命了皇六子荣王李琬作为元帅,当时的右金吾大将军高仙芝作为副元帅东征。\n\n在唐玄宗做了这些准备之后，安禄山的大军虽然遇到了一些阻碍，不过因为杨国忠没什么本事，使得安禄山就在同一年的12月12日就攻下了洛邑。当时东京的留守李憕还有御史中丞卢奕因为不投降，就被安禄山杀了。河南的尹达奚珣没什么骨气就投降了安禄山。不知是不是唐玄宗因为有人投降了，有些丧失判断。听信了监军宦官的诬告，用“失律丧师”这样的罪名处斩了封常清、高仙芝这两位坚守这的大将。\n\n在天宝十五年的正月初一，安禄山在洛阳自称大燕皇帝，并改国号为元圣武。此时大燕军攻无不克，战无不胜。很快就打入了长安。\n\n唐玄宗看到是这样的局势，就马上选择了逃离长安，逃到了马嵬坡这一个地方。在逃亡途中，士兵又饿又累，不愿意再战斗了，于是龙武大将军陈玄礼就请求唐玄宗杀了杨国忠父子和杨贵妃这几个祸乱朝政的人。杨国忠其实已经被士兵们乱刀砍死了，唐玄宗看这样的情况就打算为杨贵妃求情，不过士兵们不买账，最后玄宗还是赐死了杨贵妃。这是士兵们斗志高昂，马上就进行了反击。很快就结束了这次叛乱。\n\n安史之乱后的唐朝\n\n安史之乱是唐朝一个由盛而衰的点，同时，这件事还造成了唐代的藩镇割据。安史之乱经历了一共七年零三个月，虽然这个叛乱最后是被镇压住了，可是唐朝也是付出了很大的代价。经过了这一次的祸事，大唐是大不如前了的。无论是从经济、政治还是军事上来看都是处于一种苟延残喘的状态下。\n\n司马光在《资治通鉴》中有过这样的记载：“(安史之乱爆发之后)由是祸乱继起，兵革不息，民坠涂炭，无所控诉，凡二百余年。”从中最直观的可以看出，那时的民间是民不聊生，大家都不知道日子应该怎么过了。\n\n在政治上，那些地方的势力开始蠢蠢欲动，不再对于唐朝中央机构的命令言听计从。当中央下达命令时，阳奉阴违，并不会好好地、完整地执行命令。更多的情况下，是把圣旨当做一张废纸。这就看出，中央对地方的统治力在下降，甚至可以说是下降到了一个从未有过的低点。\n\n从经济上看，这次平定叛乱花了不少的物力，中央的财务状况有点被掏空的感觉。而且因为在打战，人们也无法安心地耕作。中国一向是一个农业大国，没有了安心耕作的环境，人们的生活会受到很大的冲击。据很多史料记载，在这次的安史之乱结束后，民间是有了一场大饥荒。这就可以证明，这次战争对于经济的打击是多么的大。\n\n所以，安史之乱即使被平定了，也给了唐朝不可磨灭的伤害，还影响到了后世。\n\n安史之乱的影响\n\n《旧唐书》中提及，整个黄河中下游，几乎没有人烟。唐朝诗人杜甫有诗云：“寂寞天宝后，园庐但蒿藜，我里百余家，世乱各东西”。战乱后的百姓流离失所，很多民众处于无家可归的状态。人们的生产生活一被打乱，那么国家的经济、政治、军事、文化等方方面面都会受到影响。\n\n其次，边疆不稳定也是安史之乱的影响。唐王朝经历安史之乱后，根本无暇顾及边疆事务。唐玄宗为了镇压安禄山叛乱，召回了镇守在边疆的士兵，造成了边防空虚的状态。\n\n西边吐蕃人见唐朝正在内乱，根本无无暇顾及边疆事务，于是他们和安禄山乱兵一起，夺去了河西走廊、陇右。公元790左右，唐朝陆续失去安西北庭，这让岌岌可危的唐朝政权逐渐危在旦夕。除此之外，唐末藩镇割据额局面，也是由安史之乱引发的。以及经济中心南移，百姓赋税加重都是安史之乱的影响。",
			"date_added": 1489572499
		},
		{
			"post_id": 1489572945,
			"body": "历史谁忠谁奸，是后来人怎么评述你，而不是让后人评述你\n\n今天这篇是有感而发，现在某度里可以搜到的民国的很多汉奸，他们后代里有很多厉害角色，看到自己的父亲或者爷爷是卖国贼，就想把他们的劣迹清楚掉，最后也成功的洗白了，可我想说历史是由后人评说，是后来人，而不是自己的后人，后人可以在一定程度上翻案，但不能重新洗档，随便换档案啊！\n\n中国历史上英雄辈出，但是也有不少令人痛恨不已的奸佞。秦桧就是其中被世人视为汉奸或卖国贼，当中最为世人所知“十二金牌召岳飞”的故事，因其以“莫须有”的罪名处死岳飞而遗臭万年，但近来却有一些考古发现似乎在推翻这个说法，那么秦桧后人为什么认为秦桧是背锅呢？秦桧墓又在哪里呢？据说秦桧书法十分出色，有何证据呢？\n\n我的看法是秦桧没有骨气，丧权辱国，虽然为高宗背了黑锅，但秦桧对社稷对国家是没有贡献的，只为迎合君上而不为国谋事，这样的人只能说是奸臣，秦桧后人说秦桧是好人，只是背了黑锅，自己说自己祖宗是好人，谁信呢？\n\n在离牛首山不远的长江边，有座没有碑文的“秽墓”，这是南宋初年臭名昭着的奸相秦桧之墓。秦桧世居建康，并被宋高宗封为“建康郡王”，死后埋葬在南京西南郊和牧龙镇牧牛亭，当年墓上“丰碑屹立，不镌一字”，据说是因为无人为其撰碑文。明朝成化十一年（1485年），秦桧墓被盗发，盗墓者“获金银器具巨万”，被抓获后，当地官吏有意“减其罪，恶桧也”。　\n\n《续金陵琐事》（上卷）记载，明宪宗朱见深当皇帝时，江宁人盗掘秦桧墓事发，被抓后，却没有被严惩，被从轻处罚：“秦桧墓在江宁镇，岁久榛芜。成化乙巳秋八月，被盗所发，获货贝以巨万计。盗被执，而司法者末减其罪，恶桧也。有蔡西圃名昂，历事大理，亲阅囚牍，为作读以快之。”　　\n\n但是考古界2006年的最大发现，终于随着某拆迁开发工程而诞生。在建设过程中发掘的一宋代古墓，日前出土了包括秦桧亲笔遗嘱在内的一批重要文物。\n\n据未经证实的消息透露，有关文物部门已经初步确定该批文物中包括有秦桧亲笔书写的「政治遗嘱」，对其生前的行为作了一定的辩解，并对中国知识分子(士大夫)提出了尖锐的批评。据了解，国家文物局鉴定专家和各研究机构的着名宋史专家均已云集现场。\n\n自称秦氏后人的多名人士表示，将密切关注该文物的鉴定，如确定先祖罪名不实，根据疑罪从无和无罪推定的司法原则，将可能入禀法院要求取消岳飞庙中的秦氏夫妇跪像，如仍要设立跪像，则应「将跪像脑袋换为书本，代表食书不化、空言误国的腐儒们该为中国的落后而忏悔」。\n\n该份被专家初步认定为秦桧「政治遗嘱」的文物，书写在一块长达2.2米、宽约50公分的绸缎上，这也是其能保持至今的主要原因。\n\n出土该批文物的村庄位于本市郊区，早先名为麓洱，现名为壶侑，因风光优美，出产茶叶，宋代时一度是高官们的庄园。此次所发掘的宋墓，专家估计为秦氏子侄辈的墓穴，时间应在1178年(宋孝宗淳熙五年，为岳飞平反昭雪)后，秦氏此时逐渐失势，一些身前文物成为族人累赘和朝野忌讳，干脆采用殉葬方式掩藏。\n\n巧合的是，随本次墓葬发掘一起出土的地契资料表明，此地庄园基本为岳秦两家分领。两家比邻，这也是宋史研究的研究的新发现之一。\n\n据消息人士透露，初步鉴定秦桧该份遗嘱作于高宗绍兴十四年(1145年)，时年55岁(秦桧生于哲宗元祐五年，1090年)，即其死前(1155年)十年，岳飞含冤被杀(绍兴十一年腊月，1142年1月)后三年。\n\n秦桧在该份遗嘱中，首先告诫子孙远离政治，自己深知将「获谴汗青」，「蒙羞万年」，叮嘱子孙在他死后万莫贪恋禄位，急流勇退，也不可在后为他平反，「庶几可得苟全性命」，并对几个已身据高位的族人详细指示了退出政坛的方略。专家正是据此认定此书信为家族内的政治遗嘱。\n\n据已经详细阅读该份文物的一位匿名专家介绍，秦桧在该份遗嘱中表明自己坚信对金议和是当时的「国情」下保全家国的唯一出路，也曾经和岳飞直接探讨过此问题，但岳飞表示「要为不可为之事」。\n\n而宋高宗其实并不反对北伐作战，因为皇帝很陶醉这种救世主的感觉。但因为岳飞在规复旧河山之外，经常公开宣扬要「迎还二帝」，而金国也不断在战前派密使威胁高宗要「送还汝兄」，并不断暗示囚在五国城的宋钦宗与岳飞有秘密来往，令高宗疑窦丛生，甚至到了「寝食不思」地步。高宗12道金牌召回征途中的岳飞，就是因为金使送来了岳飞与钦宗联络的「确切证据」，钦宗甚至扬言返国复辟后将清洗「老九」(高宗为徽宗第九子)的人马，高宗因此需要和岳飞对证确认。\n\n据了解，秦桧在遗嘱中说，高宗与岳飞的晤谈一概秘密进行，他也不能与闻。但事后高宗告诉他，岳飞一再表态自己只想收复北方迎还二帝，私心最多就是成就功名，待成功后愿意效仿石守信等解甲归田。至于帝位归属，岳飞表示那是「皇家手足间事」，没有旗帜鲜明地表态。秦桧在遗嘱中对岳飞的战功给予很高评价，认为岳飞的善战为其议和提供相当大的便利空间，以打促谈效果很好。\n\n但岳飞有功名心，性格也比较孤僻，与人不好相处，容易招疑招忌，好多次甚至与皇帝言语不合而撂挑子走人，与皇帝结了深怨。岳飞不大考虑高宗本人的利益，不仅和被囚敌国的钦宗有谣传中的来往，还多次当面劝高宗立嗣。高宗本人因有隐疾(据后世医学推断是阳痿)而无子嗣，因此十分怀疑岳飞拥兵欲立拥立之功，犯了人臣的大忌，违背了祖宗传下的抑武扬文的宗旨，估计也是因此引发高宗杀机，不惜破除有宋以来不杀大臣的誓言。\n\n赵构杀了岳飞，秦桧只是当了替罪羊而已，秦桧不能说，也不敢说出实际；若说出实际情况，那等待他的将是和岳飞一样的命运，甚至秦氏家族覆亡。为了保存家族实力，秦桧不得不替赵构承担了千古骂名。后任皇帝为了保持自己法统的正确性，根本对此不予以确认，反而强化了秦桧是汉奸的意识，赐给岳家白铁铸造秦氏夫妇跪像，通过此种方式摆脱赵构的负面印象，并给民众以铁证的感觉。实际上这恰恰证明了当时皇帝的心虚与伪善。\n\n秦桧之所以甘愿背黑锅而不反驳，这是因为他不能也不敢向皇权挑战，所以只好背黑锅了。从秦氏后辈隐姓埋名并从不对此事做出解释来看，他们是做好了后退之路的。或许刚刚出土的文物可以证明这一点，谁都知道杀了岳飞会是什么结果，岳飞早晚有一天会被平反，秦桧也知道将留下骂名，但如果反驳并把责任推给赵构，那结局将是秦氏家族的覆灭。与其覆灭，不如甘愿背骂名。尤其值得一提的是，秦桧的后代里有一人坚持抗元，为南宋及汉族政权流尽了最后一滴血；而岳飞的儿子岳雷挂帅以后似乎乏善可陈，这些都是后话。\n\n尽管历史被翻出一角，但是骂名已经被钉死在了历史上，很难再去追究真相了。\n\n所以今天，我们暂且不论秦桧的为人忠奸，且看他的书法艺术成就。\n\n秦桧字体尚工，书写齐整工稳，擅长篆体。陶宗仪在金陵文庙的中栏上曾见过秦桧的书法“玉兔泉”三个字，称其字“颇有可观”。秦桧的书法存世有《偈语帖》、《深心帖》等，南宋曾宏父《凤墅帖》亦收录有秦桧的墨迹。\n?\n秦桧《偈语》用笔率意自然，松脱舒畅，结字顺势而就，不滞不板。秦桧《深心帖》书于宋绍兴十二年(1142)之末，书此帖前三月刚进太师魏国公。此帖笔意在米芾和蔡京之间，大概蔡六米四。帖末自谓“凝寒笔冻，殊不能工也”，道出了“书如其人”的古训。　　\n\n民间有传，秦桧是宋体字的创始人，在书法上很有造诣。他综合前人之长，自成一家，创立了一种用于印刷的字体。后来人们又模仿宋体字的结构、笔意，改成笔画粗细一致、秀丽狭长的印刷字，就是仿宋体。虽说民间多传秦桧发明了宋体字，但并无确凿的史料支持。陆锡兴研究认为，宋体字大约在正德、嘉靖年间才创作并流行起来，秦桧的字虽工，但与宋体字的产生并没有关系。　　\n\n其实不管秦桧在岳飞这件事上是忠是奸，他为官过年的为人处世已经在史书上留下了痕迹，所以评价一个人不能因为一件事来定论，秦桧的后人可以为他的冤屈翻案，但是也改变不了秦桧曾是做过的事，同样的秦桧即便是个奸佞之臣，也改变不了秦桧书法上的造诣之深。\n",
			"date_added": 1489572934
		},
		{
			"post_id": 1489814030,
			"body": "宋朝小贩幸福的日常生活\n\n尽管武大郎老婆偷人，导致家破人亡，但作为一个宋朝的卖炊饼(馒头)的小贩，武大郎过的是小康生活：租得起临街两层小楼，平时酒肉不愁。这样的生活不过是由武大每日挑两筐馒头沿街贩卖挣来的，他一没被收重税，二没有衙役踢摊子，日子过得平静悠然。如若不是登徒子西门庆，恐怕这一家人也能安乐祥和地把小日子过下去。\n\n　　在明代小说中，并非只有这一个宋代小贩形象。冯梦龙《醒世恒言》第三回《卖油郎独占花魁》同样讲到一位南宋临安城里的卖油小贩秦重，说他靠卖油竟能在一年多的时间里，把三两银子的本钱变成了十六两银子。\n\n　　或许有人说，这只是小说家言，不足为凭。但在宋代史料中，并不难找到现实的例子。南宋人洪迈的《夷坚志》中便讲述了一位小贩的发迹史：“吴十郎者，新安人，淳熙初，避荒，挈家渡江，居于舒州宿松县，初以织草履自给，渐至卖油，才数岁，资业顿起，殆且巨万。”一个小贩靠织草鞋和卖油，才几年时间，就家财巨万，暴富之迅速，令人瞠目。还不止一例，宋人笔记中，南宋初期临安著名的小贩宋五嫂、李婆婆等也是靠着经营饮食摊发家致富的。\n\n　　宋朝社会商业发达，在名画《清明上河图》中就有各种各样的摊贩，无论桥头、城墙边还是街道旁，剃头的、卖甘蔗的、卖菜的、叫卖各种小吃的，应有尽有。\n\n　　那么在宋朝，一个做小买卖沿街摆摊叫卖的小贩，如何能过起幸福的生活呢？\n\n　　宋朝城市管理相当人性化。\n\n　　想要买卖好做，首先不能总遭遇没事找事的城管，商人的正常经营必然离不开政府的人性化管理和支持。\n\n　　在唐代及以前，商人只能在规定的地点即设有围墙的坊市内从事交易活动。坊市闭门以后及开门之前，无故行走者将受到被打20鞭子的处罚。\n\n　　到了宋朝，由于商业活动增加，城市布局已打破了唐代坊市界限，城镇和乡村集市均可随处摆摊开店，营业时间不受限制。政府不但不予干涉，甚至明令保护。\n\n　　乾德三年，宋太祖就专门降旨：“令京城夜市至三鼓以来不得禁止。”由于朝廷的保护，城市小贩更加活跃，“大街买卖昼夜不绝”。\n\n　　宋朝的城市管理者同样会遭遇今天相同的问题：商贩侵街，影响市容交通。为此，宋朝政府设立了相当于现在城管的“街道司”。街道司虽然也有维持城市的卫生、整修与日常秩序的职责，但绝不会成天驱逐小商贩，闹得鸡犬不宁。\n\n　　虽然小贩侵街占道问题屡禁不止，但朝廷为顾及小贩的生计，一般不主张轻率粗暴地惩处小贩。如宋真宗天禧四年(公元1020年)，“开封府请撤民舍侵街者，上以劳扰不许”。为了解决这个问题，朝廷集思广益，绞尽脑汁，最后终于找到了解决的办法：在街道两旁适当距离，竖立“表木”，作为禁止侵街占道的红线。红线之内，允许设摊、开店，侵出红线之外就要受罚。\n\n　　《清明上河图》里的虹桥两头就立有四根“表木”，桥上两边，小商贩开设的摊位，都在“表木”的连线之内，中间留出通行的过道。这样，既照顾了商贩的生计，又不至于妨碍公共交通。\n\n　　更难得的是，宋代皇帝扩建皇宫和出巡都要顾及商贩的经营和市民生活。如雍熙三年(公元986年)，宋太宗想扩建宫城，担心影响东京(开封)市民生计，便派殿前指挥使刘延翰等人去了解民意。\n\n　　刘延翰等人当然不会搞什么听证会，也没有铺天盖地宣传这次民意调查的重大意义，但所得到的民意结果却是实实在在的。最后宋太宗“以居民多不欲徙”，打消了扩建计划。\n\n　　康定元年(公元1040年)，宋仁宗出巡。尽管当时街道狭窄，宋仁宗既未下旨拆迁，也没有诏令封路，而是命“侍从及百官属，下至厮役，皆杂行其道中”，“而士庶观者，率随扈从之人，夹道驰走，喧呼不禁”。宋仁宗这等亲民作风，也为他身后赢得了“仁”的谥号。\n\n　　宋代小贩利润率很高。\n\n　　想致富，首先要有高利润。在宋人的笔记中，有经营为“逐什一之利”、“逐什百之利”的记载，所以一般认为宋代商业的平均利润率为10%左右。\n\n　　但是，这只是平均利润率，很多商品的利润率远不止于此。让我们看看东京笼饼的价格轨迹。\n\n　　据《春渚纪闻》记载，宗泽在宋高宗建炎元年(公元1127年)出任东京留守时，让自己的厨师按照市面上的规格制作了一批笼饼，经过测算，得出每枚笼饼的成本为6文钱，而根据宗泽的回忆，他在宋哲宗元祐六年(公元1091年)初到东京时，每枚笼饼卖7文钱。\n\n　　初看元祐六年每枚笼饼利润仅1文钱，但事实并非如此。由于北宋后期开封粮价一路上涨，相隔38年后，建炎元年的粮食已是天价。\n\n　　根据史料记载，宋哲宗执政后期物价一直上涨，到宋徽宗继位后更是物价暴涨，不可收拾。\n\n　　《宋史·食货志》记载了东京在宋徽宗宣和四年(公元1122年)的米价为“石二千五至三千”。\n\n　　宗泽就任东京留守正值靖康之难后，金兵初退，东京物资奇缺，物价飞涨，尽管宗泽使用铁腕手段抑制物价，到建炎三年米价仍维持在每升四五千的水平，已是宣和四年的100多倍。\n\n　　因此，元祐六年的粮价应远低于建炎年间的水平。\n\n　　米价涨落是粮食价格乃至整个物价起伏的风向标。而粮食价格是决定笼饼成本的主要因素。结合物价上涨幅度，完全可以得出这样的结论，元祐六年一枚笼饼的成本可能不到建炎元年的一半，也就是说，成本不足3文钱，其毛利率超过了60%。\n\n　　这还不算利润最高的生意。南宋初期，社会上流行着这样一句谚语：“欲得官，杀人放火受招安；欲得富，赶著行在卖酒醋。”这里的“行在”就是临安(杭州)。由于开酒店最赚钱，因而临安酒店林立，时人有“青楼酒旗三百家”之说，其中不乏小贩经营的小酒店。即便以下层人民为主要顾客的所谓碗头店，利润率在50%以上也相当正常。\n\n　　利润率如此，而小贩由于本钱小，资本周转往往很快，一旦经营商品适销对路，当然能获得更高的利润。\n\n　　宋朝商税不威胁人民的生活。\n\n　　决定小贩收入的第一因素是利润，而政府的税收又对其利润产生着重要影响。\n\n　　宋代的商税有两种：对经过收税点的过往商贩收取的税称“过税”，税率2%；对店铺与城镇摊贩收取的税为“住税”，税率3%。另外，对于少数特定商品，政府要收取10%的实物作为抽税，但应税商品在抽税后不再征收过税和住税。表面上看，过税税率较低，但由于相同货物可以在不同关卡重复收税，因此实际过税往往高于住税。\n\n　　各项加起来，商税有时超过了商品价值的10%。学者程民生在《宋代地域经济》一书中对各地的商税做了统计，得出全国户均商税额为467文。\n\n　　不过，宋代发生重大灾害时，政府对商税的征收都要加以斟酌，视情况减免特定商品的税率，如宋宁宗嘉泰四年(公元1204年)3月4日，因临安府大火，烧毁房屋无数，急需竹木建房，朝廷下旨：凡官民与贩及收买竹木等免收税两个月。\n\n　　宋室南渡后，对于米谷、茶盐、柴炭等生活必需品，不分常时与非常时都免除商税。日本著名学者加藤繁认为：“在宋代的商税政策中，应该承认有着不使威胁人民生活的精神和重农主义。”\n\n　　像武大郎这样的小贩，不大会去经营那些抽税商品，并且由于本钱小，很少有能力承接长途贩运的业务，一般只在市镇内或相距不远的几个市镇。\n\n　　而《庆元条法事类》明确规定，不得无故在离城五里外向过往商人收税，违者杖责八十。所以，小贩所能承担的过税微乎其微，3%的住税和少量过税负担对他们的收入并不构成实质性影响。\n\n　　宋朝的商业政策，也影响到后世，明代的商税税率就极低，仅“三十而取一”，多收即属违令。\n\n　　到16世纪后期，很多地方更是停止征收商税，像浙江金华县这样商业繁荣的地方，万历六年(公元1578年)全县仅象征性地征收了不足白银7两的商税。\n\n　　在这样的政策氛围中，元明清时期的小贩仍然不乏成功的例子。明朝温纯写的一篇墓志铭中就描述了一位明代小贩一步一步发家成为大富豪的经历：“伯子事三原一良贾也……稍长，小贾邑市，已贾吴鬻布，有天幸，家日起，已贾淮扬，治盐策。”\n\n　　宋代政府通过立法保护商贩合法权益。\n\n　　贪官污吏作为个体多重收税的例子也有，但从整体情况看，宋代官府非常在意税对商人的负担，很注意避免“商人亏本，少人行贩”。宋代政府在某种程度上是商人经营的保护者。\n\n　　从宋太祖开始，就曾多次下令，“不得苛留行旅，赍装非有货币当算者，无得发搜索”。“又诏榜商税则例于务门，无得擅改更增损及创收。”\n\n　　朝廷规定：“诸税务监官买商税人物者徒一年，若为人买及托买者各杖一百。”同时，还对因税务监官购买商人物品致其亏损的行为按“致饶减税钱，各计所亏，准盗论”，从而避免了税务官员以权压人，侵夺商人利益。\n\n　　为了避免官府勒索商人，王安石变法在推行市易法时，朝廷又颁布《免行条贯》，规定免除各商行对官府的供应，各行按获利多少，分三等按月或季度交纳免行钱之后，官府所需物资不再向各商行摊派。\n\n　　这样，官员无法利用特权强索商人财物。而获利润多的商人多交免行钱，又限制和削弱了大商人勾结权贵垄断市场的意愿和能力，从而保护了中小商人的利益。\n\n　　随着宋朝政府保护商业活动和商贩利益的各项措施的实施，小贩的社会地位也得到了相应提高，他们开始有了做官的机会。\n\n　　《夷坚志》中就有这样的记载：“忠训郎王良佐，居临安观桥下。初为细民，负担贩油，后家道小康，启肆于门，称王五郎。”一位小贩竟靠着卖油使一家人过上了小康生活，还进入官场，位列三班。这在宋代以前是不可想象的。\n\n　　小贩经济和社会地位的提高也使一些自命清高的文人对他们刮目相看。大文豪苏轼就提出了“农末并重”的主张，不但如此，他还身体力行，专门为一位卖油馓子的老妇人写诗打起了广告。诗中说：“纤手搓来玉色均，碧油煎出嫩黄深。夜来春睡知轻重，压匾佳人缠臂金。”\n\n　　当然，宋代以降的小贩生活也并非全是阳光普照，由于他们中多数人是失地进城的农民，本钱微薄，在创业过程中难免会饱尝艰辛。《金瓶梅》里就描绘了武大郎在经商之初的惨淡经营。\n\n　　但是，至少在宋代，从政策面上，给了沿街串巷的小贩们宽松的商业环境。至于你做不做得成买卖，就要看个人的能力高低，运气造化了",
			"date_added": 1489814018
		},
		{
			"post_id": 1489906788,
			"body": "汉光武帝刘秀：我可以光复汉室天下\n\n刘秀，汉高祖刘邦九世孙。刘秀虽是刘邦直系后裔，但刘姓宗室此时已繁衍至十几万之众，他这一支被封在河南南阳的皇族早已没落，成员大都担任小宦、小吏，有些已经务农为生。刘秀早年丧父，家道中落，他和哥哥刘縯是被时任萧县令的叔叔刘良拉扯大的。\n\n　　史料记载，刘秀生得龙章凤姿，一表人才，除此之外似乎看不出他有任何异于常人的天赋异禀。他喜欢操持家务，有空还兼职帮人家牧牛补贴家用。刘秀性格温顺，做事不急不恼，缺乏凌厉之气，但言而有信，一副居家好男人的摸样。刘秀25岁时远赴长安跟先生学习《尚书》，他学业平平，只是“略通大义”，看来他并不是一位资质奇高、能举一反三的好学生。在长安求学期间，刘秀发出的最惊人的“豪言”是：“仕宦当作执金吾，娶妻当娶阴丽华！”执金吾是负责京师治安的中下级武官，阴丽华是河南新野城中著名美女。史载这姑娘生得花容月貌，被他爹阴太公视作待价而沽的奇货。一次，刘秀去新野办事，在街头偶遇阴丽华，立时惊为天人。无名无位、囊中羞涩的寒士刘秀自然觉得她高不可攀。做官能做个执金吾，娶老婆能娶阴丽华，年轻时的刘秀志向不过如此，最多是中人之才，毫无超拔流俗之资，更遑论心存高远的鸿鹄之志了。\n\n　　世事难料，日后刘秀果然娶到大美人阴丽华，抱得美人归，此是后话。刘秀的大哥刘縯则与他完全不同。史载刘縯性格刚毅、胸藏韬略、不喜务农，平时喜欢结交天下豪杰人物，为此甚至散尽家财。刘縯皇族意识浓烈，对新莽政权极度不满，志向远大的他即使身处逆境也时时不忘寻机建功立业，很有取天下的野心。刘縯经常自比刘邦，将弟弟刘秀比作刘邦那位只知埋头治理家业、整日蝇营狗苟的哥哥刘喜，嘲笑他胸无大志。面对哥哥的取笑揶揄，刘秀一笑置之。谁知最后取天下的是貌似才具平庸的刘秀，却不是才高八斗、胸藏百万甲兵的刘縯。造化弄人，于斯可见。 \n\n　　彼时新莽政权经绿林赤眉大起义的凌厉打击已摇摇欲坠，新朝军队主力已被击溃，王莽已无力控制地方。各地群雄并起，除农民起义军外，更不乏众多西汉、新莽旧贵族与拥兵自重的地方实力派人物，许多刘氏子孙也加入到起义队伍中来。刘縯刘秀眼瞅得时机成熟，也乘势而起，竖起反旗。地皇三年（公元22年），刘秀随兄长在南阳起事，庄稼汉洗脚上田，从此走上了一条波澜起伏的人生之路。\n\n　　刘氏兄弟虽贵为前汉皇族，但地位不高，势力更是谈不上，只好先栖居人下，加入了人多势大的下江、平陵起义军。心高气傲的刘縯果然是个帅才，集智、勇、力于一身，他屡立战功，很快从一群大老粗中脱颖而出。地皇四年（公元23年），刘秀兄弟所在的义军诸将拥立另一位西汉宗室刘玄为帝，建立更始政权，昏聩懦弱的刘玄被称为更始皇帝。其实这位置本该是由勇毅善谋、治军有方的刘縯来坐的，只因自由散漫惯了的农军将领们觉得他在军中威望甚高，且治军严明、不讲情面，怕他上位后自己受拘束、不自在，于是私下串联将平庸听话的刘玄抬上了皇位。智勇双全的刘縯被刘玄封大司马要职，刘秀也被封偏将军。此时，不显山不露水、低调内敛的刘秀被认为才具平平而且胆怯怕事，完全被哥哥刘縯的强大气场所笼罩。\n\n　　更始政权建立后，王莽大为惊恐，他调集新莽几乎所有的军队，集42万之众，对外号称百万，由司空王邑和司徒王寻亲自率领，几乎倾巢而出，准备一口吞掉刘玄更始军。新莽军第一个攻击目标就是刘秀驻守的昆阳。此时昆阳城守军不足万人，刘秀一面安抚惶恐不安的部下，鼓励众人坚守，一面率十三骑勇士连夜偷出南门去搬救兵，最后里应外合，一举破敌。昆阳一战，刘秀沉着冷静，以弱胜强，率几千兵卒大败王莽数十万虎贲之师。此战乃历史上以少胜多的经典战例，刘秀初试啼声，可谓一鸣惊人。刘秀一战成名，其威名不径而走，众人私下啧啧称奇道：“刘秀见小敌害怕，大敌当前却很勇敢，真乃大将之才！”昆阳一战，新莽政权精锐尽失，王莽的丧钟已被敲响。刘秀威名从此广为人知，人们对这位沉默寡言、温文尔雅、虚怀若谷的青年将领开始刮目相看并心悦诚服。 \n\n　　事后，刘秀从不自夸昆阳之战所立大功，甚至连提都不提，军中众人从惊讶到敬服。刘秀的威望一日高似一日，更始军中“刘氏双雄”谁人不知，哪个不晓。此后，已进入新莽末期，新朝最后时局的动乱已由烽烟四起变成群雄割据的相持阶段。\n\n　　昆阳大捷后，刘氏兄弟威震四方，声名远扬，却遭到更始政权内部一些庸碌之辈的嫉恨。不久战功卓著且位高权重的刘縯被经不起部将撺掇的刘玄所杀。刘秀悲痛欲绝，无奈时机未到，被迫韬光养晦。他愈加小心翼翼，绝不授人以柄，蛰伏舔伤以静待转机。史料记载，刘秀在刘縯遇害后，不为哥哥服丧，饮食言谈与平时无异，表现得若无其事。刘秀的淡定反而让刘玄有些愧疚，心怀鬼胎的他封刘秀为武信候，官拜破虏大将军以示安慰。史上深谙韬晦自保的人不少，但能做到刘秀这样的怕是不多。刘秀在人前装得浑然无事，人后却哭的枕头都湿了。刘秀此举好比晚清曾国藩所说“打落牙齿和血吞”。看来，世人看待成功人士，大都“只见人前显贵，哪知人后受罪”。自古欲成大事的人都忒不容易啊！\n\n　　更始元年（23年）破虏将军刘秀奉刘玄之命去扫平北方群雄。刘秀此时虽身份地位很高，但仍被刘玄等人猜忌，他持节北渡时身边仅仅带着几千疲弱士兵。此时占据河北的王朗，称霸西北的窦融、隗嚣，割据巴蜀的公孙述等军阀都拥兵数万。这些割据势力兵强马壮、虎视眈眈，而铜马、绿林、赤眉、新市等农民军更是声势浩大，各拥众数十万，兵锋所指，气焰熏天，哪个又是好惹的？刘秀一行此去，端的是以卵击石，羊入虎口，凶多吉少。\n\n　　任何事物都是相对的，没有绝对的好坏。刘秀北上貌似有去无回，但也避开了更始政权内部日益激烈的权斗，离开了斗争激烈的漩涡，有了自由施展才干的良机，为日后徐图壮大积累了基础。面对远强于自己的对手，刘秀并不气馁，他重用并提拔了一批有勇有谋的少壮军人，比如邓禹、吴汉、耿弇、寇恂，还有那位被军士们尊称为“大树将军”的冯异。他倚重他们，信任他们，不久就有了一支完全忠实于他、敢打硬仗的精悍勇锐之师。经过一系列艰苦卓绝的征战，刘秀击败了实力雄厚的河北军阀王朗，平定河北，有了喘息之地。平王朗期间的惊心动魄、跌宕起伏、起死回生难于言表，刘秀更是数次被王朗部骑兵追杀，差点丧命。“王莽（朗？）撵刘秀”的民间传说故事似乎就发生在这段时间内。更始三年（公元25年）六月，在河北站稳脚跟的刘秀在手下将领的拥戴下，于鄗城以南千秋亭宣告称皇帝位。国号沿用汉，史称东汉，又叫后汉。改元建武，亦称光武。刘秀是为彪炳青史的光武帝。随后，刘秀采取各个击破的策略，软硬兼施，又打又拉，击败并收编了铜马、高湖、新市等农民军，实力大增，手下兵多将广，令人不敢小视。 \n\n　　建武元年十月，刘秀下令迁都洛阳。随后开展了一系列东征西讨，目的是削平四方，击灭拥兵自重的各股割据势力。他采取先强后弱的策略，首先击溃盘踞在长安附近的三十余万赤眉军，尽收其众。然后用四年时间平定关东。在关东他获得了西汉旧贵族残余势力的鼎力支持并一路所向披靡。随后，刘秀恩威并施迫降陕甘土豪武装窦融、隗嚣。最后大军挥师入蜀，擒杀独霸四川的军阀公孙述，重新统一中国，此时为建武十二年（公元36年）。\n\n　　看似柔弱不堪、才能并不出众的刘秀干出了一件惊天大事，把不可能变为事实，靠的是宽、仁、忍、勇、谋。刘秀貌似胸无大志，浑浑噩噩，实则内里暗藏机锋，明里收敛锋芒，积聚实力，待机徐图大业。青年时代的刘秀虽无宏图大志，似也无天纵之才，但却有做大事必须具备的素质：他待人宽厚，律己甚严，深藏不露，这为他日后实现“光武中兴”打下了深厚的基础。史载刘秀从不恣意放纵，不喜奢侈，谦恭下士，能忍人所不能忍，不论失意还是得志都是如此。做人行事，他常显露出一种恢宏大度，平实谦和的气度。正是如此，才能在平凡处见奇巧，细微处见广博，实乃大智若愚的典范。史料对刘秀大加赞美，说他“效法明君，律己责人，从不自辩、自夸，率先垂范，以身作则”。在平定四方的多年征战中，他注重安抚，不事屠戮，因此深得人心。刘秀尊重知识分子，重用范升、陈元、杜林等一批著名学者。一时间，麾下谋臣如云，将士如雨，如此众多的文武贤才投奔他、拥戴他，何愁大事不成！\n\n　　刘秀作为东汉王朝的缔造者，结束了王莽篡汉后的乱局，恢复刘汉社稷江山，以“柔道”治国，善待功臣，轻徭薄赋，与民生息，实现了“光武中兴”。在那个遍地兵燹、人心思安的时代，无疑是符合历史潮流与人民意愿的。由于刘秀的“光武中兴”，大汉国运又延续了195年，以426年的寿龄创造了中国封建王朝存在时间的最高纪录。劲气内敛、低调沉稳、喜怒不形于色、起初并不起眼的刘秀能于新莽末期群雄逐鹿的乱局中笑到最后，完成了历史赋予他的使命，成为一代明君和史上颇具影响力的不凡人物，看似偶然，实则必然。光武帝刘秀其人其事，值得后人深思。\n\n　　一代光武帝已经远去，但是他的事迹依然让人回味不穷，读史明心，如今的我们只要从他的身上学到一些东西，又何愁愿望不成呢？\n",
			"date_added": 1489906775
		},
		{
			"post_id": 1490010088,
			"body": "梅毒战争\n\n   1495年，法兰西国王查理八世大军开进，终于占领了梦寐以求的那不勒斯王国。这个伸入地中海心脏的王国长期以来都是阿拉伯世界与基督教世界的贸易窗口，半个多世纪以来又通过与伊比利亚半岛的商业日渐富庶，成为了意大利文艺复兴的中心之一，当然炙手可热。而6年前刚刚成立的新兴帝国西班牙也对这片进入大陆的门户要地垂青已久，于是一连串激烈的外交和军事争夺拉开了序幕——然而，我们的故事却发生在这场争夺的幕后。\n\n      爆发与蔓延\n\n一份1495年前后的欧洲地图截取，西班牙王国（图上表示为黄色）已经将撒丁岛和西西里纳入囊中；意大利南部的那不勒斯王国（Naples，淡橙色），是西班牙势力东进的下一个目标。\n      得胜的法国人刚刚回国，部队中就爆发了一场前所未见的恐怖瘟疫，患者身体表面从头到膝突发凶险的脓包，不久崩破溃烂，脸上的肉片片剥落，几个月之内就会死亡，景象惨不忍睹。这种恶症并没有在法国驻足多久，很快就传遍了欧洲，并跨越地中海向东方传播开去，只用了3年，它就传到了恒河的入海口，印度港市加尔各答；大约1505年，亦即大明弘治十八年，又借道东南亚从岭南进入中国，到1520年，整个欧亚大陆连同周围岛屿凡有人处无一幸免。从各种称呼就能看出来这种病的传播路线：法国人叫它“那不勒斯病”，德国人和波兰人叫它“法国病”，俄罗斯人叫它“波兰病”，土耳其人和阿拉伯人叫它“基督徒病”，印度人叫他“葡萄牙病”，中国人叫他“广东疮”，日本人叫他“中国疮”——而到了1530年，它获得了今天通用的拉丁语名字“Syphilis”，汉语则最终以病状叫它“梅毒”。\n\n      相互栽赃般的混乱的称呼除了标记梅毒的传播路径，也暗示着人们并不知道这种恐怖的怪病究竟源自哪里——历史上人们对梅毒的起源也做过许多猜测，其中受支持最多的假说有两种，一种是欧洲本土的疾病在当时发生了新的变化，成为了梅毒；另一种是世界其它的角落的疾病传到了那不勒斯这个地中海商业中心，在新环境下发生了爆发。直到2011年，人类体质学和流行病学家比对诸多考古遗骸后，才将我们需要的答案指向了后者：就是当年那个新成立的西班牙从美洲大陆引进了这位瘟神。\n\n19世纪美国历史画家埃玛纽埃尔·洛伊茨1843年所绘《哥伦布陈情女王》，画面中央是哥伦布，宝座上扶额的是女王——刚刚打完仗，女王觉得这个要赞助的家伙很让人头疼。\n      事情还得从初次爆发的3年前，也就是1492年讲起。这年1月，西班牙王国攻陷了摩尔人的最后一座王城格拉纳达，终于从异教徒手中彻底夺回了伊比利亚半岛，完成了“收复失地运动”的800年大业。同年夏天，那个名叫克里斯托弗·哥伦布的船长终于说服了两位国王（当时的西班牙刚刚通过政治联姻合并而成，王后伊莎贝拉同时是半壁江山的女王），在8月份杨帆远航，在茫茫大海上向着西方驶去，两个月后在加勒比海上的一个岛屿，今天的巴哈马登陆。\n\n      哥伦布发现这些将他从溺死的危机中捞上来的黄皮肤原住民意外的温顺，于是开始了他的宏图大业：哥伦布从西班牙搬来部队和武器，通过剁手、挖心、掏肠、喂狗等手段，大笔地从原住民手中掠夺黄金和年幼的性奴——当然也有馈赠，比如天花患者用过的毯子或者流感患者用过的杯子，虽然每年都有6万到10万原住民因此死亡，哥伦布却最终因此彪炳青史，功盖千秋。\n\n      与黄金和性奴同时，哥伦布和他的部队还带回了一样东西，就是梅毒——虽然梅毒此前在南美的原生状态我们仍然不得知晓，但之后的事情却水落石出了：西班牙部队染上梅毒以后并不消停，他们四处游逛；就像开始的地图标识的那样，当时的西西里岛已经被西班牙控制，而西西里和那不勒斯向来交好，这种性病随即传到了那不勒斯的妓女身上；而当法国军人攻破那不勒斯开始享用俘虏来的妓女时，这种病也就赠送给了法国人。另外，西班牙雇佣军也出现在法国部队里回到了法国，也有不少功劳。\n\n      总之，人类之间的祸福输赢，对于瘟疫来说都是扬名立万的大好时机。\n\n      1495年在那不勒斯的爆发是梅毒的最早文献记录，那是一种病状猛烈且快速致死的瘟疫，这让刚刚从黑死病的狂飙收割中缓过劲来的欧洲人恐慌不已。\n\n《身患法国病的人》从形式上来看，这是一幅典型的占星术绘画——头顶是黄道十二宫的天球，1484是行星位置，并非创作年代；天蝎座上有一颗亮星，表示这种疾病是星座不利；患者是德国长枪雇佣兵的打扮，当时的梅毒尚在军中流行，病人的症状也恰是梅毒刚出现时的烈性症状，从头到脚生满脓包；另外两面文章标明了发生的地点，德国（当时还是神圣罗马帝国）纽伦堡——仅仅过去一年，这种疾病就已经扩散到了中欧，可见其传染性之高，也从侧面反映了军队内部混乱的性行为。神圣罗马帝国皇帝马克西米立安一世在1495年感慨，这种前所未有的疾病一定是上帝对渎神行为的天谴。\n\n      然而就像贾德·戴蒙在《枪炮、病菌与钢铁》里描述的那样，国境不能阻挡瘟疫，疾病也不能逃过进化。只经过了半个世纪的流传，到1546年，梅毒就演变出了一种阴险毒辣缓缓发作的三期发病，到如今与结核、麻风并尊世界三大慢性传染病：\n\n      初次性接触感染后的3天到3个月是一期梅毒，接触部位出现底部坚硬、边缘清晰，不痛不痒但愈合缓慢的大溃疡，称为“硬下疳”，经过一段时间后会自愈；\n\n      再经过4到10个星期发展为二期梅毒，症状多样，但通常是会在躯干和四肢出现对称而不瘙痒的粉红色皮疹，随后演变成斑丘疹乃至溃疡，其中有一类独有的斑疹，中央愈合而周围扩散，形成片片梅花状，故中文称“梅毒”，而口腔和咽喉黏膜上也会形成泛白的疣状病灶，接触传染性极强。患者还会伴随发烧、喉咙痛、虚弱、消瘦、脱发及头痛等全身症状——全部症状会在两个月之内消失，然后进入3到15年，最长可代46年的漫长潜伏期。\n\n      潜伏期过后就是毁灭性的三期梅毒，有三种类型：梅毒瘤性梅毒患者全身的皮肤和脏器都会出现大小不一的树胶样肿瘤，骨骼也会受到侵染变得像朽木一样疏松多孔，以至于严重毁容形如丧尸，患者往往失去鼻子；神经性梅毒患者出现梅毒性脑膜炎，癫痫、瘫痪、痴呆接踵而至；心血管梅毒则会侵染主动脉，造成主动脉炎、动脉瘤、动脉瓣关闭不全，直至心力衰竭而死亡。\n\n对于流行病学和更普遍的生物进化来说，这样的性状变化对传染病非常有利：迅速致命的传染病会在短时间内损失大量宿主，失去了传播的机会，到头来鱼死网破同归于尽；而潜伏期长或者症状温和的传染病才有足够的时间和机会传播给下一个宿主，做到阴魂不散生生不息——“数罟不入洿池”的可持续发展道路正是古往今来那些成功流行不绝如缕的传染病无不遵守的规则。而梅毒更胜一筹的是，那些在病程中多次出现的皮肤溃疡和粘膜扁平疣都没有痛感，这在保证宿主存活的基础上又不影响宿主继续发生性接触，大幅提高了传染率。\n\n      值得一提的是，梅毒的性传播身份让它在发病缓慢之外获得了另外的庇护，即人们除了性交大都不愿暴露患病部位，甚至羞于启齿，这让疾病更加隐蔽；而淫乱与性病这一对组合还在17世纪引发了这样一种观点：得梅毒的人都是活该遭报应，根本就不该给他们治疗，16世纪和17世纪之交这种观点尤其流行——就像前面提到的神圣罗马帝国皇帝马克西米立安一世的观点那样。这些人类行为事实上增强了梅毒对社会生活的适应，以至于到18世纪，梅毒是如此泛滥，任何症状都会被怀疑是梅毒——包括孩子生病\n\n      梅毒既然走上了持久战的道路，它对人类社会的渗透也就日益深刻，起初只是在部队和周围的妓院中流传，但在那个缺乏疾病控制的中世纪晚期社会里，这种传染性很强的性病很快蔓延到了整个社会。然而直到1520年之后，随着梅毒症状从急性传染病向着慢性传染病演化，人们才意识到这是一种性传播疾病——这仿佛是对文艺复兴以来反禁欲主义的一次讽刺，人们重新在性的问题上变得保守。比如那个疯狂娶妻又疯狂杀死自己老婆的英国国王亨利八世就曾试图关闭妓院阻挡它的蔓延，结果很更加讽刺的是，亨利八世死前的种种症状就像极了一个梅毒患者，虽然也有历史学家争辩说那是糖尿病和脑外伤。\n\n      和亨利八世命运类似的帝王将相还有很多，比如16世纪后半叶的俄罗斯帝国首任沙皇，伊凡雷帝，他的老婆损耗率甚至更大，8个老婆3个出家5个死于非命，往往都是婚后不久便被他玩死——这种不受控制的反复癫狂就被认为是梅毒侵犯中枢的表现之一。1580年，他连自己的长子也一杖打死，4年后自己也中风丧命，俄罗斯帝国刚刚成立就陷入了权力真空。\n\n      另外，满清第八个皇帝同治帝死时年仅19岁，正史记载是出天花走马牙疳而死，然而民间纷纭传言他是私自出宫逛八大胡同身染梅毒。\n\n早期的治疗尝试\n梅毒若不经治疗，死亡率可达58%，在艾滋病出现以前一直是最可怕最难缠的性传播疾病。随着该病日渐流行，找到有效的治疗手段也迫在眉睫，没想到这一找就是400多年。 在梅毒最早出现的时候，一个名叫弗朗西斯科·德里加多（Francisco Delicado）的西班牙神父兼梅毒患者宣称的梅毒可以被俞创木分泌的树胶治愈，包括蒺藜目蒺藜科俞创木属6个物种，尤其是其中的药用俞创木（Guaiacum officinale）——而这些美丽的植物恰恰分布在哥伦布当年抵达南美时踏上的土地，巴哈马等中美洲的热带丛林中。神圣愈创木如今还是巴哈马的国花。\n\n虽然很多欧洲人都期盼得到俞创木治好梅毒，然而俞创木生长缓慢且效果并不出众——欧洲人并未找到更好的草药治疗，中国的《本草纲目》虽然记载了梅毒流行情况，同样也没能找到治疗方案。但中国人和欧洲人不约而同地将目光投向了一种炼金术的常用药物：水银和砒霜。他们配合高温蒸汽浴，用水银清洗梅毒患者溃烂的伤口，并且取一定量的水银制剂让患者口服——效果真的有，病痛确实得到了缓解，然而这无非是引虎驱狼，即便没有死在梅毒上，也要死在水银对神经系统的毒害上，到头来唯一落实的好处就是生前千疮百孔的肉体在死后不易腐烂，因为水银有很强的防腐效用。19世纪人们发现碘化钾也有不错的治疗效果，然而副作用并不比水银少多少，碘中毒同样能毁掉全身代谢。\n另外，除了缓解病痛，梅毒造成的大面积毁容也不可小觑。多数梅毒患者经过数年的潜伏期后，终将发展为梅毒瘤性梅毒，如前所述，这意味着头面部也会出现许多大小不一的树。\n\n而到了1928年，弗莱明发现了青霉素，它不但在治疗外伤感染方面有奇效，而且对梅毒也有一击必杀的强大威力。1943年，人们发现早期梅毒只要用青霉素肌肉注射几针就好，晚期梅毒，哪怕是神经梅毒，也只需静脉输液就能治愈；而除了过敏患者以外，青霉素几乎没什么毒副作用。而且不仅梅毒，许许多多细菌造成的顽疾，也被青霉素一招毙命，人类医学史翻开了崭新的篇章。\n\n美国战后的梅毒治疗招贴画《像创世一样古老的梅毒现在可以治疗了！》 待到二战结束，人类的硝烟散去，高产青霉菌菌株选育成功了，原本昂贵的青霉素价格\n\n直线下降，人类第一次开始了对梅毒的大清剿。凡是有能力生产青霉素，或者医疗机构能够提供青霉素的国家，梅毒发病率飞流直下。虽然因为性解放运动，梅毒有过反弹，但是人类的现代医学水平依旧保护着数不清的披头士和文青。\n卷土重来\n然而就像任何一场战争一样，神经鞘一松懈，垂死的敌人就会反扑。就在人们踌躇满志以为梅毒再也不是困扰的时候，它却悄悄开始重新聚拢在每个人的周围。\n前面反复提到过，梅毒这种性传播疾病能给患者外观造成非常明显的变化，给人打下“报应”的烙印。文艺复兴以后几百年来，就是在这样的阴霾下，人们始终不敢放纵自己的性欲，在性行为上延续着保守的态度。 所以当梅毒的治疗变得简单高效，到了上世纪60年代与80年代之间，终于从美国掀起一场声势浩大的性解放运动，并向世界各地发展开来——虽然避孕药、女权运动乃至反战主义都是这场运动更加明显的原因，例如“Make Love, Not War”这样明显反战的运动口号，但是如果不是根治梅毒消除了人们的“后顾之忧”，这场运动绝对不可能如此深远，乃至促成了后来的同性恋解放运动甚至青少年性解放运动。\n\n与此同时，是中国大陆轰轰烈烈的改革开放进程，到90年代末，从沿海到内陆都在对外接触中都获得了新的财富、新的观念——还有新的病源。其中尤其是珠江流域，地下卖淫业日渐发达，梅毒在性工作者中的感染率不断上升，广东的珠江流域再次成为了梅毒重灾区。 而就全国来看，在1993年到1999年间，梅毒感染率年均增长85%。中国疾病预防控制信息系统数据表明，2009年全国共报告梅毒327433例，较2008年增长了17.09%，居全国乙类法定传染病发病数的第三位。在报告系统比较完善的上海，梅毒已成为最经常被报告的传染病。\n但梅毒本身还不是最可怕的，如前面说过，在艾滋病出现以前，梅毒一直是最可怕最难对付的性传播疾病，而艾滋病的爆发恰恰与梅毒可治愈之后的性解放运动密不可分，这种1981年问世的顽疾几乎与梅毒无缝衔接，人类过去畏惧梅毒时的心里阴影如今全权转交给了艾滋病，而二者更在传播与感染上达成了互利互助——梅毒患者早期出现的溃疡和粘膜破损让艾滋病的感染率提高2到5倍，二者协同感染的情形因此非常多见，在个别城市中心甚至达到30%-60%，男男同性传播也成为了二者协同感染的重要方式。\n\n经过以梅毒为首的老一辈性传播疾病大力栽培，艾滋病重新让人类恢复了对性的禁忌，性解放运动到21世纪初就因此饱受批判，而逐渐淡出了主流。\n而在我们为艾滋病协同感染担忧的同时，在医疗条件欠缺的不发达国家和地区，梅毒仍然是大规模流行的传染病。梅毒当前仍有每年过千万的新增感染病例，其中有超过90% 的案例发生在发展中国家，其中包括70万到160万名孕妇，造成自然流产、死胎及先天性梅毒。在撒哈拉沙漠以南非洲地区，梅毒造成约20%的围产期死亡。\n",
			"date_added": 1490010074
		},
		{
			"post_id": 1490010170,
			"body": "宋真宗拉动内需反腐倡廉促经济\n\n一千年前，繁华似锦\n\n　　北宋真宗大中祥符二年三月，西域于阗国王遣回鹘罗斯温等来宋朝贡。罗斯温跪奏曰:“臣万里来朝，获见天日，愿圣人万岁。”（《宋史》）宋真宗问询路上情况，罗厮温说:“涉道一年，昼行暮息，不知里数。昔时道路尝有剽掠，今……行旅如流。愿遣使安抚远俗。”罗厮温称于阗到敦煌的道路通畅，行旅如流。此次于阗使节带来的贡品有玉石、乳香、琥珀、棉织物、琉璃、胡锦等；于阗使团间有商队，从内地带去了丝织物、金银器、茶叶等物品。\n　　\n　　这一年是公元1009年，距今整整一千年。千年梦回，北宋繁华似锦。而这一“锦”象在这年的九月体现得尤为明显:“（西夏）夏州进奉外，有以私物贸易久而不售者，自今官为收市。”这就是说，西夏使节所带之物，如果卖不出去，宋朝官府就全部包买下来，充分照顾朝贡者的利益。北宋政府财大气粗可见一斑。\n　　\n　　这一年，北宋基本上是风调雨顺，没有大的自然灾害。唯有一次汴水涨溢出岸，浸没了从京师到郑州的道路。宋廷诏选善于治水的使臣迅速控制了水势，一时受阻的漕运也得以恢复通航。\n　　\n　　这一年，客居泉州的阿拉伯穆斯林出资，仿照叙利亚大马士革伊斯兰教礼拜堂的建筑形式建造了泉州清净寺，占地2500平方米，是我国现存最早的一处伊斯兰教寺。\n　　\n　　这一年，河南虞城富人曹诚在商丘建学舍150间，聚书1500余卷，“博延众生，讲习甚盛”，宋真宗赐名“应天府书院”，为中国四大书院之一。\n　　\n　　这一年，宋真宗追封孔子弟子颜回等十人公爵，曾参等62人侯爵，封先儒左丘明等19人伯爵。\n　　\n　　这一年，正处于历史上少有的盛世“咸平之治”时期，北宋悠闲地走在封建主义的小康大道上，经济复苏，国力猛增，制度清明，人文鼎盛，人口数量亦成倍增长！\n　　\n　　有宋一代，素以富足、安康著称，却只这样一个“盛世”排名，而且是在开国不到40年、国家千疮百孔，每年不停地与党项、契丹作战，甚至还有四川叛乱的情况下开创的，那么，如何揭开这一辉煌的谜底呢？\n　　\n　　大中祥符（1008—1016）是宋真宗的第三个年号，北宋使用这个年号共九年。大中祥符二年，繁华似锦，可是所有这一切，在五年之前并不明朗，那时的热门话题是:战争与和平。\n\n和谐就是生产力\n　　\n　　法国思想家伏尔泰说，中国是举世最优美、最古老、最广大、人口最多、治理最好的国家。而北宋，却是中国历史上的一个“小国”。\n　　\n　　公元1009年，在中国大地上除了北宋之外，还有辽、夏，云南的大理国，青藏为吐蕃诸部及黄头回纥，西域为西州回鹘及于阗国（此时已皈依伊斯兰教，属于哈拉汗朝）。\n　　\n　　辽之北则为斡朗改和辖戛斯等多个政权并立。而五年前，北宋的周边形势要严峻得多，尤其是宋辽关系。\n　　\n　　1004年闰九月，辽萧太后与辽圣宗率大军侵入宋境，十一月，进抵澶州（今河南濮阳）。\n　　\n　　此前，辽曾提出和约，宋真宗选择了战争。在同平章事寇准等人的坚持下，宋真宗亲至澶州督战，登临北城门楼，“诸军皆呼万岁，声闻数十里，气势百倍”。\n　　\n　　辽军一面屯兵澶州城下，与真宗所统宋军主力对峙，一面展开和谈。\n　　\n　　和平还是战争？宋真宗选择了和平:十二月，宋辽讲和，双方约为兄弟之国，承认边界现实，宋每年给予辽银10万两，绢20万匹。这就是历史上的“澶渊之盟”。\n　　\n　　关于“澶渊之盟”，历来颇多非议，否定者认为这是胜算下的城下之盟。殊不知，虽然辽军腹背受敌，但已击败宋军第一线主力，长驱直入，折损大量宋军；同时宋人也因争战多年却无法击败辽军取得最后的胜利而倾向议和。\n　　\n　　民意如此，人心向背啊。宋真宗要的是和谐—友邦的和谐，民众的和谐。于是，宋辽签盟，从此交好达百年之久。\n　　\n　　何况，虽然“澶渊之盟”后宋朝纳岁币换取了和平，可并非像某些教科书所言“大大加重了北宋人民的负担，加剧了北宋的财政危机”那么简单:从公元979年，真宗之父赵光义北征开始，宋辽之战已经打了25年了，其间北宋损兵折将，人民生灵涂炭，难道还应继续吗？这种生死相搏，要最终博弈到何时，且宋朝彻底胜算又有几何？\n　　\n　　每年扔出去30万两白银，谁都心痛，可是否了解当时宋朝在北方战线上应付一场战争，需要投入怎样的国力物资？\n　　\n　　3000万两白银！这还仅仅是中等级别的战争。\n　　\n　　当时宋年收入一亿，而一场中等规模的战事所耗费的军费就高达3000万，这是多么恐怖的数字。即位近七年来，宋真宗一共应付了多少场超级战争？相比之下，这30万两岁贡的确是九牛之一毛！但年30万岁贡对于经济拮据的契丹来讲，无疑是天上掉的大馅饼。\n\n　　于是，契丹上下因此而与宋朝百年交好，契丹铁骑不再南下。此中利弊，勿庸赘言。\n　　\n　　到此，如果说后人对“澶渊之盟”还有不满意的地方，那就是它使北宋失去了中原帝国的威仪，番邦外夷竟未臣服！其实“辽宋为兄弟之国，辽圣宗年幼，称宋真宗为兄，后世仍以世以齿论”不是很好吗，何必非要自居“父皇帝”？兄弟和谐相处，于神宗而言，其结果就是:和谐就是生产力。\n　　\n　　宋朝的国家财政收入，和约之后得以增加，在宋真宗病逝前一年，即公元1021年，其总额已达15000万。可以说，没有五年前的和约，就没有1009年的繁华似锦。\n　　\n　　繁华似锦，尚需锦上添花，而能锦上添花的，是宋神宗那支廉政的大手笔。\n　　\n　　公元1009年十一月，大手笔宋真宗作了一篇文章。\n　　\n　　众所周知，真宗是位诗人，脍炙人口的“书中自有黄金屋”“书中自有颜如玉”就是出自他的名篇《励学篇》。不过这次却非他的即兴之作，而是告诫百官的《文武七条》:一是清心。平心待物，不为自己的喜怒爱憎而左右政事；二是奉公。公平正直，自身廉洁；三是修德。以德服人，而不是以势压人；四是务实。不要贪图虚名；五是明察。勤于体察民情，不要苛税和刑罚不公正；六是勤课。勤于政事和农桑之务；七是革弊。革除各种弊端。\n　　\n真宗所立七条，均是廉政之举\n　　\n　　有宋一朝，经济发达，尤善商贾，尽管赵宋的面积、人口、资源都比前朝李唐差得多，但是，宋朝的经济，在像1009年这般风调雨顺的好年景时，岁入是唐朝的七倍；即便灾害频仍，岁入也是大唐的三倍左右。\n　　\n　　经济繁荣，边贸红火，贡赋通达，税收富足，官员接触钱财的机会也由此多了起来。然而北宋时期官员赃罪（贪污）的现象却减少了，尤其与相距较近的唐朝、明朝相比，更是稀少。借宋人朱熹《观书有感》一问:问渠哪得“清”如许呢？\n　　\n　　为有源头活水来！我想真宗所提之“清心”“修德”就是廉政的源头，有这样的活水注入，何愁为官不清呢？\n　　\n　　“清心”“修德”是真宗倡廉的根本，其实宋代的倡廉措施中也是“德治”在先:\n　　\n　　宋代官员有试用期，试用官员转正要有若干名正式官员保举，按规定，官员不得保举曾犯有贪污罪的官员转正。宋朝允许在职官员参加科举考试，考中者可提前转正或越级提拔，但曾犯有贪污罪者不许参加科举考试。又规定，凡重要职务和接触钱财的职务，一律不允许曾犯贪污罪者担任。宋朝官员通常定期定级，但曾犯贪污罪的官员升迁则举步维艰。\n\n　　一个官员犯贪污罪，其上司、曾荐举过他的官员都要受到处罚。这使得上司很注意防范下属犯贪污罪，荐举者很关心被荐举者的德行，这就使官员贪污受到牵制。\n　　\n　　宋代吏部设有官员档案，凡犯贪污罪者都记录在案。宋代还规定，这些犯罪者，每次晋级或调动职务时，都要向吏部主动申报自己曾犯过贪污罪，并规定，此类官员不得随意更改姓名。\n　　\n　　“德治”就是以道德教育，启迪官吏的道德良知，使之不去越轨，但它必须与“法治”相结合:以法律约束，令其奉公守法，不敢贪污。为达到《文武七条》之“奉公”（廉洁奉公）宗旨，神宗倡廉工作的一大重点是加强监察官员自身的廉政建设。\n　　\n　　宋朝对具有纪委职责的监察官员有着严格的规定，甚至监察官违反出巡制度都要遭受处罚。还特别规定了监察官失察、自身贪暴受惩处的制度。1009年九月，真宗“诏诸路官吏蠹政害民，转运使、提点刑狱官不举察者坐之”。\n　　\n　　对于失察的监察官，真宗实行严厉的处罚。王曙为河北转运使，“坐部吏受赇，降知寿州”；张观任解州通判，因“盐池吏以赃败，坐失举劾”，被降监河中府税；河北路走马承受使臣悉代之，“坐不察边肃贪纵故也”。\n　　\n　　因为这些廉政举措，1009年的北宋，可谓政治清明，这更加速了宋王朝物质文明与精神文明的双丰收，一个被《清明上河图》千秋歌颂的时代正拉开序幕将北宋王朝推向中国封建社会的巅峰，等待着百年后张择端的那支画笔。\n　　\n一朵幸福的小浪花\n　　\n　　从1009年到《清明上河图》问世，百年光景弹指一挥间，在历史的长河里算不了什么；而这年正月发生的一件小事，也只是历史长河中微不足道的一朵小浪花，但它却带来了无限的幸福和快乐。\n　　\n　　像往年一样，1009年的正月初三，民间热热闹闹地过着春节；而在宫廷里，却又多了一份喜庆:今天是第一个天庆节，休假五日，不扫地、不乞火，不汲水，与岁朝相同。这一天建醮集会，真宗赐宴并馈送朝臣节物。\n　　\n　　此前一年，即大中祥符元年的正月初三，文武大臣们被宋真宗紧急召集到皇宫。原来，这位皇帝一个多月前梦到一位神仙告诉他会降下天书《大中祥符》，刚才，宫里果然在承天门发现了天书。此言一出，群臣们顿时炸开了锅:这可是千年难遇的大事啊，唯有盛世才会有如此的祥瑞！之后，在全国百姓的“一再请愿”下，宋真宗前往泰山封禅。是年十一月，真宗下诏规定以正月初三（天书初降日）为天庆节；第二年，即1009年，又下诏全国各地设置天庆观，以便于天庆节的建醮集会，还令人修《天庆道场斋醮仪式》一书，颁发全国各地。\n\n　　于是一千年前的正月初三，大宋官员幸福地过上了“天庆节”，而这种幸福竟纷至沓来:1009年五月，“诏兖州长吏以天书降泰山日诣天贶殿建道场设醮，以其日为天贶节，令诸州皆设醮。”天贶节的庆祝活动已开，随之大中祥符四年正式规定“以六月六日天书再降为天贶节”；大中祥符五年闰十月，又新设了两个节日—先天节和降圣节……\n　　\n　　皇帝新创节日，并不始于宋真宗，而是在中唐以后。但就皇帝新创节日之多、调动参与节日活动的官员范围之广、并使之成为国家政治生活中一件大事的，则起于宋真宗时期。\n　　\n　　宋真宗新设的五节中，均规定不得用刑，禁行死刑，到大中祥符五年又明确规定了节日禁行死刑的天数:天庆节七日，天贶节一日。后又对大辟罪在节日期间的行刑问题进行了详细规定，在前面禁刑七日的基础上延长为:天庆节、先天节、降圣节、承天节，前七日后三日，天贶节、天祺节仍一日。这对宋代死刑执行制度的完善起到了一定的作用，对老百姓来说，是件大好事。\n　　\n　　真宗把国家政治生活中大事的日子新设为节日，并制定详细的活动内容，还由中央和地方财政划拨大量经费以保证节日活动的开展，这对官员休假制度等都起过重要的作用，而且对后世乃至当代官方节日的建立产生了深远的影响（也许我们今天的休假有些还是拜真宗之所赐呢）。\n　　\n　　千年前的正月飘起的一朵小浪花，竟然有着如此大的影响力？\n　　\n　　但它的影响还不仅如此。宋真宗封禅及增设节日，以及他对传统节日的重视，不能一以个“愚民政策”或“劳民伤财”就否定了，它在有着文化和政治意义的同时，客观地推动了消费，增加了社会消费时间，促进了商业经济的繁荣。\n　　\n　　岁末年节时，皇帝赐臣僚宴饮，既是增进君臣关系的需要，又是播撒皇恩的大好时机。历朝皇帝都有此举措，宋真宗也不例外。他即位不久，就“赐近臣岁节宴于宰相吕端第，自是遂以为例。”另外，有资格参加节序赐宴官员的范围较前期大为扩大，如1009年二月，“旧制，节序赐宴，惟皇族、近列、诸帅、内职。三月甲子，始诏自今上巳、重阳，三司副使、判官及馆职事官并别置会。其后，知杂御史、三院御史、法官、开封府判官亦预焉”，即从原来的内朝高官扩大到外朝一般官员。同时，节日时还馈送朝臣节物，“并客省赍签赐羊、酒、米、面；立春赐春盘；寒食神(食炎)、饧粥；端午粽子；伏日蜜沙冰；重阳糕，并有酒；三伏日，又五日一赐冰”。享受馈送节物的官职之广，几乎包括文武百官；节日之多，几乎全部囊括，这恐怕是历史上少有的。皇帝拉动了消费又增加了亲和力，生意经念得好。\n\n　　宋真宗“诏自今伏日并休务”，增加了官员伏日的休务假，对官员节日之外的事假也较以前灵活，将祭奠亡亲的私忌假的范围扩大到所有官员，私忌日给假一天，并新创了饯行假。一些节假，不仅只施行于官员，那些为官府服役的工匠也可享受，比如给在福建险恶山路上运送官物的军士以旬假和节假。\n　　\n　　从现有史料记载来看，宋真宗时期官员约一万余人；此外，还有数十万在各级官署中服役的胥吏，以及各级武职人员及其家属。其中，文武官员每年可休77天传统节假，还有新设假日；官府服役者可休65天，如此庞大的官吏队伍和如此宽松的休假制度，相信会在商贸繁华的北宋形成规模大小不同的“黄金周”。\n　　\n　　宋朝是中国封建社会工商业最发达的朝代，中国城市化率最高的朝代，中国海外贸易最发达的朝代；宋朝是人民生活水准最高（是明、清的3－4倍）、官吏的俸禄最高的朝代，是市民阶层最强大、最富裕、最幸福的时期；宋朝是中国文化最发达的朝代，是中国封建王朝最民主、科学、自由的朝代……试想，在这样的大环境之下，宋朝的七八千万人，遇上一个开明的，鼓励消费的，注重官员休假与关怀的，注重民间传统假日与民主的君主，将是一个怎样的情况呢？\n　　\n　　那必将是消费提高了，经济繁荣了。\n　　\n　　于是，千年回眸，我们揭开了一个辉煌王朝的谜底。从一朵小浪花的折射中，我们看到了，1009年，从战争到和平，创造了财富；1009年，从廉政建设到政治清明，发展了经济；1009年，从拉动消费到促进繁荣，千年前的那个朝代，成为了中国经济规模最大的朝代，经济总量占世界比率最大的朝代，中国封建王朝生活水准最高、最繁荣的时代。\n　　\n　　当其时，宋朝富甲天下，经济总量占世界的80%，其一年的铸钱量最高可达五百万贯，而终明一朝总铸钱量也仅一千万贯，中华民族在大宋的欢歌笑语里，幸福到了极点，华夏伟大的形象一直深植于每一个炎黄子孙心中，透过《马可·波罗行纪》的描绘，亦可以感受到西方人的景仰。伏尔泰说:“我们不能像中国人一样，真是大不幸！”盛世如北宋者，伏老未能亲临，的确是他的大不幸；美籍史学家爱德华·伯恩斯在其所著的《世界文明史》中写道:“日本在公元6世纪及其后的几百年如饥似渴地学习和吸取中国文化。”而如果我们自己不能借祖先的前车之鉴，将是谁的大不幸呢？\n",
			"date_added": 1490010155
		}
	],
	"post_like": {},
	"comment": [],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1Lu83qdv5RzCUyWB6SyftWQ2rPkZQ4YFoi",
			"user_name": "Fire1314",
			"date_added": 1489573057
		}
	]
}