{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": 1,
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1_1yk1FeoNn1RmZRtCXcsgL59nNp7xs3aYu": [
			{
				"comment_id": 1,
				"body": "Possibly connected to this two mysterious death cases are 47 other explainable deaths connected to the Clintons.\nHillary 2016 Campaign Hides 47(from 50) Unexplained Deaths Of Her Former Political Associates\nJames McDougal – Convicted Whitewater partner of the Clintons ( died of an apparent heart attack)\nMary Mahoney – shot while working in Starbucks before going public with a story of sexual harassment by Clinton, silencers used, $4000 remained in store\nVince Foster – found dead in park near DC, gunshot wound to mouth (supposed suicide) with a .38 by his side. (Former White House Councilor, and colleague of Hillary Clinton at Little Rock’s Rose Law Firm)\nRon Brown – Sec. of Commerce and former DNC Chair ( died of a gunshot wound to the head [suppressed by the media/DC] and then went down in a plane crash.)\nC. Victor Raiser, II – major Clinton Fundraiser ( plane crash)\nPaul Tulley – DNC Political Director (48 yrs old of natural causes)\nEd Willey – Clinton Fundraiser ( gunshot wound to the head)\nJerry Parks – Head of Clinton’s gubernatorial security team (gunned down in his car)\nJames Bunch – Influential Texan (suicide by gunshot)\nJohn Wilson – Connections to Clinton’s Whitewater deals. (suicide by hanging)\nand others.\nhttps://strangefunnies.blogspot.com/2013/02/mysterious-unexplained-deaths-and.html\nhttp://www.nowtheendbegins.com/hillary-2016-campaign-hides-47-unexplained-deaths-former-political-associates/\nIf you think the Clinton's aren't evil, watch this! \nhttps://www.youtube.com/watch?v=F5JapU0Vf44\nThe ruling elite tries to hide something from us.\nBe careful and never speak about this deaths especially if you are living in the USA. Otherwise you could be the next one.",
				"added": 1482325641
			}
		]
	},
	"comment_vote": {}
}