{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": 1,
		"1_1yk1FeoNn1RmZRtCXcsgL59nNp7xs3aYu": 1,
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": [
			{
				"comment_id": 1,
				"body": "Jews masterminded and they are leading the secret killing of all Germans.\nThis plan is going on. The Germans fertility is lower then of any other nation of the world.\nJewish doctors use chemicals and vaccines to systematically sterilize all Germans.\nRecently the Jews payed ISIS to terrorize Germany. This will give pretext for the Jewish lobby to introduce full dictatorship and sterilize the last remained Germans.\nThe other Europeans will follow.\n\nGermany Must Perish!\nThe Jewish Theodore Newman Kaufman advocates in his book  the genocide through sterilization of all Germans and prohibit the use of the German language - published in 1941 in the United States.\nhttps://en.wikipedia.org/wiki/Germany_Must_Perish!\nhttps://en.wikipedia.org/wiki/Theodore_N._Kaufman\nhttps://en.wikisource.org/wiki/Germany_Must_Perish!\n\n'Segregate the German army into groups, concentrate them in severely restricted areas, and summarily sterilize them.\nOrganize the civilian population, both male and female, within territorial sectors, and effect their sterilization.\nDivide the German army (after its sterilization has been completed) into labor battalions, and allocate their services toward the rebuilding of those cities which they ruined.\nPartition Germany and apportion its lands. The accompanying map gives some idea of possible land adjustments which might be made in connection with Germany's extinction.\nRestrict all German civilian travel beyond established borders until all sterilization has been completed.\nCompel the German population of the apportioned territories to learn the language of its area, and within one year to cease the publication of all books, newspapers and notices in the German language, as well as to restrict German-language broadcasts and discontinue the maintenance of German-language schools.'\n\nHenry Morgenthau Jr. was the mastermind of the secret Morgenthau Plan to kill all Germans\nhttps://en.wikipedia.org/wiki/Henry_Morgenthau_Jr.",
				"added": 1482405044
			}
		]
	},
	"comment_vote": {}
}