{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"3_1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1_1NmT7R64j1uMJ9qs3Bfgda5cGczFqNmCBL": [
			{
				"comment_id": 1,
				"body": "for what reason... java programmers paid the best (big and rich companies stuck with java), but if you want to be more productive (startups, etc), javascript would be a good choice, as it's used in the backend (node.js), frontend (which runs in the browser), and database (mongodb, or anything with json, instead of SQL / etc). What is you goal ? earn much, or be productive. I know it's controversial....",
				"added": 1490634551
			},
			{
				"comment_id": 5,
				"body": "> [delusion](#comment_4_1eQKH8VcGoV17tUEfCHad8pMix9qR8aVu): learning javascript is a terrible choice if you're not interested in building web driven crap.javascript is also a pile of garbage and a security nightmare.\n\nit has a huge community who probably things the same, but it pays well (enterprise demand), and relatively easy to learn and use (as I said, ~same logic for frontend javascript, backend javascript, and database.). Well, not entirely the same, but the difference is smaller than in alternative stacks.\n\nThere are a lots of languages out there, with big community support, and I think, as experienced devs, we shouldn't do the same as religions, which says crap to anything else (that's only my opinion, I respect diversity)",
				"added": 1491243581
			}
		],
		"1_1FLvSPque6gGdvv56THSXznQNnzfehcyNq": [
			{
				"comment_id": 2,
				"body": "look at people who live in poverty, and their biggest problem is who to hate. They are, regarding to brain capacity / memory / cognitive abilities, are not very different from people who take risks and work hard to make the world a better place. Now, think about aliens, who are supposed to be more intelligent (if they can visit us, but we can't visit them), and extrapolate how we look at these miserable people, to how they might see us..",
				"added": 1490866541
			}
		],
		"11464_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 3,
				"body": "Using VPN can make things worse, as it requires less ISPs to actually cooperate, thus making the VPN providers more exposed, and more valuable target. Tor network its the same, there are a just a few exit nodes, their location is known, and the traffic can be correlated.",
				"added": 1491047485
			}
		],
		"11482_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 4,
				"body": "well, I'd like to quadruple my privacy, so I need 4+ VPN? :D",
				"added": 1491078504
			}
		],
		"2_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE": [
			{
				"comment_id": 6,
				"body": "I think illegal == against the interest of someone, who have power.",
				"added": 1491650292
			}
		],
		"11740_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 7,
				"body": "and what happens with you data in the clearnet? guess what, it's legally traded and used to create behavior models, control you, and show you adverts to make you buy things which you like but you don't need :D",
				"added": 1492261705
			}
		]
	},
	"comment_vote": {
		"5_1Bte1EMmKsRq3aCPtKQNh3NLuhuXL8VVv": 1
	}
}