{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Jews More Prone to Schizophrenia Than Non-Jews recognized by Jewish professors by the University of Jerusalem. Dr. Hutschnecker who studied schizophrenia by Jews claims they are 7 times more prone to this mental illness. ATENTION As Dr Hutschneckers study reveals Jewish schizophrenia can be transmited to Gentiles if they come to close contact with Jews.",
			"body": "Jews More Prone to Schizophrenia Than Non-Jews\nThe study was conducted by Professor Ariel Darvasi, assistant dean of the Faculty of Life Sciences at the Hebrew University of Jerusalem, in coordination with Dr. Todd Lencz from The Feinstein Institute for Medical Research in New York. The first portion of the study included the largest-ever sample group of Ashkenazi Jews ever researched.\nhttp://www.renegadetribune.com/jews-prone-schizophrenia-non-jews/\nJewish scientists believe that genes have a great deal of influence on the disease, alongside other environmental and hereditary factors. What they do not say that the only environmental difference to Gentiles where they lived that Jews always had an environment of lie and cheat.\n\nJews, according to Dr. Hutschnecker display their mental illness through their paranoia. He explained that the paranoiac not only imagines that he is being persecuted but deliberately creates situations which will make persecution a reality.\nDr. Hutschnecker said that all a person need do to see Jewish paranoia in action is to ride on the New York subway. Nine times out of ten, he said, the one who pushes you out of the way will be a Jew.\n'The Jew hopes you will retaliate in kind and when you do he can tell himself you are anti-Semitic.'\nhttp://thisiszionism.blogspot.com/2008/03/evidence-that-jews-are-carriers-of.html\n\nATENTION\nAs Dr Hutschneckers study reveals Jewish schizophrenia can be transmited to Gentiles if they come to close contact with Jews.\n\"There is no doubt in my mind,\" Dr. Hutschnecker said, \"that Jews have infected the American people with schizophrenia. Jews are carriers of the disease and it will reach epidemic proportions unless science develops a vaccine to counteract it.\"",
			"added": 1485214351,
			"parent_topic_uri": "9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		}
	],
	"topic_vote": {
		"1_1DqaWUpq6dRXfuXCokpjYoAkDj2nzZDnAn": 1,
		"1_1NU6gdra9qhUhdbYGLia1G3HYT87qUTA7w": 1,
		"1_1AQwGx5xyBi5Fvv9WHJFMCMNtQhUc8UhQF": 1,
		"1_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"2_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1,
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": 1,
		"1_12Xj1w5HYu6w5xtEwwLyEiMYGuCqvYKL2q": 1
	},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}