{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Barbie.avi What we actually have",
			"body": "",
			"added": 1478615357
		}
	],
	"topic_vote": {
		"1_1KoY1ipDRSFtKQ7w5sj1SYBb3yodjLpdeP": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1_1KoY1ipDRSFtKQ7w5sj1SYBb3yodjLpdeP": [
			{
				"comment_id": 1,
				"body": "1. An original source of barbie.avi is \"RAE Tammy\" video (100% truth). Firstly, anon found it on a Chinese video hosting named \"ikoo8\". Here it is: http://www.ikoo8.com/video_play/XMzU1NzYzMjQw.html\n\nThis fact can be proved due to this forum post: http://www.amputeep.com/forum.php?mod=viewthread&tid=962\n\nAnd the next fact\n\n   2. The date of the first link to this video indexed by Google, seems to be 19 June 2009 (80% truth). If you search this link: \"http://www.megaupload.com/es/?d=RJTFWVV0\" with Google, you will get that it firstly occured in June 2009. Here is the list of links of amputee videos which includes \"RAE Tammy\": http://freeamputee.blogspot.ru/2009/06/amputee-women-free-videos.html?m=1\n\n   3. The true name of \"Barbie\" is Tammy (100% truth)\n\n   4. The video was firstly recorded at 10th April (or 4th October) 1989 (80% truth). You can see the date of this video at the end\n\n   5. This video is a public interview with amputee girl and not a private medical/psychiatric film (60% truth). This fact can be proven due to the title \"licensed for private home exhibition…\" at the beggining of the first part of \"barbie.avi\", Tammy talks about \"requests\", \"photos\" and gives thanks to watchers at the end of \"Tammy\" and the original video occured in the internet before uploading \"barbie.avi\"\n\nIf you can find new facts about \"Tammy\" and you want to find the full \"Tammy\" video, you can post them here",
				"added": 1478615401
			}
		],
		"1_18jipjDsfAxAuq4ixbi2w24xJrYVfTYFPn": [
			{
				"comment_id": 2,
				"body": "> [wer](#comment_2_1MfE4K1TvPB3pPsiQeb7AF8BQXrHW8Sj4j): North Korea\n\nAnd how are you still not jailed? I heard that North Korean politicians spy for users",
				"added": 1478632853
			},
			{
				"comment_id": 3,
				"body": "Russia",
				"added": 1478632904
			}
		]
	},
	"comment_vote": {}
}