{
	"next_post_id": 4,
	"next_comment_id": 3,
	"next_follow_id": 5,
	"avatar": "generate",
	"user_name": "Tolst0evsky",
	"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1487700780,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1487700837,
			"body": "New account after HDD destruction (yep, backups are for rookies). Hello world. Again. :-)",
			"date_added": 1487700835
		},
		{
			"post_id": 1489426048,
			"body": "[Конец капитализма уже начался. Что дальше?](http://ideanomics.ru/articles/4476)\n\n> Мы и не заметили, как вступили в посткапиталистическую эпоху. Какой она будет, пытается представить автор новой книги Postcapitalism, экономист Пол Мейсон.\n> Мы и не заметили, как вступили в посткапиталистическую эпоху. В ее центре — информационные технологии, новые подходы к работе и экономика совместного пользования. Старые методы не исчезнут еще долго, но пришло время снова поговорить об утопиях, считает Пол Мейсон, автор новой книги Postcapitalism и редактор экономики BBC. Вот его программная статья в The Guardian, которая наделала в последние дни немало шума.\n> Красные флаги и распевки маршей партии СИРИЗА во время греческого кризиса, а также ожидание национализации банков на время возродили мечту XX века о вынужденном уничтожении рынка сверху. В течение большей части XX столетия именно так левые мыслители представляли себе первый этап экономики после капитализма. Эту силу к рынку применит рабочий класс — либо на избирательных участках, либо на баррикадах. Его рычагом станет государство, и частые эпизоды экономического краха предоставят для этого возможность.\n> Однако в последние 25 лет крах потерпел именно проект левых. Рынок уничтожил плановую экономику, индивидуализм заменил собой коллективизм и солидарность, а резко расширившаяся рабочая сила мира выглядит как «пролетариат», но уже не мыслит и не ведет себя как таковой.\n> Если вы претерпели все это и при этом не любите капитализм, это был травматический опыт. Но между тем технологии создали новый выход, который остаткам старых левых — и всем, на кого они производили впечатление — придется принять или погибнуть от него. Оказывается, капитализму положат конец не насильственные методы, а нечто более динамичное, которое уже существует, пусть и незримо, в старой системе и которое пробьется наружу и перестроит экономику вокруг новых ценностей и моделей поведения. Я называю это посткапитализмом.\n\n\n(дальше -  по ссылке)",
			"date_added": 1489426045
		}
	],
	"post_like": {
		"173bxmLC8QA16cwrt2Z5SpYpijLHC2LtLR_1487808400": 1487866339,
		"1LYR3a3FNio5QWH7HN7W27DcjR7PQ2oYjv_1487741937": 1487866526
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Rythyrix:  nope )",
			"post_uri": "14yvo4Fy5yLJuSmJLN1SPRTCcUM86pEANk_1487700837",
			"date_added": 1487866185
		},
		{
			"comment_id": 2,
			"body": "Есть такие, да.",
			"post_uri": "1HRnhpg4tdCn6PtjbwdbrDKyvXQizPeLCn_1488731263",
			"date_added": 1488732822
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA",
			"user_name": "Mist",
			"date_added": 1487866685
		},
		{
			"follow_id": 2,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw",
			"user_name": "Balancer73",
			"date_added": 1487866812
		},
		{
			"follow_id": 3,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1NHR4Gdv1dVLZS5HRwY6aJWfngk9jCLF87",
			"user_name": "Brom",
			"date_added": 1487868128
		},
		{
			"follow_id": 4,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN",
			"user_name": "Flyman",
			"date_added": 1489425609
		}
	]
}