{
	"next_comment_id": 4,
	"user_name": "LGBT",
	"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
	"post_like": {
		"16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1491367755": 1491408120
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "This is the first comment I give like. Is a pleasure the fact my first mention here is by a trans person. I'm @Plasmmer: creator and content creator of this profile, and I created it not for everyone to be part of LGBT society, but for everyone to know the cause and help us make the world more tolerant. I know all those people who make accusations. There are those who started it all and command these attacks, and there are those who are influenced. The influencers are the ones I know best. The problem is that they are a millenarian order of conservatives who abhor anything that is different from them. And in their contradiction (symbol of them through the pomegranate), they do what they want under the cloths (crimes), but if someone wants to do what they want (exercise rights) they will repress. They are unpunished until today because one of their tactics is to accuse others of what they are. Sadly, the ones I've been talking about are psychopaths who hate life and do not even know who they are, and when they see someone accomplished in being \"yourself\" (LGBT, as an example), they attack.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1491367755",
			"date_added": 1491408555
		},
		{
			"comment_id": 2,
			"body": "I made an extensive and (perhaps) tiresome comment below, but speaking exactly in ourselves:\nWe have to unite more and more. They usually attack us when we're in solo. We have to be together ever. And always put our intelligence, courage and revolt over fear. Spread our messages in public, and talk about our plans in private. These are some strategies of a true revolution.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1491367755",
			"date_added": 1491408966
		},
		{
			"comment_id": 3,
			"body": "Me.Mkg20001.bit is the site where the backgrounds feature is working. You can access your profile, then change the background.",
			"post_uri": "16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd_1491403810",
			"date_added": 1491409155
		}
	]
}