{
	"next_comment_id": 7,
	"comment": [
		{
			"comment_id": 1,
			"body": "You made the right choice! ;]",
			"post_id": 56,
			"date_added": 1461933758
		},
		{
			"comment_id": 2,
			"body": "The problem with ZeroNet is the simplicity that the clearnet has.. Not a problem for devs but for common people.. This simplifies many things, thanks for this implementation experiment!! =)",
			"post_id": 100,
			"date_added": 1483169021
		},
		{
			"comment_id": 3,
			"body": "Cool!! :D",
			"post_id": 101,
			"date_added": 1483292023
		},
		{
			"comment_id": 4,
			"body": "Nice one =)",
			"post_id": 104,
			"date_added": 1486857193
		},
		{
			"comment_id": 5,
			"body": "My slow internet (0.65-0.35 Kbps) will love this tar.gz implementation :D",
			"post_id": 105,
			"date_added": 1488243292
		},
		{
			"comment_id": 6,
			"body": "well.. MANY CONGRATULATIONS in primis! Then :)\n\n- Why decentralization important to you?\n\nI love the idea of a free to access Internet extended worldwide, I love the idea of a continue enhancement as fast as technology evolves! (in Italy we are stuck in 90s in some zones.. at home I have a cabled 0.65/0.35 mbps line for example.... and pay much more than a fiber line.) \n\nThen a decentralization gives the opportunity to reach every corner of the world, even where censorship is very strict! This is an important point!\n\n- What's bad with the current Internet?\n\nPeople is starting to use Internet day by day, so the load on servers is higher day by day too... In a decentralized world, following the ZN idea.. the most popular zites are the fastest!\n\n- Why are you using ZeroNet?\n\nI believe in this project as much as in a free Internet accessible by everyone even if have no moneys for a phone bill.\n\n Then, because of my low bandwidth, I also love the zite local download, so I can access It even if offline (or almost) as well as choose to download optional files all in once! So I can go to bed or take a launch and so enjoy the content =) so.. I can decide to help distributing that content ^_^\n\nanother think that I use to do is downloading large zites on the business in the city and so watch these at home :)\n\n- What should I talk about?\n\nmark that by this way we can say something like \"__an Internet from the people for the people__.\"!\n\nIt's time for our call! One more time, CONGRATULATIONS for this important goal Tamas!! ; ]",
			"post_id": 107,
			"date_added": 1489322885
		}
	],
	"comment_vote": {},
	"post_vote": {
		"3": 1,
		"43": 1,
		"46": 1,
		"70": 1,
		"94": 1,
		"97": 1,
		"100": 1,
		"101": 1,
		"104": 1,
		"105": 1,
		"107": 1
	}
}