{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "https://theanarchistlibrary.org/library/david-graeber-are-you-an-anarchist-the-answer-may-surprise-you",
			"body": "https://theanarchistlibrary.org/library/david-graeber-are-you-an-anarchist-the-answer-may-surprise-you",
			"added": 1478963255
		}
	],
	"topic_vote": {},
	"next_comment_id": 49,
	"comment": {
		"1_1AhXDbKvcLap7TcS2542J7bFYzKHM3xeRU": [
			{
				"comment_id": 1,
				"body": "> binero: Exploitation always happened. Slavery existed before currency existed.\n\nIf you have evidence of this that you've kept to yourself you are going to be a very rich man. And probably up for a nobel prize",
				"added": 1478550460
			},
			{
				"comment_id": 2,
				"body": ">binero: The market will still be supply-demand based, but people will merely be granted an allowance.\n\nThat isn't capitalism. That is state socialism. The market wouldnt allow that. Its like asking shareholders to take less profit to help the poor. Never happens, I can't think of a single company who says to shareholders 'lets give away our profits and take home less'. Even the state is reluctant to increase taxes. Int he US and the UK corporation tax has been decreasing. In the uk it is 20% in the 80s it was 70%. Capitalism drives to sharing less, because sharing less means gaining more profit, and thus more capital, known as capitalism!",
				"added": 1478550488
			},
			{
				"comment_id": 3,
				"body": ">binero: That has always been the case. Also, the advanced technology that you say there wasn't in the past, that only emerged with capitalism.\n\nYes, but it doesnt mean it couldnt have emerged with anarcism. Many tools obviously did. Like the wheel. But furthermore without copyright and patents we'd have more innovation not less. Thats why open source (anarchist in many respects) produces innovative software. Even google realised open source was the best way to drive innovation on smartphones. TOR, Zeronet, wikipedia, android, linux, - all major technoilogical innovations driven by anarchist principles (ok android has lost its way - and since it has been recapitalised by google, most tech people also agree - its made it worse not better)",
				"added": 1478550505
			},
			{
				"comment_id": 4,
				"body": ">binero: That's an absolutist view. I don't believe in communism. In a communist society it's in people their interest to not care about others. It just takes one bad person to ruin it for the others.\n\nIts not absolutist. Im trying to explain what anarchist communism is. You experienced a house party surely ? - thats communism . It doesnt matter if you believe it or not. It doesnt change the facts. Communism is about caring and sharing with others willingly. Whatever you think communism is, if its not that then it is not communism",
				"added": 1478550524
			},
			{
				"comment_id": 5,
				"body": ">Binero: . It just takes one bad person to ruin it for the others.\n\nYes, that will always be true, but more so under capitalism. And to go back to my house party analogy, would you say all house parties are awful and worthless because one bad person MIGHT ruin it? A capitalist party (a party organised for your company by your boss for example) are always ruined by you having to submit to the will of your bosses demands. By you not being free to do as you will, but constrained by the fear of loosing money (your job).",
				"added": 1478550537
			},
			{
				"comment_id": 6,
				"body": ">planespherev2: With all respect, you should study the 4 types of modes of production, and their respective dates.\n    For the last time, i'll do it for you but you should just read the wikipedia pages about it.\n    Slavery didn't existed at all before 12000 BCE. From 160000 BCE to 12000 BCE, it was a primitive communist organizatin, without money and hierarchy.\n    About the 4 modes of production:\n    Primitive communism (160000 BCE-12000 BCE).\n    Slavery: occured in diverse area and in diverse dates since 12000 BCE. But mostly during the roman empire, which was an entire mode of production based on slavery.\n    Feudalism: division of society in 3. Laboratores, oratores and bellatores. Laboratores worked for bellatores who protected them.\n    Capitalism: current system of production with the separation of humans in 2: the owners of the means of production, and those working for them (employees).\n\nIt should be noted also that slavery has been abolished several times through history. Most notably (contrary to popular preception) during the middle ages. Religions - both islam and buddism actually came about on the back of ending slavery, people were fed up of it. They backslided on it over the centuries of course. But this has repeated itself. Humans tend towards being against slavery, always have, likely always will. Just because we have it doesnt mean we actually want it. The few who benefit from it only do so because they have wealth and currency backed by armies (monarch, fascist or governmental) which feeds back into sustaining the armies - soldiers faith in currecny to feed their families too (often failing to realise they are the masters, the ones holding the guns, who control what money is really worth) but eventually they figure it out. They have in different times. Usually when religions come about .",
				"added": 1478550562
			},
			{
				"comment_id": 7,
				"body": ">binero: Capitalism doesn't have to be seperated. Cooperatives are also capitalist. Crowd funding is also capitalist. Those are all capitalist by nature. You don't need to get rid of something that has proven to work to work together. Capitalism doesn't require there to be seperation.    If anyone has been brainwashed it's you. You do not understand what capitalism actually is anymore.\n\nWhat do crowdfunding and co-operatives under capitalism have to do with anarchy. If anything youve just highlighted the social capitalism (which is really just capiotalism with a less sharp edge) that you denied existed.",
				"added": 1478550609
			},
			{
				"comment_id": 8,
				"body": ">Binero: Those are all rules cooperatively constructed by the people and laid down in a constitution. Yes, to create a state you first need anarchy, because you cannot create a state where there is one.\n\nI didnt co-operate with that. And why cant I create a state where there is one? Or a non-state where there is one? Who gets to decide who forms the state. I tell you who. The feudals, the rich, the powerful, monarchs (uk) and what do all these have in common? They have armies. Paid in coins they control. They even put their faces on the coins lest you forget.",
				"added": 1478550629
			},
			{
				"comment_id": 9,
				"body": ">binero: Every example you guys listed for anarchy sounds horrible and I definitely do not want to live like that. They're all stuch in even before the dark ages.\n\nThen you do want to be an anarchist! Because the first rule of anarchy is that you don't have to do anything you don't want to do.",
				"added": 1478550649
			},
			{
				"comment_id": 10,
				"body": ">binero: Every example you guys listed for anarchy sounds horrible and I definitely do not want to live like that. They're all stuch in even before the dark ages.\n\nBinero. There is a book called 'Work' by Crimethinc. Ive read a lot of books, on economics, history and politics. But this is one of my favourites. A life changing book of ideas. I used believe in capitalism, then I became a socialist but they never sat right with me, always left unanswered questions. I am now a committed anarchist and it is the only political movement I genuinley am unable to find flaws in, even when it scares me, fear is not a failure. . I am so confident about how good this book tackles the subject of capitalism , debt, socialism, money and power (including unions ) . I'm willing to bet if you read the whole thing you will radically change your mind. Its written in an enjoyable and articulate way without being to heavy or too condescending. Another book is Debt the first 5000 years by David Graeber - its an anthrpological study of slavery and money through the ages and utterly crucial to understanding how capitalism arose, and what it is and how it fits in with our innate humanity in the modern age.",
				"added": 1478550667
			},
			{
				"comment_id": 11,
				"body": "Proper redistrubution is anarchy. Capotalism has never done it. No other kind of state ever has either.",
				"added": 1478550703
			},
			{
				"comment_id": 12,
				"body": ">Binero: Bigpharma isn't an issue in every country. Their healthcare was horrible with an average age of death of 25. Death during childbearth was through the roof!    Also, your technology point doesn't make any sense. Modern technology only came about with capitalism, and capitalist nations have had more technological advances (PER CAPITA!) then non-capitalist states. Why aren't your favourite tribes designing the next microchip? Because they aren't capable.\n\n2 million women live with untreated child birth fistulas right now. Every country in the world today is capitalist. (or capitalist-socialist) . The rich can fix this problem tomorrow. But they dont. Capitalism has already failed.",
				"added": 1478550737
			},
			{
				"comment_id": 13,
				"body": ">binero: Bigpharma isn't an issue in every country. Their healthcare was horrible with an average age of death of 25. Death during childbearth was through the roof!\n    Also, your technology point doesn't make any sense. Modern technology only came about with capitalism, and capitalist nations have had more technological advances (PER CAPITA!) then non-capitalist states. Why aren't your favourite tribes designing the next microchip? Because they aren't capable.\n\nIm not a defender of so called state communism (the term is an oxymoron) but I feel you dont understand that because you compare capitalist states to non-capitalist states which dont exist and never have. Even so if you are talking about someone like Russia (often proposed as communist) I would like to add that they were the first people in space. Technological advances are hindered by capitalism, imagination is, because it brought about patent and copyright laws which prevents people from sharing ideas freely. But we have no way to prove this because capitalism is all we have had for the last few thousand years. You might as well say we wouldnt have had rain or invented sex if it wasn’t for capitalism.",
				"added": 1478550763
			},
			{
				"comment_id": 14,
				"body": "> [nab](#comment_12_1KVbKJBqXdkUr4ogZGJEjDFsm2y9vtX8Bj): I neeeed your sources ! Really need it !\n\nhttps://www.gov.uk/government/publications/rates-and-allowances-corporation-tax/rates-and-allowances-corporation-tax",
				"added": 1478559443
			},
			{
				"comment_id": 15,
				"body": "> [nab](#comment_12_1KVbKJBqXdkUr4ogZGJEjDFsm2y9vtX8Bj): I neeeed your sources ! Really need it !\n\nIt was 52% in 80s   I stand corrected.     The point still holds.  Its still a huge drop.    It is now 20% .\n\nhttps://www.figurewizard.com/list-uk-corporation-tax-rates.html",
				"added": 1478560092
			},
			{
				"comment_id": 16,
				"body": "the top rate of income tax in 1980 was reduced from 83% to 60% in under Thatcher.   83%!   \nhttps://en.wikipedia.org/wiki/History_of_taxation_in_the_United_Kingdom\n\n Capitalism has helped the rich pay less.  And the super rich less still.   And the super super rich pay nearly nothing at all, and the super super super rich get a subsidy!  ( google amazon UKs distribution centre in Wales. ) \n\nStarbucks paid ZERO corporation tax in the uk between 2008 and 2013.",
				"added": 1478560828
			},
			{
				"comment_id": 17,
				"body": "> [binero](#comment_42_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Let's tackle the problem in a different way because I feel this is goin nowhere. \n> What issue does capitalism have that requires anarchy? Also, I see I'm running out of my quota so if @nofish could fix that, that would be great. (I sent an email yesterday)\n\nHad same problem.  Got no reply.  installed another zeronet session,  got new zeroID.",
				"added": 1478560922
			},
			{
				"comment_id": 18,
				"body": "> [binero](#comment_42_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): What issue does capitalism have that requires anarchy?\n\nI could be here for a 5 year writing that list for you.   Instead ,   I'll summerise it in one word:  \n\nGreed.",
				"added": 1478561260
			},
			{
				"comment_id": 19,
				"body": "Capitalism depends on greed.  Its not a bug.  Its a feature.  Capitalism is greed.  The 2 words can be used interchangeably in every context to describe the same thing accurately.",
				"added": 1478561348
			},
			{
				"comment_id": 20,
				"body": "> [nab](#comment_13_1KVbKJBqXdkUr4ogZGJEjDFsm2y9vtX8Bj): Thank you, your debate is very interesting ! :)I must say that @binero's arguments are not very convincing: no sources, and most of them are based on \"this is the current system so the other cannot do the same\".Maybe if you tried to understand the anarchist's arguments you could argue better.(I'm a convinced anarchist, so I don't have anything to add to your arguments @thisweb13)\n\n\nThanks.  We all know capitalism is bullshit.  Even binero I am sure.  This amusing short essay sums up our collective denial.\n\nhttp://strikemag.org/bullshit-jobs/\n\n It takes  a unique or insane person to not recognise this kind of bullshit is everywhere,  in their own job, or among friends or family (and probably all 3).  Day in, day out,  Every. Single. Day.  Bullshit bullshit bullshit.  Capitalsim is smoke and mirrors built out of greed. \n\nIf a CEO of any major company stops working tommorow or your local refuse collector does.  Which one do you think you'll notice first?   Easy right?  So which one deserves the most reward?",
				"added": 1478562656
			},
			{
				"comment_id": 21,
				"body": "> [binero](#comment_43_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Why is greed an issue? As you said, it's a feature, not a bug.\n\nOk, well if you can't see greed is bad for society I have nothing else to add.  Even christians see it as one of the deadly sins?",
				"added": 1478720322
			},
			{
				"comment_id": 22,
				"body": "> [binero](#comment_45_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): So? Why would we replace capitalism. All of those issues aren't the result of capitalism but the result of not having proper regulations. Child labour is already banned in the West. Food supply and climate change can both be regulated.\n\nBut greed, a part of capitalism (because profit is greed) , means regulation becomes de regulated - because deregulating regulation increases profit, .  Regulation is anti capitalist. And the people who regulate are the powerful, who are rich capitalists.  No regulation lasts becasue the greed drives the mostpowerful to deregulate!  Regulation and capitalism are antithetical",
				"added": 1478730838
			},
			{
				"comment_id": 23,
				"body": "> [binero](#comment_45_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): . Child labour is already banned in the West. \n\nYes because its more cheaper to use child labour in the east where theres no regulation and much of your clothes and goods are made. \n\n>Food supply and climate change can both be regulated. \n\n And yet they are not.  These are the biggest problems facing the world today.  In the west most of our food comes from abroad, third world countries where most people cant afford much food.",
				"added": 1478731059
			},
			{
				"comment_id": 24,
				"body": "> [binero](#comment_48_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): The one who is the least replacable you'll notice first.\n\nIf we value the person by how replaceable the work they do is then what does that say about you?      Arent all people equally valuable in and of themselves?  The difference here is that you dont appreciate the ceos because he does nothing for you personally.   The refuge collector does.  He personally collects your rubbish.    In any case whether CEOs are more replacable than rubbish collectors or not now is debatable, but without oppresion by money, you'd struggle to find anyone to empty your bins. Wanting a CEO wouldnt cross your mind, unless you wanted them to OPPRESS people into  cleaning your bins.   The economy is built on structural violence, violence imposed on anyone who doesnt pay their debts and services to others with money and money alone.  The CEO is a step in  the levels of that structure, baring down, threatening the violence and power from above handed to him.",
				"added": 1478732006
			},
			{
				"comment_id": 25,
				"body": "> [binero](#comment_50_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Please explain why conserving resources is a good thing? \n\nAre you serious?",
				"added": 1478732182
			},
			{
				"comment_id": 26,
				"body": "> [binero](#comment_50_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt). If you argument is people are good, then why would they not be able to agree on common rules they can follow? \n\nBecasue under capiatlsim if 99% of the worlds population were good and wanted common rules they could follow, it wouldnt happen if the 1% capitalist sociaopaths who are rich, powerful and have armies didnt agree.  Thats what we have and that IS exactly what's wrong with capitalism.  Your question is the most important one.  I hope ive answered it.",
				"added": 1478732381
			},
			{
				"comment_id": 27,
				"body": "> [binero](#comment_51_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): Greed is a bad word. All animals by nature have a desire to improve their current situation. You call it greed, but just calling it that won't remove the fact it's not something introduced by capitalism. Capitalism sees this desire for more, and makes use of it by directly correlating your welbeing to other people their welbeing. You can only become wealthy by helping other people. Sure people can cheat, but that's why they can agree on common rules.\n\nHunger, wants and needs are not the same as greed.   There are no other greedy animals. None.   If a lion has just eaten he wont kill a zebra.  In fact he has evolved to conseve it and let it breed for a meal when he needs to eat. (whch also answers your why conserve resources question)",
				"added": 1478732560
			},
			{
				"comment_id": 28,
				"body": "> [binero](#comment_51_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): You can only become wealthy by helping other people. \n\nAre you sure about that?  How does robbing  someone help other people?",
				"added": 1478732720
			},
			{
				"comment_id": 29,
				"body": "> [thisweb13](#comment_28_1NLj8uWHVf68dt53Wuz5HRqQvX7fScCXpD): Are you sure about that?  How does robbing  someone help other people?\n\nLots of people get rich through blackmail.  Oh yeh, the banks in 2008 blackmailing the public with economic terrorism ,  demanding bailouts from the taxpayer for which they did not cause and for which the banks helped nobody, destroyed homes, jobs, and lives whist paying themselves huge salaries and bonuses and still asking for more.  That is the very essence of global capitalism today.  Its not theoretical, its already failed most people.  even the western upper middle classes.",
				"added": 1478733002
			},
			{
				"comment_id": 30,
				"body": "Capitalism made Trump president of the world.  There is no argument I can make against capitalism that is more powerful than that fact.",
				"added": 1478737081
			},
			{
				"comment_id": 31,
				"body": "> [binero](#comment_52_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): You're the one who is saying the amount of money someone earns is correlated to their worth. It only makes sence to give people who do replaceable jobs less salary, because it insentives them persue somethign else.\n\nIts not the lack of incentive its the lack of options.  Refuse needs collecting.  It should always be well rewarded.  I didnt say money correlates with their worth, I said the work they do should be better rewarded.  We dont need to incentivise anyone ( I wouldnt want a CEO to be paid less than a refuse collector either - assuming you think we need them,)",
				"added": 1478900499
			},
			{
				"comment_id": 32,
				"body": "> [planesphere](#comment_18_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C):  The CEO only earns more because as a society we agree being a CEO is a much harder job.\n\nUm no, he earns more because the wealthy elite like to pretend its a much harder job.   Society mostly disagrees with how much,  say,  the CEO of Roytal Bank Of Scotland or BHS  should get.",
				"added": 1478900711
			},
			{
				"comment_id": 33,
				"body": "> [thisweb13](#comment_32_1NLj8uWHVf68dt53Wuz5HRqQvX7fScCXpD): Um no, he earns more because the wealthy elite like to pretend its a much harder job.   Society mostly disagrees with how much,  say,  the CEO of Roytal Bank Of Scotland or BHS  should get.\n\nIf you think being a CEO it a harder job than collecting refuse, or say fighting in a war zone, then either you dont understand what hard work is, or you dont understand what value is.",
				"added": 1478900825
			},
			{
				"comment_id": 34,
				"body": "> [thisweb13](#comment_33_1NLj8uWHVf68dt53Wuz5HRqQvX7fScCXpD): If you think being a CEO it a harder job than collecting refuse, or say fighting in a war zone, then either you dont understand what hard work is, or you dont understand what value is.\n\nThat old cliché rings true with what you say :  'Capitalists know the price of everything and the value of nothing'",
				"added": 1478900913
			},
			{
				"comment_id": 35,
				"body": "> [binero](#comment_52_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt):  If your argument is that CEOs earn disproportionally much compared to what they deliver, I agree. This can be regulated. A progressive tax rate directly correlates with wealth equality.\n\n This can be regulated?  OK name a wealthy ceo in all of history who has accepted such regulation at any time ever?  Any minor  regulations that already exist are nearly always avoided.  As I said hardly any of the biggest companies on the planet pay tax.  And they are regulated to pay tax.  They just avoid it.  Regulation is easy to avoid.  And if it isnt the rich have enough power and enough builderberg meetings to thwart any attempt you might want to make.   And I dont mean sometimes.  I mean always. For all of capiatlist history.  Without exception.",
				"added": 1478901176
			},
			{
				"comment_id": 36,
				"body": "> [binero](#comment_52_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt):   I've never heard of violence committed to anyone because they couldn't pay their debt. Debt usually gets forgiven, except for bussinesses. \n\n\nAre you kidding.  All those foreclosures in 2008, making people including children homeless, bailifs, debt collectors.  All will commit acts of violence and arrest you if you dont pay.  They have the legal right to use force.  All force is violence. Forced starvation and homlessness (when a home lays empty no less) is an act of extreme aggression and violence in my view.  And it happens every day. All over the world. Try not paying a debt.  See for yourself if it will be forgiven.",
				"added": 1478901500
			},
			{
				"comment_id": 37,
				"body": "> [thisweb13](#comment_36_1NLj8uWHVf68dt53Wuz5HRqQvX7fScCXpD): \n\n    Wanting a CEO wouldnt cross your mind, unless you wanted them to OPPRESS people into cleaning your bins.\n\nA CEO doesn't oppress anyone. If you're talking about people who are doing jobs they don't want to do, that's hardly the CEOs fault. The CEO isn't forcing them to do that job, it's the fact that society fails to guarontee that person's basic rights no matter what. A universal basic income would immediately enable anyone to only do the jobs they want to do.\n\n The CEO makes ALL his money of the back of that refuse collectors labour and keeping the profit for himself instead of sharing it fairly.   It is his fault.  And of course the system that allows it. Capitalism.",
				"added": 1478901683
			},
			{
				"comment_id": 38,
				"body": "> [binero]When a person doesn't need food, he won't work to be able to buy that food.\n\nThis is an assertion made only in the context of capitalism.  Under anarchy people want to work and contribute to the community.  Under capitalism (and the individualism it promotes) you are indeed correct.   But that isnt an inevitability in other contexts, and you have no evidence to back it up.    There is evidence that communities have always contributed towards to others needs, even when their own needs are met.  Its actually the point of being a social animal.  Making those bonds and social agreements insures our mutual survival.  As capitalism breaks them down, it mutually ensures the destruction of humanity.   That is what we see happening rtight now.  As people hoard resources, let others starve and pulute the planet for CAPITALism!",
				"added": 1478955167
			},
			{
				"comment_id": 39,
				"body": ">Binero   :  Robbing something isn't something unique to capitalism. Long before capitalism existed thieves existed\n\n Robbing is only a thing if capitralism exists!  Its an idea. And even then it isnt nessicerilly greey or even bad, it can be a good thing.   If I take an apple from your garden its theft (robbery) .  But under anarchy it wouldnt be.  It would just be me eating an apple from a tree.  And likewise 'robbing' a bank to give to the poor isnt a greedy act.  Its a good idea. Only capitalism calls it theft.  So robbery is a word invented by capitalism.  And you have been brainwashed to believe its an innherently bad thing.",
				"added": 1478955566
			},
			{
				"comment_id": 40,
				"body": ">binero Capitalism is not a political system\n\nThis is nonsense.  Its not possible to be seperate from a political system  Capitalism is utterly dependent on politicising life. It  requires structural violence (the enforcement of of debts and use of approved currency) It is illegal to forge money - without politics who would stop people forging money?  Who would stop someone taking property?   Capitalism IS a political idea.   If it wasnt  anarchy would flourish.  It is anarchy that is not a politcial syatem.   Its the only system that specifically rejects politics.  Politics comes from the word police (police of public) .  Anarchy rejects any kind of dominant heiracal force.  Capitalism MUST have it.",
				"added": 1478958341
			},
			{
				"comment_id": 41,
				"body": "Capitalism is not a political system and the USA is not the world\n\n I dont see them as a matter of opinion.   Just a measurable of reality.  The US has WAY more weapons than any other nation on the planet.  This means they have more power to oppress than anyone else.  Most capitalists  accept this!    That power and weaponry enforces the rules of capitalism.  The Trump and the rest of the US political and finacial elite know this,  that’s why America dominates the world.   Goldman Sachs, Trump and Me (an anarchist) are not in any disagreement about this.  Do I think we can chage that?  Absolutely, but right now Capitalism dominates, and the US dominates capitalism.",
				"added": 1478959051
			},
			{
				"comment_id": 42,
				"body": "> [binero](#comment_56_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): To start off, can I please ask you post everything in one message? I know I also split up my posts earlier in this conversation, but that was by accident. It's just much easier to respond if there is only one message.\n> \n> Then how do you incentivise people to do jobs that are in high demand? You disagree with the current model but fail to provide an alternative. \n> \n> We do, or at least I do. The reason CEOs earn so much is because if they fail, thousands if not tens if thousands of people will be negatively affected. As such, they are allowed high salaries.\n> If your argument is the salary is disproportionally high, I agree. That's an easy fix though. You could merely have a very progressive tax rate, in which the more a CEO is allowed, automatically the more the state is allowed and thus the community is allowed. \n> \n> Being a CEO is a less replaceable job, and a very hard one. A lot of people can collect garbage or fight in a war, but not a lot of people can lead a bussiness. \n> \n> This is a hypocritical argument. Are you saying that because something has never or barely never happened, it is not a valid solution. If so, I can now dismiss your entire argument. As I cannot see a political anarchy nor a communist model in our current world, both of them must be bad solutions.\n> I completely agree that a lot of people and corporations who should pay taxes are not. This is a political problem, and not a problem with the economic model. \n> \n> That just depends in which country you live. As such, it's not an argument against capitalism. In my country, people who cannot pay their bills are excempted from paying taxes and are immune to certain fines. You cannot go to jail for not paying your bills nor can you be arrested. If this was not enough, the government will negotiate with the creditors to work out a payment plan. It is in the creditor their interest to agree with such negotiations as otherwise they might never see their money. Such a payment plan concists out of debt relief, a resheduling of the payments, possible selling of property although the person in question is always allowed to do this themselves. Any person who starts these negotiations is immediately disallowed from generating any further debt. In practise this means the person cannot make any new loans, but also that any interest they have to pay as well as other increments of the existing debt is made void. If the negotiations result in the person having to sell property, there is except property as well. Anything required for a basic life cannot be sold, including without being limited to the residence, a bed, a table and a set of chairs. It is not uncommon though for these negotiations to compeltely relief the person of all debt, especially if the person cannot pay their debt due to loss of job or other conditions that are out of their control. \n> \n> This argument is naive at best. As I pointed out before, if you don't like the extrordinarily high pays they get, implement a progressive tax rate that can be enforced.\n\nSorry about that, I got behind because my user account got screwed up when I was posting.",
				"added": 1478959174
			},
			{
				"comment_id": 43,
				"body": "> [planesphere](#comment_18_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C): Have you heard about the sub prime crisis, were people saw their houses confiscated and were (still are) obligated to live under camping tents?\n> \n> Theft only exist on modes of production were there is money and/or property. Thus slavery, feudalism and capitalism. During the primitive communism, there wasn't theft inside the tribe. In superior communism, there won't be theft anymore. No need to steal when everybody have everything he need (not everything he wants, but everything he need).\n> \n> So, is planned obsolescence, something capitalism created, a guarantee that resources are used in the most efficient way? \n> Anyway i just thought about it yesterday, and with the tendency of the rate of profit to fall, capitalism NEED planned obsolescence. Otherwise the final crisis will come sooner than later. If people don't buy again and again the same stuff, the economy crash and the system collapse. \n> I just thought about it and it could be even worse in the future, lobbies could impose  laws which compels you to change you belonging regularly (with excuses like security, protection of the environment etc...) Even if, for example, buying a new car (which consume less) in exchange of the old one pollutes more because of the energy and resources used to build the new one).\n\nSorry, I hadnt read you comments before I posted mine, Ive juts repeated everything you said unessicarily.  But im glad we came to the same answers here!",
				"added": 1478959544
			},
			{
				"comment_id": 44,
				"body": "> [binero] Why would people not steal to get what they want? \n\nThe question you should ask yourself is why would they?",
				"added": 1478959819
			},
			{
				"comment_id": 45,
				"body": "> [binero](#comment_56_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): To start off, can I please ask you post everything in one message? I know I also split up my posts earlier in this conversation, but that was by accident. It's just much easier to respond if there is only one message.\n> \n> Then how do you incentivise people to do jobs that are in high demand? You disagree with the current model but fail to provide an alternative. \nIf a job is worth doing ther is reward in itself of course. Incentive in your context seems to mean 'bribing' people will capitals (and thus granting them power over others) \n> \n> We do, or at least I do. The reason CEOs earn so much is because if they fail, thousands if not tens if thousands of people will be negatively affected. As such, they are allowed high salaries.\n> If your argument is the salary is disproportionally high, I agree. That's an easy fix though. You could merely have a very progressive tax rate, in which the more a CEO is allowed, automatically the more the state is allowed and thus the community is allowed. \n> \n> Being a CEO is a less replaceable job, and a very hard one. A lot of people can collect garbage or fight in a war, but not a lot of people can lead a business. \n\nHarder than fighing in a war zone or cleaning maggots from bins in the freezing winter smog?  I dont think you are being entirely honest with yourself here.  And if you are just going to argue about how replaceable they are then you haven’t acknowledged their suffering.   That thinking is exactly why I despise capitalism\n> \n> This is a hypocritical argument. Are you saying that because something has never or barely never happened, it is not a valid solution. If so, I can now dismiss your entire argument. As I cannot see a political anarchy nor a communist model in our current world, both of them must be bad solutions.\n> I completely agree that a lot of people and corporations who should pay taxes are not. This is a political problem, and not a problem with the economic model. \n\nIm not saying that.   Capitalism is about making profit.  It is not about regulating for less profits. So it MUST be political, in order to prevent regulation:   If regulation happens then capitalism isnt happening.  For capitalism to work, under any system, it necessarily must ignore social rules that prevent increased profits.  The fact we have never seen regulation work, isnt proof in itself, I take your point.  Its just you have no proof it can work either.  What im really saying is we dont need proof,  because capitalism is in direct conflict with mathmatical laws.  We could pretend there are no mathmatical laws I suppose.  But I think its more likely that structural and political violence keeps maths at bay, in favour of political oppresion (stealing back power by making up the sums - by printing new money and creating derivatives and laws that make people who are owed money not owed the money so everyone is so confused we cant proove who owes what to who) .  But build a mathmatiucal model from scratch and it doesnt work.  Not without politics.\n> \n> That just depends in which country you live. As such, it's not an argument against capitalism. In my country, people who cannot pay their bills are excempted from paying taxes and are immune to certain fines. You cannot go to jail for not paying your bills nor can you be arrested. If this was not enough, the government will negotiate with the creditors to work out a payment plan. It is in the creditor their interest to agree with such negotiations as otherwise they might never see their money. Such a payment plan concists out of debt relief, a resheduling of the payments, possible selling of property although the person in question is always allowed to do this themselves. Any person who starts these negotiations is immediately disallowed from generating any further debt. In practise this means the person cannot make any new loans, but also that any interest they have to pay as well as other increments of the existing debt is made void. If the negotiations result in the person having to sell property, there is except property as well. Anything required for a basic life cannot be sold, including without being limited to the residence, a bed, a table and a set of chairs. It is not uncommon though for these negotiations to compeltely relief the person of all debt, especially if the person cannot pay their debt due to loss of job or other conditions that are out of their control. \n> \n> This argument is naive at best. As I pointed out before, if you don't like the extrordinarily high pays they get, implement a progressive tax rate that can be enforced.\n\nDon't know where you are from, but if this is the case, it sounds almost anticapitalist to me.   Souynds like where you are from is more communist (in the true sense) than elsewhere.  But sadly it wont last, not whilst capitalsism still permeates the economic system.",
				"added": 1478962291
			},
			{
				"comment_id": 46,
				"body": "> Binero:  As I pointed out before, if you don't like the extrordinarily high pays they get, implement a progressive tax rate that can be enforced.\n\nI can't.  Only capitalists can do this, as they own the guns of enforcement, theyd have to be willing to give up their money.  Thats anti-capitalism.  Why would they do that?.",
				"added": 1478962581
			},
			{
				"comment_id": 47,
				"body": "Are You An Anarchist? The Answer May Surprise You! \nhttps://theanarchistlibrary.org/library/david-graeber-are-you-an-anarchist-the-answer-may-surprise-you",
				"added": 1478963199
			},
			{
				"comment_id": 48,
				"body": "> [binero](#comment_57_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): No one is doing any of that in the name of capitalism. People are doing that because it brings them profit. To fix it, simply increase the cost of supply or decrease the demand. \n> \n> \"Capitalists\" don't own the guns. \nThey do.  They also invented them.\n\n>The government has a monopoly on violence, that's how the state works. If your state is ruled by capitalism, that's a political issue, not an economic issue. You cannot make the argument communism fixes political corruption as it's unrelated to the state. \n The govnts and monarchs of the world are all Capitalist.  Thats how you gain power, by having capital over the majority.  No communist country exists or ever has since capitalism came about.\n> \n> Now I just disagree with you more. I take the bus on a daily basis and let me tell you, there is a lot of horrible people out there. \nYes there are and I bet my life every horrible person you met was a capitalist created by capitalists.  \n> My issue with anarchism is that people will just organise into states again. Anarchies don't survive.\n\nBut they did for 1000s of years.",
				"added": 1479079334
			}
		]
	},
	"comment_vote": {
		"15_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C": 1,
		"16_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C": 1,
		"17_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C": 1
	}
}