{
	"next_topic_id": 14,
	"topic": [
		{
			"topic_id": 1,
			"title": "So about the \"used xx.xk/40.0k\"...",
			"body": "How exactly do we get that number to decrease? There doesn't seem to be a way to delete old posts/comments, and each one slowly inches me forward to seemingly never being able to post here again. That doesn't really seem like a good way to keep users around.",
			"added": 1456905584
		},
		{
			"topic_id": 2,
			"title": "Too many files open Error?",
			"body": "I keep getting this error while using ZeroNet. Seems to randomly occur, but I think it mostly happens when stuff's trying to update:\n\n`Err: OSError: [Errno 24] Too many open files in UiServer.py line 76 > UiRequest.py line 80 > UiRequestPlugin.py line 21 > UiRequest.py line 328 > posixpath.py line 356`\n\nAny idea on what the problem is, and how I'd go about fixing it?",
			"added": 1456965367
		},
		{
			"topic_id": 3,
			"title": "Content sign failed: invalid private key.",
			"body": "This error message pops up when I try to send a message on http://127.0.0.1:43110/1AvF5TpcaamRNtqvN1cnDEWzNmUtD47Npg\n\nHelp?",
			"added": 1457009165
		},
		{
			"topic_id": 4,
			"title": "Getting a list of visited sites",
			"body": "I was wondering if there was a way to read the list of sites a user a visited. I noticed there's \"siteList\" but it's listed under \"admin commands\" and I don't think it works for any site other than the main page. Is there any way to grab this list besides prompting the user for it?",
			"added": 1457056675
		},
		{
			"topic_id": 5,
			"title": "ZeroSearch has duplicate results that are returned, as well as artificially increasing the index count",
			"body": "Some example searches:\n\n0chan : pulls up two 'Porn 0chan' results.\nkatee : pulls up two 'Katee Owen Fan Page' results.\nshinra : pulls up two 'Shinra is a Zero' results.\n\nIt's pretty clear that this happened when ZeroSearch merged in Kaffeine's results.  Not a big issue, but it inflates the index number making it unable to be trusted.",
			"added": 1457068317
		},
		{
			"topic_id": 6,
			"title": "Leaving the internet?",
			"body": "Has anyone tried running ZeroNet on a mesh network without the traditional internet infrastructure? Is it possible to do this yet? I read somewhere that it still uses a central tracker to connect peers, rather than something like DHT. Also, the central reliance on ZeroName, along with Namecha.in (which isn't even a part of zeronet!) seems problematic.\n\nI feel ZeroNet really needs to be able to sever any connection with the regular clearnet, and be able to ran on mesh networks in order to really embrace the idea of decentralization, as well as be able to take off and become a useful tool, rather than just an interesting play-thing.\n\nA decentralized meshnet combined with a decentralized web seems like a match made in heaven. Combine that with the other P2P technologies, and you'd effectively be able to ignore and ditch the ISP monopolies, as well as prevent any sort of bullying by large companies.\n\nAs it stands, ZeroNet still relies on ICANN to distribute IP addresses, domain names (the Namecha.in domain), and relies on various internet backbone companies in order to distribute the data. This is still dangerously centralized in my opinion.\n\nIs this on the to-do? Is it even on nofish's radar? What's everyone's thoughts on such a thing?",
			"added": 1458114311
		},
		{
			"topic_id": 7,
			"title": "Scraping ZeroNet sites",
			"body": "Scraping zites for content is inherently problematic, due to the way ZeroNet functions. For a typical site, you just send a request to the page, get the page content, and do as you please. However, doing this on a ZeroNet site results in getting the ZeroNet wrapper, rather than the page itself. Instead, you have to resolve the javascript and load the iframe, and *then* grab the iFrame's content.\n\nAFAIK, there's no clean way to do this in Javascript.\n\nZeroMail comes with some echobot scripts that manages to scrape the page to look for email. I've adapted this script to work in a general fashion (since I was changing it to scrape site lists for Kaffiene). [Here's the generalized script.](http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_3)\n\nAs you can see it requires the selenium library along with phantomjs, which is a piece of software that runs websites and properly resolves the page.\n\nI was wondering what other solutions there might be, that don't rely on using selenium/phantomjs, or may even be entirely javascript.\n\nFrom my understanding, this is the problem that merger sites are meant to solve: a local/client way (javascript/coffeescript) to grab content from other ZeroNet sites.\n\nThoughts?",
			"added": 1458279584,
			"parent_topic_uri": "3_1PVcdu7USZH2kHMETbqDYLPjJZKCDWM52k"
		},
		{
			"topic_id": 8,
			"title": "What other P2P/Decentralized software do you guys use?",
			"body": "Besides torrents and zeronet, obviously.",
			"added": 1470226631
		},
		{
			"topic_id": 9,
			"title": "What site or service does ZeroNet need before it replaces the majority of your Clearnet browsing?",
			"body": "I've been thinking that ZeroNet needs a 'killer app' to drive adoption of the platform. Or maybe a few. For me, ZeroNet has sort of been a 'side show' I want to build up and promote, but it hasn't quite yet replaced the clearnet for me. I know it's the same for you guys, since we have a very small, not very active community here. So have at it: what's so great that's driving you away from ZeroNet and back to the clearnet?\n\nFor me, I always wander back to Reddit for the news, varied discussions, and active userbase. But we already have a Reddit-clone here, but we *do* have a lack of news and discussions. And all the news sites inevitably point back to clearnet. I've also noticed a huge lack of images/pictures here. Is it because there's not really a need? Or because there's not a platform to upload pictures? One big thing I know we could probably use is a music or video site, but those have the obvious filesize issues.\n\nThoughts?",
			"added": 1470624522
		},
		{
			"topic_id": 10,
			"title": "Okay. How the hell do I raise my post limit for my blog?",
			"body": "I've tried everything. I edited the content.json, edited the content.json in the data folder, signed, published, restarted zeronet, etc. Every time it *looks* like my limit went up, but if I delete the site and redownload it, the limit drops back down. The root content.json still has the limit upped, but the data one does not. How the hell do I get the updated content.json to stick?\n\nAlso, while I'm at it, I somehow managed to desync my key from zeronet. I thought I almost lost it, but luckily it was still in the file. How do I get zeronet to remember the private key so I don't have to keep punching it in?\n\nEdit: Honestly, the quota system is the most frustrating part of ZeroNet by far. Second only to the finicky content.json files.",
			"added": 1470711292
		},
		{
			"topic_id": 11,
			"title": "Testing some cert_auth stuff. Don't mind me.",
			"body": "So there's been signing/publishing issues issues with KaffieID and I seem to have found out why. When there's a cert_sign in the content.json, ZeroNet attempts to create a new cert to recreate the cert_sign to verify.\n\nThis is simply a test to see if I can actually spoof ZeroIDs despite the measures to counteract it. If  this works, there's no point in keeping the 'name' bit in the cert_sign. I have a full write up over on ZeroMe.",
			"added": 1471821384,
			"parent_topic_uri": "3_1PVcdu7USZH2kHMETbqDYLPjJZKCDWM52k"
		},
		{
			"topic_id": 12,
			"title": "ZeroMe Database Rebuild Bug",
			"body": "```\nInternal error: TypeError: 'unicode' object does not support item assignment\nUiWebsocket.py line 98 > UiWebsocket.py line 177 > SidebarPlugin.py line 602 > SiteStorage.py line 121 > Db.py line 316\n```\n\nI get this error whenever I try to rebuild the ZeroMe Database. Ends up breaking everything, since some hubs aren't merged. The error apparently happens on proxies as well, like bit.no. Posting this here on ZeroTalk, since I'm unsure if people are getting my ZeroMe posts.",
			"added": 1472262488
		},
		{
			"topic_id": 13,
			"title": "For the content.json permissions field, I always see entries of name@zeroid. Is it possible to use the public key instead?",
			"body": "As the title suggests, I'm wondering if there's a way to just ban the public key, rather than the name. Since this could easily run into issues with KaffieID and other non-unique name services as the user would be able to change the name to get around the ban.\n\nI haven't seen any examples of it done, which is why I figured I should ask. My ban-list is growing, and I'd like to make sure that things go smoothly.\n\nAlso: Is there a way to sync the banlists between sites? Or must I copy+paste it into the content.json of each one? Perhaps referencing an external ban.json would work better?",
			"added": 1490932379
		}
	],
	"topic_vote": {
		"14_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"1_1GCMDNMgJHvZJfdbD9ygDmpBdnVAobdJYg": 1,
		"2_17fgJ3tZjhM7HCkTkd5TWf2BLLWmhRKcXB": 1,
		"1_1JJcAjWkLz8CNDjL4J35wDz65Ky7QjLd4Q": 1,
		"5_1LRrd96P7FiTcsyNXVzPM5jtpQoH1B4gYf": 1,
		"3_1PVcdu7USZH2kHMETbqDYLPjJZKCDWM52k": 1,
		"15_1CMYxdit4qq9QGk9DYRu2ruRPd2YDGckH8": 1,
		"10_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": 1,
		"5_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx": 1,
		"1_1AZCBZGFdZR4pwafMut2Z1kk4wbYantaAL": 1,
		"1_1AhXDbKvcLap7TcS2542J7bFYzKHM3xeRU": 1,
		"14_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": 1,
		"1_15dMbdM7c2RT9RhNTJRqzc4vYSvrSJvxyG": 1
	},
	"next_comment_id": 314,
	"comment": {
		"14_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 1,
				"body": "/r/trackers, talking about a particular ZeroNet site.",
				"added": 1456803534
			},
			{
				"comment_id": 6,
				"body": "> [scrub](#comment_3_1ADB7TdX2fVbTsWBoMe9yBTmVXTbb33b4R): Can I have a direct link to where it was mentioned? I can't find it. >.<\n\nhttps://torrentfreak.com/play-p2p-impossible-shutdown-160301/",
				"added": 1456874442
			}
		],
		"1_1EUyJtat7mbu5wMcR6nrJTPBBRons1mtMA": [
			{
				"comment_id": 2,
				"body": "Literally yesterday. The Play torrent site was mentioned on reddit in a few different subs I frequent. Got it all set up yesterday and spend the afternoon looking around the sites already online. There doesn't seem to be much here, but there's quite a bit for it having what appears to be only a little over a year's worth of development.\n\nJust needs a community to make sites and participate in discussions, and it'll be awesome.",
				"added": 1456870033
			},
			{
				"comment_id": 11,
				"body": "> [ekaterina](#comment_46_1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD): If some of the people who came here today to check out ZeroNet decide to stay, there will finally be something to actually do on ZeroNet :) It's always the chicken and egg problem, you only get new users if there is content for them to enjoy but you need users who create content in the first place, new ZeroNet sites, posting in the forum, etc.\n\nThat's the biggest issue. There seems to be a weird blend of quite a bit of websites, but nothing to do. The user count seems okay at the moment. And the torrent freak influx definitely helped. I think that twitter clone will really help. Along with all the other kinds of sites it'll allow.",
				"added": 1456903730
			}
		],
		"1_1Q8iqH31cKCqynoJRxR2PfJhzQr8wHdiHr": [
			{
				"comment_id": 3,
				"body": "> [muja](#comment_42_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr): How many peers are you seeing for Play?\n\nI see 100 for Play, and 91 for ZeroTalk.",
				"added": 1456872018
			}
		],
		"1_1KMjDiMh4s8dWLxk3zSPQ1w8gSPyL5oUf8": [
			{
				"comment_id": 4,
				"body": "Sites have a 'Users' folder. When you authenticate, it creates a sub folder for each user. These folders are then treated the same way as sites you published, where they're signed by you as a user, despite being pushed out on a site not controlled by you.\n\nCheck out the /data/ folder in your ZeroNet installation. You should see \"1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT\" which is this site. Then go into /data/. Then /users/. Find your user ID (azenet's is 1KMjDiMh4s8dWLxk3zSPQ1w8gSPyL5oUf8) and check inside. You'll find all your posts. Your particular user ID and the private key is stored in your users.json file.",
				"added": 1456873004
			},
			{
				"comment_id": 5,
				"body": "> [azenet](#comment_1_1KMjDiMh4s8dWLxk3zSPQ1w8gSPyL5oUf8): Thanks! This is very clear.How does this play with the space limit that can be set per site ? Let's say that when content is published, all the reachable peers have reached their space limit, will the content never publish ?\n\nWell it's always published on your computer. If users reject to raise their limit (it'll prompt you, or you  can do it manually by dragging the top right icon to the left and changing the value), then they just won't sync AFAIK. Each user has a set limit, which I think can be adjusted by the site owner. Sites themselves aren't actually limited to a particular size, but IIRC anything over 10mb has a prompt. I have no clue how that'd actually look on the user's end. Perhaps nofish could give a better answer.",
				"added": 1456873457
			}
		],
		"2_1ADB7TdX2fVbTsWBoMe9yBTmVXTbb33b4R": [
			{
				"comment_id": 7,
				"body": "http://127.0.0.1:43110/zerosearch.bit\n\nBut it's not very good... You're probably better off looking through one of the various threads asking for sites. There's also http://127.0.0.1:43110/0list.bit which is a list of sites and comments about them.",
				"added": 1456879643
			}
		],
		"12_1PNyuY1iZqXBpft4ArouqcnE4pNRGYij5i": [
			{
				"comment_id": 8,
				"body": "> [oxilic](#comment_29_1PNyuY1iZqXBpft4ArouqcnE4pNRGYij5i): Yep hopefully. I'll also start a crawler soon which should increase the rate as most people don't submit their sites.\n\nAny chance of getting better descriptions of the results as well? A lot of the results that pop up don't give any hints as to what's on the site.",
				"added": 1456887291
			}
		],
		"1_1Fa8QonaFFGcNx3YKiohCoAAhcFaVjkCyM": [
			{
				"comment_id": 9,
				"body": "Search engine: http://127.0.0.1:43110/zerosearch.bit\nUser Driven List of sites: http://127.0.0.1:43110/0list.bit\nList of registered .bit domains: http://127.0.0.1:43110/1Name2NXVi1RDPDgf5617UoW7xA6YrhM9F",
				"added": 1456900156
			}
		],
		"1_15zfQw1PPLNRYGUtuzTj1LN5hX6K24rUnY": [
			{
				"comment_id": 10,
				"body": "You need to use name coin. [See here.](https://zeronet.readthedocs.org/en/latest/faq/#how-can-i-register-a-bit-domain)",
				"added": 1456902248
			},
			{
				"comment_id": 12,
				"body": "> [ekaterina](#comment_47_1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD)\n\nThere really needs to be a built-in solution to cleaner domain names. NameCoin isn't really a good solution, since it relies too much outside the ZeroNet network. NameCoin dies for whatever reason? No more domain names.",
				"added": 1456904600
			},
			{
				"comment_id": 14,
				"body": "> [ekaterina](#comment_48_1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD): Blockchains get way too big too fast, in a year it would already take hours to install ZeroNet and then days, which would seriously hinder adoption.\n\nThis is already the case though. There's no way to actually register a .bit domain for use with zeronet without diving into the whole namecoin thing and learning how *that* works. Right now I'm in the middle of downloading the entire namecoin block chain simply so I can attempt to register a domain. On top of that, I still need to figure out how to *get* namecoin, since it's not exactly clear.",
				"added": 1456906170
			},
			{
				"comment_id": 30,
				"body": "> [cheese](#comment_3_1A6hcWNpQ9SSLoTTpuT19VsVQ6WCVRkyen): Is anyone else having trouble sending zeromail?  I tried to send a test to the echobot, but didn't receive a reply.  Makes me think that somehow my messages aren't going out.\n\nI just did an echobot test. It responded fine.",
				"added": 1457010134
			}
		],
		"1_1ATG1fuopoWWvSbwU99cWx2RQxLexG5ENq": [
			{
				"comment_id": 13,
				"body": "What's the catch? Have to contribute some ungodly internet speed? Have to provide leaks of new warez?",
				"added": 1456904718
			}
		],
		"2_1PX7VW6xfccTT2tNUTwrYKJpGsGfrnoJfP": [
			{
				"comment_id": 15,
				"body": "Only three people are in space? That seems... kinda low. I would've expected more.",
				"added": 1456906576
			},
			{
				"comment_id": 16,
				"body": "> [scrub](#comment_14_1ADB7TdX2fVbTsWBoMe9yBTmVXTbb33b4R): Didn't quite a few people come back from space recently?\n\nI don't really follow that kind of stuff. I just figured that there'd be a lot of astronauts in space doing space stuff for whatever reason. I was expecting like 20-30 or somewhere around there.",
				"added": 1456906706
			},
			{
				"comment_id": 17,
				"body": "> [effekt](#comment_1_1PX7VW6xfccTT2tNUTwrYKJpGsGfrnoJfP): There are usually 6, 3 literally just came back. On the rare occasion, there are 9 up there and in the past there were even 13.\n\nAre they just in the ISS? Or is there other stuff they do in space?",
				"added": 1456907203
			}
		],
		"1_16Hg8ux8t4gqZjGgiEUWQ8xAsqJrtJv7MC": [
			{
				"comment_id": 18,
				"body": "I am. Rev915.",
				"added": 1456913286
			},
			{
				"comment_id": 19,
				"body": "> [elitememer](#comment_3_16Hg8ux8t4gqZjGgiEUWQ8xAsqJrtJv7MC): I think this novel wicked fast javascript is making people post a lot more than necessary :P\n\nJust imagine. An internet without ads or tracking crap. Where whole sites are cached and are super tiny. Now you're thinking with ZeroNet!",
				"added": 1456913742
			}
		],
		"1_1yq6ABe15TborB8sGQb1pGcZgUd6eu3WJ": [
			{
				"comment_id": 20,
				"body": "The domain service is handled by Namecoin. Domain names aren't required in ZeroNet and instead work based off public/private keys. The domain is the public key, and the private key is used to write to it. You can't 'censor' a public key. And Namecoin is already decentralized and has it's own system of how it works. Might want to read into it. It's pretty neat. It's similar to bitcoin.",
				"added": 1456964135
			}
		],
		"1_1PJVSC1FHaZpkkbZqVGJcMrKrYTGmYN6rM": [
			{
				"comment_id": 21,
				"body": "http://127.0.0.1:43110/13x71nc7fju6afMqpEPfcu3Gx9Z5hNhH48/?Post:5:How+To:+custom+ZeroNet+addresses+using+Vanitygen+\n\nThat's a quick tutorial on how to create a vanity address. It's worth noting that ZeroNet addresses are just bitcoin addresses. So any vanity bitcoin address tool should work.",
				"added": 1456973466
			},
			{
				"comment_id": 22,
				"body": "You can also get a [name].bit address. Which is done through namecoin. Such as my blog site http://127.0.0.1:43110/kaffie.bit",
				"added": 1456973538
			}
		],
		"1_1CNWTRN6cn761Wyb4eauhUU8wiKgGSTMC7": [
			{
				"comment_id": 23,
				"body": "I have listed a search engine, along with various other beginner tools over on my blog: http://127.0.0.1:43110/kaffie.bit/?Post:2\n\nZeroSearch is probably what you're looking for.",
				"added": 1456979759
			}
		],
		"1_1Ch2Q1jPeM6pspyNZ28AA73v51wjYLSd3q": [
			{
				"comment_id": 24,
				"body": "Yup. Probably due to the amount of publicity Play got.",
				"added": 1456982133
			},
			{
				"comment_id": 31,
				"body": "> [fastidious](#comment_1_15jEDpgRFYsMrJnwoadsaxkF3uoDoajaZS): What is Play?  I came here from HN (Hacker News).\n\nhttp://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp\n\nIt's pretty much the thing most people came here for.",
				"added": 1457010897
			}
		],
		"1_19qzd1DkCVqK753BX35iXU439DiusNCpCA": [
			{
				"comment_id": 25,
				"body": "That's the idea. You can delete the sites or pause the seeding if you want. But if you don't, it'll seed all the sites you visit while Zeronet is running.",
				"added": 1456996628
			}
		],
		"2_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ": [
			{
				"comment_id": 26,
				"body": "> [antiphase](#comment_7_1NoRNknY1JbJ8nMdn88LwczyMDFnR1GtNw): So far I've only seen two gateways:\n> \n> http://bit.no.com:43110/\n> http://zero.pags.to:43110/\n\nThere's also http://zeronet.crypt.cat:8080/",
				"added": 1457003281
			}
		],
		"2_1GCMDNMgJHvZJfdbD9ygDmpBdnVAobdJYg": [
			{
				"comment_id": 27,
				"body": "> [antiphase](#comment_10_1NoRNknY1JbJ8nMdn88LwczyMDFnR1GtNw): I see ZeroNet as an ideal platform for independent and crowdsourced content in a way that the centralized Web could never get quite right. We might see the rise of a Web closer to the one originally envisioned by Tim Berners-Lee, rather than the commercially-dominated horrorshow the Web is now.\n\nHands down the best thing about ZeroNet at the moment is that all the sites are independent little sites rather than giant bandwidth hogging corporate sites. I've honestly read more blogs and visited more random small info sites here than I have in the past few years on the regular net. It's just so easy to publish a site and have it seen by a few people.",
				"added": 1457004362
			}
		],
		"2_1GCsW9TFfjDsvcdmKPADq1n8Q3ha72UtDQ": [
			{
				"comment_id": 28,
				"body": "I'm a big fan of python. It's pretty much magic.",
				"added": 1457008173
			}
		],
		"3_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 29,
				"body": "> [antiphase](#comment_21_1NoRNknY1JbJ8nMdn88LwczyMDFnR1GtNw): Works for me. Tried clearing browser cache?\n\nNope. I also tried incognito and using another browser. I tried restarting zeronet, deleting the site and redownloading, changing my id to 'unique for this site' and then back, etc. Every other site works fine for posting. It's just that one chat room.",
				"added": 1457009974
			}
		],
		"2_15ymkjUYJS6tjUC35AekGMExZMN6iks8ma": [
			{
				"comment_id": 32,
				"body": "I'm on mac and run zeronet through the terminal with the pre-installed python. Just navigate to the folder and then 'python netzero.py'. I didn't install python through homebrew at all.",
				"added": 1457051207
			},
			{
				"comment_id": 34,
				"body": "> [theta](#comment_5_15ymkjUYJS6tjUC35AekGMExZMN6iks8ma): Sorry for a stupid question but I have almost never used terminal before installing homebrew. \n> How do I navigate to the folder?\n\n'cd [foldername]'. Use 'ls' to view files/folders in the current directory. Personally, I have my computer configured so that I can open a terminal window or tab that's already in the directory I choose with the UI. I forget how I set that up though.",
				"added": 1457052338
			}
		],
		"1_1CcJZEvu57ZqSDjWDEJCAGEWzHQ7uXKKNR": [
			{
				"comment_id": 33,
				"body": "There's already a chrome extension that beautify's the URL: https://chrome.google.com/webstore/detail/zeronet-protocol/cpkpdcdljfbnepgfejplkhdnopniieop",
				"added": 1457051294
			}
		],
		"2_1KJFB4SEHaHCY11HMKsMGyth1mXKb3R5oY": [
			{
				"comment_id": 35,
				"body": "> [testingzeronet](#comment_1_16rGP2GvZAi4dMjCFGvB7BzriWwZUaYW4v): ZeroSearch seems like the one with the most results.  Kaffeine's is a clone of zerosearch with slight changes in the source code and fewer indexed sites, I'm not sure why anyone would prefer it to zerosearch.\n> Bwoi doesn't look like it has been updated in a while, but it does have an original source code. It only has 139 results though, around half as many results as ZeroSearch.\n\nZeroSearch was the first one. It uses a mix of a central authority list filled by it's dev, along with a collection of dev approved user submissions. At the moment, the index count is wrong, since there's several sites indexed multiple times. IMO it's not very functional, but it was what we had to work with for a long time.\n\nKaffiene (my search engine) is indeed a clone of zerosearch. I removed the user-submission aspect, since it just queued them up without adding. However, when I finished cloning it, Kaffiene had an identical amount of sites. I then took the liberty of adding a few more. I noticed earlier today ZeroSearch added quite a few as well. IMO, Kaffiene is more usable, and provides more or less all the same sites.\n\nBwoi is a new one that only indexes and searches the ZeroName sites.\n\nPerhaps I'm biased, but I'd say usability goes: Kaffiene > ZeroSearch > Bwoi.\n\nEither way, I'm planning on continually updating Kaffiene with new features/results. I'm currently looking into how to automatically grab new sites to index. As always, I intend to keep functionality and quality search results as a top priority for Kaffiene. Which are two issues I constantly have trouble with on the competing search engines.",
				"added": 1457060036
			},
			{
				"comment_id": 36,
				"body": "> [oxilic](#comment_45_1PNyuY1iZqXBpft4ArouqcnE4pNRGYij5i): The sites needed to be manually checked to prevent spam, so they were added to a queue.  How is that worse than your current way of receiving sites through zeromail?\n\nIt's not. A user request system is nice, but it's ultimately useless. There's no reason to have a queue system that's mostly for the dev of the site taking up bandwidth and site storage space. It'd work better if users of the site could vote on 'good' sites. But as it stands, that entire functionality is useless without an active dev. There's the implication that the queue is autochecked when it's not. Making it more or less the same as the other sites.\n\nPersonally, I removed this because it's dishonest (the queue is equivalent to just asking the dev to add the site) and it takes up space. it also makes the site clunkier. It's not a fault for having it, but I just see no point in it. ZeroSearch honestly has much bigger problems than doing something with the queue system.",
				"added": 1457060686
			},
			{
				"comment_id": 37,
				"body": "> [oxilic](#comment_46_1PNyuY1iZqXBpft4ArouqcnE4pNRGYij5i): So then you replaced it with another user request system?\n\nHuh? No. Kaffiene at the moment does not have a request system. It has a note to message me if you don't see your site, but there's no actual request system. I'm confused at why you're trying to find fault in that. Functionally, it's identical. I just removed unneeded code.\n\n>Doesn't the same apply to yours?\n\nMine doesn't have a request system at all. But yes, mine is working off a central authority list managed by me. IIRC, every search engine is equivalent in this regard at the moment.\n\n>Again, same goes for yours. You kept the same site and just changed the dev.\n\nI cloned the site, sure. But it's not really the same any more. And won't be in the future.\n\n>As I see it, you basically cloned my site, changed a couple lines to make it show the tags and remove the search limit, added your name on it and claimed it as your own. How is that in any way not dishonest.\n\nI explicitly stated I cloned it on my blog. Cloning websites is a feature of ZeroNet. Either way, in the next revision of the site I'll be getting rid of most of the existing code. My main intention was to provide a more functional ZeroSearch. Which I seem to have accomplished. I'm confused at why you're angry. If you don't want your site cloned, don't upload it to ZeroNet. Anyone is free to clone Kaffiene. I have no problems with that. I just want a functional search engine. Kaffiene was originally made for my own personal use. But I figured I might as well upload it for those who want it. People are still free to use ZeroSearch. For all I care no one *has* to use Kaffiene.",
				"added": 1457063389
			},
			{
				"comment_id": 38,
				"body": "> [ripper234](#comment_1_1MxdAjWgnqwCaunGHmhY39tVR51qV3peJL): Integrate it into Zeronet homepage!\n> Also, pagerank.\n> https://medium.com/world-bug-repository/zerosearch-a-google-for-the-decentralized-web-b940ee66d9f3#.qng13v1fi\n> Also, are you looking for investors?\n\nAt the moment, there's no search engine that accurately reflects what that article is talking about. Not ZeroSearch. Not Kaffiene. Not Bwoi. A true search engine ala google will probably have to wait until merger sites are a thing.",
				"added": 1457064958
			},
			{
				"comment_id": 39,
				"body": "> [war59312](#comment_4_1PXHuyMr4g7zLeVr6yAgfDQJBkFsUqL1V1): Zero Mail is listed twice:\n> Zero Mail - mail, p2p, messagingZero Mail - mail,p2p,messaging\n\nThere's a lot of duplicates. This is what happens when you copy+paste DB's without checking the entries.",
				"added": 1457070011
			}
		],
		"6_1MxdAjWgnqwCaunGHmhY39tVR51qV3peJL": [
			{
				"comment_id": 40,
				"body": "> [ripper234](#comment_6_1MxdAjWgnqwCaunGHmhY39tVR51qV3peJL): I posted about Synereo sometime ago in ZeroTalk, which I supposed is one of the sites you index.I searched for it now, and couldn't find it.\n> Is this a bug? What am I missing?\n\nIs there a Synero ZeroNet site? ZeroSearch only indexes ZeroNet stuff.",
				"added": 1457073629
			}
		],
		"1_1JmMttAN9hgVWw5qiFuxybkVm3h7LqbSNr": [
			{
				"comment_id": 41,
				"body": "No. Those are centralized sites only accessible through TOR. ZeroNet is completely different.",
				"added": 1457095490
			},
			{
				"comment_id": 42,
				"body": "> [minigwar](#comment_1_1JmMttAN9hgVWw5qiFuxybkVm3h7LqbSNr): Still new, trying to learn, thank you!\n\nTo clarify (because it sounds like you don't know what zeronet is), zeronet is simply P2P decentralized websites. You *can* have darknet style stuff and markets and things like that. But that stuff isn't here. Those sites operate like regular websites, they're just hidden behind the tor network.\n\nZeroNet is different, the sites themselves are decentralized and distributed amongst the users, instead of accessing a centralized source.\n\nWhere you might be getting confused is that ZeroNet has *optional support* to route your traffic through the tor network to hide your IP/traffic. However, the sites themselves are still the same.\n\nIf you're looking for typical darknet/tor sites, you'll want to go look at TOR itself: https://www.torproject.org",
				"added": 1457095731
			}
		],
		"1_1D7uESYtAKV36MVPGJZXuE7LUKbLwfo4dX": [
			{
				"comment_id": 43,
				"body": "That sounds about right. Though it's worth noting that you can easily backup the data to prevent it from being deleted. And, unless it's encrypted, it's just stored as plain text, meaning you can easily look at it or repost the content.",
				"added": 1457144452
			}
		],
		"2_1KMxiVcvnJ2vFFGWNYhujgFNWYvNrxdVmo": [
			{
				"comment_id": 44,
				"body": "https://popcorntime.sh\n\nIt's already back.",
				"added": 1457155650
			},
			{
				"comment_id": 47,
				"body": "> [dude](#comment_13_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): Be cautious - there are some malicius forks - https://i.imgur.com/cRBrr6z.pnglink from https://torrentfreak.com/popcorn-time-fork-claims-official-relaunch-after-mpaa-shutdown-160225/\n\n.Sh is the legit one, from the guys who ran the .Io fork. Any others are 'unofficial'. Your reference image isn't quite correct, as the ag build is safe, but the guys who run it did some shady advertising/pr. And there's no real reason the ch one should be trusted. It's a community build like the rest of them are (besides sh).",
				"added": 1457177869
			}
		],
		"1_154jAWx5PDRmvF4txGHo4Edw1BpduhDyvw": [
			{
				"comment_id": 45,
				"body": "> [oracle](#comment_140_1ED3Ho3kmzaKiECtyuqSjDpoE47rKuXeP)\n\nWhile I personally think it's easy enough to start a site here, I think you're right. At the moment there's an absurd amount of 'personal blog's that have nothing but the basic design, and maybe a single post or two. It's ridiculously easy to start a site, but not follow up and do anything special with it unless you know how to code and/or don't mind getting messy.\n\nIt basically results in a few well-made sites, and a ton of identical silly blogs. Which isn't really all that fun for much of anyone, haha. Gotta have more dynamic content and more active users.",
				"added": 1457165895
			},
			{
				"comment_id": 53,
				"body": "> [muja](#comment_54_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr)\n\nI think you're missing the point. Oracle's talking about people who normally *wouldn't* go out and make a website. Those millions of people who just want to click a button and have their content appear on the page. Markdown is fine, as we see people on reddit use it just fine despite having no coding experience. However, how many of those users would, say, be comfortable digging into the html and javascript of a site to customize it? Hell, even a lot of reddit *moderators* don't care to do that and just copy+paste important stuff they like (full themes, generators for stuff, etc).\n\nAnd back in the day with myspace we saw a similar thing happen. People visited site generators to theme their site, rather than digging into the html/js. I see ZeroNet quite similarly to how Myspace or even something like Geocities was back in the day: where everyone has their own little site customized to their taste.\n\nHowever, I *do* see this as an opportunity to educate people on how stuff *actually* works, and get them digging into code and learning about how websites work, rather than continue to rely on buttons.\n\nAll that being said, I love markdown. It's fantastic. It should honestly be a standard.",
				"added": 1457268707
			}
		],
		"4_1EUyJtat7mbu5wMcR6nrJTPBBRons1mtMA": [
			{
				"comment_id": 46,
				"body": "As long as the ZeroNet python script is running, the sites will be updated. Even if the browser is closed.",
				"added": 1457176871
			}
		],
		"2_11pADbvn3XmFZ5sbM9ZANRb5Gv9igHLCF": [
			{
				"comment_id": 48,
				"body": "Search Engine: http://127.0.0.1:43110/search.kaffie.bit\nBeginner's package: http://127.0.0.1:43110/kaffie.bit/?Post:2:ZeroNet+Beginner’s+Package+\n\nZeroNet is sort of like the regular internet. There's websites, search engines, forums, etc. It's just that the way it's all handled is different. Did you bother to read the ZeroNet website? https://zeronet.io\n\nIf you have any specific questions, feel free to ask.",
				"added": 1457186207
			}
		],
		"1_1ELh3yaiakmeDvLLUhzPDKixiNaqGUYzNh": [
			{
				"comment_id": 49,
				"body": "> [henryjekyll](#comment_1_1KXon73f8GWeRj8GSoMBQCJ3kNdxkmzQ9v): Does anyone have an idea of how private this is? I mean: in my country torrenting is illegal, so I always have to use a proxy to use my torrent client. Is this also necessary here in ZeroNet? are the real IPs shared somewhere? Is there any extra precaution I should take?\n> Thanks\n\nZeroNet does not hide traffic. Which is why there's included  Tor support, and if you're overly cautious, you might want to use a VPN. Though I'm confused. You say 'torrenting is illegal'. Do you mean the protocol itself? Even companies like Blizzard and Microsoft use torrents to distribute their software and updates. And plenty of legal content is distributed through it. On top of that,  torrents themselves can be used for plenty of legal activities, like browsing ZeroNet.\n\nIf you're *actually* questioning about 'Play', then treat those torrents exactly as you would torrents you get on the clearnet. Because that's literally what they are: reposted magnet links. They seem to be all Rarbg links. So if you use a VPN or w/e for those, then you'll obviously want to use it for the movies you get off Play.\n\nZeroNet itself does not actually torrent the movies. Unless, of course, a movie is included as part of a website that you connect to (at which point the site would take a long time to load). It also wouldn't be prey to the typical ways that companies catch people torrenting (through looking at the IP swarm), since ZeroNet is it's own network and doesn't connect to people outside of it.\n\nIf you're planning on using ZeroNet itself (not using it to mirror links) to do illegal things, then you might want to get extra protection.",
				"added": 1457249159
			}
		],
		"2_1Hcc6FX8CaRnXcGC4EYZ4NjrR2yfxuUHW8": [
			{
				"comment_id": 50,
				"body": "Same way you get *any* torrent to play. You either need to download it with your favorite torrenting client, or you need to get a software that streams torrents.",
				"added": 1457249559
			}
		],
		"4_1LRrd96P7FiTcsyNXVzPM5jtpQoH1B4gYf": [
			{
				"comment_id": 51,
				"body": "They can't be forced to remove it if they don't have the private key. Just delete the private key, and bam. No one can take down the site; not even the author. Of course, that'd prevent updates as well, but that's solved by simply re-verifying your public user key and associating that with a new site.\n\nAlternatively, everyone can backup the download of a controversial site.",
				"added": 1457256219
			}
		],
		"1_17oYQdLkvyzEVPH3hXRtK3ru4FLNKZUD3b": [
			{
				"comment_id": 52,
				"body": "That's the thing about decentralization: you can't fight spam or other 'undesirables.' That's sort of the whole point. If you could, the same system would be used to fight against slightly less 'undesirables', and slightly less, and so on. Where is the line drawn?\n\nAs for spam, there's already systems in place to block users from posting to your site. And with 'merger sites' I imagine it'll be possible to have block-lists of known spammers.",
				"added": 1457266419
			}
		],
		"1_1MdNLKFDGufjyYSkH2vb4dnPHsao3ZoQJ5": [
			{
				"comment_id": 54,
				"body": "You can find the source code in the site folder: '1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp'. Just clone the site and populate the list however you please. From a glance, it looks like there's tools behind the scenes to help manage the various lists, but you could easily write your own, modify the site, or simply do it by hand.",
				"added": 1457311461
			}
		],
		"3_1HcK5Hw1rPZeYdgTmqJGrVG2tSyR9Ke2Gt": [
			{
				"comment_id": 55,
				"body": "I'm confused. What seems to be the issue? All I see is a link to an image on clearnet, which shows an 'index.html not found' page. How is this a bug? That the site didn't properly have it's index.html set up?",
				"added": 1457394750
			},
			{
				"comment_id": 56,
				"body": "> [oxilic](#comment_49_1PNyuY1iZqXBpft4ArouqcnE4pNRGYij5i): That image had a tracker, so the guy that uploaded it has your IP (or your vpn's).  There's no bug, the title is just there to get people to click.\n\nI don't see how that's an issue... It's not like I don't visit clearnet sites that do that anyway. Reddit, Google, Facebook, etc. all track my IP.",
				"added": 1457399453
			}
		],
		"1_18x3cTfnPkGixpMrrWJQDxtgyT2hDviZVP": [
			{
				"comment_id": 57,
				"body": "Just use a proxy: http://127.0.0.1:43110/zeroproxies.bit",
				"added": 1457424168
			}
		],
		"6_1Kg7CXZM5h3wTPENsTDwWUmRBf9VhYy2cW": [
			{
				"comment_id": 58,
				"body": "> [moscar](#comment_2_18x3cTfnPkGixpMrrWJQDxtgyT2hDviZVP): And we need a search engine for 0net\n\n[There's several.](http://127.0.0.1:43110/search.kaffie.bit/?q=%5Br%5D%20search%20engine)",
				"added": 1457424348
			}
		],
		"5_1EMpuiFM1NLZmAVyoAWnwi8VwiZVV4dcnN": [
			{
				"comment_id": 59,
				"body": "Seems like a lot of bias :P. But to answer the question, I'm a *huge* fan of personalized web. And I think decentralized publishing is the future of that. You get what you follow, and it's all stored locally and easy to access. Updates get shared directly with you and other people into the same stuff. Amazing. I don't have much experience with those other things, but decentralized stuff is usually pretty icky and clunky. Like bitcoin. Amazing idea, but makes me not want to touch it with a ten foot pole. ZeroNet is easy and not really all that scary or clunky. You can just jump right in.",
				"added": 1457438934
			}
		],
		"5_1KwTTgPRSTHFmmJAFBt6kQfdyNeSM5KJuH": [
			{
				"comment_id": 60,
				"body": "Eh. It still misses quite a few things:\nhttp://localhost:8080/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D (different port)\n\nbit.no.com:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D (proxies pointing to zeronet sites)\n\n1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D (raw zeronet addresses)\n\nzero/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D (raw zeronet address with chrome extension zero/ prefix)\n\nsearch.kaffie.bit (raw .bit domains for chrome extension)\n\nzero/search.kaffie.bit (raw .bit domain with zero/ prefix)\n\nI personally came up with this regex `[a-zA-Z0-9]{30,34}` to grab all the raw addresses. I still would grab long clearnet domains, but I was mostly just using it to check for duplicate entries in Kaffiene. Really what you're after is a way of grabbing .bit domain names, and bitcoin addresses. I'm sure people have already come up with great ways of doing that.",
				"added": 1457484804
			},
			{
				"comment_id": 61,
				"body": "> [pycole](#comment_60_1KwTTgPRSTHFmmJAFBt6kQfdyNeSM5KJuH):  Right now, I'm simply trying to write a regex that prevents a forum from accepting a non-zeronet url. I'm not dealing with proxies, custom port setups, or the chrome extension. The url forms my expression accepts right now are meant to be usable by as many people as possible--just click and go.\n\nYea, the different port one I haven't seen too often. I *have* seen 0.0.0.0 links though. And I *have* seen ones for the various proxies, along with just the raw address itself. If you want it 'click and go', you'll probably want to reduce the links down to the raw address, and then form the clickable link based on what the person's using. I made Kaffiene do this, so that it appropriately provides the correct links depending on how you're accessing the site. All I'm saying is that if you're trying to get people to submit sites, it's important to check for all possibilities. Especially when it's easy to do so.",
				"added": 1457489043
			}
		],
		"1_1PnCqnnZscQNPpRmHHZ7UfBpv2oZoqejMB": [
			{
				"comment_id": 62,
				"body": "I don't know how the P2P backend works, but technically this should be possible. Other users on the same wifi/router/network should be able to be peers. Though, that'd require a lot of ZeroNet users to be connected locally. Which I can't imagine happens often.",
				"added": 1457525508
			}
		],
		"2_1DFDjUGJdSp1kMuFq1AtNS9ZWmkVtbp947": [
			{
				"comment_id": 63,
				"body": "> [pycole](#comment_66_1KwTTgPRSTHFmmJAFBt6kQfdyNeSM5KJuH): Wait...Google's tools can observe Zeronet? Does that mean Google has installed Zeronet on one of their servers?\n\nNo. Google analytics are a bit of javascript you put on a page. When someone visits that page, it reads the google analytics link and connects. Google then takes that traffic info and provides it to the owner of the site. Google itself doesn't have anything to do with ZeroNet.",
				"added": 1457582627
			}
		],
		"1_145RMBphDHxfAeUP5YPjozVkSMSw1GppVA": [
			{
				"comment_id": 64,
				"body": "> [erkan](#comment_33_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): Only the English wikipedia consists of ca. 49 GB database alone :-) \n\nOptional files :P",
				"added": 1457616957
			}
		],
		"4_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 65,
				"body": "> [shift](#comment_52_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Search engine base on javascript/servers (like zero search) is bad idea for that network, i advice you look to Yacy but only to technology of yacy search. If we make search plugin for zeronet (python) it can indexes all user sites ( sites what user seeds) and broadcast index to DHT network (like yacy do) and that plugin should have zero api, so if you want to find some information in network you send request to DHT and recursively find what you want (like yacy do). \n\nThis won't happen. I was talking with nofish about crawling sites. He doesn't want anything that could automatically 'reveal' sites that may be intentionally hidden. So any sort of crawling, or DHT searching, or w/e is off limits. Which means a few things: 1) it won't ever be included as a python script, meaning it has to be JS, or a separate download. 2) It won't have native support, meaning that the results would be inherently limited. 3) There's still no way to grab content, making the search practically useless.\n\nI think the actual future of the search engines is probably going to be merger-sites, where various site indexes link out their list of sites, search engines grab and merge those, and then search through them. That way, users can select which indexes they want to search through, sites can be added by any participating peer, and it still works in the manner that's intended by ZeroNet.",
				"added": 1457657875
			}
		],
		"3_1NzjwWNcVjsX1ndBgkgC1EM5EUzMACGm8L": [
			{
				"comment_id": 66,
				"body": "You can directly edit the all.js file if you want. But it's generated automatically from all the .js and .coffee files if you run zeronet in debug mode.",
				"added": 1457672243
			}
		],
		"1_159CpJLBxHMf7Nx1SpgX2HZhVEPSKpSPc6": [
			{
				"comment_id": 67,
				"body": "There's [play.](http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp) It's a site that provides magnet links to movie torrents. Just stick them in a client that can stream torrents, and you should be good to go. Not really like netflix though...\n\nVideo streaming won't be a thing on ZeroNet for a while. Since each file is only downloaded from a single peer, rather than downloaded in a torrent-like fashion. Perhaps if someone wrote a client-side streamer for magnet links, then hooked that up to play to get a popcorn time style site.",
				"added": 1457918200
			}
		],
		"1_19R2USgb9vPyg1jPQEJkGVoBwDuDcEmHRF": [
			{
				"comment_id": 68,
				"body": "After a quick read through, it *does* seem possible to use webtorrent in ZeroNet. It's all javascript, so there's no reason it shouldn't work. However, it does seem to use special torrents, rather than the typical ones. Not sure what that's about.",
				"added": 1457919622
			},
			{
				"comment_id": 71,
				"body": "> [musickiller](#comment_87_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): \n\nAs my previous comment mentioned, I played around with it for a bit. No external plugins or anything was needed. Regular movie torrents from play didn't seem to work with my test, but I dunno if that was just shoddy example code, a shoddy connection, or just a bad torrent. Or if it legit didn't work with those torrents. The web torrent site says you need special \"webrtc enabled\" torrents in order for them to work. And those torrents need to be seeded by a 'webrtc enabled' client. Of which there's seems to basically be none.\n\nFrom what I can tell, it didn't at all store the file on my computer after the test. Presumably it was in the cache. Seeding doesn't happen after the user leaves the page. So all stuff would either have to be explicitly seeded with an external app, or the users would have to remain on the page while they seed.\n\nThis would be fine if lots of people were accessing the content, like popular movies on play. It's not so good for a video sharing site like youtube or vimeo which might have unpopular videos.\n\nIf it worked for regular torrents (my quick test showed it didn't), then it'd be brilliant for it. Just have the users upload magnet links/torrents, and then stream them. You can already do this with regular torrents, along with a streaming client like Playback.\n\nIPFS seems like a better way to go, but I found it was *really* slow to stream content. I dunno if that was because I didn't set it up right, or if it was just legit slow.\n\nPersonally, I like the idea of *regular* torrents, so that users can freely use a torrent client of their choice, or use the built in one. But AFAIK there's no JS tool to stream them yet.",
				"added": 1457950813
			}
		],
		"1_18fC8bhLr1t8PFe2PGe5JJfvYsqxWD898W": [
			{
				"comment_id": 69,
				"body": "You turn the content into optional files. Or you delete old unneeded content.",
				"added": 1457926612
			}
		],
		"1_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": [
			{
				"comment_id": 70,
				"body": "Huh. I was hoping to use the external access to the stats page to grab a list of sites seeded by the various proxies.",
				"added": 1457926891
			}
		],
		"3_1MahZJTzjoEMMCv2jBReDWhyNGRhN5tvDq": [
			{
				"comment_id": 72,
				"body": "Domain names lack the .bit and are all lowercase.",
				"added": 1457950947
			}
		],
		"5_1LRrd96P7FiTcsyNXVzPM5jtpQoH1B4gYf": [
			{
				"comment_id": 73,
				"body": "I can't seem to connect. Can't connect with the bit.no.com:43110 proxy either. Content.json failed to download.",
				"added": 1457955428
			},
			{
				"comment_id": 74,
				"body": "> [ekaterina](#comment_115_1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD): Worked for me. Do you have Tor working? Maybe it has only Tor: Always peers right now. bit.no.com doesn't have a working Tor, so it can only download from peers who have Tor but don't use the Tor: Always setting (Tor: OK instead), those peers work as a bridge between full Tor users and normal users as I understand it.\n\nI got it working. No tor for me. I'm guessing that was probably the issue. Either way, I've started contributing to the site. I already made a page [for Kaffiene.](http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:kaffiene)",
				"added": 1457956399
			},
			{
				"comment_id": 75,
				"body": "> [basxto](#comment_32_1PVcdu7USZH2kHMETbqDYLPjJZKCDWM52k): Please support [[wikisite|alternative naming]] and #tags / categories\n> \n> Proposal: use [☇]() to link also to the real address if you use a .bit-address\n> \n> made ZeroPolls\n\n\nJust an FYI, the capital urls lead back to the homepage. I copied the content and put it into the proper [zeropolls](http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:zeropolls) page. Should probably rollback the homepage.",
				"added": 1457957027
			},
			{
				"comment_id": 76,
				"body": "> [cub3](#comment_37_1LRrd96P7FiTcsyNXVzPM5jtpQoH1B4gYf): Thanks kaffie, I already caught a few errors, I'll add this one to the list.\n\nI'd also like to request a 'recent changes' section, if that wouldn't be too much trouble. It's annoying to see the site updated and then have to click through each page's history to see what's changed. Having a central page to see where changes occurred would make it easier to revert any malicious changes, or to fix newbie mistakes.",
				"added": 1457962164
			},
			{
				"comment_id": 77,
				"body": "> [ekaterina](#comment_119_1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD): \n> I'm afraid that line will confuse and misinform new ZeroNet users. Sites are not cloneable by default, it is completely optional for a site creator to allow cloning, \n\nI added a page on cloneable zites. But yea, that line is a bit misleading. It's worth noting that sites *can* be cloned without setting cloneable to true. You just have to manually create the site and copy the files over. Which is what I meant to convey. It could probably be worded better.\n\n>and there is no such license in place that forces people to make their ZeroNet sites or \"zites\" open source as far as I'm aware, but to me that line implies both of these things (not a native speaker though).\n\nZites are open source by default. The entire source is fully readable and able to be copied and modified. Perhaps the copyright isn't that way, but the technology is. I'm not at all knowledgeable of the law, so if something's wrong here, feel free to correct it. AFAIK, 'open source' merely means you can see the code and compile/publish/etc content using it. Perhaps @nofish can chime in and explain what's up legally here.\n\n> I'd prefer a formulation like this \"Zite owners can optionally allow cloning of their Zites\", maybe with one or two examples, and then just link the word cloning to the cloning article which explains the concept in-depth.\n\nYea, that might be a bit better. I'm unsure of how to phrase it that clearly explains the sites can just be copy+pasted, backed up, etc. And also have the cloneable option.",
				"added": 1457964692
			},
			{
				"comment_id": 78,
				"body": "> [ekaterina](#comment_120_1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD): \n\nWell... not *every* site is open source. For example, you cannot view google's search code. It's blackboxed because of server-side stuff (php, python, perl, etc). This is part of what makes ZeroNet unique. There's no 'hidden code'. It's all out in the open for people to read/copy/etc.\n\nI've always used the term 'open source' in this manner (that you can read all of the code for something). But indeed, just because something is open source (that is, you can read the code) does not mean it's inherently licensed to be freely redistributed/modified.\n\nWhen I joined ZeroNet, I figured the 'clone able' option was more for ease of use: to default the data and make it easy for sites to be copied, rather than the long way around. Even the official [zeronet blog](http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:3:How+to+have+a+blog+like+this) explains how to copy a site without using the 'clone' button. This method works on any ZeroNet site.",
				"added": 1457965564
			},
			{
				"comment_id": 80,
				"body": "> [ekaterina](#comment_121_1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD): \n\nBut are they actually a part of the site? From what I can tell, they simply automate what the site owner would normally do. So while indeed those parts are hidden, they aren't *really* a part of the site. They're more like automated site owners. You can't, for instance, have a site use AJAX and pull information from a php script that then grabs from a database.\n\n> [basxto](#comment_37_1PVcdu7USZH2kHMETbqDYLPjJZKCDWM52k): You instantly know when an article is authored by @Kaffie.\n\n:P. To be fair, I've included ZeroSearch in some articles too.\n\n> -> https://www.gnu.org/philosophy/categories.html\n> It does mean you can redistribute it, but the name itself does not imply that. It would be best for the network to release all zites as free / libre open source software though…\n\nHuh. It'd be kind of silly to have a decentralized web where you're not allowed to copy things.",
				"added": 1457966131
			}
		],
		"1_1MuqWEiJ8VCCZMHZ6hcJW35RMEgm7VVED5": [
			{
				"comment_id": 79,
				"body": "Yup. Seeing it perfectly fine.",
				"added": 1457965826
			}
		],
		"2_17n5jg4bBEoWodXDf8L4Y2u88ShagS272Y": [
			{
				"comment_id": 81,
				"body": "Order is determined by the visitor. The visitor can easily spoof the timestamp and sign their content. This'd put it as an earlier 'transaction' or post. It's just that in most sites, there's no reason to make your posts older than they are.\n\nThere's nothing special about ZeroNet sites. It's just HTML/Javascript with an SQLite database. There's no way to enforce proper timestamps.",
				"added": 1458007273
			},
			{
				"comment_id": 82,
				"body": "> [bukaking](#comment_4_17n5jg4bBEoWodXDf8L4Y2u88ShagS272Y): Thanks! I guess maybe it might make solutions more apparent if I just say what I am interested in doing. Talking about cryptocurrencies was rather misleading.\n> I basically want to try and create turn based games, using internal messaging (like ZeroChat) to publicly update the state of the game to players and observers.\n> For my purpose it sounds like I can just have players use an incremental move number (0, 1, 2, etc), and if a player tries to cheat by sending \"double moves\" they will have to have signed both moves, which I guess could be detected and then the player will be considered forfeit by everyone watching the game.\n\nAh, this is completely doable. You can either just have the client check the moves and only display the latest/earliest (much like how [ZeroWiki](http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:home) only displays the latest update). Or you can use a server backend that visitors send messages to in order to submit their move. Something like ZeroID (to register unique names) or ZeroBoard (send messages to server which then posts for you).\n\nJust do this as you would any regular HTML/JS app, or introduce a python/php/etc backend if needed (though that removes the decentralization).\n\nDouble spend is still  an issue, obviously. Since the blockchain/bitcoin is the first solution to that problem. Cryptocurrencies are unique because they guarantee that the coin is unique and unable to be spent twice with no central authority. You either need a central authority to validate, or you need to trust the users (either client). The nature of ZeroNet allows someone to delete or change the content they've uploaded at any time. So that wouldn't really work well for a game, since cheating could happen. So you're probably stuck with either centrally checking it, or figuring out some other solution. Perhaps you could do a 'move verification' thing. Have 3 players in a game, and then make sure 2 of the 3 sign off on a move for it to be accepted. Bitcoin market places do this to ensure transactions aren't scams and to ensure things don't mess up.",
				"added": 1458013719
			},
			{
				"comment_id": 83,
				"body": "> [musickiller](#comment_92_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): I think it is possible to use NXT here, but that means 1 NXT per action. Not much at all, 10 NXT ~= 9 cents, but still money. But I think it's possible to compress data and send several actions per \"message\". You can define hundreds of actions for single message (1000 symbols?).\n> Pluses: you can keep all data you need in the blockchain, accounts also can be stored in NXT for securityMinuses: as all blockchain-based stuff, it is a standalone, several GB big application.\n> I think a server is a simplier solution, but it's good to know alternatives =)\n\nNXT is a cryptocurrency with a blockchain. I already explained that such a method is *the first* solution to that problem. AFAIK there hasn't been another one yet. It's either cryptocurrency, a central authority, or blindly trusting users.",
				"added": 1458032558
			}
		],
		"1_1H8igzd23YbSUqucNFPg25nKtNgcPcwssE": [
			{
				"comment_id": 84,
				"body": "> [jdoig](#comment_6_1D33SjywZjLd2QdRgzYMprcxZPva9FGZ3h): Would that not lead to crazy amounts of fragmentation? If Alice clones it to add her torrents and Bob clones it to add his do we not end up with 1000's of clones that add only a little content, or clones of clones that each leave the one before them redundant?\n\nWe already see this with blogs. Just run a Kaffiene search for 'blog' and scroll down to the less seeded results. A lot of them are blank with maybe one or two posts. The idea is the best ones float to the top. You can technically do this with ZeroNet *itself* as well. Just go to github and fork the project. Modify it as you want, and now you have two ZeroNets.",
				"added": 1458114510
			}
		],
		"6_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 85,
				"body": "Huh. So it sounds like what I'm thinking is already planned for development. That's great.\n\n>For decentralized freedom from ICANN, cjdns is the way to go, but we don't have ipv6 support yet.\n\nAh, I was thinking that might be an issue. I can't imagine adding ipv6 support would be difficult. But then again, I don't know shit about networking. Sounds like it'd simply be adding support for a different format of address.\n\n>ZN does use trackers, as seen here.\n\nYea, I spotted that shortly after I posted this. At the very least, the trackers can be edited to point somewhere that's not on the internet. And digging into it, it seems there's already support for local namecoin domain lookups (grabbing from the computer's namecoin db). It's just not enabled by default. That, and you can repoint the zeroname dns to whatever zeronet site you want. So that makes it easy to remove the reliance there.\n\n>DHT is a much more decentralized method of peer negotiation, although possibly less secure in this context (according to an old conversation I had with nofish, can't remember where).\n\nHmmm... Less secure? What does cjdns or the existing mesh nets do then? They have decentralized IP allocation even. Certainly they have something similar?\n\n>If you have a sturdy understanding of Python and data structures, please feel free to help out. If you have bitcoin, you can provide some monentary motivation here.\n\nUnfortunately I don't know anything about networking, and I'm unemployed and don't have cash nor bitcoin. I'm pretty comfortable with python though.\n\n---\n\nAs a side note, I was wondering if you knew of any light weight linux distros that come with the various P2P stuff preinstalled? Seems like another project that should be started, if it hasn't already. Having an easily deployable, lightweight OS that can connect to and help expand a decentralized meshnet+zeronet seems like it'd do wonders. Package that with a raspberry pi, or some other cheap PC, or maybe make it a liveboot USB and you've got an internet revolution kickstarted.",
				"added": 1458116753
			}
		],
		"10_14XxpXNGMLsyeQxikacrbQnAFXVyhN5Ngx": [
			{
				"comment_id": 86,
				"body": "> [veklin](#comment_2_1eAD3eu7XTTmz99sDLbfqmWbFjKKjC89w): This makes me think that if the search bar here was also added to Olist, then latter would actually become a makeshift search engine.\n\nWhy bother with a makeshift search engine when we have [actual search engines?](http://127.0.0.1:43110/search.kaffie.bit/?q=%5Br%5D%20search%20engine) A perfect decentralized search engine really can't be made at the moment. As we lack the tools to do such (an automated updating of site indexes is impossible without a centralized crawler). But for the time being, we have various search engines that work way better than simply adding a rudimentary search to 0List.",
				"added": 1458174506
			}
		],
		"10_1CMYxdit4qq9QGk9DYRu2ruRPd2YDGckH8": [
			{
				"comment_id": 87,
				"body": "Oh damn. Users can make subcategories? I thought only the ZeroTalk owner could do that. That's handy. Now all we need is a way to list the subcategories for each ZeroTalk.",
				"added": 1458174673
			}
		],
		"6_1NzjwWNcVjsX1ndBgkgC1EM5EUzMACGm8L": [
			{
				"comment_id": 88,
				"body": "Doesn't seem to work in safari.",
				"added": 1458177991
			}
		],
		"6_1KwTTgPRSTHFmmJAFBt6kQfdyNeSM5KJuH": [
			{
				"comment_id": 89,
				"body": "Wow. I'd trust my passwords and banking to this. The output is completely unintelligible. That ensures no one can read it but me!",
				"added": 1458185734
			}
		],
		"13_1CMYxdit4qq9QGk9DYRu2ruRPd2YDGckH8": [
			{
				"comment_id": 90,
				"body": "Upvotes, like comments, are written onto your part of the website. When someone views the relevant thread/post, it grabs the upvotes from everyone's folders.\n\nSo anything you upvote here on ZeroTalk will be in /data/<zerotalksite>/data/users/<youruser>/data.json or w/e. Sites are fully independent. If you copy a site folder, you get all the comments/upvotes along with it.\n\n>Could I easily add another votable category? e.g. like a downvote for example, next to the upvote button. (later maybe a combined up/downvote button)\n\nIf you own and manage the site, you can.",
				"added": 1458267972
			}
		],
		"5_1DcDDitsjFJohvwonPmpibRChmA7uGxqL7": [
			{
				"comment_id": 91,
				"body": "Not possible yet. AFAIK this would be an example of 'merger sites'. You *can* use an img tag, which is native HTML, and then put a link in there to a site, or something like ipfs. But if you try to do that with another zeronet site, I'd imagine problems would occur (due to the site not being downloaded, and iframe issues, and such).",
				"added": 1458274324
			},
			{
				"comment_id": 92,
				"body": "> [eventi](#comment_22_1DcDDitsjFJohvwonPmpibRChmA7uGxqL7): Something like this works, though:\n> curl http://127.0.0.1:43110/159bRwxjgvNGfhvXw1qzXsTPjenMzy2P4n/data/hello.json\n> I'm just looking to do that in my own zite\n\n? curl isn't javascript. And even running curl anyway just results in the ZeroNet wrapper. You'd still need to resolve the iframe/js in order to access the content. You *could* do this if you're sure the user has the image/raw file already downloaded. But that's still reliant on curl, and only works on certain files, not content embedded in the page. Not really a great solution.",
				"added": 1458300293
			}
		],
		"7_1KTjPe9MxoYkcXj78GuZgCcj3R3f3Twh7r": [
			{
				"comment_id": 93,
				"body": "5000+ users registered with ZeroID. Play has about 2000 seeds (from what I've seen). So 900 isn't really shocking.",
				"added": 1458473843
			},
			{
				"comment_id": 94,
				"body": "> [klauszimmermann](#comment_33_15QGRquMETTn5LnCHjTm1qa9eaXGtq7gpT): That is amazing! I remember some times last year and earlier this year where a well-seeded site would get something like 70 peers maximum, and look at how it is now!\n> I wonder what happened in late February that caused this explosion of peers.\n\nThe 'play' torrent site, probably. Caused a lot of people to learn of ZeroNet.",
				"added": 1458498976
			}
		],
		"15_1CMYxdit4qq9QGk9DYRu2ruRPd2YDGckH8": [
			{
				"comment_id": 95,
				"body": "> [crypton](#comment_44_17fgJ3tZjhM7HCkTkd5TWf2BLLWmhRKcXB):  Then invite all your \"supporters\" to join you there.  It's a waste to clog up general communication areas (or even introductory areas for new users) with hate and trolling vomit.  (my 2 cents)\n\nIMO this goes for *any* content not really suitable for the general ZeroTalk. There's already specialized sites for various operating systems, browsers, capitalism, socialism, debate, etc. Keep the general ZeroTalk to stuff related to ZeroNet and the related topics (programming/site dev, decentralization, p2p, etc).",
				"added": 1458521076
			},
			{
				"comment_id": 96,
				"body": "> [pycole](#comment_86_1KwTTgPRSTHFmmJAFBt6kQfdyNeSM5KJuH): Your personal site/blog is like your house: you can say whatever the fuck you want in it. If you and some others want to have a good laugh about that one minority joke you love or whatever, that's fine. You own the site, and it's your guests that leave (and stop seeding) if they get fed up.The general sites are like public parks: If you're being overly caustic, you may get shown the door. That's not censorship, it's you being asked to be less of an ass. The line between bluntness and decency is blurry, but being told to GTFO is a hint.\n\nTo add to this, there's a difference between presenting an opposing view (hitler was right, for instance) and talking about it in a decent humane way, and simply spamming shit and hating on people with no real room for discussion on a public forum.\n\n> [musickiller](#comment_93_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): And I thought we were building a cenzure-free network. Guess I was wrong.\n\nLast I checked, it's impossible to censor ZeroNet sites. That doesn't stop people from wishing to keep a civil atmosphere in particularly public sites. Again, refer to my previous comment. We have wonderful search engines, decentralized hosting, etc. so that you may share content that you please without clogging up public forums with hate.",
				"added": 1458542017
			},
			{
				"comment_id": 97,
				"body": "> [eichmann](#comment_3_1B7ef4NZMcDZm74M6CjkoztZAGKeCdaQfS): well, Heil Hitler. The Fuhrer did nothing wrong!\n\nYou're free to have that opinion. Just don't hate on people in public forums, and don't spam shit on every linked site (right now I see pro-hitler stuff on: ZeroTalk, ZeroWiki, 0list, amongst others). I'd definitely recommend a ZeroTalk clone if you really care to talk about that stuff. As I mentioned, there's various other forums up that help organize discussions.",
				"added": 1458547487
			}
		],
		"6_1LJMypJ67iEBwah82xwVVdB8SGZ1mwqgHQ": [
			{
				"comment_id": 98,
				"body": "The site will remain seeded forever by whoever chooses to seed it. If you own the site, you can push out an update with 'nothing' in the folder (literally just an empty site) and once people update their copy, it'll wipe it. That obviously doesn't protect against people backing up the site and cloning it though.\n\nIf you simply delete zeronet off your computer, or delete the site folder from your HDD, the site will remain seeded as it was when you last published.",
				"added": 1458819559
			}
		],
		"2_13BepSu3vkeSQB3ZWkCDg7Lu5w64tfpeTa": [
			{
				"comment_id": 99,
				"body": "> [thisguy1337](#comment_26_16bxMyoL49mWYhcZKBYVBT5zEFW9SQpiao): IMO it's not that big of a deal. Most users of Zeronet have a bit of common internet understandings and a phishing site likely won't get past many. And like pycole said, your site isn't shit without a .bit domain.\n\nWhat would you even bother to phish though? Authentication is all done through certs. User-content can't be copied, meaning clone sites will be empty (even if you manually copy+paste). I don't really see the point of why you'd do that.",
				"added": 1458858197
			}
		],
		"5_16bxMyoL49mWYhcZKBYVBT5zEFW9SQpiao": [
			{
				"comment_id": 100,
				"body": "Essentially you're just changing the content.json file of the site. So if that file is updated and you redownload it, your change will be undone. Other than that, I can't imagine any harm would happen due to it.",
				"added": 1458950761
			}
		],
		"2_1KSNSPNM5FTUwPJeyyHrLXek1dsumpnFm1": [
			{
				"comment_id": 101,
				"body": "index.html not found. Did you publish?",
				"added": 1458953131
			}
		],
		"1_13jLz92kNNVJPG2AgUr83SzTwfsS8RUrcG": [
			{
				"comment_id": 102,
				"body": "> [lifent](#comment_6_13jLz92kNNVJPG2AgUr83SzTwfsS8RUrcG): seem's these search engine can't index all contents, it's not full-text index?\n\n> [erkan](#comment_93_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): Perhaps it will come soon, who knows?\n> Full index needs space.Standard setting of a site here has 10 MB, which ofc, can be increased, which I then don't load. Better is: one can set \"optional file setting\", and files are loaded on request\n\nTo have accurate searching of content within the page, you have to have that content accessible. Google does this by essentially cacheing the entire internet. This is not really a solution for a ZeroNet site. Something like [Zearch](http://127.0.0.1:43110/163ZAwi5BcGBm6UEwdJF1pkcejDMCT1kAj) tried this, and it doesn't work out too well. One solution could be to have sites update a 'metadata' field in the content.json. Then all a crawler would have to do is grab that metadata and appropriately search it. But that requires site owners to participate.\n\nSo far, all the search engines (with the exception of Zearch) simply use curated tags. But perhaps there's a better solution. We'll see.",
				"added": 1458992622
			}
		],
		"20_1CMYxdit4qq9QGk9DYRu2ruRPd2YDGckH8": [
			{
				"comment_id": 103,
				"body": "For filesharing, there's IPFS and torrents.\n\nFor IRC, we have stuff like [ZeroMedia.](http://127.0.0.1:43110/zeromedia.bit/)",
				"added": 1460634323
			}
		],
		"1_19arYgVKguUamTqtYGu6T9FSUsr19CyEcG": [
			{
				"comment_id": 104,
				"body": "Sure. They'd just need to take advantage of new web tech like webrtc.\n\nAgar.io in particular connects to a backend server. So obviously we can't do something like that (unless it's centrally hosted). And updating the local site constantly to sync game state would be too slow. So a direct connection would be the best bet.",
				"added": 1462355104
			}
		],
		"7_1P8VJL2iKWfUB4hqQkrFdXCbC8RrimAZoZ": [
			{
				"comment_id": 105,
				"body": "That's... uh... technically not for ZeroNet. It's for *other* .bit/namecoin domains. [Like this.](http://wiki.opennicproject.org/dotBitTLD)",
				"added": 1462603170
			}
		],
		"2_1QFypqt7F76svWztFgeFB89ChFfAwsWBcJ": [
			{
				"comment_id": 106,
				"body": "Well ZeroTalk is just a messageboard. For talking. No guarantees anything on here will be 'useful'. If you meant ZeroNet in general, well... it's new and an entirely new tech. Which means that obviously there's not going to be a whole lot on here. From what I've seen it's mostly just blogs and message boards. There's some stuff like a wiki, a polls site, etc. Perhaps you should make something if you think there's something missing?",
				"added": 1463117236
			}
		],
		"4_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 107,
				"body": "Well there's [Play](http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/), which is just for movies and doesn't have user upload. And there's also [ZeroTorrent.bit](http://127.0.0.1:43110/ZeroTorrent.bit/) which has user uploads and is similar to ZeroTalk. What else are you looking for that these don't provide?",
				"added": 1470123285
			}
		],
		"1_1GARNBmKSxstSwbNZLVQLBCNwAtjxjheae": [
			{
				"comment_id": 108,
				"body": "> if it would be feasible to open a torrent site akin to kickasstorrents on zeronet with minimal hardware investment.\n\nThere's already a site like this: [ZeroTorrent.bit](http://127.0.0.1:43110/zerotorrent.bit). And yes, all websites on ZeroNet require minimal hardware, since the hosting is decentralized.\n\n>I'm asking because I find it hard to imagine how a site with a 'large amount' of user generated content can be decentralized.\n\nDepends on how much you're talking about. For reference, the pirate bay database comes in at 700mb or so, and contains: \"names, descriptions, comments, seeder and leecher info, date of upload, size info and quality marks (only for some torrents, before before TPB took it down).\" Remove the extra information and leave the magnet links and titles and you get down to 75mb. That's more than small enough to host on ZeroNet. Albeit, you'll likely need to use the 'optional files' feature that allows visitors to download/seed only some of the files (stuff viewed).\n\n>Ideally the site owner should not need to be online constantly for the site to run normally (only to update features or fix bugs).\n\nYup, ZeroTorrent is already like that.\n\n>So in order for the users to be able to login and add content without the 'central server', the user database would have to be available to every peer. In order not to compromise the privacy of the users it must be possible for every user to encrypt his own private user data into this user database. Also as admin of the site one might want to also look in on some of this private data. So maybe the private user data needs to be also encrypted using the site owners public key as a duplicate.\n\n>Is something like that feasible or a pipe dream?\n\nYou're essentially describing how the DB system works for ZeroNet sites in general. Keep in mind the 'login and add content' is something you literally just did here on ZeroTalk. Instead of a question, all you'd have to do is post a magnet link and some info. To quickly summarize how it works, each user has permission to upload a 'data.json' file with their contributions to the site. These json files are aggregated into an SQLite database which is then accessed by the site. Each user's contributions are only able to be modified by the user (and perhaps the site owner). And there's even options to make them completely encrypted private, like in the case of ZeroMail.",
				"added": 1470305457
			},
			{
				"comment_id": 109,
				"body": "I'm unfamiliar with btdigg, sorry. But in terms of ZeroNet, all you get is javascript that's ran by visitors of the site. Any automated maintenance (like crawlers and the like) either require a dedicated host that has access to ZeroNet, or for you to do it by hand.\n\nA quick example would be the echobot on ZeroMail. It's a python script running on a centralized/dedicated host that essentially acts as another user (such as the site's owner).  I actually have been toying with the concept of decentralized crawlers for my search engine [Kaffiene.](http://127.0.0.1:43110/kaffiene.bit) Though unfortunately there doesn't seem to be a reliable way of doing that. The choices seem to be either running a centralized backend that simply interfaces with zeronet, or relying on user submissions.",
				"added": 1470307489
			},
			{
				"comment_id": 110,
				"body": "Yea, I've heard of yacy. Obviously decentralized search engines (for anything) is possible if you have people running code for it. The issue is using ZeroNet as a platform to do that. The javascript for each site is ran like a typical website. Once you leave the site, the code no longer runs. See [ZeroTube](http://127.0.0.1:43110/1FUQPLXHimgCvYHH7v3bJXspJ7bMBUXcEb) for why that's an issue. The videos magnet links get uploaded, and while the user is on the page it seeds through webtorrent. But once they leave, the video becomes unseeded and effectively dead. On top of that, there doesn't seem to be a way to escape the site's sandbox, making it impossible to crawl clearnet for stuff anyway (not that users would agree, as many come to zeronet as an alternative web).\n\nYacy is able to do what it does because it runs in the background while users visit regular web pages. It logs that activity and crawls the visited pages. I thought up a similar idea for kaffiene: grab the user's list of seeded sites. Unfortunately this solutions was cockblocked by nofish, as grabbing a list of seeded sites is only for admin/official sites, making it impossible to use otherwise. For a torrent crawler, this method wouldn't work at all.\n\nOne solution might be to have a python script, or zeronet plugin that users can download and set up, that helps crawl for torrents or w/e else. They'd still be posted in the user-driven way, but it'd be automated. Perhaps that'd work?\n\nEither way, the big thing is that websites don't really have a backend here. It's just a frontend that's decentrally hosted. So trying to do backend stuff is likely going to have to be centralized (or you could come up with your own decentralized backend separate from zeronet).",
				"added": 1470310640
			}
		],
		"11_1FTFKztuv4Z5uy6iS83k9hB2xtS6yFnDxx": [
			{
				"comment_id": 111,
				"body": "> [bot](#comment_88_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb)\n\nThey mean for the location of zeronet's data. It'd be as simple as configuring a location to a different spot on the HDD. You can technically move the Zeronet folder itself to another location, but your site still has to be stored in /Zeronet/data or w/e. It has nothing to do with the sandboxing.\n\nThe issue I see is that you'd have to manually configure each site, or else keep the same folder structure for the sites which sort of defeats the purpose (unless you wanted the zites in /documents and the zeronet app in /apps). Though I do think a 'dev mode' to load a site from an alternate location for developing would be nice. That way you don't have to work on top of the live site while you dev.",
				"added": 1470359442
			}
		],
		"1_12xwWp1qTmxEXMxVxrG3AQKPk6MUWjQjM7": [
			{
				"comment_id": 112,
				"body": "There's currently a 'favorites' option, so your favorite sites get pinned up at the top of the homepage. AFAIK 'genres'/sections/categories are planned for further homepage organization.",
				"added": 1470433483
			}
		],
		"1_12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu": [
			{
				"comment_id": 113,
				"body": "Click 'follow in newfeed' when on the main ZeroTalk page (with all the threads). Then on the homepage, there should be a search box. Type your search and it'll search through all the stuff you're following.",
				"added": 1470433709
			}
		],
		"16_1CMjV2r4EBpFt8VCcWWZKDysZXPcPExRNN": [
			{
				"comment_id": 114,
				"body": "Check out [ZeroWiki](http://127.0.0.1:43110/0wiki.bit) for something like this. ZeroWiki logs the history of a page, displays the newest, allows multiple editors, etc. Though, obviously, it's completely public and anyone can change it. However, if that's not your speed, you can change in the site settings which users are allowed to upload things to the site, and what content they're allowed to upload. Alternatively, you can simply make the site itself modifyable by multiple people, so it'd be as if they all own the site, rather than doing the zerowiki thing, where you have people able to edit pages, but not the site itself.",
				"added": 1470433948
			}
		],
		"3_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6": [
			{
				"comment_id": 115,
				"body": "> [border0464fred](#comment_21_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6)\n\nYou can technically upload that stuff. Many people have. They use 'optional files' which are only downloaded when viewed. [GifTime](http://127.0.0.1:43110/1Gif7PqWTzVWDQ42Mo7np3zXmGAo3DXc7h/) does this. Many other sites include large isos/software/videos/music that are optional so it only downloads when clicked. However, large files distributed in this manner isn't good, as not everyone will say to store/share it, and when downloading it only downloads from a single peer. Instead, sharing via magnet links or through something like IPFS might be better.\n\nFor music and video. There's also stuff like webtorrent to make it in the browser and more easily viewable.",
				"added": 1470434272
			}
		],
		"1_19XWHYGRPvDkBYu6RePhg8vixH61dqitAy": [
			{
				"comment_id": 116,
				"body": "I just did this the other day. Make sure you have [homebrew](http://brew.sh/) installed. Mac Ports apparently works too, but I use brew. Then run `brew install tor` to download/install the tor daemon (they have a mac app for the browser, but just ignore that). After it's done downloading and installing, navigate to the `/usr/local/etc/tor` folder on your computer. The easiest way to do this is to open finder and hit `cmd+shift+g` and paste it in there. You should see a `torrc.sample` file. Copy that and rename the copy to just `torrc` with no extension. Open it up in a text editor (presumably a plain text one like [sublime](https://www.sublimetext.com/) to prevent auto-formatting from messing it up. Avoid using mac's built-in one.) Look for `#ControlPort 9051` and simply remove the \\#. Two lines down you should see `#CookieAuthentication 1` remove the \\# from this one too. After that, save up and launch tor using `tor start` in the terminal. After this, restart zeronet and it'll run with tor. If you want to use tor for every connection (rather than just having one for a bridge or to access tor-only peers) then on the zero net homepage, click on the tor button in the top right, and hit 'enable tor for every connection' at the bottom. Then restart zeronet. You can disable it in the same way.\n\nHope that helps. That's how I got mine set up. No torbrowser though, if you wanted to use that.\n\nEdit: I converted this quick walkthrough into [a guide over on my blog](http://127.0.0.1:43110/kaffie.bit/?Post:22:New+blog+post) Please share that rather than this post when sharing how to do this. Thanks :)",
				"added": 1470436210
			}
		],
		"5_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": [
			{
				"comment_id": 117,
				"body": "That's not quite how it works, no. The mail on zeroverse vs the mail on zeromail are entirely separate databases. Mail on one service cannot reach the other service. So if you send mail on zeroverse's mail, then your recipient needs to use zeroverse mail. And likewise, if you send it on zeromail, the recipient needs to view it on zeromail.\n\nZeroverse was an attempt to help decentralized the username/id service that ZeroNet provides. The developer made an ID registration clone where you must register with bitmessage. And also a zeromail clone, where you can log in with either zeroid or zeroverse id. This provides more options for your ID provider.\n\nCurrently mail cannot cross between sites.",
				"added": 1470440129
			},
			{
				"comment_id": 121,
				"body": "> [paintninja](#comment_4_12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu)\n\nYou know, I was just thinking, maybe merger sites will help solve this problem? Your 'hub' would be your mail provider, and to mail people on other providers, they'd be added as a contact and it'd work like cross-site commenting. But I'm not familiar with either platform, so I dunno if it'd actually work.",
				"added": 1470523449
			}
		],
		"10_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": [
			{
				"comment_id": 118,
				"body": "I'm so hyped for this.",
				"added": 1470463483
			},
			{
				"comment_id": 119,
				"body": "> [quadrangle](#comment_8_1CTut2qbaj54ZjNoYeuWSGwV75iVieKY6N): What is it?\n\nIt's ZeroNet's answer to social networks. I heard it's like Twitter. The site is the showpiece for ZeroNet's newest feature: merger sites. If you read the [issue page](https://github.com/HelloZeroNet/ZeroNet/issues/232) for merger sites, that might give you an idea of what ZeroMe will be like.",
				"added": 1470521734
			},
			{
				"comment_id": 132,
				"body": ">If I can't find any more bug then **tomorrow.**\n\n> - HelloZeroNet commented **a day ago **\n\nSoon.",
				"added": 1470782770
			},
			{
				"comment_id": 133,
				"body": "Update:\n\n>I think i was able to fix all the bugs, tomorrow morning i going to re-check everything, then publish it",
				"added": 1470797462
			},
			{
				"comment_id": 134,
				"body": "Hmm... I somehow managed to join both hubs, and now there seems to be conflicting data... How do I delete my blue hub data?",
				"added": 1470877770
			},
			{
				"comment_id": 135,
				"body": "> [bot](#comment_106_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb): Just remove one hub (folder). Possibly restart 0net.\n\nI tried this. It removes it locally, but both hubs still have me on there. Restarting zeronet doesn't help. I feel like if I delete the content.json and data.json files then it'd work, but I don't know how to manually sign/publish stuff in the data/users/etc folder.\n\n> [sirenyc](#comment_39_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): What is this hub?\n\nWhat is what hub? I initially joined red. Then I glitched it and joined blue. Now both appear at the same time and cause problems.",
				"added": 1470878709
			},
			{
				"comment_id": 136,
				"body": "> [bot](#comment_107_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb): zeronet.py siteSign [siteaddress] --inner_path data/users/content.json\n\nI can't sign that content.json because I don't own bluehub. I'd need to sign the data/users/[mypubkey]/content.json. Is it the same command? What private key would I use? On my sites.json there's two bluehub entries -___-",
				"added": 1470879964
			},
			{
				"comment_id": 137,
				"body": "> [bot](#comment_109_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb): We prolly need a \"remove me\" button on the hub.\n\nCertainly. And to prevent people from joining a hub if they've already joined one. Or at the very least a way to manage the unwieldy two-hub thing. I tried modifying the innerpath var to the right content.json, signed and it seemed to sign properly, but it won't delete the profile/comments/etc. As of now, I can't touch my blue profile posts, and trying to do so messes up my red profile stuff. I managed to delete the conflicting profile info and then switch back to my red profile. So at the very least things should work okay. Please let me know if you see my profile pic+description. And whether you see the url as blue or red.",
				"added": 1470881346
			},
			{
				"comment_id": 138,
				"body": "> [p2p](#comment_189_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ): actually you can, but not a normal sign, an inner_path sign instead ( you can do it easily via the sidebar, turn on This is my site,  type data/users/your_ID_address/content.json in left box of  Sign button, and then click Sign finally Publish)\n\nThis worked. It prompted for a private key, and I tried a few. The one that ended up working was my ZeroID private key. I edited the data.json to just be `{}` and then changed it to that directory and signed/published on the *blue hub site* (not zerome or red hub). This then erased the bluehub profile and everything of it off my page. No more glitchiness. One user happened to follow both my blue hub page as well as a glitched 'null' page. Which may cause problems down the line. But for now we're all good. <3",
				"added": 1470885262
			}
		],
		"8_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 120,
				"body": "> [testset](#comment_29_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp): Diaspora* not P2P but it is a nice Decentralized/Federated project.I was not listing it because I was not sure if it counts here.I think it should count but it depend what @kaffie meant by \"P2P/Decentralized\".\n\nI wasn't really aiming for stuff like diaspora. More of software you run on your local machine to connect to a larger network of peers to achieve something. I mean, it's fine. More for the list, but not really what I was after.",
				"added": 1470522657
			}
		],
		"1_1M4Ab8CUu3byziHVvNXLHmPezC4Lg9hvNJ": [
			{
				"comment_id": 122,
				"body": "There's a working proxy at https://proxy1.zn.kindlyfire.me which is what my search engine uses for the time being. Though I think I might point it to this meta-proxy, so I don't have to keep changing it.",
				"added": 1470606712
			}
		],
		"2_1PCPuVtFv8apVpXYbc46wHugNhFUVQ6KCv": [
			{
				"comment_id": 123,
				"body": "ZeroNet sites do not have a backend server, so no. There *are*, however, mirrors uploaded to zeronet that contain static site content (like an archive). The only way to access clearnet would be to access it directly yourself.",
				"added": 1470648221
			},
			{
				"comment_id": 147,
				"body": "> [sbeee](#comment_33_13k6itGVhzLTZUZKiqWWJ5KdvVUEMqDWDv): I think there is no utility to go to zeronet to see an application which is not on this network but on another one.This question makes me think that it should be interesting to replacehttp://127.0.0.1:43110/Crypto-addressbyzeronet://Crypto-addressor zeronet://nameCoin-domain\n\nI actually played around with this a bit. I made a quick zite test to assign a `zero://` protocol on firefox. I can now access zites like `zero://kaffiene.bit`. This is able to be done by providing a redirector zite and then pointing the protocol to it. Unfortunately it seems this method doesn't work on other browsers. I'd really like to see native support on zeronet for this method, as it'd standardize url linking, and clean up the address bar to boot.\n\nIt seems chrome users grab the extension which let's them use `http://zero/kaffiene.bit`.",
				"added": 1471060988
			}
		],
		"9_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 124,
				"body": "> [o4zw5vmpoz5hz78z](#comment_137_1KTjPe9MxoYkcXj78GuZgCcj3R3f3Twh7r): fastcast http://127.0.0.1:43110/1qJ3EM5rTa2wPTBvJuCFjdLXjrBCgBkR8\n\nIt's nice, but there's no user uploads. There was an attempt at a 'ZeroTube' a while back, but it suffered from a lack of being able to continually seed the videos. Which is probably why there isn't a video service yet.",
				"added": 1470658756
			},
			{
				"comment_id": 125,
				"body": "> [truth](#comment_8_164W1rFVD9Bm7poGJWvjVUjvkbhhFC5nnt): Everything media can be be done by BitTorrent. We need zites that integrate torrent content, a small html div element that is integrated on your bittorrent client, activates a download and displays content on the zite.\n\nThe problem is that there's no native way to torrent things. Webtorrent works, but it can only download/seed torrents that have webtorrent peers. IIRC, nofish mentioned he was going to add a torrent client into zeronet to achieve this.",
				"added": 1470679306
			}
		],
		"1_1mytj22YfKjQujw9Fo43WBwSJB658vqyY": [
			{
				"comment_id": 126,
				"body": "I'm having a similar issue on my blog. I had an issue like this for my search engine, which had the solution as \"click save site settings\" in the side bar, modify the stuff, do it again, save again, etc. And then publish using the sidebar. That worked for the root content.json. But my /data one seems to be giving me a similar issue with no clear fix.",
				"added": 1470713084
			}
		],
		"10_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 127,
				"body": "> [tkarita](#comment_79_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t): You can add a \"privatekey\": line to the site's entry in data/users.json.  ZeroNet does that automatically when you clone a site.\n\nLike this?\n```\n\"SiteAddress\": {\n        \"auth_address\": \"authaddr, \n        \"auth_privatekey\": \"authkey\", \n        \"cert\": \"zeroid.bit\",\n        \"privatekey\": \"privatekey\"\n      }\n```\n\nI have that set for both sites, and both are marked as 'owned' in the side bar, but it still prompts me for a key every time I click sign/publish. My blog only started doing this after I deleted it and redownloaded (since it was cloned and worked fine otherwise).\n\n>  It's frustrating that sites can become unusable if the owner is absent for too long.\n\nI meant on my own blog. Obviously here on ZeroTalk I'd have to message nofish or delete old posts. Either way, I figured it out. The solution was to edit the file with the updated permissions, then in the sidebar, click on the inner content.json (the edited one) and then select sign/publish. I dunno why that was so frustrating to do. I had a similar issue when editing one of my sites' description. The solution there was to edit it, and click 'save site settings' and do that a couple times, and then sign and publish.\n\nAnd yea, the quota system should either have higher defaults, or be disabled altogether by default. It makes it hard to have a thriving community when discussion is heavily limited.",
				"added": 1470713724
			}
		],
		"11_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": [
			{
				"comment_id": 128,
				"body": "Cloning is an intended part of ZeroNet. The system allows you to configure your site to provide clean template for clones. If you care about your brand not being cloned, it might be best to keep all the branding out of the cloned files. It seems proper to me to mention if you clone something (maybe on a blog), and to distinguish it sufficiently from the original. I'm not hesitant to say that Kaffiene started as a clone of ZeroNet. Yet, as we're all aware, it's now sufficiently different and has it's own codebase and brand. At this point, it's pretty easy to tell the difference between the actual original site and a lazy clone. Lazy clones are obvious, so they're not a big deal. The well done clones are high enough quality that it really doesn't matter which is more widely used. Let the better zite win, right?",
				"added": 1470714104
			}
		],
		"1_1Dj5WCaPV2r18QcDQFHmyx2HnGmwMJce9b": [
			{
				"comment_id": 129,
				"body": "Electricity could easily be free if we did a quick 1-time setup of solar, and government funded wind/tidal/wave/geothermal. It'd also reduce our fossil fuel consumption to 0.\n\nWater is a bit trickier. Here in california we're in a drought. And companies like Coca-Cola drain natural lakes. Water isn't exactly a renewable resource either. So I'm at a loss for what to do there.\n\nIf we're talking about basic human requirements, we should also lump food and shelter in there; providing a soylent-style meal, and bunked sleeping areas at least. No one should go hungry or thirsty, and no one should be left out in the elements. Electricity is mostly optional, but we're able to get it for near-free, so why not?",
				"added": 1470717564
			},
			{
				"comment_id": 143,
				"body": "> [starcodesys](#comment_2_1Dj5WCaPV2r18QcDQFHmyx2HnGmwMJce9b):  And if this is to extreme a step, then in the same way taxes are paid for government services, then why not for electrical and water services?\n\nThis is pretty much the TL;DR. If we're going to have taxes used on *anything*, guarantee basic necessities are covered for all humans before doing it. Why support roads and the automobile industry, when you can let the industry build it's own damn roads and instead support food/water/shelter for people and rely less harmful transport like walking/biking/subways? Why spend trillions on a military whose only job is to *kill people*, when instead you could be providing those same people with food/water/shelter?\n\nIt's nonsensical to me that we spend our taxes on *anything*, while there's still people starving to death and lack shelter (despite shelter being a legal necessity!!!)",
				"added": 1470953118
			}
		],
		"2_1DpQSUAGRj5ykejhp5NFinYZUHz5q87ujh": [
			{
				"comment_id": 130,
				"body": "http://127.0.0.1:43110/kaffiene.bit/",
				"added": 1470745551
			},
			{
				"comment_id": 131,
				"body": "> [zeropunto](#comment_4_1wnjTS6YRUp6Q6yjECuoh1o28TPkvrnq2): http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:zite-list-searches\n\nAlso: http://127.0.0.1:43110/kaffiene.bit/?q=search%20engine",
				"added": 1470779382
			}
		],
		"2_1wFmwTMU9TPYuVqsFZSyutRN3PhWue3GM": [
			{
				"comment_id": 139,
				"body": "In your zeronet folder, look for a file called 'users.json'. Open that, and look for your site. There should be an entry called 'privatekey'. That's your private key for signing the site. Should be there for cloned sites.",
				"added": 1470886831
			}
		],
		"8_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 140,
				"body": "> [spartanshield](#comment_4_13WWWFi6iuSLazDcNvHgBEjjeAofAhAwtE): pokemon have red/blue/green - ingress have blue/green :P\n\nPokemon Go and the US release of the original is red/blue/yellow. Green is more or less just blue.",
				"added": 1470917580
			},
			{
				"comment_id": 142,
				"body": "> [spartanshield](#comment_6_13WWWFi6iuSLazDcNvHgBEjjeAofAhAwtE): So , any idea about Red/Blue hubs ?\n\nThere's no difference between the hubs. They're just two separate hubs to demonstrate the merger site feature. Red/Blue are just standard primary colors that likely don't refer to anything.",
				"added": 1470952309
			}
		],
		"7_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 141,
				"body": "> [spartanshield](#comment_5_13WWWFi6iuSLazDcNvHgBEjjeAofAhAwtE): I fail to see how it can prevent spam. If someone uses a bot to spam on the network, they also can program it to change the size limit.\n\nyou can't change the limit unless you are the site owner.",
				"added": 1470917767
			}
		],
		"3_1JHrskNwA3oo9gxvCbo3Q1RZTUuKCDdfUa": [
			{
				"comment_id": 144,
				"body": "Merge sites consist of two parts (ZeroMe uses three). There's the viewer, which is only display logic, and is responsible for containing the merged database. This is essentially the site everyone goes to. Look at ZeroMe's code for an example here.\n\nThe second part is a 'hub', or the site being merged. This are more or less *only* data. They don't have any merge logic. Check out the Red/Blue sites for more on how these are structured. They're fairly straight forward.\n\nAs for how to implement, I dunno. It looks pretty complicated. You can look through [ZeroMe's source code](https://github.com/HelloZeroNet/ZeroMe) and try to figure it out. I'm sure documentation will come soon.\n\nZeroMe also uses an intermediate site to gather a list of users from all Hubs to display on the 'all users' page. From what I can tell, this is also just a database like the hub sites are.",
				"added": 1471040672
			}
		],
		"3_1LJLVfT9hKRuTHzBKTpse57PGfpwx82myR": [
			{
				"comment_id": 145,
				"body": "It's asking permission to use the merger site feature. If you accept, ZeroMe will merge sites that are listed as okay to merge under the 'ZeroMe' label. If you don't accept it, you can't really use ZeroMe.",
				"added": 1471054624
			}
		],
		"1_12ammmMtU2utLCtNGwLwrh3K8LsmzR4k8T": [
			{
				"comment_id": 146,
				"body": "Your zeroid is connected to your master seed, which is stored at `zeronet/data/users.json`. Just move that file (don't delete it if you want to keep your current account), and zeronet will recreate it with a new seed. This will let you register a new zeroid. There's a multi-user plugin available that you could set up, but I'm not sure how it works.",
				"added": 1471057021
			}
		],
		"1_1FVgXvt6d7AciuXYYeHwFcPfUyRqRDhZxV": [
			{
				"comment_id": 148,
				"body": "[Kaffiene](http://127.0.0.1:43110/kaffiene.bit/) now supports searching through the ZeroName index (no tags). It also has it's own index with over 1000 sites tagged (and another 1000 or so untagged).",
				"added": 1471068926
			}
		],
		"1_1Mxv7my8HRBiVNRtiFaHrrbb11hmPqa6qL": [
			{
				"comment_id": 149,
				"body": "> [teszt](#comment_28_1AdcxsExVKvxffQtEd72E5tckouzZHLEYC): ZN is decentralized as network but different sites and services can be created on it which run centralized by somebody.zeroid and zeroverse are such identity services.If the id system runner is on Holiday his ID system could be out of work.For many of us this is not clear at the beginning and when they find out they will be disappointed.However this is not easy to solve.But if anybody have a good idea how to make a working decentralized identity system then let us know.Maybe the nanasi ID could be improved as it seems most closed to a decentralized ID.\n\nI was going to say that the Nanasi-style IDs are likely the way things are headed. Keep it easy to decentralize and able to make unique ids. Then just have names freely customizeable (like on ZeroMe). Having a centralized back-end auth system sort of defeats the entire purpose of ZeroNet.",
				"added": 1471073033
			}
		],
		"1_16XR1GVbekHSMMoUZ5pTQWFpq2anbkHgrC": [
			{
				"comment_id": 150,
				"body": "[The stats page](http://127.0.0.1:43110/Stats) has some information about what ZeroNet is doing. You can also slide the 'home button' in the top right to open a sidebar that has some info on how many people you're connected to, and the geo-info you're getting.",
				"added": 1471073917
			},
			{
				"comment_id": 151,
				"body": "> [arendeiro](#comment_1_16XR1GVbekHSMMoUZ5pTQWFpq2anbkHgrC): Yeah, it displays only current usage though. I was wondering if someone would be aggregating these with time and posting the evolution on some website.\n\nI'm not aware of anything like that. ZeroNet is still really new. I'd say if this is something you're interested in, you should make something like it yourself.",
				"added": 1471074339
			}
		],
		"7_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": [
			{
				"comment_id": 152,
				"body": "Migration works fine. Especially with the new hub detection. Just leave the posts on the hub they were written. This makes it better longterm, when people make hubs to be subreddits or subforums/torrent categories.",
				"added": 1471128983
			},
			{
				"comment_id": 153,
				"body": "> [weakish](#comment_9_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR): So there is three problems:\n> \n> migration\n\nMigration should be simple enough. There just needs to be a tool to do it automatically.\n\n> censorship\n\nAgain, more hubs and easy migration averts this problem entirely.\n\n> scalability\n\nWe're already running into issues with quotas on non-merger sites like zerotalk. Having free migration among hubs solves that problem. For ZeroMe, I saw the issue right away, and manually migrated my profile over to my own hub with a 10mb cap per user. And since it's my hub, I can manually adjust that when needed.\n\nThe big issue is residual posts. If you comment or like something on a hub, it's posted in that hub. Not your own. That means you're still subject to the various limits/censorship. Not really a big deal though, as reddit does something similar (each subreddit has it's own moderators who can censor/ban/remove posts/etc).",
				"added": 1471149051
			}
		],
		"1_14dWJrtWbw6sQKHgfeukbzBDJvBSnfRnTw": [
			{
				"comment_id": 154,
				"body": "No. ZeroNet does not route network traffic. Instead, it uses torrents to distribute decentralized websites. You *can* use ZeroNet to find torrents, that you then download using your regular setup. And ZeroNet also has support for Tor, if you wish to use that.",
				"added": 1471153092
			},
			{
				"comment_id": 155,
				"body": "> [tkarita](#comment_92_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t): There are the webtorrent services of ZeroMail 2.0 and NullFolder, but webtorrent uses its own protocol which is incompatible with normal torrents.  It also needs an active browser window, so it stops working if all the seeding windows go away.\n\nIt actually *does* work with normal torrents. But due to how webrtc works, it can't connect to normal torrent clients. Meaning that all the torrents effectively have 0 seeds/peers. If you take a normal torrent, and seed it with a webtorrent client, it'd be accessible through nullfolder/zeromail.",
				"added": 1471158073
			}
		],
		"1_1APbko6uK9fwwZoqB5LKgFeqWdF3SDLw4k": [
			{
				"comment_id": 156,
				"body": "You have to be connected online to download sites for the first time, and to receive updates from other users. However, after you visit a site, you do not need an internet connection to browse the site, as it's all being served from your own computer.\n\nSo say you download a bunch of sites when at home on your internet connection, and then go somewhere without wifi. You can still read the sites/content you've downloaded (visited before) even without a connection. However, updates won't happen until you're connected online again.",
				"added": 1471213126
			},
			{
				"comment_id": 157,
				"body": "> [purpledrank](#comment_1_1APbko6uK9fwwZoqB5LKgFeqWdF3SDLw4k): Thank you so much.That really helps me understand this.Is it possible to make my own version of ZeroNet for a few friends of mine to use?\n\nThis is on the roadmap, actually. ZeroNet distributes sites through torrents, meaning that you don't technically need to be online to use the tech. At the moment you still need a tracker to manage peers. But if you dig into the python files, you can figure out how to change that.\n\nAnd yes, it's completely possible to modify zeronet. It's all python, so you can just open up the files on your computer and edit them. Alternatively you can go to the [github page](https://github.com/HelloZeroNet/ZeroNet) to follow it's development (and to fork/branch/etc).\n\nBasically as long as you're on a network with access to a tracker, zeronet can do it's thing and share sites. They'll update as they should, but obviously will lack the updates from the internet, if you choose to not go online.\n\nDHT/tracker-less support is planned, but it's not quite here yet.",
				"added": 1471213841
			}
		],
		"1_1N5Rs6CHsGPdDB1y3JqjYm9SLSWUTkjwEF": [
			{
				"comment_id": 158,
				"body": "> [edantes](#comment_15_1JF3eQjW4voiKdcvCkMXvUx5bLmZAiVdyi): I emailed the developer working on the faux KAT site, didn't get a response, not sure what's going on. If things don't start moving soon I'll try to get something going myself, I've been harvesting and processing countless torrents in recent days, its not going to be for nothing, I'll tell yaz that! :) Stay tuned.\n\nTBH, it's looking pretty dead to me. The gitlab hasn't updated in a few days, the dev seems MIA, and the site's half-broken as it is.",
				"added": 1471387973
			},
			{
				"comment_id": 159,
				"body": "> [tkarita](#comment_96_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t): It isn't clear whether the current merger sites could support that.  Users might be posting to several hubs, but joining multiple hubs has caused problems for ZeroMe.  I think Kaffie has said the problems are mainly due to design flaws in ZeroMe; maybe a categorized site is possible now.\n\nThe issue isn't with the hubs. The hubs are just collections of data. The issue that happen(ed/s) with posting in multiple hubs is the display logic that ZeroMe uses. it assumes stuff from 'posts' only comes from a single hub, where in reality it can come from multiple. All you'd really have to do is keep the multiple hubs distinctly separate, rather than assuming that only one can have posts.\n\n'joining a hub' is really just planting down the posts/bio/avatar/etc. info on that particular hub. For a generic torrent site, the 'posts' would be submissions, and would be properly categorized into the various hubs. There wouldn't be a conflict, since they'd be explicitly in different categories (hubs). What ZeroMe does is treat all the comments/likes/posts/etc. as if they're all one big zerome site. Rather than acknowledge they're from different hubs. That's what leads to the issues.",
				"added": 1471400664
			}
		],
		"1_1HUrhTUZFB2KKsXLUv1vugPH358iB6zsiY": [
			{
				"comment_id": 160,
				"body": "Yup. As long as you give people the URL and they start seeding it, they can interact with and join the hub. The only thing is that it won't appear in the defaults, so if people aren't seeding it, they won't see the option to join it.",
				"added": 1471470534
			},
			{
				"comment_id": 161,
				"body": "> [quadrangle](#comment_38_1CTut2qbaj54ZjNoYeuWSGwV75iVieKY6N): Oh great, the vermin are breeding. Now we have to deal with you too?\n\nAm I a vermin? I'm probably one of the most followed users on ZeroMe.",
				"added": 1471474725
			},
			{
				"comment_id": 162,
				"body": "> [19](#comment_1_1HUrhTUZFB2KKsXLUv1vugPH358iB6zsiY): But I tested it with another PC and I saw it in the defaults.\n\nSee ZeroMe's content.json:\n\n```\n\"default_hubs\": {\n   \"1BLueGvui1GdbtsjcKqCf4F67uKfritG49\": {\n    \"description\": \"Hub for ZeroMe users. Runner: Nofish\",\n    \"title\": \"Blue hub\"\n   },\n   \"1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i\": {\n    \"description\": \"Hub for ZeroMe users. Runner: Nofish\",\n    \"title\": \"Green hub\"\n   }\n  }\n```\n\nOnly green and blue are defaults. So if you don't have any hubs downloaded, only those two will appear. This has been thoroughly tested. There's *several* hubs that have been created and don't show up at all unless you're already seeding them (at which point they show up under 'seeded hubs').\n\nCould you provide a screenshot of a non-default hub showing up under the default hubs with the 'download' button? I've yet to see this happen.",
				"added": 1471481788
			},
			{
				"comment_id": 163,
				"body": "> [19](#comment_3_1HUrhTUZFB2KKsXLUv1vugPH358iB6zsiY): Green?!I saw a red hub!(And the blue hub)\n\nRed was initially a default when I joined. But as of now it's not a default. Are you saying you saw three hubs: Red, Blue, Green, all on the create+profile page, with a download link next to them (including your yellow hub that's unseeded by you)? That's very strange and I'd definitely like to see a screenshot. As of now, a fresh boot should only reveal Green and Blue hubs. With the rest becoming visible upon seeding.",
				"added": 1471482270
			},
			{
				"comment_id": 165,
				"body": "> [19](#comment_4_1HUrhTUZFB2KKsXLUv1vugPH358iB6zsiY): http://127.0.0.1:43110/0chan.bit/?/b/thread/726f14851ba9230341f4c506ed433586Screenshot, and the red hub did disappear.\n\nThose are seeded hubs. Any hub you're seeding will appear there. Other people cannot see the things you do under 'seeded hubs' (they see their seeded hubs instead). The ones everyone see are listed under 'available hubs' and only contain green/blue as of now. They have a 'download' button next to them, and when downloaded, move over to the 'seeded hubs' section.",
				"added": 1471493525
			}
		],
		"1_19TgPhgpi9U73U9jQWUSspfxy8vbPjUxVT": [
			{
				"comment_id": 164,
				"body": "[Kaffiene Search Engine.](/kaffiene.bit)",
				"added": 1471493382
			}
		],
		"2_163sF1Kdsd5LdpjAXDKBshdEBNJH6PUqvg": [
			{
				"comment_id": 166,
				"body": "At the very least you need to save the `zeronet/data/users.json` file. As that contains all your public/private keys and such. Any sites you own but haven't published (meaning you're the only person with the files) you'll need to backup as well. Any site that's online and hosted by others you can simply redownload by visiting it.\n\nIf you simply want to keep *everything*, then just back up the `zeronet/data/` folder entirely. That contains all the sites you've downloaded, your keys, etc.",
				"added": 1471519785
			}
		],
		"1_1EN9Ape9Gbe2FAcP8qNWsyvg7x7z92LhA7": [
			{
				"comment_id": 167,
				"body": ">Does anybody have a good explaination for how merger sites such as ZeroMe work?\n\nThe merger feature is broken up into two parts: A hub site which contains only data. And a viewer/merger site which grabs multiple hub sites and 'merges' them. You can replace either part: you can keep the same hub sites and replace the viewer, or keep the viewer and replace the hub sites.\n\n>If I am seeding a hub, am I by default able to view it in ZeroMe?\n\nYes. Any hub you're seeding, you can view in ZeroMe (provided, of course, that it's a zerome hub).\n\n>When I post something, does it go to the first hub I joined, or does it go to all of them?\n\nWhen you join a hub, that hub gets initialized with your profile and post data. When you post something, it goes to the hub that you initialized. There's currently a bug where if you initialized two different hubs, things will glitch. You can see which hub it'll post to by looking at the link to your profile, it'll contain the hubsite address.\n\n>If it only goes to one hub, am I able to switch which hub I post to?\n\nThere is no official way to do this, no. I wrote a guide on how to manually switch hubs [here.](kaffie.bit/?Post:25:How+to+change+your+ZeroMe+Hub) Though if you have existing followers, ZeroMe will glitch a bit. The lack of switching hubs is purely due to how ZeroMe works, and not an issue with the merger/hub feature.\n\n>Am I only allowed to have a profile on one hub or do I have a profile on all of my hubs?\n\nThe profile, as mentioned earlier is stored in your initialized hub. There's nothing technically stopping you from including this data on the other hubs. However, the ZeroMe merger site isn't written to support this, and glitches. ZeroMe expects you to have a profile on only a single hub. And indeed, there's no real benefit to having a profile on different hubs. For merger sites in general, a 'profile' isn't actually a part of the API. So you can forego it altogether, or allow users to make 'posts' on every hub (just like they can with comments).\n\n>Can I comment on somebody's post from a different hub? What happens if they aren't seeding the particular hub that I joined first? What would happen?\n\nYes, this is the whole point of a merger site. Your posts on other hubs are stored in your user folder on that site. If you are commenting on a post that's on a different hub, your comment will be viewable to anyone seeding that hub (which is the same group of people able to see the parent post). If, however, they are only seeding your home hub, and not the other hub, they won't be able to see the post. People only see content that's posted on/to hubs they are seeding. Comments and likes are stored in the hub they're commented/liked on. So if someone can see the post, they can see the likes and comments.",
				"added": 1471564198
			}
		],
		"2_13U9mRgV3bdkXiNXjMZeBWTcSHZjgNmk2z": [
			{
				"comment_id": 168,
				"body": "Red Hub - 1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL  \nBlue Hub - 1BLueGvui1GdbtsjcKqCf4F67uKfritG49  \nInfinity Hub - 1NFiNiTYxiKn5PJo9eDEsiusJJUFkew5Vo  \nKaffie's Hub - 12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv  \nBitcoin - 12rTbtzcEZH7RiVfShBB3qhoe3rfwbpm8S  \nHub Espanol - 15mV5T1R1wxg3E1FPsvZw19bw6QzvRREfn  \nAnarcho-Capitalism - 1CiGGh6RrTtaTJfutVKUrfURsP5J4stJDk  \nGFW Hub - 1Gb25pK7XqrgnBYjhHLGBjEYURg2MhbJCq  \nTrump 2016 - 16bNGdxFkGWGnCEfVue3w4CSp3Ew2hcyBB  \nOrange is the new Black - 1ARSTRDgMSH2E81pcZCbaEq28TZ72Levxh  \n\n---\n\nThose are the ones I have in Kaffiene's hub index. There's also:\n\nYellow Hub - 18FheQ1v3bz4iv5yx8hr9hg5W5BJ8WNJ8d  \nGreen Hub - 1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i  \nBot Hub - 1JUDmCT4UCSdnPsJAHBoXNkDS61Y31Ue52\n\nThere's a few more I've seen around as well, but I didn't manage to write them down.",
				"added": 1471658231
			}
		],
		"4_13U9mRgV3bdkXiNXjMZeBWTcSHZjgNmk2z": [
			{
				"comment_id": 169,
				"body": "Since the last revision (Rev1422), here's what has changed:\n```\nFix typos in log message\nSupport group by in newsfeed follows\nFix connected_limit and size_limit paramter parsing\n```\n\nYou can find all the commits/changes [on the github.](https://github.com/HelloZeroNet/ZeroNet/commits/master)",
				"added": 1471688491
			}
		],
		"1_1LNHyrTD9qMnPPmZBPo6RxL7Q2hQUB8hv1": [
			{
				"comment_id": 170,
				"body": "[Kaffiene.bit](http://127.0.0.1:43110/kaffiene.bit)",
				"added": 1471745400
			}
		],
		"11_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 171,
				"body": "Well that's concerning...",
				"added": 1471821427
			}
		],
		"4_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx": [
			{
				"comment_id": 174,
				"body": "Move to a different hub that has a raised limit, like KaffieHub or InfinityHub. I saw this issue coming from a mile away, which is why I made my own hub. I set the limit to something absurd for the moment, like 10mb. I'll likely raise it in the future as well.\n\nEdit: [Guide on how to do this.](http://127.0.0.1:43110/blog.kaffie.bit/?Post:25:How+to+change+your+ZeroMe+Hub&)",
				"added": 1472172947
			},
			{
				"comment_id": 175,
				"body": "> [testingzeronet12](#comment_132_1CMjV2r4EBpFt8VCcWWZKDysZXPcPExRNN): Have you written a guide on how to create your own hub?\n\nOn ZeroHello, just scroll down to the bottom to where the hubs are listed. Click the three dots ('...') on the right side of one of the Hubs. Then click \"clone\". And ta-dah, you've made your own hub. From there you can share the link, change the title/description, and do whatever else you want to it. I personally changed the splash page to link to my other sites, and raised the limit so that people can post more.",
				"added": 1472268855
			}
		],
		"1_1KzaKud9cUZB7HcgHnhrZqyuq2NnTeW6PR": [
			{
				"comment_id": 176,
				"body": "I wrote [a guide on how to properly set up Tor on Mac.](http://127.0.0.1:43110/blog.kaffie.bit/?Post:22:How+to+install+and+configure+Tor+to+work+with+ZeroNet+on+Mac+OSX&)\n\nIt's just a matter of downloading and running the tor daemon, and configuring it in a particular way. ZeroNet then automatically detects it.",
				"added": 1472293235
			},
			{
				"comment_id": 177,
				"body": "> [zarty](#comment_2_1KzaKud9cUZB7HcgHnhrZqyuq2NnTeW6PR): Thanks but your link doesn't work unfortunately. \n\n> [nofish](#comment_741_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): (This bug was fixed recently in ZeroBlog, so anyone who has cloned it before maybe wants to update it CC: @kaffie)\n\nShould be fixed now.",
				"added": 1472303874
			},
			{
				"comment_id": 178,
				"body": "> [zarty](#comment_3_1KzaKud9cUZB7HcgHnhrZqyuq2NnTeW6PR): Ok, I was able to open your guide thanks.  I got down to step 5... However, the two lines were already uncommented and the port number were different...  ControlPort 49051.  I continued without changing the file. \n\nTry changing it to the values in the guide.\n\n>At step 7, 'tor start' just fails.  Tried SUDO tor start, same error:-\n\nYea, this is my bad. I should probably fix my guide. Just start tor with `tor`.",
				"added": 1472304871
			},
			{
				"comment_id": 179,
				"body": "> [zarty](#comment_4_1KzaKud9cUZB7HcgHnhrZqyuq2NnTeW6PR): Here's the torrc file.  I started Tor and restarted Zeronet.\n\n[This is my torrc file.](http://127.0.0.1:43110/0pastebin.bit/?1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_6) Literally the only two non-comment lines are:\n\n```\nControlPort 9051\nCookieAuthentication 1\n```\n\nThat file should be in `/usr/local/etc/tor/`. I dunno what that other stuff you listed is. ZeroNet is uncompletely unmodified. I then start tor using just `tor` in a separate terminal window/tab. And then I start ZeroNet with `sudo python zeronet.py`. Did you install it through homebrew?",
				"added": 1472332705
			}
		],
		"5_1KzaKud9cUZB7HcgHnhrZqyuq2NnTeW6PR": [
			{
				"comment_id": 180,
				"body": "I use transmission. It comes default on a lot of Linux distros, so if you ever use one, you can find your way around pretty quick. It's also relatively simple, no spyware/ads, etc.\n\nAlternatively, if you want a streaming client, webtorrent is good (and promotes webtorrents as well). I also hear good things about bitx.",
				"added": 1472383686
			}
		],
		"1_1PPVb3FDDiNyNqbdb5UAv8ykEC1K1Nwquy": [
			{
				"comment_id": 181,
				"body": "ZeroNet uses .bit domains resolved through a ZeroNet site. The default resolver is [zeroname.bit.](http://127.0.0.1:43110/zeroname.bit) ZeroName gathers it's list by connecting to the [Namechain](http://namecha.in/) website and grabbing a list of valid ZeroNet names.\n\nZeroNet also has an option to resolve using a local copy of Namecoin, or to configure your own domain name site.\n\nBy obtaining a domain name for your site, the links shorten to something like [http://127.0.0.1:43110/kaffie.bit.](http://127.0.0.1:43110/kaffie.bit) Still long, but much shorter. As you may have been aware with ZeroMe, you can see that the domain name has made it a bit shorter. The extra stuff at the end is site-specific parameters, which varies from site to site.\n\n---\n\nThe big issue, then, is the ugly localhost:port at the beginning. There's two ways of fixing this, and neither are official. The first is to either download the [ZeroNet chrome extension](https://chrome.google.com/webstore/detail/zeronet-protocol/cpkpdcdljfbnepgfejplkhdnopniieop?utm_source=chrome-app-launcher-info-dialog), which is semi-officially supported (stuff like ZeroMe adjusts for it). Or you can head over to the [kaffie.bit protocol test page](http://127.0.0.1/kaffie.bit/test.html) and download the .pac proxy file to configure the `http://zero/<address>` style urls along with direct http://name.bit support.\n\nThere's also an option on that page to configure the `zero://` protocol, which is entirely unofficial, but cleans up links a lot (the end result is: `zero://kaffie.bit`). However, the way this protocol is handled only works on firefox (and likely clones), and doesn't clean up the url bar, it just makes links look nicer (which is pointless if people can't resolve them).\n\nThe big issue with both methods is that the purpose of clean links is to share them. However, neither the `http://zero/` nor the `zero://` methods are official, and thus not all users have them (again, refer to the test page to see which work for you). Hell, even the localhost:port bit becomes non-standard, with the presence of proxies and people customizing their port. Ultimately there's not really a clean solution to all of this, and it remains to be one of ZeroNet's biggest problems.",
				"added": 1472426998
			}
		],
		"1_1CiHRyU3rHFGR1rEyTPDYH7xjN99iPZkBJ": [
			{
				"comment_id": 182,
				"body": "Do you have [ipfs?](https://ipfs.io/)",
				"added": 1472458992
			},
			{
				"comment_id": 184,
				"body": "> [jarmund](#comment_2_1CiHRyU3rHFGR1rEyTPDYH7xjN99iPZkBJ): No I need ipfs for it ? Sorry if it's a noob question I'm new on Zeronet\n\nYes. That particular site explicitly mentions the pictures are hosted on IPFS. So you need to set it up to see the pictures.",
				"added": 1472593545
			},
			{
				"comment_id": 185,
				"body": "Lol. I ain't tech support. I have my own slew of issues with IPFS. The big issue seems to be that most of the images on the site won't load due to either lack of it being hosted, or some IPFS issue. Can't really help there. All I can say is that I *did* manage to get some pics to load, and obviously IPFS is needed (as the pics are all hosted there).",
				"added": 1472623246
			}
		],
		"16_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 183,
				"body": "> [jarmund](#comment_1_1CiHRyU3rHFGR1rEyTPDYH7xjN99iPZkBJ): Hi, why I can't watch anything? the watch it buttons are unclickable.\n\nVideos need to be seeded. At the moment, most of the videos on the front page are uploaded by me, and my webtorrent was going fritz with 300% cpu usage. I've got that settled, so the videos should work now. There needs to be more seeders for the site to work smoothly.",
				"added": 1472460814
			}
		],
		"2_1AZjDLkfYwSmjM7ZJUf7HHnrF778augRMa": [
			{
				"comment_id": 186,
				"body": "> [iamdeath](#comment_1_1DcE9QfZbfLZhXxgtQ8Ui3oMZvs9NVjqZB): The real question: Will women ever use this network?\n\nThere's already several on here. We've probably been using ZeroNet longer than you have, TBH.\n\n>And what's so bad about gun dealers, anyway? You want a gun, don't you?\n\nWrong thread? No one mentioned guns or gun dealers here. Though I agree that complaining about legality on an uncensorable network is silly. I'm personally 100% for gun ownership and the second ammendment. As I'd imagine most people here are.",
				"added": 1472629905
			},
			{
				"comment_id": 187,
				"body": "> [iamdeath](#comment_5_1DcE9QfZbfLZhXxgtQ8Ui3oMZvs9NVjqZB): BORN female. Like XX female, not XY + mentally ill.\n\n1. Trans women are women. Just because you're an idiot doesn't make that not true.\n\n2. Lots of cis people have genetic disorders and are not XX nor XY. Chromosomes have little bearing on sex and appearance. Seriously, go fucking learn your shit before you spew crap off like an idiot.\n\n3. Being trans is not a mental illness. Though I'd consider people who say stupid shit like the stuff you're saying to be mentally ill.\n\n4. Yes, there are cis women here. You don't believe it because you're a sexist transphobic bigot. If you don't like it here, gtfo.",
				"added": 1472698015
			},
			{
				"comment_id": 188,
				"body": "> [xiaoxin](#comment_5_17bo4yV2YQ8qERFytHMogwancQzQmzzaDM): My fiance suffers from gender dysphoria, mind, and I say suffers because it causes an immense amount of distress for her.\n\nIt's unfortunate and happens. Best you can do is treat it and move on.\n\n>It's a mental disorder, linked to a small but consistent abnormality in the brain, and like most mental disorders and illnesses (i.e. clinical depression) there isn't a cure either, only treatment.\n\nNo. It's not. Gender dysphoria, as described in the DSM-V is a mental illness, not a disorder. It's not linked to any abnormality in the brain, but rather an improper responding to sexed hormones. Which is why it's treated with hormone replacement. And yes, it's been cured. This is the type of idiocy I was talking about.\n\n> I could point you to a dozen books written by certified, professional psychiatrists, but they all say the same thing: avoidance and denial are absolutely, completely ineffective at treating anyone with a mental disorder: anxiety, PTSD, eating disorders, whatever.\n\nI don't disagree. I'm well read on psychology and mental health. Gender dysphoria, and being trans, are not a mental disorder.\n\n>And indulging in a disorder, i.e. normalizing suicide, or chemically and surgically imitating the opposite sex hurts people, badly, and permanently, and it's absolutely reprehensible for any medical professional to permit it.\n\nGreat strawman right here. No. Transitioning, hormone replacement, and surgery do *not* make people worse off. What makes people worse off is ignoring the problem. There's a reason untreated trans people have a 40% suicide rate while post-op reduces that dramatically.\n\n> So you know what my soon-to-be wife and I do, concerning dysphoria?\n\nSolve the problem? It's pretty straight forward, and treatment works almost immediately.\n\n>Find an effective therapist, learn to live with it, not reject it, or indulge in it, \n\nHave fun with that, I'd rather not live my life eternally depressed. Thanks. You do realize talk therapy doesn't help with a hormone problem, right? And that it simply gets worse with age?\n\n>and stay away from incredibly reckless practices like hormone therapy and surgery, the kinds of things that ruin people's lives.\n\nExcept it has an 80%+ satisfaction rate. One of the highest in medicine. If transitioning is 'reckless and ruins people's lives' then certainly all medicine and medical treatment must. Given everything else has a lower satisfaction rate.\n\n>Because you know what kind of people are able to accept their problematic circumstances, recognize reality, and endeavor to be happy despite it? Grown up, fucking adults.\n\nGrown fucking adults don't deny science and reality in favor of fantasies of \"I'll just get over it magically\".",
				"added": 1472769487
			},
			{
				"comment_id": 189,
				"body": "> [tbh](#comment_3_1EmKu3AxsUduZzr99SryZbfcPrihsZV9mg): What is gender dysphoria and how does it work?\n\nGender dysphoria is a mental illness that arises from the condition of having neurological sex differ from the sex of the rest of the body. In most cases this means only trans or intersex people will get it, but there have been cases where cis people have gotten it for a variety of reasons (side effects of other drugs, forcefully transitioned, willfully transitioned, etc). The exact sensation is a bit difficult to describe, but it's a bit like depression, body dysmorphia, and anxiety all balled up into one.",
				"added": 1473026298
			},
			{
				"comment_id": 190,
				"body": "> [superkitty](#comment_1_18o9faKCDNyTE7EmGKEG8QZcepqSLBZRwj): Thought experiment:Image you have a perfectly normal female, and a perfectly normal male.Then you take their brains and switch them out.\n\nJust to be explicit, there's no other changes? You literally do a brain transplant ala the one coming up? I think trans people in general would be pretty excited at that.\n\n> How do you think they would feel about that?What if they are stuck like that for the rest of there life?\n\nIf you did such a brain transplant on a cis (not trans) person, they'll almost certainly experience gender dysphoria due to conflicting hormones and anatomy. There's been quite a few cases that demonstrate this. The most famous is [David Reimer](https://en.wikipedia.org/wiki/David_Reimer) who's a cis guy that was forcefully transitioned.\n\n> There brains are healthy, and the bodies are healthy, so what is the problem exactly?\n\nThis is the case for trans people. The issue is the gender/sex conflict. The brain expects a certain physiology and certain hormones. Examples unrelated to sex would be stuff like phantom limb syndrome.\n\n> The sexually dysmorphic differences in a body happen due to the sex hormone balance at multiple stages of a persons life.For many things, once developed, it is \"set\", meaning that changing the balance later wont change it much or at all.\n\nMost development happens within the womb and then later at puberty. Pubertal changes can sometimes be undone (depending on the exact trait/change we're talking about). But yes, several sex traits can't be undeveloped (voice, breasts, reproductive organs, genitals, etc).\n\n>The brain is sexually dysmorphic (why wouldn't it be?) and while it has much plasticity, it also has parts that have little or no plasticity.\n\nSure. The brain is pretty complicated as it is.\n\n> In the womb, humans start off female and are either left to develop as a female, or switched to male with a timed testosterone dump.The amount of testosterone in the dump, and the timing can be off, resulting in anomalies, like a brain that developed female in a body that developed male.\n\nYes. This is the current theory as to the cause of trans identities.\n\n> Biologically, males and females are almost identical, if you change a persons testo/estro balance during childhood to the opposite of there sex, they will develop into the opposite of there sex, voice, appearance, size and all.\n\nIndeed. Once outside of the womb, besides already developed differences, the presence of external hormones can cause the body to develop in either direction. This is why transitioning often times works much better for younger people.",
				"added": 1473037515
			},
			{
				"comment_id": 191,
				"body": "> [iamdeath](#comment_27_1DcE9QfZbfLZhXxgtQ8Ui3oMZvs9NVjqZB): nobody cares about your genitals. You can totally be female here, misseh\n\nWell excuse me for answering questions. Wasn't even part of the discussion until *you* brought it up.",
				"added": 1473045673
			}
		],
		"6_1L5rGDgTs4W2V7gekSvJNhKa7XaHkVwotD": [
			{
				"comment_id": 192,
				"body": "The KaffieID site should be fixed. The content.json had an include that wasn't actually part of the site (from when I cloned it from Nanasi). Just remove everything from 'includes' to fix it.",
				"added": 1473159456
			}
		],
		"1_1CpmRqADyAVneFPpvoUJjhMQpQwLEB3CWE": [
			{
				"comment_id": 193,
				"body": "Not that I'm aware of. Market sites still haven't come to ZeroNet just yet. There might be a blackhat forum around though. The [HackerTalk site](http://127.0.0.1:43110/14Z5ps3D5tpFbd1TUnqF7xjAtBW5yFuJRb) might be what you're looking for.",
				"added": 1473161645
			}
		],
		"1_1JgHfDK4eojCkVZHKey9hiMAcAc9mxMUK2": [
			{
				"comment_id": 194,
				"body": "> [amenefus](#comment_1_1Pva3FqPLwAFNRaxrN9S8ub5hbxNTqcZnR): I'm working atm for pastebin in 0net\n\nAs an FYI, there's already [NullPaste.](http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz)",
				"added": 1473161720
			}
		],
		"1_1K4ZbzAxkpr7BJyVqFdZiXptiiNSQCvDBW": [
			{
				"comment_id": 195,
				"body": "You have to sign it before publishing. You can easily sign/publish with the sidebar.",
				"added": 1473201001
			}
		],
		"1_1NLKyC1Eq7gZeRKZ6oPN45wMWorx9yFWUW": [
			{
				"comment_id": 196,
				"body": "It's a cross-site username. And yes, you can block certain names from posting.\n\nI'm curious though, whether there's an option to just not use usernames, and instead use the user's public auth key that's generated for the site instead.",
				"added": 1473232985
			}
		],
		"1_1B8TUcKXxx7nTpUwf5B5rXNnNyUpV8SG5V": [
			{
				"comment_id": 197,
				"body": "Do you have IPFS set up? It's needed in order to see the stuff.",
				"added": 1473240152
			}
		],
		"1_15WJPhvY6MCRGdWoJXsLUE7FjhWXsTjN6V": [
			{
				"comment_id": 198,
				"body": "Copy the users.json file to the new computer. It has all your keys and such.",
				"added": 1473474390
			},
			{
				"comment_id": 200,
				"body": "> [a1user](#comment_1_18Sh2Z83C23xdd6pjCq6NGv7Y6svEBcUfb): Too hard. Users should be able to reuse ids they already created without having to copy files.\n\nIt's basically the same as a bitcoin wallet. Though, I'm curious on what your ideas are to sync computers without a central authority?",
				"added": 1473546516
			}
		],
		"6_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": [
			{
				"comment_id": 199,
				"body": "http://127.0.0.1:43110/kaffiene.bit",
				"added": 1473474435
			}
		],
		"1_1PoA7YxWVZKoXWoD1PjdwByFqqCA8d2uqr": [
			{
				"comment_id": 201,
				"body": ">It is not like a mirror of the Internet, and it should be, only decentralized.\n\nUmm what? That's pretty much exactly what ZeroNet is.\n\n>The urls are too long to unable to be remembered\n\nThis is solved by registering domain names through namecoin. It's entirely optional, much like the regular web.\n\n>instead the .json files should be stored on ZeroNet itself, \n\nWhere do you propose they be stored? The whole point of ZeroNet is that there's no centralized server. And putting personal authentication in a publicly accessible place makes it vulnerable to attacks. There's no technological way to achieve this.\n\n>so users can login anywhere, from any browser.\n\nYou can already do this. You just need to migrate your keys. But yea, it definitely needs to be made easier.",
				"added": 1473656093
			}
		],
		"4_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT": [
			{
				"comment_id": 202,
				"body": "Client doesn't seem to work, and when I try to share my library it fails because none of the stuff I listen to is in MusicBrains.",
				"added": 1473723980
			},
			{
				"comment_id": 203,
				"body": "> [icf20](#comment_10_1JARuoKjvXanUeKyPTXU9cus2jRzi4DZU5): is not this the original website http://torrent-tunes.com/ ?\n\nThat site is even more dead. It's all broken and nonfunctional.",
				"added": 1473727607
			}
		],
		"3_19dSnqd1GpiMTnuiD4n1tPasyKTDfNSFyz": [
			{
				"comment_id": 204,
				"body": "I'm still not seeing how any of this relates to the movie linked. The film (In Time, it's pretty good and the whole motto is *against* the system contained in it) has a simple synopsis of: money=lifespan. I fail to see how that relates to ZeroNet at all.\n\nThe comments seem to be implying a cryptocurrency combined with zeronet sites? Something like Steem I imagine? I avoid using cryptocurrency forums/social networks for a reason. They discourage active users, and promote circlejerks/shitposts. On top of that, it adds a barrier to entry, have huge lag (due to blockchain requirements), and are impossible to have exponential growth. So ultimately you get an asymmetry along time, and the earlier users benefit. Fail all around.\n\nIf we tie it into ZeroID, that defeats the whole purpose of having decentralized authentication (See: KaffieID, Nanasi, etc). And nothing prevents someone from 'farming' by making multiple ZeroIDs and draining the existing account. If you just artificially gave out coins to anyone, you'd need a central authority, which defeats the entire purpose of ZeroNet: to be decentralized.\n\nLastly, there's no reason to even have such a thing. Bitcoin works fine, as does namecoin.",
				"added": 1473921550
			}
		],
		"2_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz": [
			{
				"comment_id": 205,
				"body": "> [kopykate](#comment_21_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4): Why is America so obsessed with gay people?\n> It seems to me like Americans either worship gays, or they hate them and wish them death. Here in New Zealand, nobody gives a fuck what people do with their personal lives.\n\nBunch of prudes started the US, and then gay people started revolting. Things got more divisive until the current day. People here are now either super-ally/flamboyantly gay or they're super prude religious nuts. People who fall in between are pretty much just ignored. Bad for the press.",
				"added": 1474516802
			}
		],
		"5_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": [
			{
				"comment_id": 206,
				"body": "The day spotify has the music I listen to is the day I start listening to my music legally.",
				"added": 1474969238
			}
		],
		"2_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR": [
			{
				"comment_id": 207,
				"body": "I just banned the first two users from KaffieHub: bbxxx@zeroid.bit and doom1@kaffie.bit. And I had to remove their spammy comments from my posts.\n\nSounds like someone needs to start an auto-ban list for known spammers.\n\nEdit: doom1 tried to get around the ban by making doom1b@zeroid.bit so I banned that too.",
				"added": 1475301410
			}
		],
		"1_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 208,
				"body": ">I stupidly read posts/comments from SQLite and am happy. \n\nThat's what you're supposed to do. The SQLite database is literally there to make reading the content easier.\n\n>I, look, data are duplicated both in JSON, and in SQLite. \n\nYes. User submissions are published in their particular folder, commonly as a JSON file. These JSON files are then merged on the viewer/client-side into a temporary SQLite database for easy reading. You can see the 'rebuild database' button in the sidebar of sites you visit.\n\n>Whether it means that data income from network in JSON, and SQLite is their cache for acceleration of local work?\n\nYes. This is correct. The data that is synced/shared/uploaded is all the JSON stuff. The SQLite is just a local compilation for easier coding/reading.\n\n>So I should save the new post information both in JSON, and in SQLite?\n\nNo. Only JSON. In practice, you need to: edit the JSON file, sign the user's content.json file using their private key, publish the files. The SQLite database will be rebuilt automatically as needed.",
				"added": 1475661706
			}
		],
		"2_14UupgrdnT7Y8vMES7aqUFgD1fC5RYNrh8": [
			{
				"comment_id": 209,
				"body": "Lol at neither nofish or bot actually addressing the question. From what I'm seeing, there's not a way for a zite to determine the download speed of various transferred files. Perhaps you could make one file 'optional', then load the zite. Have the zite register the time, and then attempt to load the file. It'll begin downloading it, at which point you can detect when the picture loads and calculate dl speed.\n\nBut the problems I see are:\n\n1. Files are only downloaded from a single peer. They aren't chunked or anything. Different files can come from different peers.\n\n2. Given 1, your speed displayed would be based on the speed between you and the one peer.\n\n3. AFAIK there's not really a way for a zite to delete a file, so that you may easily retest.\n\n---\n\nPerhaps you could try getting a tool for your computer, to see the bandwidth coming in/out and then loading a zite?",
				"added": 1475662060
			},
			{
				"comment_id": 211,
				"body": "> [nofish](#comment_793_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Different files are downloaded from different peers. Giftime has 1000+ files, so it can be downloaded from 1000 different users (workers limited to 20 by default, so it won't). This files are around 1MB so there is no reason to chunk them into more pieces.\n\nRight.  I think I miswrote there a bit. I meant an individual file is only downloaded from a single peer. While multiple files are spread across different peers. And indeed, most files right now are <1mb. However, small files don't really work for testing connection speed, especially if they're from different peers.\n\n> The sidebar downloaded file size are updated every second, so it's not hard to calculate the real bw usage. (or you can use OS's task manager to see the speed)\n\nIs that information available to zites? OP is talking about making a service like speedtest.net, where you can go and run a test to see how fast your connection is.",
				"added": 1475755763
			}
		],
		"3_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": [
			{
				"comment_id": 210,
				"body": "Not sure what this has to do with communism. It looks more like a failing of capitalism to me.",
				"added": 1475755505
			}
		],
		"2_1AWKKjCvCFvUbmrbBtqrMSfAGZ8D6tAVHt": [
			{
				"comment_id": 212,
				"body": "[OpenNIC](https://www.opennicproject.org/) resolves .bit domains. You can also find NMControl, which is a tool for browsing .bit sites, on the [namecoin download page.](https://namecoin.info/download/)\n\nIt's worth noting that .bit is a TLD. It's not a system or dns. ZeroNet uses namecoin, which is a blockchain that manages a dns for .bit domain names. Namecoin itself is *not* made just for ZeroNet, and other things may be entered into the registry. Most of these non-zeronet sites can be accessed simply by using opennic or nmcontrol. But there's certainly nothing stopping someone from making a unique way of resolving namecoin .bit domains for their own software, much like how zeronet does. And, tbh, zeronet is probably the largest collection of .bit sites.\n\nEdit: It's also worth noting that zeronet sites cannot be accessed without zeronet. Trying to visit, for instance, talk.zeronetwork.bit (this site) without zeronet will result in nothing.",
				"added": 1476703099
			}
		],
		"9_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": [
			{
				"comment_id": 213,
				"body": "The big problem with a decentralized MMO is storing and verifying data. You could do it in a blockchain, as you mentioned, but that'd be too slow for a game. The other option, then, is to store it on the user's machine. However, this is then prone to hacks/exploits.\n\nInstead, what you could possibly do is make a 'federated' system. Where you have servers, but those servers can be owned by anyone and sync among themselves. This is essentially a decentralized version of how MMOs currently work (currently, they have multiple servers owned by the same company, and are either isolated, or sync/share data).",
				"added": 1477029991
			}
		],
		"11_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": [
			{
				"comment_id": 214,
				"body": "I'm in california, and there's quite a bit of talk about it, it seems. It's definitely *possible*. There's a measure called 'Yes California' that's going to be put up for a vote in 2018. And I think many people would be supportive of it. We *are* the 6th largest economy, after all. But the biggest issue is managing to convince the other states to let California go. No clue how easy/hard that'd be.\n\nBut the path is pretty clear: Vote yes to seceding -> Figure out the legal stuff -> get the majority of other states to agree -> Independent California!",
				"added": 1479298590
			}
		],
		"1_1Gi4g59DwnkjgL9VmvmrfC95tMymyWFaaY": [
			{
				"comment_id": 215,
				"body": ">Why bother with DNS poisoning when the DNS servers are likely run out of a basement in China.\n\nAre you fucking kidding me? This alone tells me the poster has no clue how ZeroNet works, nor what the risks are of running it. The DNS is based on namecoin, which is as safe and decentralized as bitcoin. If you have a problem with namecoin, you sure as fuck have a problem with ICANN, since namecoin is demonstrably more reliable and safe than ICANN. You can 100% guarantee that the site you're looking for is the site you get, and not someone who did a DNS hijack, or an ICANN official mucking things up.\n\nI don't use ICANN. Fuck them. OpenNIC for regular web, and namecoin for dark web. Anything else and you're opening yourself up to security risks.\n\n>For example, White Van material (talking about CP here) has been found encoded into EXIF data in seemingly benign pictures. Android had a HUGE insecurity where just viewing an image on your phone ran a script behind the scenes and you would never have known.\n\nThe issue with android is a bigger issue on the clear web, as images can come from anywhere and be automatically ran. ZeroNet prevents cross-site embedding, which means only sites you trust can load images or content.\n\n>You cannot, I repeat CANNOT browse or use a webpage while you are offline. \n\nYes you can. I often browse ZeroNet while offline. In fact, you can *only* view pages 'offline'. Page content is not streamed, it's downloaded and then viewed. ZeroNet just saves it instead of cache.\n\n>However, AJAX won't work\n\nAJAX works fine on ZeroNet, though it's obviously not encouraged.\n\n>HTTP requests and responses won't work, \n\nThey do. Only to sites that have been set to view offline.\n\n>links won't work\n\nThey do. Again, you can certainly use a search engine like Kaffiene, and then click a link to a site and visit it, all offline.\n\n> refreshes and updates won't work.\n\nThey do. You can refresh the page, and updates from you or anyone on your lan (once support is done ;P) work fine. Obviously you can't receive updates from the internet without being online. Duh.\n\n>OP is directing people to a link (I'm not posting it). If anyone asks a question, OP replies and attempts to answer by saying \"just download the link\". I don't need to explain why that would be monumentally stupid in doing so.\n\nYeah, it's really dumb to download and run stuff without knowing what it is. But that's like saying \"if someone tells you to download and run firefox, don't do it because you're dumb!\" ZeroNet is completely safe.\n\n>digitally signed, and secured so that information at rest and during transmission isn't being tampered with. \n\nActually, you can't get that guarantee with the clear web. You guarantee it with ZeroNet.\n\n> You can't verify that what is being handed to you isn't malicious or that executables aren't embedded in them. \n\nActually, that's true of the clear web, not zeronet. 'google.com' on the clear web could point you to a malicious site due to a variety of reasons. But kaffiene.bit on zeronet will *guarantee* you get the right files coded and signed by yours truly. But yes, just like the internet in general, you can't guarantee that any particular user will not host malicious files. That goes for both clear web and zeronet.\n\n>Once they have been received by your system, they don't go away when you delete Zeronet\n\nOh for fucks sake. ZeroNet is entirely self-contained. If there's any exploit, it's due to your browser, and thus you're equally as vulnerable on the clear web, if not more so due to the previous flaws mentioned.\n\n>Say goodbye to HTTPS, SSH, TLS, or any other standardized and ubiquitous security measure when you use Zeronet because you're pulling your information from an adjacent node, not a server.\n\nSure, but you don't need them. All the files are guaranteed to be correct by math.\n\n>TOR is not secured, either. \n\nTor is not zeronet.\n\nThis guy is clearly clueless about how ZeroNet works, or why it's *more* secure than the clear web, not less.",
				"added": 1479976293
			}
		],
		"2_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp": [
			{
				"comment_id": 216,
				"body": "I can never seem to get IPFS to work right. Everything has problems loading, even though I'm running it as instructed. Dead files, slow connections, files don't load right, etc. For something that's focused on 'permanence', there sure does seem to be a huge difficulty in actually getting the files.",
				"added": 1481870170
			}
		],
		"2_17tQX9J2fScN9APmweSUnzEU4EfTG1ojYb": [
			{
				"comment_id": 217,
				"body": "> [nekololi](#comment_6_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): i just assumed that feature was broken because every time i open the browser all my favorites get reset. how exactly are favorited sites saved? cookies? localstorage? or something on zeronet's side?\n\nWell the favorites feature definitely works. It's stored in the browser itself, likely through cookies or localstorage, given that using a different URL for the homepage results in losing your favorites (using different URLs you can have different sets of favorites). Really, they should be saved in ZeroNet itself, so that the browser is irrelevant to whether you can see your favorite sites.",
				"added": 1482101812
			}
		],
		"2_1DSoqCXNkqv7yJNXiF6YoaeK2bW8BFt2gh": [
			{
				"comment_id": 218,
				"body": "ZeroMail isn't actual email. It's just encrypted messaging. You can't even use it to mail cloned versions of the site.",
				"added": 1482209153
			}
		],
		"1_1yk1FeoNn1RmZRtCXcsgL59nNp7xs3aYu": [
			{
				"comment_id": 219,
				"body": "If Michelle Obama was trans, Obama would still be straight. Unless the claim is that she's FTM. As for a dick.... certainly if she were MTF then she'd have gotten surgery? I swear some people are just too retarded to actually use their brain.",
				"added": 1482210528
			},
			{
				"comment_id": 220,
				"body": "> [dr3](#comment_1_1TEcpFuYhzNgL8wwwNW9kAHy2QpPNw9wT): My best respect for Michael/Michelle Obama.They are different kind of sexual modifications/reassignments. As seen in the video he/she could have penis even if the testicles are removed and the female hormones are taken to make the breasts grow.In whatever transition stage is legally considered a person male or female in one country or another the biological sex is more connected to the genetically defined sex. People are understandable confused now but in everyday language they still tend to use the biological sex.How would you call those with penis and tits but removed testicles ?How would you call those with removed penis but intact testicles ?https://www.youtube.com/watch?v=_qvNvnPK1wkhttps://en.wikipedia.org/wiki/Penectomy\n\nIf you're legitimately curious, given that she has actual breasts, if she were trans, she'd be on hormones. And likely for many months (at least the entire time she's been in the public eye, so 8+ years). Along with that, there's no reason to doubt she'd have SRS given her status and wealth. Usually the only prohibitive thing is cost (it's an expensive surgery). Most trans women either just remove testicles, or get the full surgery.\n\nIn any case, trans women are still women and are referred to as such. Even if not all of the transition steps are done. As for 'biological', trans people change their biology through hormones.",
				"added": 1482415235
			},
			{
				"comment_id": 223,
				"body": "> [al1](#comment_3_1DJDNVzhYeJ7xvDYnaXdJqnZ9YKcTWQixt): Interesting woman with penis.kaffie But even you are not modern enough under Obama and Clinton.Under Obama's new rules, a male student does not have to be undergoing hormone treatment or surgeries to be considered \"transgender.\" Any boy can qualify by merely walking into the principal's office at his school and declaring himself a girl.What's more, a student's gender \"identity\" is considered \"fluid,\" so he could consider himself a boy one day and a girl the next. The burden is on the school to adapt and accommodate.The fact that the U.S. Department of Justice's Civil Rights Division signed the new guidelines along with the U.S. Department of Education sends a message to schools.Comply or be sued.\n\nYeah, the modern stuff is SJW tumblr shit that harms the trans community. It's awful. Really it should all be doctor/medical based, rather than just by what the person says. Real trans people are legit and deserve respect. Tumblr shit can just gtfo. Though I *do* appreciate Obama's pushes on trans stuff, since it *does* benefit me as well. Even *if* it gives legitimacy to the tumblr shit.",
				"added": 1482609816
			},
			{
				"comment_id": 225,
				"body": "> [johnb](#comment_1_128uk9XrPKhpPf3jZx6mmhNucxVqc9dnqX): Oh. Congratulations.And in which category do you consider yourself ? MTF or FTM ? In transition, completed or just starting T ?\n\nI'm a girl. I've been taking my E for about half a year now.",
				"added": 1483229662
			},
			{
				"comment_id": 226,
				"body": "> [johnb](#comment_2_128uk9XrPKhpPf3jZx6mmhNucxVqc9dnqX): Sorry, I am not familiar with this.Is this an estrogen hormone to induce external female characteristics ?\n\nCorrect. I take an estrogen supplement (in the form of estradiol), along with an anti-androgen (spironolactone). The estrogen is used for the obvious reasons, to raise my estrogen levels up the proper female levels. The anti-androgen is used to *lower* testosterone down to female levels. From there, the body naturally develops how it should, and female characteristics properly develop. There's a huge list of stuff that happens. Skin changes, sweat, fat distribution, breasts, hair growth, some shrinking, certain things stop growing, body hair changes, etc, etc. There's also a whole host of mental effects, which have benefited me greatly, including relieving my anxiety.\n\nLike wise, trans guys go the other way. They take testosterone injections (no need for an estrogen suppressant), and develop male characteristics as they properly should: facial hair, muscle/bone growth, body hair, fat distributions, sweat, skin changes, etc, etc. Though I'm not too knowledgeable about this direction, since I've never had the need to look into it.",
				"added": 1483400731
			},
			{
				"comment_id": 227,
				"body": "> [johnb](#comment_3_128uk9XrPKhpPf3jZx6mmhNucxVqc9dnqX): You mean girl above and with penis and testicles bellow? Is half of year estrogen supplement enough to grow female breasts?\n\nEverything about me is girl, because I'm a girl. But yes, I haven't had reconstructive surgery yet (you can only get that after a year of hormones). And yes, I have boobs.",
				"added": 1483792514
			}
		],
		"1_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": [
			{
				"comment_id": 221,
				"body": "Well you can't fake archive.fo links, right? So it'd be up to whether the twitter account is actually him, or if it's just some nut.",
				"added": 1482506226
			}
		],
		"3_12shzNwEsUKcdzbWYFNH54LJjKzQ7MUwhp": [
			{
				"comment_id": 222,
				"body": "If you can make a blockchain that isn't garbage, I'm all ears. I'm *avoiding* blockchain tech and using ZeroNet mainly because the blockchain is too large/bulky, slow, and immutable. It's basically really only good for large (non-micro-transaction) purchases. Namecoin works great in that regard, since DNS stuff doesn't need to be updated frequently. But some people are trying to build forums and such on the blockchain, and it's just awful.",
				"added": 1482533012
			}
		],
		"1_14DujeMmUQr14gCcg6ZUVcdU1DA5GphYvG": [
			{
				"comment_id": 224,
				"body": "ZeroNet is pretty much the exact opposite of tor. So it's not an alternative (they can be used side by side). And no, it's not made by the NSA. Just some dude.",
				"added": 1482642099
			}
		],
		"2_1AWSA7oG2qrhWYgeSiJtDHCwc2KvyR7ijs": [
			{
				"comment_id": 228,
				"body": "> [martinv](#comment_8_18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj): What about every peer including the original owner of a zite deletes the site from their ZN dashboard?I guess some proxy might still have a copy, but what if it never was added to a proxy?\n\nThis has actually happened. Where all the peers of a site either stop using ZeroNet, or they delete the site, or they stop seeding. After all the seeds are gone you get a 'no peers' error message. It's very rare for this to happen on popular ZeroNet sites like the default ones (ZeroTalk, ZeroMe), Kaffiene Search, or 0chan, but it could theoretically happen. As long as *1* person still has it, it'll be hosted.",
				"added": 1483940925
			}
		],
		"1_1AhXDbKvcLap7TcS2542J7bFYzKHM3xeRU": [
			{
				"comment_id": 229,
				"body": "> [thisweb11](#comment_294_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): All anarchists use money but not all money is used by anarchists\n\nNot all anarchists support currency. I'd argue that you can't be a true anarchist if you support a society that has money and ownership.",
				"added": 1485328353
			},
			{
				"comment_id": 230,
				"body": "> [thisweb11](#comment_296_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Well, as I say it depends what you mean by money. Money is just an I O U a favour. Money is a token of trust. It can be anything. \n\nI mean any form of ownership. Tokens representing ownership are included. If you can 'trade' that means you own something. And if you own something, you need to enforce that ownership and restrict others' access to it. While that can certainly happen in an anarchy, it's not supportive of such and does not match the ideals, philosophy, etc. And I'd argue that in a properly formed anarchy, it'd be unneeded entirely and there'd be no reason to do so.\n\n\n> [planespherev3](#comment_135_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Agree. That's one of our divergence with thisweb11. But i don't point out this difference because we have more common points than differences. \n> For me also, it's absolutely necessary that we abolish money, since it's the core of the system. The mechanism around everything else is organized.In revolutionary Catalonia, in some areas, money was abolished.\n\nIndeed. I see that as what should be the 'goal' of current governments. Get rid of the opportunity to create income and wealth inequality, and then reduce ownership and switch to models of mutual access.\n\n> [jjg](#comment_3_1AfMv5MuNfa3BfmdsvGiHn9fnrEsCwxhhC): So, are we practicing anarchists here or is this mostly theoretical?  If practicing, let's trade tips and tactics, because each day it looks like the world needs more anarchists :)\n\nI'd be curious on how you can practice anarchism in modern society. It's not exactly like you can just ignore the legal system and assume nothing will go wrong. I do think opting out of society as much as possible should be the current goal. And focusing on making free decentralized systems so that the current legal and monetary systems are unneeded. The less support mainstream society has, the easier it'll be to get rid of it. I talked a bit about this on my blog, but I definitely need to do some more in-depth writing. Unfortunately I don't think opting out completely without societal support will ever be possible, as long as you have medical needs or desire new tech.\n\nWhat we really need to get anarchism off the ground and going is lots of funding and resources. Building up networks of anarchist communities, and focusing on cutting ties with major systems. I think ZeroNet can be a key piece of this in terms of tech. No need for dedicated webhosts, no need for ICANN, no big corp tracking or spying, etc. Unfortunately the hardware and physical aspect of it all is much more difficult than the digital portion. Software is already an anarchy :)",
				"added": 1485515972
			},
			{
				"comment_id": 231,
				"body": "> [shishi900](#comment_6_17U149zMQuTXJ53cXGLyDfrGEoztPiFkjc): Why the harsh language tho ? Fuck off with your sci-fi utopia already it never was, it never could be and it will never happen. The capitalism with big empire-like corporations is the future and you can see it.Try to land a man on the moon or mars with anarchism.\n\nWell the 'utopia' had been achieved a long time ago in the past. But you're right, without people pushing for it, it seems unlikely, and we'll almost certainly end up with a sort of dictatorship/fascism if we don't. Your vision of the future indeed seems to be the way we're headed (until earth runs out of resources and it collapses). And it should be seen as a dystopia to avoid. As for landing on the moon, capitalism didn't do it. You're thinking of socialism. I'm certain that anarchism would make these ideals *easier* to achieve, rather than harder.\n\n> [planespherev3](#comment_144_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Oh because it's so important for everyone of us to land people on other planets. Funny one of the arguments of convinced capitalists is always putting rockets in space or landing people in other planets when our current planet is by far the most beautiful in the solar system but we treat it like trash. \n\nIt absolutely *is* important to start decentralizing and get people on other planets and to make it easily done. But it's also important to help the earth. These are not contradictory goals.\n\n> [thisweb11](#comment_305_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Yes we cannot have ownership or property.    But if I send you, a distant comrade a letter asking for food because my child is sick, I should not offer gifts (gifts makes us slaves).  I have nothing to trade.  What I offer is my humanity and solidarity.  My word, a letter of love.   That is my money.   Everything is symbolic/gestures/tokens, language itself , before things can materialise.    Currency today I agree, it should be abolished.   But I also think there is a missunderstanding about that too. The point I wanted to make was really about profit, money (as in currency can exist without profit).  Its still a ransom to work, but profiit (like interest) was never always the result of money -  in middle eastern societies before capitalism, prices were determined buy the community, not the buyer or the seller.  And never for profit. \n\nYou can't buy or sell something without ownership or property. As long as you have ownership and/or tokens representing such, you will always have people who try to maximize how much they have. Regardless of the systems in place.\n\n> Q) Should anarchists support bitcoin or decry it?\n\nIt's a step up from the current monetary system. And the blockchain itself can be a useful way of assigning names and numbers (see namecoin which is great). I do not think access should be restricted based on bitcoin (or namecoin). I think a UBI implementation like [duniter](https://en.duniter.org/) would be a better option to support, if you're looking to replace money but still keep it.\n\n> Funding?  By that I assume you mean 'stealing' (taking back what is ours to take), especially given your first comment about money ;)\n\nIdeally funding and resources would be obtained peacefully, rather than aggravating the rest of society. It's important to have a good image. There's also the issue of legal theft deprives someone else of their access. Which is anti-anarchistic. It would not be an issue in an anarchy, as the person 'deprived' could simply take it back, or take something else they need. But within current society, most people do not want to get on the bad side of the militarized police. You're free to do so, but I don't think that'll be the fastest way of demonstrating a minimal viable product. To properly kickstart an anarchy you'd need *lots* of resources. Land, some sort of farm for food production, technology, shelter, water, electricity, etc. The more the better. Imagine managing to make an anarchic city. Go anywhere in the city and it's still good. Showing that living without money is possible will make people quick to ditch their slave labor which will then crumble the system. Trying to fight the law first will only result in anarchists being perceived as 'hoodlums' and criminals, rather than as people who want to build a better and more functional society.\n\nThis is why I have no problem advocating copyright infringement, but I'm more iffy on depriving people of things, and aggravating police. If you saw during Trump's inaugeration, some people calling themselves anarchists were breaking windows, knocking over trash cans, and lighting cars on fire. While that *was* a demonstration of rejecting the legal system, I doubt many people would look at that and go \"I want to be like them.\" But if, instead, you show them a city of people living and not needing to work, opting in where they can best improve the city, and generally living with modern luxuries, that's more attractive and will get people supporting the cause.\n\nRobbing the rich is fine. They don't feel it anyway. Robbing from the middle class and poor results in the deprivation of access being felt, and should be a no-go. That's my 2c on the topic.",
				"added": 1485563347
			},
			{
				"comment_id": 232,
				"body": "> [planespherev3](#comment_147_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): I don't want to give a bad name to anarchy, and this has nothing to do with it. And i don't want to troll or anything. \n> But since only truth can give the best of us, and there's no reason to self censor ourselves here, i'll say it.\n> I'm not 100% sure that such things as space, or planets, exist.\n> Now we can go back to anarchy.\n\nYou're right that it doesn't really have anything to do with anarchism. I didn't mean to imply such. Personally I think it's an important goal, and it's not contradictory with anarchism.",
				"added": 1485576064
			},
			{
				"comment_id": 233,
				"body": "> [planespherev3](#comment_148_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Wasn't irony. \n> But heh maybe it's too soon ;-)\n\nI'm aware. I just don't agree. I've looked into it before.\n\n> [thisweb11](#comment_309_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): So you do think people should own names and web pages?  Namecoin IS money. \n\nThis is kind of a complicated issue. On one hand, private ownership of a name/password/etc. is pretty much needed for online services to work and be convenient. On the other, owning a name or namecoin is indeed 'money' and thus enforced ownership. I think namecoin isn't really the way to go, even though it works *much* better than current DNS systems. I can see a type of namecoin blockchain popping up that has the UBI properties of duniter. Or maybe just ditching domain names altogether (though that might be difficult for non-tech people). As for web pages, yes. People should be free to be able to manage their own websites. Much like how it's done here on ZeroNet. You can easily clone a site, look at the source code, modify your locally downloaded copy, etc. So it's not like the content is 'owned'. And there'd certainly be no copyright. So really the only thing you could say is \"ownership of the ability to access content associated with a particular public key\". At which point I'd argue that it's not owned, but merely accessed by one person who's the only person who knows how to access it. If someone else got their hands on the private key, there'd be no issue with them modifying the site. Privacy =/= ownership. But this is certainly something I'd need to think more about, and talk about with other anarchists.\n\n>I agree we shouldnt own materials and have private property.  But I think you missunderstand my point.  UBI is a terrible idea because not only does it still allow the capitalists to control the means of production, it also doesnt give people the leverage of being able to withdraw their labour, and UBI could be cut back at the whim of the capitalists -  leaving many without any income or leverage to demand it back.   Its also why UBI is popular among the right wing capitalists as much as with the socialists.  Some corporate lobbyists are promoting UBI because its a distraction from the fact they own the property and means of production, it  grants them all the power of the state and resources and production in exchange for charity to the unemployed.\n\nOh I agree. I don't mean to say UBI is the end-all be-all system. I'm saying for transitional purposes, it's very useful. It helps remove the reliance on wage slavery. Again, refer to duniter for a good example of how I imagine a transitional currency.\n\n>Duniter means you only get income if you own a computer and own/purchase coins. \n\nIn duniter you don't 'purchase coins'. They're generated continuously and evenly distributed among the users. The inflation involved automatically equalizes older users and newer users, as well as the rich and poor. It's designed to be able to be used for transactions, while also keeping wealth and income equality over long periods of time. And yes, it's limited to people who have a computer and have opted-in, because this obviously isn't a government currency, and it's exclusively digital (like most money nowadays).\n\n>Theres nothing remotely anarchist about that.\n\nI didn't say there was. I don't think currency in any form is anarchist. I'm simply describing what I see as a useful transitional currency in order to *arrive* at anarchism.\n\n>Its still designed to be exclusive only to people who have the means to access it.  It is libertarianism, which to my mind is the worse of all systems.  I appreciate the intent is good.  But capitalism cannot be reformed.  Its just another variant of socialism trying to slow the worse excesses of capitalism.  But it isnt going to lead to anarchy.  We need to reject ALL forms of capitalism.\n\nI see socialism as the way to get to anarchism. By making existing systems more easily accessible without using pure cash, you decrease the reliance on currency, and thus make it easier to eliminate. I'm curious how you intend to arrive at a stable anarchism with a smooth transition, if you simply reject socialism and general attempts at removing reliance on capitalism. Violent riots/revolutions don't tend to work. Look at countries that tried that. They almost always end up with a similar style of government, and not actually anarchism.",
				"added": 1485609010
			},
			{
				"comment_id": 234,
				"body": "> [thisweb11](#comment_310_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): I totally disagree with this.  If we could have it peacefully we would have by now!  If you destroy property of banks (who are theives) or fight fascist police it actually effects them and may actually help other comrades, but you will not paint a good image of yourself.\n\nThere's a difference between short-term results and long-term ideological shifts. I'm focused more on the long-game, which will actually lead to major changes, rather than short-term which will just draw some small attention and not really do anything in the long run. Smashing a window doesn't actually help anyone to begin living in an anarchy.\n\n> You will NEVER get this without giving a bad image and stealing it.  The media controls how anarchists are percieved.  Nothing you do will make a differnce to how you are portrayed in the eyes of the public. And if you want resources you MUST take it, there is no alternative. It is never going to be handed to you.  Capitalists 'own' everything.\n\nAgain, you're confusing short-term gains with long-term movements. Stealing something does literally nothing. Things are stolen every day. It does nothing to change the political/economic climate to an anarchy. No amount of looting or violent resisting of police will end up, say, making every building freely accessible. That will only come from society itself changing.\n\n> This would be great.   Its what happend in catalonia.  All of those anarchists fought non peacefully to get it.  And they are not portrayed as people with a good image  today, even as most of the world today acknowledges Franco was an evil fascist.\n\nRight. Some sources will always paint anarchism in a bad light. But the more working examples we have, the easier it'll be to point to and say \"hey look, this works.\"\n\n> No I don t think they would say that either.  So?  You need to understand the black block movement.  Its a tactic for actually doing stuff that effects the system and allowing other protests (even non anarchists) to protest and act in other effectual ways whilst distracting the cops.    Do you think marching up and down a predetermined route helps?   The Womens March in DC last week was a distraction from the call for an actual womens global strike on that day  (which would have been way way more effective - revolutionary id say - see   http://www.womenstrike.org/  (the media didnt even acknowledge this call by women)    Thats why the media promoted the weekend march so much, to drown it out.   It does fuck all harm to them by comparison. And gives women an outlet that is mostly harmless to them.  Withdrawing labour is the only way to destroy capitalism.  Captalism will always exist while we still provide labour for them.  A weekend march doesnt touch them .  As a defiant act of self expression, it has some value (it potentially helps push the theory that we should change the system along a little).  But does nothing to actually change the system. \n\nRight. Demonstrations do nothing. What actually helps is systemic change. Not just a temper tantrum but a viable solution that works and will actually impact society in a major way.\n\n> Of course, but HOW do you get that city in the first place without TAKING it?\n\nThat's certainly a good question. One way is to just buy it out, participating in capitalism. I lived in a city like that, owned by a single company. Another way is to simply convert everyone in that particular city over to anarchism. Remember, the point is to get people agree with and participate in anarchism. Not attack people and try to attack existing countries. The big problem is that many supply chains are based around the world and are heavily entrenched in capitalism. A violent reaction where we cut ourselves off and claim a small block or neighborhood or something is functionally useless. Kicking people out doesn't help. We need them to simply readjust their work for anarchism instead of capitalism.\n\n> [thisweb11](#comment_312_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Why do you think its important to go to space when we can't even roam the countryside outside our back gate without capitalists permission?  I'd say getting to space is the least important goal in the history of humanity.   Its only  importance is one of fun, the pleasure of discovery itself.   But that makes it extremely low on the list of things we need to do when I can't even walk in the woods without a fine.\n\nBelieve it or not, making space habitable will do a lot to help push anarchist and decentralist values. The point of, say, colonizing mars is for the systems that are built. Food, water, shelter, etc. all easily available in a place that doesn't really have that stuff. On top of that, pushing for other-world colonization can be one way of kickstarting anarchism. Just simply not on earth. The moon, mars, etc. are all international and not all that regulated. Meaning it's the perfect testbed for anarchism. It's not *as* important, but I still see it as a good goal to have in terms of political views. As it stands, I'd *much* rather have the $600billion/year military budget spent on space/nasa, than on killing people.\n\n> [thisweb11](#comment_313_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Agree it is complicated.   ( I recommend anarchist David Graeber's book: Dept the first 5000 years which discusses the meaning of money at length)   Ive thought about this a lot and don't think its quite right to say anarchists must not use money.  Ownership of resources and private property is different to privacy and possessions. I think there are kinds of money that have a similar dichotomy of meaning that many anarchist fail to grasp. \n\nI cannot think of a single way to fairly distribute a currency and ownership without there being bias and a tendency to hoard and cause a growth economy. As well as to enforce those things. If you have ownership, you need a violent body to enforce that ownership (otherwise someone else could just take the thing). And by doing that you now have a government that decides who owns what. And thus you no longer have anarchism and capitalism will naturally arise.\n\n> OK.  Thats interesting I need to look into that more.  I think I missunderstood. How are they distributed and to who? , how is it decided who gets how many?  \n\nIt's all automatic based on the software. [See here for the theory behind it.](http://cuckooland.free.fr/TheRtmForTheKids.html) Everyone who's a 'member' of the software (actually using it and confirmed to be a unique human by the community) gets a portion of the newly generated currency. The amount generated is based on the current amount in circulation. Say, 10% (I think duniter has it at like 9.something). So every time new money is generated, it's 10% of the total amount in circulation, and that amount is then evenly distributed among members. This means there's continually rising inflation to equalize the the amount everyone has over time.\n\n> But we still have to actually get hold of resources to use this currency and thats what really matters, because if we have those resources we dont need the currency!\n\nRight. As I said, I think currency as a whole needs to be gotten rid of. But UBI is useful for remedying the current situation that capitalism has gotten us into.\n\n> Socialism hinders anarchy, if it didnt exist the capitalists would have needed to  invent it.  In fact thats why colonial countries like the UK adopted lots of marxist ideas (welfare, free schooling and eventually NHS) , anarchism was popular at around the same time, they were terrified of it.  Soft Marxism was used to appease an impending revolt and it held back the anarchists.  It does so to this day.\n\nThat's actually pretty interesting. I don't have any formal education in this stuff, and am simply sharing my thoughts on it all (and trying to keep up with terminology). Personally I still don't think the two are conflicting. I think socialism is a useful way of getting aspects of anarchism into capitalism without necessarily overthrowing the entire thing right away. For instance, I go through medicaid for health insurance and don't pay a dime. Exactly how it'd be in an anarchy. Likewise, I have a phone on a similar system. I don't pay for cell service. These systems let me opt out of capitalism in those fields. If you manage to do this with everything, you can completely opt out of wage slavery, albeit still be tied to a government. I definitely agree it reduces the 'need' for people to go to anarchism. But as I said, I see it as perhaps the fastest and easiest way of arriving at anarchism on a large scale. Socialize every single thing, remove the requirement of wage slavery, and then opt out of the legal system and economy entirely.\n\nThe other method I see is instead of socializing things through the political system, instead focus on not needing them at all through decentralization. Albeit that method is a bit harder, as you need to find alternative solutions for everything, rather than just jumping on board with existing ones. It'd also be more difficult to get people to switch as it'd require lifestyle changes for them.",
				"added": 1485610988
			},
			{
				"comment_id": 235,
				"body": "> [thisweb11](#comment_314_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): There can be no smooth transition.  Thats why capitalism remains despite decades of efforts from social democrats  and socialists to reform it 'smoothly' - and yet capitalism is getting worse.    Violent riots and revolutions don't work is simply not true.  Every revolution has worked becasue it got radical.  Civil rights, guerilla warfare, etc - not saying they gave us better ones - but look at Castro, his success was from radical fighting.  As is how EVERY capitalist state took power in the first place.    Its sad to think this, and its not something I want, but there have been no peaceful transitions to anarchy or socialism from capitalism anywhere in the world at any time in history that I know of.\n\nCapitalism gets worse because that's the inevitable outcome of it. Personally I still think it's possible, and will pursue it. But I don't mind of people want to do a violent revolution. Just be sure you're actually getting anarchism, and not something else hopping on board alongside it during the revolt.",
				"added": 1485611086
			},
			{
				"comment_id": 236,
				"body": "> [thisweb11](#comment_315_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Smashing a window doesn't actually help anyone to begin living in an anarchy.\n> Smashing a window IS living in anarchy.  Anarchy is a thing you do, a way you live, its not something you are 'in'\n\nThat's umm... great and all but it really does nothing but show how 'edgy' you are. You're free to do that, but if that's what you're talking about I'm afraid we're talking about two very different things. I'm talking about true societal freedom. Not smashing shit because yolo. There's many benefits to anarchism that can't be truly realized until it's societal, rather than personal.",
				"added": 1485611469
			},
			{
				"comment_id": 237,
				"body": "> [thisweb11](#comment_316_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): No, 'stealing' is a capitalist concept for a start. It doesnt really exist. But I assume you get this bit.  But you are wronmg it does nothing.  Catalonians 'stole' catalonia and the violently resisted the military.   Its the most successful example of an anarchist society in the last century.  Sure it didnt last.  Why?  Because the capitalists used violence and 'property claims / theft'  to take it all back.  And won.\n> \n> Yes.  Catalonia. That violent struggle - or any anarchits society and occupation 'theft' of property today.\n\nRight. 'Stealing' only makes sense when you have ownership. But still, the law still exists and is enforced by an increasingly militarized police. And personally, I value the freedom I currently have. Given how much of a minority anarchists are at the moment, trying to 'steal' the US seems a bit far-fetched. I'll definitely have to look into Catalonia though. Sounds interesting.",
				"added": 1485612382
			},
			{
				"comment_id": 238,
				"body": "> [thisweb11](#comment_317_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): True.  But I think taking physical action against the banks and defying  police approved march routes is not a temper  tantrum.  That is actually doing what you choose, its a defiant act and it makes the work of banks and corporations and police difficult and tiresome. \n\nI still don't see how it helps in the long run. Technically speaking, most major businesses have enough saved to go decades without earning a profit. And killing off one business will do nothing in terms of the national and global economy or legal systems. And in reality, you're likely hurting the people who work at those locations more than the people enforcing the systems.\n\n> [thisweb11](#comment_318_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): You cant convert the bankers and capitalist elites in canary warf and wall street to become anarchist.  You need to take action against them.\n\nSure. I'm certain they'll be the last to accept anarchism. The problem is that simply smashing windows or releasing cockroaches does nothing to them. They don't feel it. How they feel things is on large-scale systems. The political/legal system, *large* amounts of people opting out of the economy, a lifestyle change to opt out of using services/goods *completely* (not just boycotting for a week), etc. Big changes need big actions, and smashing a window isn't going to lead up to anything greater. And, if anything, will give a general negative image making it harder to get followers.",
				"added": 1485613878
			},
			{
				"comment_id": 239,
				"body": "> [thisweb11](#comment_319_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Agree.  But werent you trying to tell me duniter can be fair?\n\nAs a token of exchange it can be fair. In the greater scheme people will still hoard and you'll still end up with millionaires/billionaires, just not using the tokens but through other ownership like companies, jets, gold, etc. Duniter just guarantees that everyone has money, and that everyone is able to exchange that money for stuff. It's the most fair currency, but it doesn't mean that equality is guaranteed.\n\n> Ownership of property (except possesions) cannot exist in anarchy.\n\nOwnership of *anything* cannot exist in anarchy. Though if you insist, walk me through it. Say I 'own' something I bought with a bitcoin. What's stopping someone from just taking it and using it when they need it?",
				"added": 1485614239
			},
			{
				"comment_id": 240,
				"body": "> [thisweb11](#comment_322_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Thats understandable.  But how else can anarchy come about?  Do you really think the rich will give up their wealth by talking them round?  You will have to prize it from their hands my friend. If you have a way we can do that otherwise I'm all for it.  I just don't see it.\n\nThat's the thing. The rich don't *have* to 'give up their wealth'. You can just make their 'wealth' useless. Wealth inequality only exists because the majority of people say it does. If the majority of people reject that, then it's not a thing. Imagine, instead of forcefully taking something, or breaking something, a wealthy person attempts to continue using their wealth. They can't drive their car because no one delivers the gas to fuel it. They can't fly where they need to go because no one flies them there. Perhaps these things are still done, but wealth is ignored entirely. Opt out and reject the systems at play. Even if the wealthy attempt to claim something, there'd be no one guaranteeing that ownership for them. Simply put, when everyone refuses to 'play', power suddenly disappears. The issue, then, is getting everyone on the same page and opting out.\n\n> [thisweb11](#comment_323_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): So the trick isnt to stop doing what these anarchist are doing.  The trick is to scale it up.  Imagine every mc donalds having cockroaches added to it.   Imagine a global movement  where the act of smashing every bank window took place?  Wouldnt you say that would have a significant effect over a march.\n\nOh I certainly don't have judgement about it. People are free to do it. I'm just saying it's an ineffective manner for bringing large scale anarchism.\n\n> [thisweb11](#comment_325_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Which is best:  Mass boycotting McDonalds.  Or mass campoaign to increase the wages of McDonalds workers (and buying moire burgers to support that)?   \n\nNeither. Mass boycotting of buying food indefinitely would be the proper answer. Boycotting McDonalds won't do anything. I *already* 'boycott' McDonalds. I just don't eat there. Hasn't done a damn thing. I encourage people to not eat there whenever possible. Not because I think it'll help anarchism, but simply because it's a shitty business. You need people to *opt-out*. If you're just moving your business from McDonalds to Burger King you haven't helped anything.\n\n> The hurting people in capitalist workplaces line is a really not going to wash with many anarchists.  Its been used by socialists and capitalists alike to justify everything from pimping women as prostitutes to implimenting UK laws making it illegal for supermarkets to boycott Israeli products.  People will always be hurt when attcking capitalism.  Lots of people have pensions invested in oil and arms companies, we are all micro capitalists and have vested interests in keeping the capitalists in power.  Unfortunatly thats no excuse to ignore it and oppress the rest of the world who doesn’t have anything invested in it but misery.  All the people who dont even have minimum wage jobs at mcdonalds who live in the rainforsets being chopped down to supply burgers for example.\n\nI think you've mistaken what I'm saying. Attacking a *particular location* isn't going to help and will just cause inconvenience to bystanders who may be more than happy to join the cause right up until you interfered with their daily lives by releasing cockroaches where they try to make a living so they don't starve. Instead you'd want to do something like attack the stock exchange if you want to hurt the business itself.\n\n> If every mcdonalds was infected with cochroaches in a mass revolt, they most certainly wouuld feel it.   Adn if they didnt we could do it again and again until they closed down.  The trick is in gettijg enough people to do it.  The tactic itself is actually the most effective one I can think of thats non violent.\n\nI don't see how that'd end up putting mcdonalds out of business. If anything they'd just push resources into security and laws to crackdown on it, and then get militarized police to stop it. They aren't going to go out of business that way. Look at the big banks. They were pretty much doomed to close down due to financial impact. You know what they did? Lobbied the government and got a ton of money to keep going, and the people who were simply involved at the more basic levels were the ones who got hurt. The bankers themselves didn't even feel it.\n\n> [thisweb11](#comment_326_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): One mass global general strike could bring down capitalism in a week.  It would be non- violent until the capitalists tried to force us to work.\n\nThe problem is 'one mass global general strike' doesn't have systems in place to be able to make it indefinite. All the opposition would have to do is wait until people get hungry or have medical needs at which point most people will start working again. Even if you, say, had all of those people willing to steal (most aren't, morally, and likely wouldn't due to the existing law and their mindset of following it) then you'd still run out of food after it was all consumed. At which point the same systems would start back up and nothing would change. Instead you need to be able to just opt-out. Not just an angry strike where you're gonna go back to work after a week.\n\n> [thisweb11](#comment_327_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Nothing.  But then the question is wrong.  The question first has to be why would they take it?   Without private property and the ability to sell it what would be the point?   Possesions are items that are of personal value, and can't be used to exploit people for labour etc, and have no special value to others in the community .  Eg a teddy bear.  And possessions can also be shared\n\nThis is where I really draw an issue with people who seem to have taken more political classes than actually thought through what would really happen and what would be best. Realistically speaking, *I as an individual* don't really give a shit about 'the means of production'. I don't care if I have access to a factory. I care if I have access to, say, a shelter with functional electricity/heating/internet, food that I can eat, water to drink, some sort of transportation to get around, etc. These are *also* the things that people are the most likely to 'steal'. People don't steal factories or restaurants. They steal food and electronics. The 'possessions' as you call them. In ancap or any other system with a monetary system, *these* are the things that would be restricted and people would lack the ability to access. Which means the exact same problems exist: lack of communication, lack of food/water, lack of clothing/shelter, etc.\n\nOr if you're thinking of things like tools, look at it this way.  You don't need to *own* a bike. You need access to one to be able to quickly get around. And you're not always using it, so after you're done someone else can use it. A teddy bear, quite frankly, is unneeded. Besides a few handcrafted personal sentimental items (*maybe*) I don't really see much need for them. Wasting resources on it is inefficient, and I'm willing to guess no one will willingly work to mass produce them when there's no real value there. The 'value' was that people have a consumeristic mindset and have been indoctrinated to hoard things. And thus they buy unneeded things like teddy bears or other pointless material things. When you get rid of the profit angle, there's no need to produce or own those things.\n\nThere's also no need to own a factory or anything like that. You just use it. As I said, how would bitcoin even work if no ownership was guaranteed? Things that are needed would be taken and used. Things that aren't would not be bought or sold.",
				"added": 1485656578
			}
		],
		"1_1HMgB5kC5CXhxSngryrEDLUrPXkKgH1mtt": [
			{
				"comment_id": 241,
				"body": "> [cyberfoo](#comment_5_1HQat1a4kYwNck8Bx3CGxh6rKCQ9CtBvME): well there used to be a search thing called zerosearch but people stoped seeding it for some reson\n\nZeroSearch was still seeded. It's just the domain name expired and was bought by a scalper. I've since purchased it and repointed it to Kaffiene.\n\n> [planespherev3](#comment_166_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Search  engine bar with choice of a search engine (like firefox or chromium) in the homepage plz.\n\nYou can install Kaffiene to your browser, if that's easier for you.\n\n> [hexkey](#comment_15_18NsJqjikBYBjwLzMVp7aBJSpqtyRSd9qF): this one?\n\nNah, he's talking about [ZeroSearch.bit](127.0.0.1:43110/zerosearch.bit) which now points to Kaffiene. There's an old unupdated wikipage about it [here.](127.0.0.1:43110/0wiki.bit/?Page:zerosearch) The actual raw address is [1ZeroeuDnL2jNS6t1epQa1SPvC91KG8ER](http://127.0.0.1:43110/1ZeroeuDnL2jNS6t1epQa1SPvC91KG8ER), however, you can see that the site just points to ZeroSearch.bit which then points back to Kaffiene.",
				"added": 1488327962
			},
			{
				"comment_id": 242,
				"body": "> [sirenyc](#comment_142_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): Still thinking about updating Kaffiene Search to appear the new sites in the engine? Until the ZTV to appear to the new users! =)\n\nYeah I really need to get around to it. Don't know what to say other than I've just been having personal issues and haven't really worked on much of anything lately. Don't worry, I still haven't forgotten about ZeroNet! It'll get done sooner or later, haha.",
				"added": 1488328391
			},
			{
				"comment_id": 243,
				"body": "> [sirenyc](#comment_143_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): You disappeared a good time = / I'm glad that the site will be updated! (Google from ZN).\n\nYeah, sorry. As I said, I've had personal stuff going on and my work ethic has just kind of been next to nothing lately. I really need to get myself working. Probably need therapy or something >_>",
				"added": 1488336770
			}
		],
		"1_1PvAednzaMJiuMz1SD5wF3m3Hx7SK75zHv": [
			{
				"comment_id": 244,
				"body": "> [kopyjane](#comment_5_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE): Your computer must be switched off right now? :p\n> I'll have to do a tutorial on how to create a Webseed, as well. Of course, it's only a matter of adding ' &ws= ' to the end of your magnet link and then adding a HTTPS:// link to the exact same file that the torrent contains, but stored inside a webserver.. then previewing this magnet link in Instant.io, downloading the resulting .torrent file .. and uploading the torrent file into the same folder as the original .mp4 you have on your webserver. Of course, this can still confuse a lot of people .. \n> You can actually use Dropbox to create webseeds. At least, until they fix the exploit which allows you to create direct links by using the dl.dropboxusercontent.com domain. \n> I'm using a VPS for my seedbox and it's got about 200GB storage, for $9 a month (6 USD). So .. it could fit about 220 movies.. or 500-700 TV-show episodes. And I'm friends with the owner of the VPS provider.\n> What I like about it is that I can just go to a friend's house and then just stream the movies I want instead of carrying a USB drive or installing uTorrent on their computer.. so it kinda benefits me as well. :p\n\nI've tried a few times now and I can't manage to get webseeded torrents to actually play properly. The only way it ends up working is if I open webtorrent desktop, let the page 'find' the peers, and then close webtorrent desktop and let the page download from the webseed. But of course that defeats the whole point of having them webseeded in the first place.\n\nEdit: Figured it out. KopyKate auto-filled the magnet link and using the magnet doesn't seem to work, but pasting in the link to the .torrent (like I did originally to load the upload page) allows the video to be webseeded properly. Sweet. Time to upload some videos :3",
				"added": 1488806377
			},
			{
				"comment_id": 254,
				"body": "Seems like dropbox webseeding broke.",
				"added": 1490086661
			}
		],
		"1_1MwJSNBC1savftEvXQyoHcVLDgThtAPr6T": [
			{
				"comment_id": 245,
				"body": "What seems to be the issue with ZeroNet? I get why you'd have problems with the other ones (that aren't user friendly *at all*) but ZeroNet seems to work fine from what I see. The main issue here is just content. Whether it be for the easily cloneable zerotalk/zerome/zeroblog, or new sites altogether. And the only way to get that content is to have users contribute.\n\nUnlike the other projects, ZeroNet is still *really* new. Just a couple years. So far we have: A youtube clone, a Reddit clone, a twitter/fb clone, a search engine, a variety of tech blogs, some chat rooms, a wiki, pastebin, email, among others.\n\nI'm very confused at what you're looking for, if not ZeroNet.",
				"added": 1489368092
			},
			{
				"comment_id": 246,
				"body": "> [kai0](#comment_50_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): if you run business you thinking other way。\n\nPersonally, I'd like to kill the market, and business entirely. It should not exist, is a cancer on the world, and deserves to be abolished. I wouldn't *want* businesses here. Half the point for me is to get away from centralized monopolies that hoard and abuse data. I personally *like* that there's an atmosphere of community here, unlike on most of the internet.",
				"added": 1489368892
			},
			{
				"comment_id": 250,
				"body": "> [drwolff](#comment_2_1CKPXN6PimcbmYkqWzyfPSXqxHYqswgeri): I think it is more likely this person wants to invest in a project that will turn a profit.\n\nThey're looking in the wrong field though. P2P software notoriously *doesn't* turn a profit.",
				"added": 1489724785
			},
			{
				"comment_id": 252,
				"body": "> [border0464fred](#comment_71_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): This bait is so shiny.... I feel like I must hit it. \n> I think OP talk about the lack of documentation about how to dev on zerome. I found really painful to try do more then a simple hello world on zeronet. Debugging is painfull and dev procedures are damn picky.\n\nPersonally I'd love if there were cleaner documentation and examples for pure javascript, rather than doing everything in coffee script.",
				"added": 1489966511
			},
			{
				"comment_id": 253,
				"body": "> [yinyue](#comment_35_1GNgaj5EqkzqYECYbXa889fGLyuseHRi3t): You can do it, just clone the DEV's blog then add any thing you like.\n\nHe's talking about a GUI for it, rather than just mucking around with CSS and such.",
				"added": 1490074065
			},
			{
				"comment_id": 281,
				"body": "> [twiggydew](#comment_5_1MwJSNBC1savftEvXQyoHcVLDgThtAPr6T): Sorry to disappoint you guys but I'm not a troll. I do have the money to donate to any of these decentralized projects if they are 100% user friendly for non-coders. I still do not see any improvement to ZeroBlog and other sites on ZeroNet are still buggy. There's still no good youtube site where people can easily upload videos. App Centre http://127.0.0.1:43110/1LANDERvVWbShpNWpsrbBvfqSK1PabXtwv/ has no apps. ZeroPlus http://127.0.0.1:43110/1NCRELKZ3zWRS6DijziYrfWi9dsUY8Fh8n/ Avatars don't seem work. Even gifs don't work on 0ChanPorn http://127.0.0.1:43110/1NZNtZQZHQRJXafvJpmY5jgqwRaCEZMsUc The only thing that seems to work ok is the email and your music sites and that's not enough to get people to use ZeroNet. I knew this would be another failed project and so far I've been right. I think I'll just start donating money to the poor people. You guys have a nice day.\n\nDude you sound like such a troll right now. You know how long it took for those sites on clearnet to start working? Youtube took probably a few decades before the technology was there. This is *bleeding edge* stuff. It's not gonna be facebook. I've uploaded videos to KopyKate just fine. It's entirely straight forward if you follow the step by step video walkthrough. How much simpler do you need? How the fuck did you even get here on ZeroNet if you can't follow simple instructions?\n\nAs for 'App Center' and 'ZeroPlus' I have never seen nor used those sites. The first appears to be an unofficial attempt at making zeronet into an 'appstore', which it's not. And the latter is a chinese site that quickly cloned zerotalk. Of course neither of those are going to be high quality.\n\n0ChanPorn... do I even need to say? It's clearly a quick/crap clone of 0Chan, which even itself is still a very new attempt at getting the chans on here. Be glad it even exists.\n\n>Email\n\nWe don't have email on ZeroNet. You're thinking of the messaging site ZeroMail. Which is probably the only thing on here that *doesn't* consistently work for me. I always find it has issues with decrypting, sending, whatever. Very buggy. If you want the good sites, ZeroTalk is flawless, and ZeroMe is easily the best site on the network. I'm also very fond of Play and my own site Kaffiene. KopyKate, while the UI kinda sucks, works perfectly for video sharing. I've had 0 problems with it.\n\nAs for 'music sites'.... we don't have one of those. At least that's popular enough to be considered one. Just some really quick thrown together tech demos. Which is most of what ZeroNet is at the moment, *because it's brand new tech that's available NOWHERE else*. But do please show me where you find this stuff if ZeroNet is so awful? Where's *your* P2P youtube? Where's *your* DISTRIBUTED social network? AFAIK, ZeroMe is both the most active, and the only *proper* distributed social network.\n\nIt honestly sounds like you're crying because you came into a place where there's still development going on, and is highly focused towards developers, and then started crying because it's not Twitter/Facebook/Youtube. Seriously? Those sites have been around for a decade. ZeroNet has been around 2 years, with most sites less than 1. The sites are all made by hobbyist programmers, and it's all bleeding edge stuff. There's gonna be bugs, and you're gonna have to use your brain at the moment.\n\nIf you honestly have a more userfriendly P2P web platform, please share with us. AFAIK ZeroNet is it. It's the best and most userfriendly. *All* of our developers here strive to ensure that the sites are very welcoming and open. As well as feature amazing tech. If you've got something better, I'm sure everyone here is all ears. We're here because ZeroNet is the closest we've found to our idealized distributed web and we're all helping to build it. If you wanna help, then by all means stick around. But if you're just gonna insult progress and pretend there's something better, then I don't think anyone really cares for you to stick around.\n\nHonestly? You sound like an entitled millennial trust fund baby who can't do anything for himself. While the money would be great, I doubt many of us care for capitalism in general. Personally I'm here to make that money of yours *useless*. I like people who actually give a shit and can see a good thing when it's in front of them. Not someone who's gonna act entitled and bitchy and pretend bleeding edge tech is comparable to decades old websites. Did you also stumble onto the internet in the 80s and say \"well this is all shit, where's my video streaming? Look at this, sites barely even link to each other!\" No, of fucking course you didn't. You came onto the internet like every other self-entitled fuck in the 2000's when everything was baby-fied for you.\n\n> I knew this would be another failed project and so far I've been right.\n\nFailed project and yet we have one of the more active userbases for truly distributed networks. Again, feel free to share with the class if you have something better. Personally, I'll drop zeronet as soon as something better comes along. I have no attachment to the project other than wanting what's best for the internet.\n\nIf you want something, spit it out. Give explicit details of what you want. Because from where I'm standing, KopyKate is *more* usable than Youtube. ZeroMe is *more* useable than twitter or facebook. In general, these sites are *better* than their clearnet alternative. They put power back into the hands of the user, and give you complete control over your data. How is that a bad thing? But sure, go back to your walled gardens just because they have thousands of people working on them for decades with billions in funding. If you're just gonna act entitled, we don't want you here.",
				"added": 1493516011
			},
			{
				"comment_id": 282,
				"body": "> [bot](#comment_199_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb): Infuzed is an app: http://127.0.0.1:43210/1NFUSEDZjmCFJE1JSG5UjwCRK6zDwQRQd7\n\nYou're gonna confuse him with nonstandard links. [Here's the fixed one](/1NFUSEDZjmCFJE1JSG5UjwCRK6zDwQRQd7) for people who don't know what they're doing. I wanna give a shoutout for all the tech-illiterate people who still come and use ZeroNet anyway. You guys are the real MVPs. I know I personally work hard to make my sites as user-friendly as possible to welcome people who might have issues with this stuff. But they gotta meet me half way.",
				"added": 1493516602
			},
			{
				"comment_id": 284,
				"body": "> [bot](#comment_200_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb): Fixed. [...]\n\nI always make sure to format them (/address) so they auto-adjust to whoever is clicking them. Kaffiene does this automatically. Sticking a port (even the default) can cause issues.\n\n>This topic is the same. A big pile of shit right in ZeroTalk. And people will complain if we censored the stupidity.\n\nPretty much. I'm completely open to helping people out if they get a little lost or confused. It's new stuff, confusion is inevitable. But someone just not even trying and acting arrogant about it like it's all awful is just ugh. I'm still really curious about what P2P distributed platform he thinks is *good*. Because honestly? I've tried most if not all of them, and ZeroNet is the best. If I had money, I'd donate. It's the one tech project out of the hundreds/thousands I've seen that I actually think is going somewhere. It's the new web and I 110% believe and support that.\n\n>I only coded the avatars in a day (which works perfectly for me ;) as proof that these are not major issues. \n\nAvatars on finished sites (ZeroMe) work fine. It's when you come across a buggy half-coded site and then complain zeronet is shit is when you've got a problem. I mean, you have to really expect it. I wasn't surprised at all to find half-missing documentation, lots of half-assed attempts at sites, but an overall enthusiastic, but small, crowd in support of this project. It's pretty much exactly what I expected when I signed up.\n\n> Paying rent is a major issue\n\nIdeally, once I'm done with things, paying rent won't be an issue for anyone. Shouldn't exist. But tbh that's probably the main thing holding people back. People can't work on free/future tech because we're stuck figuring out how to pay the bills.\n\n>Oh, but people want us to make a PERFECT decentalized internet first.. then they might \"cough up\" some money. Like.. yeah sure. How exactly does one sit, code, and not pay rent? Hmm.\n\nYup haha. Gotta have an exact copy of the current web, but decentralized. And then *maybe* he'll give you a dollar or two. Since you just basically recreated what already exist and didn't 'improve' it.",
				"added": 1493519569
			},
			{
				"comment_id": 287,
				"body": "> [bot](#comment_201_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb): I read some personal issues (Kaffiene Search is opensource) might stop your coding. Not prying.\n\nMoney is one of the reasons. Hard to code when you need money haha. But yeah, I have a lot of instability in my life at the moment and sometimes it's hard to focus on coding. Which is why there's such huge gaps in my development schedule. Hopefully though things are starting to work out and I can work on Kaffiene a bit more consistently.\n\n> [darvy](#comment_44_1EqerKajfi14bzTkqwSfqVrxKmQW1w6Nzk): I've even considered leaving ZeroNet because I can't do anything with my ZeroBlog, I'm just holding off on doing it because I hoping nofish can do something to the blog to make it so non-coders can use it better. I already quit promoting ZeroNet months ago because I finally decided I will only promote things I can use myself. I can't use ZeroBlog so there's really no reason for me to promote ZeroNet.\n\nHopefully the non-coding aspect is still somewhat appealing. Personally I didn't do much coding for my own blog and it works fine (though I *did* customize it a bit). It's kinda hard to keep non-tech people when everything is still heavily WIP. I've been trying to get my non-tech boyfriend into zeronet and he's just been confused from step 1 haha. Personally I usually don't promote ZeroNet to people unless I have a reason. And so far those reasons have been for development, and for political reasons. I'd hate to say that tech-illiterate people should just leave, but a lot of this stuff honestly isn't as friendly as popular sites are. ZeroNet *does* take a bit more effort, as does every P2P software. It's a different way of doing things and sometimes you gotta be open to trying something new.\n\nHopefully ZeroTalk/ZeroMe/KopyKate, and other well polished sites are enough to keep you around. We definitely need more users, techy or not. The development side has honestly been kinda lacking, so I can see why people wouldn't find it that appealing. I see ZeroNet currently as a long-term thing, not as a 'replace the internet this second!' thing. Stick around, see what happens. You know?",
				"added": 1493525730
			}
		],
		"2_1JHumjFpXMTtSgm1ygdHqsvL9321Z87NDc": [
			{
				"comment_id": 247,
				"body": "Mac is great, and it's definitely a step up from windows, but if you're free to (and happy to) choose linux, definitely go with that instead. I think the ideal setup for a lot of people is Apple/Mac hardware and then run linux on it. Personally, I've gotten too comfortable with OSX's UX features to make a comfortable switch to linux for now. But you should support free/open software when you can.",
				"added": 1489378408
			}
		],
		"1_12JNkg22um5nYeLgK8XgKavpivuwjrfHAy": [
			{
				"comment_id": 248,
				"body": "Yeah. You can make/host a website 100% free without needing namecoin. Namecoin is *only* for the domain names through ZeroName. If you are either not using ZeroName (and instead your own ZeroNet DNS) or you just care about the hash/address, then you don't need to pay namecoin any attention. It's entirely optional. But to get a .bit domain that others can use by default to access your site, you need namecoin.",
				"added": 1489403154
			}
		],
		"1_1HJugahAiT2RnwJQdHuEd2RgW5fpWwNxnB": [
			{
				"comment_id": 249,
				"body": "There's lots here, but yeah, it's pretty dead. But without people sticking around it's hard to have 'something here'. There's some posts every other day or so at least. ZeroMe has a lot of daily activity, though mostly by chinese users.",
				"added": 1489711326
			}
		],
		"8_1GNgaj5EqkzqYECYbXa889fGLyuseHRi3t": [
			{
				"comment_id": 251,
				"body": "No. People are free to ignore everything pushed out by nofish, and simply use zeronet as it is. There's no stopping that. Though he *can* lead the project into worse situations, and end up killing it due to people not liking it as much. But I doubt that will happen.\n\nIf anything, what will 'destroy zeronet' would be an overreliance on the default zeronet sites.",
				"added": 1489806687
			}
		],
		"1_1NnLEbZgqNo9QfGuopF2Co7Dy152rp3Pim": [
			{
				"comment_id": 255,
				"body": "He's already president.",
				"added": 1490318510
			}
		],
		"2_18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y": [
			{
				"comment_id": 256,
				"body": "> [dun](#comment_1_14nCEDo97Cx4VpSHwPytWvacPo29Y7FAbk): Do you have a link or source for that?\n\n[It's all over twitter.](https://twitter.com/i/moments/844974226251513860) Passed 50-48 with 2 abstained. It was more or less a unanimous republican/gop voted yes, democrat voted no. Just senate though. I have no idea where else it needs to pass in order for it to take effect.",
				"added": 1490322980
			}
		],
		"16_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": [
			{
				"comment_id": 257,
				"body": "Yeah I wanted to mention that I can't seem to log into ZeroVoat/Zeronet Central. I'd love to use the site but at the moment I cannot. Looks lovely if I could only log in haha.",
				"added": 1490351569
			},
			{
				"comment_id": 263,
				"body": "> [davidnelband](#comment_1_1C1gnFcVv9J9kUjF4odDMRYcEWVPJbbqFp): Hi, the error should be fixed, please try again\n\nYay, works great. I had a bit of a hiccup in my content.json and I'm not sure why that was, but I managed to get it all working.",
				"added": 1490683727
			}
		],
		"1_1FxpcMsoTKTeUoNDRJKzqyLAwXuwVg3zgX": [
			{
				"comment_id": 258,
				"body": "The problem is that the point of ZeroNet is to *not* be biased towards particular sites. It's a web platform, not a website. By giving ZeroTalk and related zites further special treatment, you increase reliance on them, rather than forming a natural web where people will go and sort themselves out. It's already *ridiculously easy* to find chinese websites on here. Or any other language. All the links are at the top of ZeroTalk already. How much more do you really need? Exact clones of all the template/demo sites in every single language? Isn't that a bit overkill? The point is that these are *demos*, not the product. If you have a problem with the demo, you should go out and make your own site.",
				"added": 1490399779
			},
			{
				"comment_id": 261,
				"body": "> [dun](#comment_4_14nCEDo97Cx4VpSHwPytWvacPo29Y7FAbk): Eh, I really just want an alternative to ZeroTalk that lots of ZeroNet people use, but lets you filter based on the content - like a traditional chan board, or like Reddit's setup with subreddits. It seems the Language is what defines the different boards here, so I am wishing I didn't have to sift through Chinese comments to find content I can understand. It's not personal. :-D\n\nThere's already a few chan clones here. See [0chan](0chan.bit). Though I think it's impossible to have a 'true' chan experience, as comments require a file upload, which in turn requires a user pub key and thus ties the comment to a particular user. So no true anonymity unless you keep making new accounts for each post.",
				"added": 1490610053
			}
		],
		"1_16UbJDyboDaAjW5fiZouKWpPJztpt43kEj": [
			{
				"comment_id": 259,
				"body": "You should be okay. Just check your site on something like https://bit.surf/ before you link it. If you can see it there, then you're good to go.",
				"added": 1490433031
			}
		],
		"1_14nCEDo97Cx4VpSHwPytWvacPo29Y7FAbk": [
			{
				"comment_id": 260,
				"body": "Yup. ZeroTalk is basically the biggest forum here. There's a few other completely dead zerotalk clones. And if you speak chinese there's lots of options. Have you tried ZeroMe? Not exactly a forum, but it's pretty active as well.",
				"added": 1490466266
			}
		],
		"7_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 262,
				"body": "You think something happened to him [between 9 days ago and now?](https://github.com/HelloZeroNet/ZeroNet/commits/master) And here's [a comment from him on his blogpost 8 days ago.](http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:107:The+Future+of+Us) He's almost certainly fine. Last I heard he's preparing to give a Ted Talk. Why does he need to prove he's 'alive and well'? He's usually pretty quiet. There's no reason he wouldn't be.",
				"added": 1490625889
			}
		],
		"1_1765rBagMqT5WbfJvixmJZi8tHyh6LHkvG": [
			{
				"comment_id": 264,
				"body": "[Here you go.](/nullpaste.bit/?recent) Has private pastes, an index of the latest pastes, etc. Works great.",
				"added": 1490683817
			}
		],
		"1_1NmkVyqBJX6a82YQFYkCNgQpE9AWsmeppp": [
			{
				"comment_id": 265,
				"body": ">how does zeronet handle multiple ID's?\n\nZN logs your public/private keys, and associates them with a particular ID service and name. Your keys file also stores a signed message from the ID service to demonstrate it's properly signed. KaffieID simply has the server's private key available publicly, so that no backend is needed. This means that names are not guaranteed to be unique. From there, zites can accept IDs from certain provider sites, and with that you can have a chain of trust. You can trust ZeroID to have unique names, and as such if you see someone with a particular zeroid, you can know for sure it's them. With KaffieID this is not possible, since the whole point is to make it so names are not unique and freely changeable with no server backend.\n\nOn the backend, how your user files (comments, uploads, etc) are stored is based on this public/private key pair, rather than your ID name. This is why KaffieID still works. This is guaranteed to be unique for every single ID generated. The same user cannot freely generate new key pairs for a site easily; though you can by removing the keys and restarting zeronet. This feature is what lets KaffieID freely associate different names to the same keypair.\n\nThe keypair is associated from your ZN daemon to the particular site. That is, your keypair for KaffieID is different than your keypair for ZeroID. With that, you can switch between wholly unique accounts on the same machine, simply by selecting your different provider. You can see [here](https://i.imgur.com/UJFg65M.png) that I have quite a few different accounts I can access without restarting my ZN.\n\n> I want to know exactly how much shit will break if I have let's say 3 ID's for different purposes on the same pc.\n\nNothing will break. ZN was built with this in mind. However, having 3 ZeroIDs would be kind of a pain to set up, but you can do it.\n\n>since practically all zites that needs a form of authentication seems to have a select user button I assume it should be possible?\n\nIndeed. Though by default zites have a whitelist of valid ID providers. This is almost exclusively ZeroID, but a few accept ZeroVerse or KaffieID too.\n\n>But zeroid won't let you have multiple zeroid id's.\n\nIt will, but it won't let you generate a new one if you're already logged in. Basically, since your keypair for the site is associated with your zeroid, whenever you visit the site it'll detect your keypair for the site is already paired with a zeroid and not let you generate a new one. To get around this, you'd need to delete the ZeroID entry in your sites file, then remove the zeroid from your list of accounts, restart zeronet (making sure the stuff is deleted), generate a new zeroid, then restore your old zeroid account in your account list, and restart zeronet again. You should then have 2 zeroids in your list and can freely select between them, much like you see in mine how there's my @kaffie.bit and @kaffie.bit - hack. It's not *supposed* to be used this way, and most people find it easier to just set zeronet in multi-user mode and go from there. But it's possible to do.\n\n>So if I then use kaffieID or some other random ID service can I just roll around with 5 different ID's without zeronet either shitting itself or zites stopping to work altogether?\n\nYou must do the same process on KaffieID as well, even though it lets you freely change your name. As your account is actually the keypair, and the name is just a descriptive label for it. As you see in my list, I have two KaffieID accounts, and they both work fine on services that accept KaffieID. And since KaffieID doesn't care about name uniqueness, you can even have the same name for multiple accounts if you wish. Though some sites may rely on name uniqueness, and ZeroMe had this problem at first when I was testing all this. I happened to have user info of my other account fed to me improperly due to the name. However, as long as the site goes by public key for determining the user (as it should, since that's how the file storage is determined), then all should be well.",
				"added": 1490759114
			}
		],
		"1_14GeFTj8h85EgnWpS4LPJr5eMrjpKH1e5S": [
			{
				"comment_id": 266,
				"body": "You download and run software without knowing what it is? Where did you hear about it? Why did you download it?\n\nLong story short, it's basically just websites hosted without a back-end server. Meaning it's all on your local machine. Lots of cool benefits from that, but the big takeaway is that it's not the same as normal clearnet websites. It can 'do' pretty much anything the regular web can do. We have a [wiki](/0wiki.bit), a [pastebin](/nullpaste.bit), a [video sharing site](/kopykate.bit), a [reddit clone](/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb), a [search engine](/kaffiene.bit), among other things. This place is kinda inactive, but it's all still really new. So a lot of stuff is a WIP.",
				"added": 1490834480
			}
		],
		"2_14nCEDo97Cx4VpSHwPytWvacPo29Y7FAbk": [
			{
				"comment_id": 267,
				"body": "> [bot](#comment_181_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb): Yes, i meant this original one. Cloning ZT and boosting the user space is trivial, but people will gravitate to the most popular sites, so overcoming the \"inertia\" of staying on this original version of ZT is what we're working on.\n\nYou know what's needed? Something like ZeroNet Central, but that uses the merger site feature, so that we can have users go wherever, and still access the same community.",
				"added": 1490840084
			},
			{
				"comment_id": 270,
				"body": "> [tun](#comment_11_1FxpcMsoTKTeUoNDRJKzqyLAwXuwVg3zgX): It's empty, though. I also don't like the idea of having to login - I really wish there were more anonymity features with ZeroNet (not that it's always necessary, just would be nice - thinking about how government and powerful agencies could abuse it).\n\nZeroNet requires a log in for interaction. That's simply how it works. You can't post something without associating it to a public key. I'm at a loss for how you'd do this without it. There's no 'true' anonymity on ZN. Just pseudo-anonymity. And yeah, the site is very new. Not really anything posted but I personally visit there often, so if something pops up I'll likely contribute. if you were looking for something active, you're shit outta luck. The only active things on ZN are ZeroTalk and ZeroMe. Everything else is pretty dead.",
				"added": 1490921095
			},
			{
				"comment_id": 271,
				"body": "> [dun](#comment_24_14nCEDo97Cx4VpSHwPytWvacPo29Y7FAbk): It seems ZeroNet Central doesn't quite work. I get an error when I login (NonType is not Iterable or some such nonsense), got a 404 when I went to click the add thread link (not the button, but the link in the contentwell), and via the button after writing my thread it hung on creating the thread. Voting doesn't work for me either (though it shows me as signed in, despite the login error). Looks like it could use some help - you have this mess in a repository?\n\nYeah, there was an issue originally (and still might persist) about logins. I'm not entirely sure how he managed to mess it up, but pretty much anyone who visited the site before is now having issues it seems. It might just be best to clone the site and start over. I think you should be able to fix your login if you go and correct your content.json file, but that's honestly a lot of work for people. Switching the backend to a merger site format would work better too, as trying to shift it when there is content would be an issue.",
				"added": 1490926793
			}
		],
		"2_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": [
			{
				"comment_id": 268,
				"body": "ZeroNet is a true free speech platform. @nofish also supports this, and doesn't moderate at all. You're free to make a ZeroNet site where you ban Nazis. Hell, just click clone on ZeroTalk, and then just remove Nazi comments you don't like. Done. Alternatively you can freely mute users by clicking the three dots on the right of their comment and clicking 'mute this user'. It'll hide their posts from you.\n\nThere's lots of people on ZeroNet with controversial views. That's just the nature of a truly free speech platform. You can't say you want free speech, and then demand to censor someone. That said, ZeroNet makes it *really* easy to block who you don't like, or to make your own heavily censored site.\n\nHopefully this doesn't deter you from using ZeroNet.",
				"added": 1490840285
			},
			{
				"comment_id": 269,
				"body": "> [opisafaggot](#comment_3_12p3yAJYYbtSY226FLMaxXLMtFkBaLxu9a): Seriously? You're trying to console this faggot because his fee fees are hurt? The best answer is this:\n> IF YOU DON'T LIKE FREE SPEECH YOU COMMUNIST FAGGOT FEEL FREE TO GO!\n> Trump is president get over it.\n> USA USA USA USA USA USA!!!\n\nIt's unfortunate that beautiful tech like ZeroNet is filled up with morons like you.",
				"added": 1490841806
			}
		],
		"1_1KNaemLKhPio4dCJiSvi81Q24AWUycwV3T": [
			{
				"comment_id": 272,
				"body": "All the keys needed to login are in users.json. Just put in the appropriate keys or completely replace the new users.json with the old one.",
				"added": 1490959037
			}
		],
		"1_172ALy9XgaQ3gJUx5zVzgeqp2oLsAoqo6m": [
			{
				"comment_id": 273,
				"body": "Same way you keep safe on the internet in general? Don't click suspicious links, don't give away personal information, understand the software you're using, etc.",
				"added": 1491350755
			},
			{
				"comment_id": 274,
				"body": "> [ulrichard](#comment_28_1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ): Isn't there a list of hashes of troubled content somewhere on zeronet? Would be cool if that could be integrated in a way to get warned before you see it. Even better to get warned before downloading, but that might be more difficult. Yes I know, every filter can be abused for censoring political stuff. But if it is just a warning, you can still decide yourself if you have doubts.\n\nI recall one user started a blocklist called 'pedoblocker' or somethng. I'm not sure entirely how it worked But I think it was an after-the-fact measure. Where it deletes and then makes the space unwritable for certain folder locations within zeronet. Effectively blocking certain sites. I think that an adblock type solution built into zeronet where you can 'subscribe' to different lists would be good. If you want to see everything, just don't block anything. If you have an issue with a certain type of content, then subscribe to a particular blocklist for that content. But by default make sure there's no blocking.",
				"added": 1491391539
			}
		],
		"1_14YkpjZoU1Q897PhRG4CWyg6CL6Rn4QEVf": [
			{
				"comment_id": 275,
				"body": ">ZeroNet uses Block Chain, like Bitcoin?\n\nNo, it does not.\n\n>So We ALL need to download the WHOLE net?\n\nNo, you do not. Only the sites you visit. Which you normally download anyway.\n\n>as a ZeroNet client, I need to download the whole ZeroNet related content to serve others just like other block chain stuffs, right?\n\nEach peer downloads and seeds the sites they visit. People are free to manually delete/stop seeding whatever sites they like. That's different from blockchains where you *must* download all of it if you're a full node.\n\n>This means, all of us are trying to download the whole internet if ZeroNet is trying to be an another decentralized internet.\n\nWell no. All of us are trying to download a part of the internet, and the collective makes up the whole net. And no, zeronet is trying to be a decentralized web, not a decentralized internet.",
				"added": 1491788951
			}
		],
		"2_1Gi1gKhUwd3SBAKYyGTyWvN1L6QHtf56SL": [
			{
				"comment_id": 276,
				"body": "Honestly? I could see it. Tons of work/credit has been stolen in the name of fame. Look at Edison/Tesla for instance. On top of that pop culture and history like to reduce achievements from many names down into one. Give all the credit to one guy, even if the bulk of the work was done by someone else. Look at the moon landing for an example of this. One guy gets credit, despite a whole team working with him, some people weren't even named or known despite doing critical work.\n\nAs for Einstein being an idiot? I'm highly skeptical. If he knew how to talk about and discuss these ideas, it's a stretch to say he's dumb.",
				"added": 1492834296
			}
		],
		"5_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6": [
			{
				"comment_id": 277,
				"body": "> [p2p](#comment_295_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ): data/content.db has peers' info stored. If you also remove it, you'll know.\n\nThat's actually pretty cool. So if the trackers go down, ZeroNet can still technically be used.",
				"added": 1492834660
			}
		],
		"1_14gU7BmDVYaUD6b1fks74MQv6XtsCnAgEX": [
			{
				"comment_id": 278,
				"body": "> [fyf](#comment_1_12h544cxr6BVc2FEPkQnTtchjFi8H9jC6z): Vaccine against homosexual mental disturbance discovered by Russian scientists. If  you are in the early stage of the sickness it could help you.http://worldnewsdailyreport.com/russian-scientists-discover-cure-to-homosexuality/\n\nHormones do not effect sexuality. Anyone who believes that is a complete moron because it's been effectively debunked by millions of people.\n\n>gaycure: curing them of their perverse sexual orientation.\n\nYou can't cure a neurological disorder, which the set of lgbt conditions are. Anyone who says otherwise is full of shit. All you're really doing is exposing the perversion, bigotry, hate, and ignorance of nazis and nazi germany.",
				"added": 1493166263
			}
		],
		"1_1CjmMpMZgtzY2w9REEwLWQbtHhd5B5NStZ": [
			{
				"comment_id": 279,
				"body": "IPFS is a file system. Once you upload a particular file it gets hashed and a permanent link to it and the file is immutable. Unlike ZeroNet which is site focused and is entirely mutable.\n\nThey're also distributed differently. IPFS requires users to 'pin' stuff or they'll stop seeding it after a while. ZeroNet by default seeds everything you view until you explicitly tell it not to.\n\nZeroNet also has user interactivity, while IPFS does not. Basically: ZeroNet is the web, IPFS is.... just a file system. You can use IPFS alongside ZeroNet, and some users have done this to upload videos.",
				"added": 1493224249
			}
		],
		"1_14Knzt7E5McPxaUHrQ8nwoBhwFAPmtRzD1": [
			{
				"comment_id": 280,
				"body": "Wait... discord banned loli/shota? Damn internet police really hate that stuff don't they? I *would* ask to remove my name/banner/links from the hubs, but I like straight shota, and honestly I don't really give a damn. I'm kinda honored you cloned my hub out of all of them :3\n\nFeel free to post on [ZeroNet Central](/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/) as well. That site needs more activity and supports direct image uploads.",
				"added": 1493472624
			},
			{
				"comment_id": 285,
				"body": "> [lmath](#comment_31_1958F7oCppj78MP966AfojMQwHg2WUupzq): So whether your KaffieHub will ban loli/shota content?\n\nI will not ban any content on KaffieHub, with the sole exception of spam/malicious links/etc. Feel free to post your content there. I'd be hesitant on actual CP though. I'm not morally opposed, but I worry about legality issues. I'd recommend anyone who wants to do that stuff use Tor hidden sites instead. I'll probably remove it if it gets posted.\n\nLoli/shota is more than okay though.",
				"added": 1493519723
			},
			{
				"comment_id": 290,
				"body": "> [seequ](#comment_2_19BZ9s633TaM3t7oW5bQPTPQJU3cbyibVH): Should be noted that loli/shota is illegal in USA (18 U.S. Code § 1466A) and in many European countries. Discord didn't have much of a choice-\n\nI don't blame discord for it. I still use their software and chat with my friends over it. It's my favorite proprietary IM client. As for legality... I'm almost certain it's in a legal grey area at the moment. Some people have been in trouble for it, others have been let off. All the more reason government is a terrible idiotic system. Drawings harm no one.\n\nEither way, it's all the more reason to use uncensorable networks.",
				"added": 1493637531
			}
		],
		"4_136wmwLTBJoGTjXTAa7sWmXewn9P53EKML": [
			{
				"comment_id": 283,
				"body": "Looks like a shitty blockchain version of [KopyKate](/kopykate.bit) and other distributed streaming platforms. By a show of hands, how many people want to pay money to watch youtube? Who actually pays for youtube red? Fucking no one.",
				"added": 1493518957
			},
			{
				"comment_id": 288,
				"body": "> [znews](#comment_11_136wmwLTBJoGTjXTAa7sWmXewn9P53EKML): Because the paid videos options don't means the whole blockchain/system of the project is \"shitty\".Also, it is starting in the beta phase, so anything in LBRY can change.\n\nCan't get rid of the blockchain which means it's failed from the start. No one wants to buy into your shitty cryptocurrency. People hardly even want to use bitcoin which is ridiculously well known. Tell you what. If LBRY can get rid of the centralized listing/hosting problem, the required transaction fees, the pre-mined coins, *and* provide freely downloadable/reuploadable video files with no drm, *then* I'll give it a shot. Until then, it's just yet another shitty filesharing cryptocurrency that's doomed for failure.",
				"added": 1493551687
			}
		],
		"32_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 286,
				"body": "Last time I checked out Brave it was honestly pretty crap. I checked it again, this time trying out ZeroNet. ZeroHello failed to load. ZeroMe failed to load. Kaffiene worked at least. And I'm not sure why WebTorrent has an extension. It's purely javascript, no need for one. Unless it downloads/seeds when not on the page? I doubt it. It's probably just patchwork for the failure to implement javascript fully.",
				"added": 1493520856
			}
		],
		"14_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": [
			{
				"comment_id": 289,
				"body": "Wonderful. I felt the same. No other P2P software really feels 'right'. There's always problems, or bugs, or they're incredibly unfriendly to average users. Some are cool, but none really felt right as something to migrate to and use full time. So while I still try to use other software, and definitely still use clearnet, for now I've decided to make ZeroNet my home, and I really hope it can flourish into something great. I honestly think it's the future of the web :)",
				"added": 1493558995
			},
			{
				"comment_id": 291,
				"body": "> [seequ](#comment_1_19BZ9s633TaM3t7oW5bQPTPQJU3cbyibVH): I wish sharing was opt-in, rather than opt-out, and that the UI neatly displayed all files the zite has before you choose to host it.\n\nHonestly? That'd kill the whole reason ZeroNet even works in the first place. If you want a good example of your 'opt in not opt out' system, go look at KopyKate. Most of the videos people upload are inaccessible because no one can seed them properly because no one starts automatically seeding after visiting it once.",
				"added": 1493637688
			}
		],
		"1_1HciUodo7kXB56PcZ4Bj9EHRmpophE4H1y": [
			{
				"comment_id": 292,
				"body": "Just an FYI, while OpenNIC and ZeroNet both use namecoin domains, OpenNIC does *not* resolve zeronet sites. They're two entirely different uses of namecoin.",
				"added": 1493689835
			}
		],
		"1_1PhJvd1cbGDqEBcCr2gbDuEopCtBtVB9BP": [
			{
				"comment_id": 293,
				"body": "What are you testing? That's a link to youtube.",
				"added": 1493965895
			},
			{
				"comment_id": 297,
				"body": "> [waterrabbit](#comment_137_1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC): That's a link to YouTube. => You are testing markdown formatting.\n\nThey weren't testing markdown. The body of their post is: `\"body\": \"https://www.youtube.com/watch?v=gPcpVMIxyhI\",`",
				"added": 1494055159
			}
		],
		"45_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 294,
				"body": "Why not just upload your videos to [kopykate?](/kopykate.bit)",
				"added": 1494048741
			},
			{
				"comment_id": 295,
				"body": "> [kai0](#comment_100_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): yes, but that one still not work for me and my youtube have many vidoe that is other people upload, i don't know about the copyright.\n\nThe site you linked (fastcast) is *literally* the same technology as KopyKate. Same exact stuff. Both are using webtorrent. If KopyKate does not work for you, then converting the fastcast site will not either. If you instead meant to get your followed youtube channels, that's impossible. As youtube is a centralized website, and not at all connected with zeronet.\n\nSo you'll have to be a bit more specific/explicit: what is it exactly what you're looking for? As for copyright, I doubt many people here care about that.",
				"added": 1494049337
			},
			{
				"comment_id": 296,
				"body": "> [kai0](#comment_101_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): you  are right, but i mean not work for me is no peer. i want try my youtube channel is i run my computer all day long mybe can have peer for other people.\n\nWell yes. There is no backend server for zeronet. Meaning people must host content themselves. This is equally as true of fastcast. fastcast simply has a dedicated seedbox hosting the videos. There is a tutorial on kopykate on how to set up dropbox as a seedbox. If you look at [my videos](/kopykate.bit/?Topic:5_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh/+Official+Video+Yousei+Teikoku+Kuusou+Mesorogiwi) for instance, you can see that I use this method to seed my videos even when I'm not online. Just like fastcast does.\n\nAs for *other* videos not being up, yes. Because people who upload things don't pay attention and fail to seed them. If you're looking for something like youtube, with a dedicated host, you're likely not going to find it for now. Maybe try [bitchute](https://www.bitchute.com/) which is a clearnet service that auto-seeds your videos for you, and uses the same webtorrent tech.\n\nEdit: [Walkthrough on how to set up webseeding.](/kopykate.bit/?Topic:25_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE/Kopykate+Webseed+Upload+Tutorial)",
				"added": 1494052135
			}
		],
		"1_1A2WvfAvmJ4RKp9YLt6u941eSpF4L53CTT": [
			{
				"comment_id": 298,
				"body": "We indeed have torrent sites on here, and indeed they are impossible to take down without the private key. Not as cool/fancy/popular, but it works. See [ZeroTorrent.](/ZeroTorrent.bit)",
				"added": 1494211167
			},
			{
				"comment_id": 312,
				"body": "> [koure](#comment_3_19yRyR57LxFjbzieSEhvyvhe4heSo7KrLa): Unfortunatly I discovered nyaa right after they took it down so it would be awesome to recover it here. I imagine that if there is a public backup like with piratebay this project could be done.\n\nTry [here.](https://nyaa.pantsu.cat/)\n\n>Are some things lost?\n\n>We have a database of the torrents on nyaa up to May 1. That means almost nothing is lost.\n\n>Sukebei, however might be in worse shape. Currently we only have sukebei databases up to 2016, but a newer database might be available for use.",
				"added": 1494487276
			}
		],
		"4_1NTgaYjK2bh1axvruth8HqtGt6Pw5ab13x": [
			{
				"comment_id": 299,
				"body": "> [thegillies](#comment_13_1NTgaYjK2bh1axvruth8HqtGt6Pw5ab13x): I wonder why? There are like 8 billion people in the world and only a handful of distributed networks. Why are there only 5 of us? The maths just aren't working for me.\n\nYeah I'm certainly confused. So many people and yet every distributed network is incredibly small/unpopular. Some are certainly solid, so I'm wondering what the issue is. It's not that people haven't heard (over 7000 people have checked out zeronet alone at least) it's that they're not contributing and not sticking around.\n\nWe've got quite an active chinese community there, but besides that it's mostly just been the same few people sticking around.",
				"added": 1494217656
			}
		],
		"2_1FaKUqa1nMyNwEpKXvb8o8uvZSpr3jXpNT": [
			{
				"comment_id": 300,
				"body": "You cannot. A ZeroID is just a public/private key combination mapped to a username and given a signed certificate by the ZeroID site (which currently has a private backend). To delete your public/private key, just delete your users.json file, or remove the relevant entries. At the moment you're unable to remove the mapping to the name, though you *may* be able to get @nofish to help with that. I doubt he will though, as it hasn't been done before.\n\nIf you'd rather have a disposable username, use a [KaffieID](/id.kaffie.bit) on a public proxy or on an isolated installation of ZeroNet. There's no backend for KaffieID so names are not unique, there's no public mapping, and the only thing you'd have to do is delete your private key and any content you don't want shown.",
				"added": 1494226804
			}
		],
		"3_17vKbxL13KnzGATstqawXSG2oiQygmdkcX": [
			{
				"comment_id": 301,
				"body": "Well it's all black because it's dead. No files. I wonder what happened. Publishing hiccup? Killed the site for personal reasons? Feds? Good example of why ZN sites *don't* stick around forever. Another good example is [ZeroSearch](/1ZeroeuDnL2jNS6t1epQa1SPvC91KG8ER) which now redirects to Kaffiene because the domain expired and I registered it. ZeroSearch is effectively dead until the owner removes that pairing on the ZN side.",
				"added": 1494236257
			},
			{
				"comment_id": 302,
				"body": "> [zeronet0](#comment_1_17vKbxL13KnzGATstqawXSG2oiQygmdkcX): It is very pity, I have not backup this site. So now backup Play is a good choice.\n\nYeah, it was a nice site. I'm really wondering what happened, since @Sirenyc was (and hopefully still is) an active user here.\n\n>And Who have backup ZeroTV ? public it again.\n\nI wish I did, tbh. This is what the cloning feature is good for! I feel the same about some other content like KopyKate's upload tutorials (though she's still active and is getting around to fixing her seeds). Best to have backups and not rely on a single authority, which is why I always encourage people to clone my sites. The merger feature is excellent for this. It guarantees ZeroMe won't ever go away.",
				"added": 1494236747
			},
			{
				"comment_id": 304,
				"body": "I went ahead and set up a mirror using the backup and modified with functional links [here.](/1HwH4hfRhohJGVtZMBYprYKyHcuJNwL4sZ)\n\nI have no plans to delete or update this site. So it'll just be a static mirror of content. If someone can provide a more recent/complete backup, I'll update it with that instead.\n\nEdit: Just realized the optional files are still up, so I went ahead and downloaded them all and put them on the mirror. Fully functional site now. Enjoy! Please help seed the files!",
				"added": 1494317462
			},
			{
				"comment_id": 305,
				"body": "> [mkg20001](#comment_15_177ia43eQrnWCHCWt1ik6viQGRzWuNXGzD):  request the older version from the nodes instead of having to look for a mirror zite.\n\nThat'd require versioning, and take up more drive space for everyone.",
				"added": 1494332525
			},
			{
				"comment_id": 306,
				"body": ">1491301186: A complete copy of ZeroTV as it was on Mar 25, 2017 can be found at:https://zeronet.korso.win/1BEJbnufyav7TK23ADTs2Qi2UJeKSGDzw6\n\n> [zeronet0](#comment_4_17vKbxL13KnzGATstqawXSG2oiQygmdkcX): How to backup it?\n\nNo easy way to download the content that proxy has. You could build a webscraper to take all the pages, but there's still half the optional files missing from it.",
				"added": 1494380971
			},
			{
				"comment_id": 307,
				"body": "> [rythyrix](#comment_91_18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y): I think I'm a jerk. [...]\n\nCare to share? I'd rather not nuke the server again doing it myself if we can avoid it.",
				"added": 1494384915
			},
			{
				"comment_id": 308,
				"body": "> [rythyrix](#comment_92_18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y): No problem, onionshare OK? Well, when it's done. Should have made a curl batch job with its -K cli option.\n\nOnionshare? [This?](https://onionshare.org/) I'll have to figure out how to use it but sure. I just meant like posting it onto mediafire or mega or something lol. Or hell, even putting it on nullfolder.",
				"added": 1494385308
			},
			{
				"comment_id": 309,
				"body": "> [rythyrix](#comment_95_18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y): For those interested, here is the zip of scraped files from the proxy below.\n\nUmm you didn't scrape properly.\n\n> [zeronet0](#comment_7_17vKbxL13KnzGATstqawXSG2oiQygmdkcX): Thank you very much, I have downloaded it :) But all the html are error pages.\n\nThis. It's all error pages, including the index.\n\n> [rythyrix](#comment_96_18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y): The proxy didn't have all the files :(\n\nNah, you didnt' scrape properly. The index is certainly there. and yet in your rip it's an error.",
				"added": 1494392066
			},
			{
				"comment_id": 310,
				"body": "> [rythyrix](#comment_97_18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y): Went by the content.json. Wasn't going recursively through the scraped html files for more links; threw that together in minute or less. Either way, were there any files you didn't have already? [...]\n\nJust need the html page+pics for all of the tv shows that weren't in the backup. Index/javascript stuff can be easily grabbed in the browser.",
				"added": 1494394523
			},
			{
				"comment_id": 313,
				"body": "> [p2p](#comment_304_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ): To avoid error when curl zites:http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx/1483356261 [...]\n\nI just ended up modding my grab.py python script. See [here.](/nullpaste.bit/?1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_12) My backup should be the latest available now.",
				"added": 1494548634
			}
		],
		"1_15dMbdM7c2RT9RhNTJRqzc4vYSvrSJvxyG": [
			{
				"comment_id": 303,
				"body": "> [uv](#comment_2_15vJjtekghtind7a1xjLBFN96PSXDx9mso): link to ZeroMaps?\n\n[This maybe?](/1yUji4qPD7GAog8XkP3EDMEfrL995S4Xd)\n\n[Kaffiene](/kaffiene.bit) is a great site to find stuff you're looking for.",
				"added": 1494289233
			}
		],
		"50_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 311,
				"body": "Fastcast again? Why bother with that instead of just using Kopykate?",
				"added": 1494464909
			}
		]
	},
	"comment_vote": {
		"14_1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD": 1,
		"4_1C7rjaNpWFAtWbQgSxbGaPzBdgCA47VYc6": 1,
		"45_1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD": 1,
		"41_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr": 1,
		"364_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"365_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"9_1Q8iqH31cKCqynoJRxR2PfJhzQr8wHdiHr": 1,
		"4_1ADB7TdX2fVbTsWBoMe9yBTmVXTbb33b4R": 1,
		"12_1ADB7TdX2fVbTsWBoMe9yBTmVXTbb33b4R": 1,
		"1_1GmZJxRakRMJiJBLBXTy4YyDuA33UJUBoM": 1,
		"7_1xf9XC4Nsa7YfQWFiK6xGsNDJA3AaCTUa": 1,
		"1_1PX7VW6xfccTT2tNUTwrYKJpGsGfrnoJfP": 1,
		"50_1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD": 1,
		"2_1PX7VW6xfccTT2tNUTwrYKJpGsGfrnoJfP": 1,
		"3_16Hg8ux8t4gqZjGgiEUWQ8xAsqJrtJv7MC": 1,
		"3_1GCMDNMgJHvZJfdbD9ygDmpBdnVAobdJYg": 1,
		"6_1GCMDNMgJHvZJfdbD9ygDmpBdnVAobdJYg": 1,
		"9_1PX7VW6xfccTT2tNUTwrYKJpGsGfrnoJfP": 1,
		"25_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ": 1,
		"17_17fgJ3tZjhM7HCkTkd5TWf2BLLWmhRKcXB": 1,
		"25_1ADB7TdX2fVbTsWBoMe9yBTmVXTbb33b4R": 1,
		"24_1PX7VW6xfccTT2tNUTwrYKJpGsGfrnoJfP": 1,
		"10_1PmQPsmpcuDvtjKQ6J9g2bH39w1TKAwGPr": 1,
		"39_1ADB7TdX2fVbTsWBoMe9yBTmVXTbb33b4R": 1,
		"2_1LVL5r7L5AwFk7waWmBwuVZ8Fcg9NDxakY": 1,
		"2_1D7uESYtAKV36MVPGJZXuE7LUKbLwfo4dX": 1,
		"11_16Szsy1UtjiXpEevWVdUDrNfNTAZ9PLbcY": 1,
		"90_1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD": 1,
		"13_16bxMyoL49mWYhcZKBYVBT5zEFW9SQpiao": 1,
		"12_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx": 1,
		"38_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf": 1,
		"37_1PVcdu7USZH2kHMETbqDYLPjJZKCDWM52k": 1,
		"38_1PVcdu7USZH2kHMETbqDYLPjJZKCDWM52k": 1,
		"41_1PVcdu7USZH2kHMETbqDYLPjJZKCDWM52k": 1,
		"43_1PVcdu7USZH2kHMETbqDYLPjJZKCDWM52k": 1,
		"45_1PVcdu7USZH2kHMETbqDYLPjJZKCDWM52k": 1,
		"522_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"31_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx": 1,
		"60_1PVcdu7USZH2kHMETbqDYLPjJZKCDWM52k": 1,
		"1_18iUA29XjD3s7XxbFQPUJrH3hNzyVU7DZ7": 1,
		"547_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"33_15QGRquMETTn5LnCHjTm1qa9eaXGtq7gpT": 1,
		"44_17fgJ3tZjhM7HCkTkd5TWf2BLLWmhRKcXB": 1,
		"559_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"8_18rFd7W9y5QGQEVXaCoJV7jyt7D8aN156h": 1,
		"87_1KwTTgPRSTHFmmJAFBt6kQfdyNeSM5KJuH": 1,
		"10_14PXH1VLXEseL1h6gLpHqi3bXEAdamDwgg": 1,
		"113_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf": 1,
		"30_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t": 1,
		"1_1MYfK6tM4vfBJ8SHvbZ8sMH4u6o9mSRPWU": 1,
		"3_1MYfK6tM4vfBJ8SHvbZ8sMH4u6o9mSRPWU": 1,
		"26_1FTFKztuv4Z5uy6iS83k9hB2xtS6yFnDxx": 1,
		"28_1FTFKztuv4Z5uy6iS83k9hB2xtS6yFnDxx": 1,
		"5_14ng1wByxwoNXAhihYbpgyarVJbFiqs8ny": 1,
		"29_1FTFKztuv4Z5uy6iS83k9hB2xtS6yFnDxx": 1,
		"94_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": 1,
		"102_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": 1,
		"5_13Mt8T2256Uz4GHk9B4XvKqyz37wPgA26q": 1,
		"43_1PCPuVtFv8apVpXYbc46wHugNhFUVQ6KCv": 1,
		"26_1CTut2qbaj54ZjNoYeuWSGwV75iVieKY6N": 1,
		"5_1BePwsiwFD8BjtYfB8tQegiKXDLnHWW1Um": 1,
		"2_1Dj5WCaPV2r18QcDQFHmyx2HnGmwMJce9b": 1,
		"28_1CTut2qbaj54ZjNoYeuWSGwV75iVieKY6N": 1,
		"13_1BFTNXtYQDMCurqyg45KLmsV6oJD7bQSsH": 1,
		"2_1HqyK2mjr5hAG3c613KzcBDURKymVwHmuh": 1,
		"32_1xf9XC4Nsa7YfQWFiK6xGsNDJA3AaCTUa": 1,
		"17_164W1rFVD9Bm7poGJWvjVUjvkbhhFC5nnt": 1,
		"159_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx": 1,
		"52_1PCPuVtFv8apVpXYbc46wHugNhFUVQ6KCv": 1,
		"12_1C6qdRAX8iYqSB7TfUxk91yW8Y2SBKNgfA": 1,
		"723_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"16_1JF3eQjW4voiKdcvCkMXvUx5bLmZAiVdyi": 1,
		"3_13Cqt2MSFS6eu4cbVuByZBuULrEAcZAqFG": 1,
		"741_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"11_17nphNHoGtz9EzvvTSSbZn7WHfM1ynpdsL": 1,
		"17_17nphNHoGtz9EzvvTSSbZn7WHfM1ynpdsL": 1,
		"145_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t": 1,
		"764_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"785_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"10_1Nx78TLGjBT18krMD175Mr1JwFwnxURRLb": 1,
		"10_1ALXyaQsvvCQ3R5WBrPbe4dXsqnLCLEkB7": 1,
		"46_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"108_1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC": 1,
		"320_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"149_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS": 1,
		"2_1CKPXN6PimcbmYkqWzyfPSXqxHYqswgeri": 1,
		"26_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"74_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6": 1,
		"5_1CwyP7JyaXpKVNXHKZfvRozBkCSk7hFAWe": 1,
		"343_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"186_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS": 1,
		"11_1PvAednzaMJiuMz1SD5wF3m3Hx7SK75zHv": 1,
		"341_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"8_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"4_1FxpcMsoTKTeUoNDRJKzqyLAwXuwVg3zgX": 1,
		"92_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6": 1,
		"903_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"47_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"199_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": 1,
		"26_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY": 1,
		"1_1J1PqgvWDkxQKRY4WUx3ZeTex4XZA2A7cg": 1,
		"15_1NmkVyqBJX6a82YQFYkCNgQpE9AWsmeppp": 1,
		"300_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"38_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY": 1,
		"3_17vKbxL13KnzGATstqawXSG2oiQygmdkcX": 1
	}
}