{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1,
			"title": "Bug in Zeronet",
			"body": "Hi,\nIt is the second time that my ZeroNet-master/data/sites.json is renamed as sites-old.json and consequently my browser Firefox tell me a Error 2 inside ZeroHello home page. So I have renamed the file and all gone well. It is a bug?\n\nI have linux.",
			"added": 1450706583
		},
		{
			"topic_id": 2,
			"title": "Edit and preview message in this Forum",
			"body": "I suggest two feature in this forum: preview and edit message.",
			"added": 1450791691
		},
		{
			"topic_id": 3,
			"title": "Bug?",
			"body": "I have make a comment with my id and I have received a failed message. Than I have set the max size to 100 kB and repost the message that has been sent without error.\n\nSo if the max size of the site is not expand you are unable to send message with your id.\n\nThis is the forum:\nhttp://127.0.0.1:43110/zerovid.bit/?Topic:6_15ut3jo5bqiURh7QZnajDmC9GG2o9psEjB/Fastcoin+Buy+your+bitcoins+in+switzerland\n\nIs it a bug?",
			"added": 1453579068
		},
		{
			"topic_id": 4,
			"title": "Error in Firefox ESR with site ZeroTorrent",
			"body": "I receive every time the error:\nRemote XUL\nThis page uses an unsupported technology that is no longer available by default in Firefox.\n    Please contact the website owners to inform them of this problem.\n\nwhen I press Other result in the end of the page. I use Firefox ESR at the last version.",
			"added": 1470429088
		},
		{
			"topic_id": 5,
			"title": "Email: zeroid vs zeroverse",
			"body": "I suppose that with the mailbox zeroverse i can send email to both the address with domain zeroid and zeroverse. With the mailbox zeroid I can only send email to zeroid address. Is it true?",
			"added": 1470439745
		},
		{
			"topic_id": 6,
			"title": "More topics bug",
			"body": "When I click in the bottom link \"More topics\" I have this error windows in my firefox ESR 45.3:\n\nhttp://www.kensan.it/tmp/zerotalk_bug.png\n\nCan nofish correct the bug?\n\nI have mageia linux upgraded and updated.",
			"added": 1473850759
		}
	],
	"topic_vote": {},
	"next_comment_id": 51,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "Ciao a tutti gli italiani, benvenuti su ZeroNet!",
				"added": 1446470193
			},
			{
				"comment_id": 2,
				"body": "> [kensan](#comment_1_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4): Ciao a tutti gli italiani, benvenuti su ZeroNet!\n\nC'è pure il reply: che figata...\nP.S. Grazie per chi mi ha dato il like o l'up ;)",
				"added": 1446470281
			},
			{
				"comment_id": 3,
				"body": "> [kensan](#comment_2_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4): C'è pure il reply: che figata...\n\ne il reply del reply non è il massimo. Però posso pure editare il mio commento: favoloso!!",
				"added": 1446470376
			},
			{
				"comment_id": 4,
				"body": "Già provato ma riproviamo",
				"added": 1450045551
			}
		],
		"4_1QH84f44yLPvMjMua9s7iM7c4RoJNZ2nTp": [
			{
				"comment_id": 5,
				"body": "Se siete italiani mandatemi una email (id kensan) :)",
				"added": 1450047822
			}
		],
		"1_1Dme3quDw9tNTjMSk6RWcBJqHchi96vi6S": [
			{
				"comment_id": 6,
				"body": "> [salvotnt](#comment_7_1HtGfHk2MuqcB5nYXZ6b2NajXJLoxfq7XS): ciao , il mio contributo: http://127.0.0.1:43110/1LHt9Ry3aoH7tBmbbKyquu7wEK2EE7yzcs\n\nCiao, i commenti al tuo blog non funzionano e quindi ti riporto il commento qui visto che ho fatto la fatica di scrivere :P\n\nHo comprato il DVD di \"Si alza il vento\" e mi arriverà tra una settimana, spero sia bello ma mi pare che la storia sia triste. Senza fare spoiler come ti è parso?",
				"added": 1450049800
			},
			{
				"comment_id": 7,
				"body": "Dimenticavo, salve a tutti! Io sono uno di quelli di bitcoinTalk, sono della \"ciurma\" :)",
				"added": 1450049941
			},
			{
				"comment_id": 8,
				"body": "> [salvotnt](#comment_9_1HtGfHk2MuqcB5nYXZ6b2NajXJLoxfq7XS): si , lo stile e' sempre quello , ma e' molto meno adatto ai ragazzi dei precedenti , non mi e' dispiaciuto ma non mi ha neanche colpito piu' di tanto. Non ti colpisce allo stomaco come una tomba per le lucciole e non ti fa sognare come nel castello errante di howl ...\n\nGrazie della risposta Salvo, io ho visto solo (piratato) La città incantata che mi è piaciuto parecchio e che trovo abbastanza indicato anche ai bambini (magari dai 6 anni in su), adesso ho comprato su dvd.it una serie di dvd tra cui si alza il vento (ma non ero convinto) e anche Il castello errante di Howl che mi è stato caldamente consigliato. Ovviamente mi sono preso pure Mononoke Hime, Totoro, Ponyo (per mio nipote), Laputa, Porco rosso (poco convinto) e infine Kiki consegne a domicilio.",
				"added": 1450295333
			},
			{
				"comment_id": 9,
				"body": "> [italcoin](#comment_1_16JwmmKbuwEJwQ83q4eaSqkHj47R4rZdtu): Complimenti al genio ungherese per aver ideato e messo a disposizione questo luogo criptato !!!Gratulálok a magyar géniusz, amiért létre és hozzáférhetővé kell tenni ezt a helyet titkosított !!!\n\nIn effetti è un posto molto carino: sai l'id del tipo? Si chiama \"zero\"?",
				"added": 1450447146
			},
			{
				"comment_id": 26,
				"body": "La foto in costume di uno dei Carabinieri (Francesco Tedesco) sotto processo per il pestaggio mortale a Stefano Cucchi, immagine pubblicata dallo stesso Tedesco sul suo profilo facebook e poi ripresa da Ilaria Cucchi nel suo profilo fb:\n\nhttps://i.imgur.com/vhbsR4N.jpg",
				"added": 1451940779
			},
			{
				"comment_id": 31,
				"body": "Ci sono indizi per cui anche Steam adotterà i bitcoin come metodo di pagamento.",
				"added": 1455392520
			},
			{
				"comment_id": 32,
				"body": "> [tailot](#comment_1_14VgzghZFKQt28FF1Ye322pxkxZDpisekU): ciao a tutti, un saluto\n\nCiao tailot, benvenuto!",
				"added": 1455461184
			},
			{
				"comment_id": 33,
				"body": "> [zozon](#comment_82_1QBLGLcgKfcpfLmiDYuDzUKVXFfmTAew55): Salve tutti, sono parlo Italiano un po, ma benvenuti da rete nulla! :) (i hope i did not make too many mistakes) ;)\n\nYou did a lot of mistakes but you are welcome!\n\nP.S. Salve a tutti, parlo solo un po' di italiano. Benvenuti in ZeroNet. :)",
				"added": 1455537859
			},
			{
				"comment_id": 34,
				"body": "> [zozon](#comment_86_1QBLGLcgKfcpfLmiDYuDzUKVXFfmTAew55): :) accento della po' :) :) why not rette nulla?\n\nNon accento ma apostrofo: http://www.studenti.it/foto/superiori/i-18-errori-piu-comuni-d-italiano/po.php\npoco -> po'(co) -> po'\n\nzeronet -> rete zero\n\nIl termine nulla o nullo è secondo me poco usato al posto di \"zero\".",
				"added": 1455574139
			},
			{
				"comment_id": 35,
				"body": "> [zozon](#comment_91_1QBLGLcgKfcpfLmiDYuDzUKVXFfmTAew55): not sure that I have  hit the meaning - accent (focus) to 'liitle' (po') knowing of Italian (intended to be a joke)I can only aspire to get to grammatically correct Italian. But I do not want to troll your discussion. \n> Practising Italian is useful for me ( abitato sotto de la Sicilia )\n\nImagine the word little, one day somebody short the word and use the term \"lit\". In italian to remember that lit is the short form of little you must use the \"apostrofo\" apostrophe that remember the complete word.\nlit'\npo'\nlittle\npoco",
				"added": 1455630587
			},
			{
				"comment_id": 42,
				"body": "Un manualino che riguarda i bitcoin scritto da G Bianchi:\n\nPer capire cosa sono i bitcoin si possono trovare tantissime fonti e risorse sul web. Alcune consigliate sono:\nuno dei siti di riferimento: http://bitcoin.org   la traduzione italiana (ancora incompleta) del libro \"Mastering Bitcoin\": https://www.bitcoinbook.info/translations/it/book.pdf l'ottima sezione guide (in italiano) del forum: https://bitcointalk.org/index.php?board=153.0\nuna lista di siti/risorse relativi ai bitcoin mantenuta dalla comunita' italiana: http://j.mp/sitib\n\nPurtroppo gli organi di informazione tradizionali conoscono ancora poco l'argomento bitcoin, quindi e' facile imbattersi in informazioni errate o confuse, verificate sempre che quanto trovate scritto in giro corrisponda a verita', magari aprendo una discussione sul forum per confrontare vari pareri e contributi.\n\nPer ricevere, spendere, conservare e gestire i tuoi bitcoin ti serve un \"wallet\" (un programma per pc/smartphone che ha la funzione di un portafoglio). Il wallet più famoso e' \"Bitcoin Core\"; e' però sconsigliato iniziare a maneggiare i Bitcoin utilizzando Bitcoin Core in quanto molto esoso di risorse e non semplice da configurare;\nsono purtroppo frequenti i post di nuovi utenti che si trovano in difficolta' proprio per aver scelto Bitcoin Core come primo wallet. Uno dei wallet piu' elementari, leggeri ed intuitivi e quindi adatto per i primi approcci e' copay: https://copay.io/ , uno di quelli elencati qui: https://bitcoin.org/it/scegli-il-tuo-portafoglio.\n\nQundo esegui una transazione, ossia invii o ricevi dei bitcoin, la rete impiega un certo tempo per \"confermare\" questa operazione. Tale tempo puo' variare da pochi minuti a diversi giorni. Il tempo di conferma dipende fondmentalmente da due fattori: da quanto la rete e' intasata e dall'importo della fee per la transazione. Per questo motivo, e' importante imparare ad usare le fee, per evitare di avere transazioni che rimangono \"appese\" per giorni.\nUsa http://blockspeed.info per verificare lo stato di \"intasamento\" della rete e http://bitcoinfees.21.co/ per aiutarti a decidere un fee adeguata.\n \nRicordati che con bitcoin puoi essere la banca di te stesso, e quindi impara a conservare i tuoi fondi in wallet che controlli direttamente tu. Essere la banca di te stesso deve anche farti maturare la consapevolezza di come \"custodire\" al meglio i tuoi bitcoin, minimizzando il rischio di perderli o di farteli rubare: https://bitcoin.org/it/proteggi-il-portafoglio. Considera che fino a quando non avrai una buona confidenza con questa tecnologia, non dovresti investirci piu' di quanto sei disposto a perdere.\n\nNon firmare digitalmente cose ignote. la firma digitale e' l'equivalente di una firma nella vita reale, e come nella vita reale se qualcuno ti chiede di firmare qualcosa lo fai solo se sei ben consapevole di cosa stai firmando, allo stesso modo, anzi con ancora maggior attenzione devi comportarti nel mondo bitcoin, dove quando una transazione e' fatta NON SI TORNA INDIETRO. Se qualcuno ti sottopone un file, un testo, una stringa esadecimale, insomma una qualsiasi forma di documento e ti chiede di firmarlo digitalmente (usando la funzione firma del tuo software di wallet), FIRMALO SOLO SE sai ESATTAMENTE cosa stai firmando, ne sei consapevole, e hai la VOLONTA' di farlo.\n\nPer comprare/vendere bitcoin ci sono gli \"exchange\" (siti internet su cui si scambiano euro con bitcoin e viceversa), alcuni degni di nota sono:\nhttp://bitstamp.net (buoni volumi, tratta in USD), http://kraken.com (minori volumi tratta anche in EUR) ,\nhttp://therocktrading.com (piccoli volumi tratta in EUR; i gestori frequentano abitualmente il forum italiano)  e tantissimi altri. Per esempio è facilissimo e senza documenti da inviare: http://bity.com che è situato in Svizzera.\n\nRicordati ti tenere i tuoi soldi/bitcoin il minor tempo possibile su un exchange, e' gia' capitato diverse volte che uno di questi exchange chiuda all'improvviso, senza rifondere agli utenti i fondi che avevano in deposito.\n\nSe hai fretta e/o non vuoi fare un bonifico verso un exchange (anche se sono dei semplici SEPA)\npuoi usare http://localbitcoins.com che ti permette di contattare altri privati in Italia e nel mondo e concordare svariati modi di pagamento, oppure usare un ATM se vivi vicino a un posto dove ce n'e' uno attivo, qui trovi una lista: https://bitcointalk.org/index.php?topic=1253593.0 oppure puoi trattare con i venditori privati in questa sezione del forum: https://bitcointalk.org/index.php?board=46.0 possibilmente con i piu' accreditati (controlla il trust del venditore nel profilo sul forum) per evitare truffe.\n\nSe vuoi usare i tuoi bitcoin per acquistare e/o vendere beni e servizi, puoi consultare questo interessante servizio: http://www.quibitcoin.it/\n\nSe pensi di contribuire a generare bitcoin (in gergo \"minare i bitcoin\"), considera bene che con i prezzi della corrente in italia piu' il prezzo delle apparecchiature necessarie, probabilmente ti conviene acquistarli. Se pero' lo vuoi fare lo stesso (per approfondimento, curiosita'  o qualsiasi altro motivo), allora troverai informazioni qui: https://bitcointalk.org/index.php?board=115.0\n\nNel mondo bitcoin troverai un sacco di gente entusiasta e pronta ad aiutarti, ma purtroppo troverai anche tanta gente disonesta e truffatori (in gergo: \"scammer\").\nMuoviti sempre con circospezione, chiedi se hai dei dubbi,  usa dei meccanismi come l'\"escrow\" per proteggerti,\nossia un terzo di tua fiducia che ti fa da garante: https://bitcointalk.org/index.php?topic=1055575.0  \nConsulta anche la sezione scammer del forum: https://bitcointalk.org/index.php?board=162.0  e questo database di siti/servizi truffa: http://www.badbitcoin.org/\n\nOvviamente queste sono solo alcune informazioni per iniziare, poi scoprirai che il forum e' una miniera di approfondimenti utili e interessanti  riguardanti bitcoin e le \"criptomonete\"  (le monete matematiche che si generano cioè con algoritmi matematici legati all'ambito della crittografia; il bitcoin è una delle tante criptomonete, la prima e quindi la più famosa); troverai utilissimo il bottone search oppure la ricerca avanzata: https://bitcointalk.org/index.php?action=search;advanced;search=\n\nE non dimenticarti di dare anche un'occhiata alle regole di utilizzo del forum: https://bitcointalk.org/index.php?topic=168829.0 Wink\n\nBenvenuto !",
				"added": 1470603614
			}
		],
		"1_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": [
			{
				"comment_id": 10,
				"body": "Can I publish in Internet my debug.log and send the link to you? the log file contains sensible data that compromise my privacy?",
				"added": 1450707577
			},
			{
				"comment_id": 11,
				"body": "I have one hundred of this error. Unhandled and site.json Error 2.",
				"added": 1450707725
			},
			{
				"comment_id": 12,
				"body": "It is the tipical part, tell me if it is useful:\n\nTraceback (most recent call last):\n  File \"/home/sandro/.local/lib/python2.7/site-packages/gevent/greenlet.py\", line 327, in run\n    result = self._run(*self.args, **self.kwargs)\n  File \"src/File/FileServer.py\", line 154, in checkSite\n    site.announce()  # Announce site to tracker\n  File \"src/Site/Site.py\", line 671, in announce\n    self.saveSettings()\n  File \"src/Site/Site.py\", line 91, in saveSettings\n    sites_settings = json.load(open(\"%s/sites.json\" % config.data_dir))\nIOError: [Errno 2] No such file or directory: 'data/sites.json'\n[2015-12-21 14:49:53,180] DEBUG    Site:1Fhhaw..G9Cv Found 2 peers, new: 1\n[2015-12-21 14:49:53,352] DEBUG    Site:1Fhhaw..G9Cv Found 2 peers, new: 1\n[2015-12-21 14:49:53,632] DEBUG    Site:1Fhhaw..G9Cv Found 2 peers, new: 1\n[2015-12-21 14:49:54,819] ERROR    - Unhandled exception\nTraceback (most recent call last):\n  File \"/home/sandro/.local/lib/python2.7/site-packages/gevent/greenlet.py\", line 327, in run\n    result = self._run(*self.args, **self.kwargs)\n  File \"src/File/FileServer.py\", line 154, in checkSite\n    site.announce()  # Announce site to tracker\n  File \"src/Site/Site.py\", line 671, in announce\n    self.saveSettings()\n  File \"src/Site/Site.py\", line 91, in saveSettings\n    sites_settings = json.load(open(\"%s/sites.json\" % config.data_dir))\nIOError: [Errno 2] No such file or directory: 'data/sites.json'\n[2015-12-21 14:49:55,212] DEBUG    Site:1BLogC..AGg8 Found 26 peers, new: 21\n[2015-12-21 14:49:55,346] DEBUG    Site:1BLogC..AGg8 Found 23 peers, new: 5\n[2015-12-21 14:49:55,841] DEBUG    Site:1BLogC..AGg8 Found 30 peers, new: 4\n[2015-12-21 14:49:56,819] ERROR    - Unhandled exception",
				"added": 1450707899
			},
			{
				"comment_id": 13,
				"body": "Ok, you have not a Gnupg public key so I have send the two log file via normal email. You have mail.",
				"added": 1450708522
			},
			{
				"comment_id": 14,
				"body": "> [oracle](#comment_50_1ED3Ho3kmzaKiECtyuqSjDpoE47rKuXeP): It's happened twice to me as well.\nVery good :) We are two guy that have the same bug.\n\n@nofish have you received my two log files at your email address  hello@noloop.me ?",
				"added": 1450789916
			},
			{
				"comment_id": 16,
				"body": "> [nofish](#comment_153_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Thanks, i got it, the startup error error: [Errno 98] Address already in use: ('127.0.0.1', 43110) indicates that you have started zeronet more than once at same time. This would also explain the sites.json file problem, because the process would want to access the file at same time. To avoid this we should stop the startup process when the binding of webui failed.\n\nOk, I have the same problem: for some reason I have started zeronet twice, now I have corrected the bug in my auto-start files. I suppose the bug disappear now.",
				"added": 1450834461
			},
			{
				"comment_id": 17,
				"body": "Is it enough to display in the zeronet page that the program is execute twice?\n\nError: You have run ZeroNet twice",
				"added": 1450878580
			},
			{
				"comment_id": 19,
				"body": "Very good, it is tricky error without your update. TY nofish.",
				"added": 1450892819
			}
		],
		"2_18NqMTQeSD7cAKEcnAdFEBQYJCxHgFXSzk": [
			{
				"comment_id": 15,
				"body": "> [mystd](#comment_6_18NqMTQeSD7cAKEcnAdFEBQYJCxHgFXSzk): ...The \"download, unpack, start\" is good for the alpha/early beta, advanced users have no problem with this but the casuals need guis. For zeronet to get mainstream it'll have to install with assistant (exe), autostart the service on boot etc. so the user can just press next, next, next and finish. Then get presented (auto open) a website in the browser that tells him how to use zeronet. Fast access links (like there currently already are) and a link on the desktop and/or start menu. Casual users are very very lazy they need these things.\n\nI'm not a codes but I agree with myst, the casual user needed an gui.",
				"added": 1450791368
			}
		],
		"2_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": [
			{
				"comment_id": 18,
				"body": "Yes, I forgot this feature, but what about preview? Yes I can publish my post and then edit it, it is a preview. Preview is not a priority feature. :)",
				"added": 1450879193
			}
		],
		"2_1PaX4LQSsjsJvTNqfZbAApgmgzBJjrkRqZ": [
			{
				"comment_id": 20,
				"body": "When I open ZeroReddit I view an empty page with some text in the top of page and the link + Create new topic. When I login with my id I receive the usual Error \"Internal error:...\". When I reconnect to ZeroReddit I received the Error.",
				"added": 1450893366
			}
		],
		"6_1KTjPe9MxoYkcXj78GuZgCcj3R3f3Twh7r": [
			{
				"comment_id": 21,
				"body": "Buon Natale in Italiano (Italian)",
				"added": 1450963072
			}
		],
		"3_168qV1Xxp2EyszrzdECLUwXrn9wGYjDdar": [
			{
				"comment_id": 22,
				"body": "> [dividedby0](#comment_15_16iYwD5U2fNoS22p6447J7992iL3DHjSHY): Liberty Library - 3d models, 3d printing, PDFs, text fileshttp://127.0.0.1:43110/1AFHPGdN9YmEtGC7iDcjU3Jq2WXAbLCxXu\n\nRemote XUL\n\nThis page uses an unsupported technology that is no longer available by default in Firefox.\nPlease contact the website owners to inform them of this problem.",
				"added": 1451084517
			},
			{
				"comment_id": 23,
				"body": "> [einfachertest](#comment_2_1LZbdpKVACfmxW5vffrcwAGugNwcWxuyKu): ok, now http://127.0.0.1:43110/1Lgg6x1sLzztDAFKe12PhkmFwPtEGtftxx ? \n>  or must be  \"To register just add 'zeronet' key to your namecoin domain\"  ???\n\nNot Found\nindex.html",
				"added": 1451084559
			}
		],
		"1_1FQzw6BBWb8DqSgT3uMsMpcWu3uz48bEDX": [
			{
				"comment_id": 24,
				"body": ":) LOL",
				"added": 1451152138
			}
		],
		"1_1FXEbfoHUqHpjVSJKSP6XvxVVfb4chmGGH": [
			{
				"comment_id": 25,
				"body": "f askgfj d",
				"added": 1451423738
			}
		],
		"2_16iYwD5U2fNoS22p6447J7992iL3DHjSHY": [
			{
				"comment_id": 27,
				"body": "> [noiamo](#comment_1_14XxpXNGMLsyeQxikacrbQnAFXVyhN5Ngx): I cant see the sidebar in any site mm...i dont know what happened?!? But tor works fine\n\nThe sidebar is in every site under the 0 icon in the upper right corner: bring it and slide to the left, it will appear the sidebar.",
				"added": 1452106136
			}
		],
		"6_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 28,
				"body": "Con i sottotitoli in italiano? fantastico!\nWith italian sub? Great!",
				"added": 1452604892
			}
		],
		"2_14XxpXNGMLsyeQxikacrbQnAFXVyhN5Ngx": [
			{
				"comment_id": 29,
				"body": "There is the test specific topic in the top of this forum zerotalk.",
				"added": 1453205357
			}
		],
		"2_1789XcRxNBxCsCTWFhhGsbmjrmg4XX4QPL": [
			{
				"comment_id": 30,
				"body": "Me too if gratis. If you want buy some btc use a service like https://bity.com/ in EU.",
				"added": 1453808478
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 36,
				"body": "I have re download zeronet and my old data folder don't works on new zeronet, so I have copy only my:\n\"certs\":\n1MaiL\nfrom old user.json to new user.json. I have copied the folder 1MaiL too.",
				"added": 1469658687
			}
		],
		"1_1BFTNXtYQDMCurqyg45KLmsV6oJD7bQSsH": [
			{
				"comment_id": 37,
				"body": "I receive an allert of Two file update failed.",
				"added": 1469663611
			}
		],
		"8_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 38,
				"body": "Diaspora*?",
				"added": 1470429409
			},
			{
				"comment_id": 41,
				"body": "> [quadrangle](#comment_4_1CTut2qbaj54ZjNoYeuWSGwV75iVieKY6N): What do you do on that?\n\nIt is like Facebook but decentralized.",
				"added": 1470497975
			},
			{
				"comment_id": 44,
				"body": "> [testset](#comment_31_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp): @kensan:\n> So, no, Diaspora* is not like Facebook at all.\n\nYes I agree, but if you know nothing about D*, i can tell you that ;)\n\nIt is \"my\" pod:\nhttps://diasp.eu",
				"added": 1470660515
			},
			{
				"comment_id": 45,
				"body": "> [testset](#comment_30_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp): So my hesitation was right... By the way, people can run their own Diaspora* pods to connect the network. So I still think it is sort of a borderline case...\n\nYes it is a borderline case, it is in the middle between p2p and centralized system.",
				"added": 1470660765
			}
		],
		"1_13Mt8T2256Uz4GHk9B4XvKqyz37wPgA26q": [
			{
				"comment_id": 39,
				"body": "Firefox: I see the player but the song don't start.",
				"added": 1470496519
			}
		],
		"5_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": [
			{
				"comment_id": 40,
				"body": "Tanks.",
				"added": 1470497022
			}
		],
		"1_1KCg4tQ1dBRfMWZ8ptrqXSSUKKR11rYb6P": [
			{
				"comment_id": 43,
				"body": "I have not the tech ability but have you the data base of KAT?",
				"added": 1470604186
			}
		],
		"7_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 46,
				"body": "> [truth](#comment_20_164W1rFVD9Bm7poGJWvjVUjvkbhhFC5nnt): What exactly is multiuser then? When I enable it, I get a new cert_sign. Can you please reply on the other thread?\n\nI have try multiuser and it don't give me my username but an alphanumeric address. I like my username and if I want a many-identity management I must to change the file  user.json",
				"added": 1471185954
			}
		],
		"3_164W1rFVD9Bm7poGJWvjVUjvkbhhFC5nnt": [
			{
				"comment_id": 47,
				"body": "Alternative N°3: substitute \"certs\": { [...] }  with \"certs\": { }  start 0N and you can create a new ZeroId identity. Please save you old \"zeroid.bit\": { [...] } in a safe place: it is your old identity. Please save and delete the entry about ZeroID (1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz), if you don't delete It ZeroNet.py will reconstitute \"cert\": {} by ZeroID data.",
				"added": 1471186581
			},
			{
				"comment_id": 48,
				"body": "Alternative N°2: https://zero.acelewis.com/#ZeroNetwork.bit it is a metaproxy.\nNot active in this moment.",
				"added": 1471186726
			}
		],
		"6_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": [
			{
				"comment_id": 49,
				"body": "Now I have make another try and I have not seen the bug. I don't understand.",
				"added": 1473957060
			}
		],
		"1_1CHcEy3SYsQvrW9uskKTZxUWj97BmZmvfa": [
			{
				"comment_id": 50,
				"body": "> [oracle](#comment_193_1ED3Ho3kmzaKiECtyuqSjDpoE47rKuXeP): When I click on a magnet link, a small window appears and it says - Problem loading page Remote XUL This page uses an unsupported technology that is no longer available by default in Firefox.  Please contact the website owners to inform them of this problem.\n\nConfirm:\n\nRemote XUL\n\nThis page uses an unsupported technology that is no longer available by default in Firefox.\n\nPlease contact the website owners to inform them of this problem.",
				"added": 1476221188
			}
		]
	},
	"comment_vote": {
		"1_14YEJRhCmYsKtDGXcvgAFUDQEyWipJgRPe": 1,
		"2_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": 1
	}
}