{
	"next_post_id": 5,
	"next_comment_id": 4,
	"next_follow_id": 26,
	"avatar": "generate",
	"user_name": "Journalist",
	"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1486928759,
			"body": "¿Se permite la pedofília en Zer0net>Zer0me?\nLLevo en Zer0net desde sus inicios y la he visto ir creciendo y ampliar sus capacidades. Muchos usuarios vinieron atraidos por la novedad y luego han desaparecido. Algunos usuarios dicen que \"si es porque faltan webs, contenido único y original\", \"no se puede hacer nada especial que no se pueda hacer en la clearnet\", \"las web son poco vistosas, gráficas y coloridas\", etc, etc, etc.\nOtros te confiesan sin tapujos: \"Cada vez hay más pedofilia, me desagrada ver eso\", \"No quiero que me asocien con Zer0me\", \"Me da verguenza que mis familiares sepan que utilizo Zer0net, imagínate que iban a pensar mis hijos, ¿tú se lo recomendarías a los tuyos?\"\",...\nY la verdad sea dicha el proyecto es sumamente interesante pero se está degradando a pasos agigantados. Desde sus inicios ha sufrido muchos ataques de spammers, normalmente de bajo nivel, que intentaban divertirse llenando Zer0net de spam. Por suerte esto provocaba la indignación de muchos usuarios, que hacían públicos muchos mensajes de quejas, se abrían hilos en todos los idiomas para hablar del asunto e intentar evitarlo, los desarrolladores dedicaban mucho esfuerzo y tiempo al asunto, en Github el tema estaba en prioridad máxima.\nAl poco tiempo, a veces minutos, estos spammers eran neutralizados, los mensajes borrados o agrupados para no molestar y las cuentas de estos usuarios borradas o bloqueadas.\nEn contraposición los usuarios que difunden publicamente imágenes de pedofilía en Zer0me (por no hablar de webs llenas de material pedófilo), suscitan mínimas críticas, algunos usuarios incluso incluyen comentarios de aprobación o votos positivos, las imágenes están activas durante no horas, sino incluso días y semanas, las cuentas de estos usuarios no suelen ser borradas o bloqueadas...\nAlgunos usuarios me han comentado que cuentan con la \"connivencia\" de los desarrolladores porque son usuarios activos que participan, crean webs, hubs, proxies, dan soporte, sostienen Zer0net,...y no se les quiere eliminar.  Y estoy empezando a creer que tienen razón.\nCualquiera que tenga unos conocimientos avanzados puede hacer un script y meter spam, para los desarrolladores de Zer0net es fácil bloquear ciertos contenidos. Ahora estrenamos la opción de \"mute\", pero poder silenciar y no ver los problemas, en este caso la abundancia progresiva de pedofília en Zer0net, no significa que se resuelva, es simplemente hacerse el tonto y mirar hacia otro lado. Tú puedes ignorarlo pero ¿cuánto tiempo van a tardar, si esto sigue sí, de tratar en los medios de comunicación a Zer0net como un sitio de pedófilos?.\n¿Zer0net es un Internet descentralizado y libre? No seamos ingenuos el creador siempre mantiene el control, en tal caso es el \"Internet de Nofish\" que es quien controla todas las puertas y todas las salidas. Es el Gran Hermano, el ojo que todo lo ve. ¿Pero qué sabemos del creador? Y lo que es más importante: ¿quién \"controla\" al Creador de Zer0net?  ",
			"date_added": 1486928757
		},
		{
			"post_id": 1486980008,
			"body": "Is pedophilia allowed in Zer0net> Zer0me?\n\nI have been in Zer0net since its inception and have seen it grow and expand its capabilities. Many users were attracted by the novelty and then disappeared. Some users say that \"if it is because webs are missing, unique and original content\", \"you can not do anything special that can not be done in the clearnet\", \"the webs are not very colorful, graphic and etc\" etc.\nOthers confess to you without question: \"There is more and more pedophilia, I dislike seeing that\", \"I do not want to be associated with Zer0me\", \"I am ashamed that my relatives know that I use Zer0net, imagine what my children would think. Would you recommend it to your own? \"\" ...\nAnd the truth be told the project is extremely interesting but is degrading by leaps and bounds. From its beginnings it has suffered many attacks of spammers, usually of low level, who tried to amuse themselves filling Zer0net of spam. Luckily this caused the indignation of many users, who made many complaints messages, threads were opened in all languages ​​to talk about the issue and try to avoid it, the developers spent a lot of effort and time on the issue, Github was a priority issue Maximum.\nSoon, sometimes minutes, these spammers were neutralized, messages deleted or grouped so as not to disturb and the accounts of these users deleted or blocked.\nIn contrast, users who publicly disseminate images of pedophilia in Zer0me (not to mention webs full of pedophile material), give rise to minimal criticism, some users even include comments of approval or positive votes, the images are active for not hours, but even days And weeks, the accounts of these users are not usually erased or blocked ...\nSome users have told me that they have the \"connivance\" of the developers because they are active users who participate, create webs, hubs, proxies, support, Zer0net, and do not want to eliminate them. And I'm beginning to believe they're right.\nAnyone who has advanced knowledge can make a script and put spam, for the developers of Zer0net is easy to block certain content. Now we release the option of \"mute\", but being able to silence and not see the problems, in this case the progressive abundance of pedophilia in Zer0net, does not mean that it is solved, it is simply to become a fool and look the other way. You can ignore it, but how long will it take, if this continues, to treat Zer0net in the media as a pedophile site?\nIs Zer0net a decentralized and free Internet? Let's not be naive the creator always maintains control, in that case it is the \"Nofish Internet\" that is who controls all the doors and all the exits. He is the Big Brother, the all-seeing eye. But what do we know about the creator? And what is more important: who \"controls\" the Zer0net Creator?",
			"date_added": 1486980005
		},
		{
			"post_id": 1487019777,
			"body": "Before someone misrepresents my words. I want to clarify that I am totally in favor of freedom of expression and I see perfect that Zer0net can talk about anything with total privacy. (Although being realistic I do not see much content of social or political activists, human rights agencies, NGOs, etc).\nBut one thing is to talk about any issue with total freedom (politics, sex, economy, drugs, etc) and another thing is to upload PICTURES PEDÃFILAS. I do not believe that this is conducive to constructive discussions, new reflections or broadening of knowledge.\nMany of those who complained about the \"disrespect\" for spam, advertising or users who advertised Zer0net their webs or contents now remain silent before the images of pedophilia. Is this no longer a disrespect towards other users?\nJust say another, Nofish know what can be done, it is easy and technically possible to block pedophile IDs, but if you want to do it is your thing, but to those of us who know a little programming do not take us for fools. You will know the friends that you choose in your way in the development of Zer0net.\nTranslated by google translator\n---------------------------------------\nAntes de que, algún usuario, tergiverse mis palabras. Yo quiero aclarar que estoy totalmente a favor de la libertad de expresión y veo perfecto que en Zer0net se pueda hablar de cualquier cosa con total privacidad. (Aunque siendo realista no veo mucho contenido de activistas sociales o políticos, agencias de derechos humanos, ongs, etc).\nPero una cosa es hablar de cualquier tema con total libertad (política, sexo, economia, drogas,etc) y otra cosa es subir IMAGENES PEDÖFILAS. Esto no creo que sirva para propiciar debates constructivos, reflexiones nuevas o ampliar conocimientos.\nMuchos de los que se quejaban de la \"falta de respeto\" por el spam, publicidad o usuarios que anunciaban en Zer0net sus webs o contenidos ahora callan ante las imágenes de pedofília. ¿esto ya no es una falta de respeto hacia los demás usuarios?\nSólo decir otra, Nofish sabes que se puede hacer, es fácil y tecnicamente posible bloquear IDs de pedófilos, sino lo quieres hacer es cosa tuya, pero a los que sabemos un poquito de programación no nos tomes por tontos. Tú sabras los amigos que eliges en tu camino en el desarrollo de Zer0net.\n\n",
			"date_added": 1487019773
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "Your explanations do not convince me. I encourage any user to do this test: create a script that introduces advertising or spam on Zer0net. This user will be able to verify that, in the few messages, his signature is blocked and it is impossible to continue. Then it will be impossible to publish and clone webs.\nWith users who introduce pedophilia images, this does not happen.\nNofish do not take us for idiots. Is it very difficult in official applications that there are no hubs without control? Is it not possible that in \"official\" Zer0me only \"official\" hubs are controlled?\nTus explicaciones no me convencen. Yo animo a cualquier usuario que haga esta prueba: crear un script que introduzca publicidad o spam en Zer0net. Este usuario podrá comprobar que, a los pocos mensajes, su firma se bloquea y le es imposible continuar. Luego le será imposible publicar y clonar webs.\nCon los usuarios que introducen imágenes de pedofília no pasa esto.\nNofish no nos tomes por idiotas. ¿es muy díficil en las aplicaciones oficiales que no haya hubs sin control? ¿No es posible que en Zer0me \"oficial\" sólo estén hubs \"oficiales\" controlados?\n",
			"post_uri": "1DnhwsShChvDmLiG3hMnPHCgMj2nJbxG8J_1486980008",
			"date_added": 1486983413
		},
		{
			"comment_id": 3,
			"body": "@Nofish:  \nBefore this post is filled with posts of Nofish flatterers,\nJust say a few things:\n-Curious, spam and advertising can be blocked, come from the hub that come and pedophilia does not.\n-Curious, spam and advertising can be blocked, the nick is registered in Zeroid.bit, kaffie, others ...\nPedophilia can not be blocked.\nI am telling the user WebControl that they can not sign and publish anymore. Those who denounce pedophilia are blocked!\n\nI have seen remove and block all spammer accounts, no matter the hub / ID / ...\nWhen are you going to block these pedophiles? Or is he going to tell us that he can not? I do not believe it.\n\nhttp://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1KNmG5rJUGhgUJGFbLkv2B5isaqu9PrZqi/12qLhLCSUd8ZVtQHQmyTi6LcyJysLQ2tgy/oooooooooooooooo@zeroid.bit\nhttp://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1KNmG5rJUGhgUJGFbLkv2B5isaqu9PrZqi/1BhyhskHXpqR2pYCJab9JBQeY7jzZRfTZQ/df646346re@zeroid.bit\nAntes de que se llene este post de pelotas de Nofish, simplemente decir:\n-Curioso, el spam y la publicidad se puede bloquear, vengan del hub que vengan y la pedofilia no\n-Curioso, el spam y la publicidad se puede bloquear, esté registrado el nick en Zeroid.bit, kaffie, otros...\nLa pedofilia no se puede bloquear.\nMe comenta el usuario WebControl que ya no puede firmar y publicar. !Los que denuncian la pedofilia bloqueados!\n\nYo he visto eliminar y bloquear todas las cuentas de spammer, da igual el hub/ID/...\n¿Cuándo va a bloquear estos pedófilos? ¿O es que nos va a decir que no puede? Yo no me lo creo.\nhttp://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1KNmG5rJUGhgUJGFbLkv2B5isaqu9PrZqi/12qLhLCSUd8ZVtQHQmyTi6LcyJysLQ2tgy/oooooooooooooooo@zeroid.bit\nhttp://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1KNmG5rJUGhgUJGFbLkv2B5isaqu9PrZqi/1BhyhskHXpqR2pYCJab9JBQeY7jzZRfTZQ/df646346re@zeroid.bit",
			"post_uri": "1DnhwsShChvDmLiG3hMnPHCgMj2nJbxG8J_1486980008",
			"date_added": 1486989271
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1AfMv5MuNfa3BfmdsvGiHn9fnrEsCwxhhC",
			"user_name": "Jjg",
			"date_added": 1486928783
		},
		{
			"follow_id": 2,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1KojMUSr1fBEwwTJAa1kTH9tqmnAhjFwRp",
			"user_name": "Cyan",
			"date_added": 1486928786
		},
		{
			"follow_id": 3,
			"hub": "1KNmG5rJUGhgUJGFbLkv2B5isaqu9PrZqi",
			"auth_address": "17cjAwEm83qvNVfARPiqL7CdAg8VJDjMaZ",
			"user_name": "Xj",
			"date_added": 1486928787
		},
		{
			"follow_id": 4,
			"hub": "1KNmG5rJUGhgUJGFbLkv2B5isaqu9PrZqi",
			"auth_address": "13SEoxMkf4htiz29g79SvKrfdYetdHJUY1",
			"user_name": "0token",
			"date_added": 1486928789
		},
		{
			"follow_id": 5,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "16osdFmHgwgy9sgBws1po2zP5PxwMALvZa",
			"user_name": "Th3B3st",
			"date_added": 1486928789
		},
		{
			"follow_id": 6,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "14gSb2CFNiotgD3e98RUMQto8zmPMr9ksB",
			"user_name": "Tan",
			"date_added": 1486928791
		},
		{
			"follow_id": 7,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "15ybgb4Jjqcvsg886Ah8bbwx3MbdsrMQPb",
			"user_name": "Yandex",
			"date_added": 1486928793
		},
		{
			"follow_id": 8,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1LxkfGxtWhktAJ5WJ9ZnKxksTSH37qm8cC",
			"user_name": "Firebox",
			"date_added": 1486928929
		},
		{
			"follow_id": 9,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "18cSYDgTfMB255SDgQM9EuoyWu78MhWfNj",
			"user_name": "Martinv",
			"date_added": 1486928931
		},
		{
			"follow_id": 10,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj",
			"user_name": "Nofish",
			"date_added": 1486928934
		},
		{
			"follow_id": 11,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx",
			"user_name": "ks",
			"date_added": 1486928938
		},
		{
			"follow_id": 12,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "12EgeG4vgNHzuPJYZqVJQwy2W9vkywbQQu",
			"user_name": "PaintNinja",
			"date_added": 1486928957
		},
		{
			"follow_id": 13,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh",
			"user_name": "Kaffie",
			"date_added": 1486929017
		},
		{
			"follow_id": 14,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "19M1DT5vruSATEcbEczYRwCk2uPuLcATBa",
			"user_name": "Talnicrom",
			"date_added": 1486929019
		},
		{
			"follow_id": 15,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u",
			"user_name": "Lola",
			"date_added": 1486929023
		},
		{
			"follow_id": 16,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ",
			"user_name": "Musickiller",
			"date_added": 1486929025
		},
		{
			"follow_id": 17,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1889tLMuZze7YMshhe8u5h4NT4SSiA4PVB",
			"user_name": "Zanity",
			"date_added": 1486929029
		},
		{
			"follow_id": 18,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1D242AyQghFqqQTwo1f1csP5kRQe588BUm",
			"user_name": "Frabrunelle",
			"date_added": 1486929038
		},
		{
			"follow_id": 19,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1QLL6cXP25nm3SZ48At3ogR1HL3xM1CUPp",
			"user_name": "Tortester",
			"date_added": 1486929039
		},
		{
			"follow_id": 20,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "16YxtnaTrCSbvCXSYxrnvobmYnqtidxG23",
			"user_name": "Hellozeronetwork",
			"date_added": 1486929041
		},
		{
			"follow_id": 21,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ",
			"user_name": "Sirenyc",
			"date_added": 1486929071
		},
		{
			"follow_id": 22,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ",
			"user_name": "P2P",
			"date_added": 1486929135
		},
		{
			"follow_id": 23,
			"hub": "1BLueGvui1GdbtsjcKqCf4F67uKfritG49",
			"auth_address": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp",
			"user_name": "FraYoshi",
			"date_added": 1486929156
		},
		{
			"follow_id": 24,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV",
			"user_name": "Mynameislegion",
			"date_added": 1486929174
		},
		{
			"follow_id": 25,
			"hub": "1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i",
			"auth_address": "1Gv5UsdtwMNN4fBHWYF5TCjtsXDUcKB7ck",
			"user_name": "Qwerty12",
			"date_added": 1486929214
		}
	]
}