{
	"next_post_id": 15,
	"next_comment_id": 7,
	"next_follow_id": 2,
	"avatar": "png",
	"user_name": "Testuser789",
	"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
	"intro": "testing how this works: http://127.0.0.1:43110/Board.ZeroNetwork.bit/",
	"post": [
		{
			"post_id": 1,
			"date_added": 1482681579,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1482681603,
			"body": "I'm testing this stuff now",
			"date_added": 1482681601
		},
		{
			"post_id": 1482681933,
			"body": "pic",
			"date_added": 1482681930,
			"meta": "{\"img\":\"900,355,fff,0000000000000000000000000000000000000000\"}"
		},
		{
			"post_id": 1482682626,
			"body": "write something and post a hot pic",
			"date_added": 1482682622,
			"meta": "{\"img\":\"900,355,eee444333ddd888777cccaaa999bbb222111,0001230000345544064506755183690921ABA900\"}"
		},
		{
			"post_id": 1482682877,
			"body": "bigger pic?",
			"date_added": 1482682872,
			"meta": "{\"img\":\"687,700,7a46848549a6ab7563543b74864922933c88332211522dba,001210314400520067444027847734429AA882B74A92666BB74CD655C77748BEE056B3F87CC01CC1ABB8600CC5ABB8510C15\"}"
		},
		{
			"post_id": 1482685013,
			"body": "probably too big",
			"date_added": 1482685007,
			"meta": "{\"img\":\"900,690,7948749a6653964895854a75c86743674532322a55ba8ca6,0122223444565203778859A71B7777790ABCCCCC8D61CB33BBEDB9BFFF1B28B9B7FF7BEFB1155551\"}"
		},
		{
			"post_id": 1482685151,
			"body": "530 x 406 px",
			"date_added": 1482685144,
			"meta": "{\"img\":\"900,690,7948749a6653964895854a75c86743674532322a55ba8ca6,0122223444565203778859A71B7777790ABCCCCC8D61CB33BBEDB9BFFF1B28B9B7FF7BEFB1155551\"}"
		},
		{
			"post_id": 1482685344,
			"body": "max pic size is 530 x 530, everything bigger gets scaled down congruently... wait, wait, wait... you can change shit ?! And how long can postings be? Is this too long? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this? And this?",
			"date_added": 1482685336
		},
		{
			"post_id": 1482686104,
			"body": "Are there #hashtags ?",
			"date_added": 1482686095
		},
		{
			"post_id": 1482686443,
			"body": "can pics be endlessly long?",
			"date_added": 1482686433,
			"meta": "{\"img\":\"45,700,eeefff,0111111111\"}"
		},
		{
			"post_id": 1482687394,
			"body": "Posting a link: http://127.0.0.1:43110/Board.ZeroNetwork.bit/",
			"date_added": 1482687383
		},
		{
			"post_id": 1482687533,
			"body": "Posting another link: http://duckduckgo.com/",
			"date_added": 1482687521
		},
		{
			"post_id": 1482688033,
			"body": "...",
			"date_added": 1482688020,
			"meta": "{\"img\":\"727,700,fffdddbbbeeecccaaa888333555,0000000000012000113034340112300563035630000000000000005784000030000000000000000000000000000000000000\"}"
		},
		{
			"post_id": 1482688259,
			"body": "how about animated gifs?",
			"date_added": 1482688245,
			"meta": "{\"img\":\"700,700,010000121111,0011111111111111111111111111111111110110111111111100011121011310113011111011111111101110111111011311\"}"
		}
	],
	"post_like": {
		"1PvAednzaMJiuMz1SD5wF3m3Hx7SK75zHv_1482681603": 1482681971
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@3f3fuzuugh: I don't know !",
			"post_uri": "1PvAednzaMJiuMz1SD5wF3m3Hx7SK75zHv_1482682626",
			"date_added": 1482689428
		},
		{
			"comment_id": 2,
			"body": "@3f3fuzuugh: That was exactly what I thought !",
			"post_uri": "1PvAednzaMJiuMz1SD5wF3m3Hx7SK75zHv_1482681933",
			"date_added": 1482689450
		},
		{
			"comment_id": 3,
			"body": "That was exactly my conclusion. Animated gifs don't work... yet.",
			"post_uri": "1PvAednzaMJiuMz1SD5wF3m3Hx7SK75zHv_1482688259",
			"date_added": 1482699310
		},
		{
			"comment_id": 4,
			"body": "@Border0464fred: Then show us a working animated gif here on ZeroMe right now. :P",
			"post_uri": "1PvAednzaMJiuMz1SD5wF3m3Hx7SK75zHv_1482688259",
			"date_added": 1482767597
		},
		{
			"comment_id": 5,
			"body": "@3f3fuzuugh: !!!",
			"post_uri": "1PvAednzaMJiuMz1SD5wF3m3Hx7SK75zHv_1482681933",
			"date_added": 1482767628
		},
		{
			"comment_id": 6,
			"body": "@FraYoshi: *reassuring* \"/y96C.matrix-animated-image.gif\" nope, but good guess ! I could have been that stupid !",
			"post_uri": "1PvAednzaMJiuMz1SD5wF3m3Hx7SK75zHv_1482688259",
			"date_added": 1482785286
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1Put1CpPZg8vovCJ426Ah2Xc43PRbyZrkT",
			"user_name": "Aztechnology",
			"date_added": 1482681627
		}
	]
}