{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"7_162gsjqc5VB9ijkvSZMZVrcqdmqQ7XugiF": 1,
		"5_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": 1,
		"1_17To4zKQntCiVqSZqHK3mwEpbLWVCtLHEe": 1,
		"1_1BcQYN5dcgNMLusmimN1yTVfvWNcHgcdWL": 1
	},
	"next_comment_id": 27,
	"comment": {
		"10575_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 1,
				"body": "What lies on Tor is an NSA honeypot.",
				"added": 1486859845
			}
		],
		"2_1E5qiz3ku3EzkMaUSj7mSSVJGtecNTGtBj": [
			{
				"comment_id": 2,
				"body": "In your ZeroNet bundle go to ZeroNet/data/users.json. This file stores information about your various IDs and some settings. If you just want a new name then you can delete (or back up) this file and then you will be handed a new ID the next time you need one. If you want to use multiple IDs this can also be accomplished by manipulating that file, but I don't know of any gui tool that does it and currently this is not the intended behavior.",
				"added": 1487123382
			}
		],
		"2_16ruLucRLto6GhT1Zb3P8JVZzC48fxd9Cc": [
			{
				"comment_id": 3,
				"body": "I would actually recommend against dual booting for two reasons. The first is that you will never be forced to learn the system, although it really is very user-friendly at this stage. The second is that you may find managing a dual boot too complex. I had a situation where Windows 7 modified something on my dual boot setup and could no longer boot the disc, although my data remained intact. Whether this was unavoidable or due to my own stupidity I'll never know, but it was then I decided I would just wipe the thing and use only Linux from then on. I am very happy to be free of Windows now.",
				"added": 1487193779
			}
		],
		"5_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": [
			{
				"comment_id": 4,
				"body": "Give me my god damn YouTube clone zite which lets me browse content from YouTube and pull it into ZeroNet for distributed hosting in order to prevent censorship.",
				"added": 1487210068
			}
		],
		"10668_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 5,
				"body": "Nice to see someone is working on keeping the \"1337 haxx0r\" image alive in the web 3.0 era.",
				"added": 1487384502
			}
		],
		"1_1JHumjFpXMTtSgm1ygdHqsvL9321Z87NDc": [
			{
				"comment_id": 6,
				"body": "> [x00](#comment_1_1JHumjFpXMTtSgm1ygdHqsvL9321Z87NDc):\n> stop using gms and phone networks as they are easily crackable\n\nSo do you not have a way to call people when you're out or do you live in some utopia where you can buy mobile internet access without it being integrated into the phone system?",
				"added": 1488135977
			},
			{
				"comment_id": 7,
				"body": "> [testuserm](#comment_12_12JNkg22um5nYeLgK8XgKavpivuwjrfHAy): Ahem, you think NSA doesn't already have a backdoor? Anyway I do use Apple, just for low key stuff though.\n\nMy American counterpart is trying to pull the wool over your eyes. We have real privacy protections here in the UK.",
				"added": 1488730963
			}
		],
		"2_13bJpDYmLnZMLWy696GAxHA9mdizyZW2PK": [
			{
				"comment_id": 8,
				"body": "> [freemandave](#comment_3_19VooSAyz8sBqHyNQcDoq6o5Wa9uar4Hhc): Hold on, if this is true we're all fucked unless we stop using all electronics with internet access.\n\nWhy is that? Do you have something to hide?",
				"added": 1488919758
			}
		],
		"26_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 9,
				"body": "> [nofish](#comment_896_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj):\n> his/her\n\nDo you drag that grammatical atrocity around with you everywhere? If you really care to include all three women on ZeroNet then just use singular they.",
				"added": 1488981517
			}
		],
		"1_1HJugahAiT2RnwJQdHuEd2RgW5fpWwNxnB": [
			{
				"comment_id": 10,
				"body": "It looks like you're trying to volunteer to create some content. Good on you.",
				"added": 1489759073
			}
		],
		"1_12May38MPRVcM5mY2LDut4U95YSbwekCwD": [
			{
				"comment_id": 11,
				"body": "> [styromaniac](#comment_20_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): No. They're all too busy fapping all these years later.\n\nThere are new pics of the girl from Harry Potter and someone else.\n\n> [yinyue](#comment_25_1GNgaj5EqkzqYECYbXa889fGLyuseHRi3t): 0chan\n\nThat said, we don't have a bunch of lame celebrity skeleton worship on 0chan and I'd prefer to keep it that way.",
				"added": 1489851509
			}
		],
		"1_1B9EV9cRouuL4fFMprXCYfNMsL6QVbsiDJ": [
			{
				"comment_id": 12,
				"body": "mdr m8",
				"added": 1490792200
			}
		],
		"1_12p3yAJYYbtSY226FLMaxXLMtFkBaLxu9a": [
			{
				"comment_id": 13,
				"body": "One time a liberal asked me to peg him in his little faggot asshole. I told him to bugger off at first but then I decided I would show him what a real trans man can do.\n\nLiberal scum need to die.",
				"added": 1491000947
			},
			{
				"comment_id": 14,
				"body": "> [opisafaggot](#comment_16_12p3yAJYYbtSY226FLMaxXLMtFkBaLxu9a): Feminists are starting to hate transfags \n\nhttps://en.wikipedia.org/wiki/Feminist_views_on_transgender_and_transsexual_people\n\nThey've always hated them.",
				"added": 1491077461
			}
		],
		"1_1PfXizQkX7L7ho96Yqva2hvdk6VFT9Dnk7": [
			{
				"comment_id": 15,
				"body": "American or 英国人 or 中国人?\nYes.",
				"added": 1491345783
			}
		],
		"2_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 16,
				"body": "If tout le mundo write en leur propía 文 il y aurait .هرخلة",
				"added": 1491512151
			}
		],
		"35_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 17,
				"body": "I'd feel better about this if there were a few sock puppets talking about how great and interesting this thing is.",
				"added": 1491607528
			}
		],
		"1_14YkpjZoU1Q897PhRG4CWyg6CL6Rn4QEVf": [
			{
				"comment_id": 18,
				"body": "To my understanding ZeroNet distributes websites like torrents, with blockchain technology only involved in registering zite names (namecoin). So no, even at this point it would totally unrealistic for everyone to download everything.",
				"added": 1491768132
			}
		],
		"13_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb": [
			{
				"comment_id": 19,
				"body": "The premise of this thing makes no sense. Look at this from the FAQ.\n\n>How does LBRY benefit content consumers? Why should I bother caring?\n>Do you watch YouTube? Imagine paying a few cents to eliminate all ads.\nI already have a free adblocker, not to mention ZeroNet video sites with no ads.\n\n>Do you use BitTorrent? Imagine getting paid to seed files into the network.\nI doubt this would be worth the money for most people. There are better file-hosting solutions already, and no one is going to pay to keep a rare movie up on the off chance someone else wants to see it.\n\n>Do you shop on the iTunes Store? Imagine paying less for songs, TV episodes, and music videos and having 100% of the price directly to the creators.\nI don't think anyone who does that sort of thing is here. Good luck wresting the illiterate masses from Apple and the other old media companies.",
				"added": 1492047974
			}
		],
		"1_1B5iBCuHQgbGdgTJmM2A2pZNVfpfp3EU5u": [
			{
				"comment_id": 20,
				"body": "Holy fucking shit why did no one warn me there might be ghosts on here?\n\nFuck this, everybody out.",
				"added": 1492206026
			}
		],
		"2_1Gi1gKhUwd3SBAKYyGTyWvN1L6QHtf56SL": [
			{
				"comment_id": 21,
				"body": "The one thing I don't understand is why you use the word \"genial\" so fucking much. Get a thesaurus goddamn.",
				"added": 1492977943
			}
		],
		"1_17jhcV7ACnYLDiBSdw6KqL3d9WVjDtcjf1": [
			{
				"comment_id": 22,
				"body": "No major world government is supported by selling illegal drugs. Get back to your conspiracy forums.",
				"added": 1492984417
			}
		],
		"8_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 23,
				"body": "You can't make a must-have technology without permission. If your idea is good it may be repackaged by approved sources with appropriate safety measures in place.",
				"added": 1493160707
			}
		],
		"4_136wmwLTBJoGTjXTAa7sWmXewn9P53EKML": [
			{
				"comment_id": 24,
				"body": "Is this anything other than a monetized bittorrent? Why would I, as a user, want to use this instead of just waiting for one fan to buy whatever media is sold on lbry and then upload a torrent to zeronet or tpb or whatever? Does this accomplish anything other than cutting out the middle man for people trying to make money by selling original content?",
				"added": 1493505017
			}
		],
		"1_1CMYxdit4qq9QGk9DYRu2ruRPd2YDGckH8": [
			{
				"comment_id": 25,
				"body": "> [a2f7](#comment_2_1NQ2rUT8zy9oPKG3ye7hZdrujyC9JmmuFY): Why do you feel that racism is something that needs to stop?\n\nThey can't take a joke.",
				"added": 1493732858
			}
		],
		"3_17vKbxL13KnzGATstqawXSG2oiQygmdkcX": [
			{
				"comment_id": 26,
				"body": "I should really be running version control on my ZeroNet folder so that I can revert changes like this.",
				"added": 1494328293
			}
		]
	},
	"comment_vote": {
		"11_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"9_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": 1,
		"15_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"34_1BRSETd8x5XUtHt9jz2e4WdB9rWY1WNfiu": 1,
		"2_18WuQsUbszu95sZDiKvrfswRnEpuB5WEQh": 1,
		"268_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": 1,
		"24_1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV": 1,
		"20_1L6pjaEajyF4kYhT5AXeJKUnUuSR5oGKrE": 1,
		"16_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"7_12Faxm4aFYxVhM6erk5LjpQu9gvSq5aGLi": 1,
		"3_1BkgWBWWN9CoXNeEmyyuagid7roJruBVjz": 1,
		"134_168qV1Xxp2EyszrzdECLUwXrn9wGYjDdar": 1,
		"329_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1
	}
}