{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Elected US President Donald Trump criticised the Jewish controlled Federal Reserve corrupt scamming practices against the US people and  provoked with it the outrage of the Jewish centralbanksters. The Federal Reserve is the holly cow of the Jews and brings more profit than the Holoscam. The Jewish controlled US Federal Reserve issued in the last 8 years over 4000 billions of USD without any backing which landed under various  bankster jargon names in Jewish pocket. The Rotschields bought during this time more gold than all nations of the world. The Jewish Anti-Defamation League have vehemently protested against Trump's antisemitism.",
			"body": "http://www.jewworldorder.org/trump-i-will-abolish-the-federal-reserve/\nhttps://www.bloomberg.com/news/articles/2014-10-24/fed-s-4-trillion-holdings-keep-boosting-growth-beyond-end-of-qe\nElected US President Donald Trump: 'I Will Abolish The Federal Reserve'\nDonald Trump intends to create a honest money based on Gold and not on Jewish scam.\nThe Federal Reserve is the holly cow of the Jews and brings more profit than the Holoscam.\nThe Jewish controlled US Federal Reserve issued in the last 8 years over 4000 billions of USD without any backing which landed under various bankster jargon names in Jewish pocket after dubious transfers around the world.\nThe Jews are now worried because their biggest scam is endangered.\nThe Rothschilds, who are officially retired from any business since more than 100 years bought during this time more gold than all nations of the world.\nhttp://www.infowars.com/house-of-rothschild-hoarding-gold-in-face-of-coming-collapse/\n(it was even investigated in various countries if the Rothschild Banks are not manipulating gold prices)\nThe Jewish Anti-Defamation League, defending all Jewish scams have protested against Trump's antisemitism. \nhttps://en.wikipedia.org/wiki/Anti-Defamation_League",
			"added": 1481316729,
			"parent_topic_uri": "9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		}
	],
	"topic_vote": {
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1,
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": 1,
		"1_1AQwGx5xyBi5Fvv9WHJFMCMNtQhUc8UhQF": 1,
		"2_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": 1,
		"2_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1,
		"1_12Xj1w5HYu6w5xtEwwLyEiMYGuCqvYKL2q": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": [
			{
				"comment_id": 1,
				"body": "Terrible this Jewish practices.",
				"added": 1481317139
			}
		]
	},
	"comment_vote": {}
}