{
  "comment": {
    "2_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": [
      {
        "body": "You belong on reddit fucking faggot OP", 
        "comment_id": 1, 
        "added": 1490840065
      }, 
      {
        "body": "> [border0464fred](#comment_89_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): Im totally ok to fight thoses retarded, My grand father have given me his lucky nazikiller bayonet form WW2 im all good.\n\nBitch you can't even handle a chef's knife and you're gonna handle a bayonet? You're better off using those hands to pleasure your trap boyfriend, cocksucker.", 
        "comment_id": 2, 
        "added": 1490840210
      }, 
      {
        "body": "> [kaffie](#comment_268_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): ZeroNet is a true free speech platform. @nofish also supports this, and doesn't moderate at all. You're free to make a ZeroNet site where you ban Nazis. Hell, just click clone on ZeroTalk, and then just remove Nazi comments you don't like. Done. Alternatively you can freely mute users by clicking the three dots on the right of their comment and clicking 'mute this user'. It'll hide their posts from you.\n> There's lots of people on ZeroNet with controversial views. That's just the nature of a truly free speech platform. You can't say you want free speech, and then demand to censor someone. That said, ZeroNet makes it really easy to block who you don't like, or to make your own heavily censored site.\n> Hopefully this doesn't deter you from using ZeroNet.\n\nSeriously? You're trying to console this faggot because his fee fees are hurt? The best answer is this:\n\nIF YOU DON'T LIKE FREE SPEECH YOU COMMUNIST FAGGOT FEEL FREE TO GO!\n\nTrump is president get over it.\n\nUSA USA USA USA USA USA!!!", 
        "comment_id": 3, 
        "added": 1490840514
      }, 
      {
        "body": "> [kaffie](#comment_269_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): It's unfortunate that beautiful tech like ZeroNet is filled up with morons like you.\n\nCry more faggot. You tranny lovers have already ruined video games and Linux with your retarded diversity bullshit.", 
        "comment_id": 6, 
        "added": 1490843286
      }, 
      {
        "body": "> [border0464fred](#comment_91_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): whatever edgelord\n\nSupporting my country is being edgy? I don't think you know what that word means Tumblrite.", 
        "comment_id": 7, 
        "added": 1490843369
      }, 
      {
        "body": "> [border0464fred](#comment_94_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): patriotism is just an other kind of religious delirium that ask you sacrifice for abstract concepts. \n\nThis man voted for Bernie. Sorry no refunds goy.\n\n> Baiting for imaginary fairy tails is edgy to me.\n\nDamn son! You sure hate making America great again. Is your last name Ramirez or Goldstein?", 
        "comment_id": 10, 
        "added": 1490919619
      }, 
      {
        "body": "> [mynameislegion](#comment_28_1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV): Fascists, I will try to be nice: ZeroNet is a project of people from many different countries - for that reason I do not believe it is the right place for you guys. I mean the Hitler Youth didn't camp in the Synagogue, right?\n> Still, I believe everyone is entitled to their own opinion - if you want to discuss Jews, please start your own site and discuss the purity of your genes there. \n> If you want to contribute to ZeroNet in other ways than spreading your ideology like the witnesses of Jehova, you are welcome to participate on the main page.\n\nFuck yourself you special snowflake faggot. Go invite rapefugees into your own house and see what happens.\n\nMAKE EUROPE WHITE AGAIN!", 
        "comment_id": 14, 
        "added": 1491075098
      }
    ], 
    "1_12p3yAJYYbtSY226FLMaxXLMtFkBaLxu9a": [
      {
        "body": "> [swagstika](#comment_6_1EgqAT7i9ipPjsMa5axHKjmLGbdttKd4E1): why the fuck would you take a gender and sexuality course?\n\nI thought it would be an easy A filled with hot sluts. I got a C doing nothing and it was filled with neon-haired hambeasts complaining about men. Remember I was bluepilled.\n\n> [rythyrix](#comment_60_18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y): To acquire a well-rounded education to make resumes, transcripts and adverts look good. BS, IMO. Welcome to College, Inc.\n\nI majored in Journalism. I'm currently managing a team of salesmen. I could've done that without the fucking debt. Oh well, just $30,000 more before the kikes are paid off.", 
        "comment_id": 11, 
        "added": 1490919832
      }, 
      {
        "body": "This is a story when I first entered the workforce right out of university. Idk why the arrows don't show so I'll use dashes.\n\n-be 22, no job prospects so I work in the mall folding clothes\n-indian man walks in\n-hi sir! welcome to GAP. if you need anything feel free to ask\n-he leaves and comes back later with the clothes he wants to buy\n-him and coworker are arguing at the register\n-coworker calls manager\n-i step a little closer to hear what's going on\n-indian: this shirt is dirty look\n-manager: i am so sorry about that. we try to keep our store and merchandise as clean as possible but some customers still damage our clothing. can i get you another shirt?\n-coworker: we dont have any more in that size.\n-manager: im sorry about that sir. youll have to order online\n-indian: its ok. just give me a discount and ill buy it.\n-manager: im sorry sir. for legal and health reasons, we need to take that shirt back and dispose it.\n-indian: what? why? just give me a discount.\n-manager tries to explain that he doesnt want the man to get sick if the stain is from bodily fluids because the man can later sue.\n-indian man insists on being given a discount\n-finally manager asks the man to leave\n-indian man wants managers info so he can report him to corporate\n-manager gives man info\n-indian man threatens a 1 star review on yelp and leaves\n\nindians are notorious for these kinds of antics. theyll tear a tiny hole in clothing or mark it with a pen so they can get a discount. theyre as cheap as kikes. they pride themselves in owning 2 pairs of pants and 4 shirts and a pair of sandals. that is part of the reason why they stink like shit besides not bathing and eating too much curry.\n\nwhat was the stain you ask? it looked like a small shit stain. yes i believe the indian son of a bitch took the shirt and wiped his ass with it and complained. i wouldnt be surprised if he did that since india is a dirty fucking country where they openly defecate in the streets and bathe in the river ghandi with corpses, shit and trash inside.", 
        "comment_id": 12, 
        "added": 1490920935
      }, 
      {
        "body": "Liberals are whiny little bitches. Everything is an oppression contest with them. Feminists are starting to hate transfags for pretending to be women and getting more attention than them.\n\nDay of the rope when?", 
        "comment_id": 16, 
        "added": 1491075238
      }
    ], 
    "1_1DoE2oLDwVmMgdk56QaNB7khXJWuyZstnU": [
      {
        "body": "Isn't there a passage in which Jews advocate the rape of infants as long as they're not less than 3-years old?", 
        "comment_id": 15, 
        "added": 1491075157
      }
    ], 
    "1_19Z8aJ32x4pE2iGvVssPJazJgpGe5L32rq": [
      {
        "body": "Sorry there's no safe spaces outside of university. I know you miss that play-doh and people telling you how special, empowered and beautiful you are.", 
        "comment_id": 4, 
        "added": 1490840739
      }, 
      {
        "body": "> [border0464fred](#comment_92_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): Is it all americans university are about ? play-doh?\n\nUnfortunately yes. You can look up \"safe spaces university.\" When students hear or see things that don't fit in with their viewpoint, they have panic attacks and need to retreat inside special little rooms (provided by the university) with coloring books, play-doh and videos of puppies. Sometimes they have special counselors there to console you.", 
        "comment_id": 5, 
        "added": 1490843205
      }, 
      {
        "body": "> [border0464fred](#comment_93_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): Same thing in Canada, but it's got under critics lately even the left who slowly start to hate it, as at one point they feared it to turn into intolerant radicalism spirals.\n\nI heard Trudeau wanted to make any criticism of Islam a crime. Now he's legalizing weed in 2018. It seems he wants the society passive when the Muslim hordes come to rape and pillage your country.\n\nMove out of your cities into a small town and get your guns and ammo.", 
        "comment_id": 8, 
        "added": 1490843909
      }, 
      {
        "body": "> [swagstika](#comment_7_1EgqAT7i9ipPjsMa5axHKjmLGbdttKd4E1): Im pretty sure that religious jews dont believe in abortion. And how are the jews responsible for communisim?\n\nThey sure don't believe in abortion but they'll encourage the goyim to kill their own offspring.\n\nLook up Frankfurt School. Not on Wikipedia either. Communism was founded by Jews. Alexander Solzhenitsyn is a good start to find out more on this subject. He was a gulag survivor who later collected stories of people's imprisonment and the history of Communism.", 
        "comment_id": 9, 
        "added": 1490919413
      }
    ], 
    "1_1E1fsmFRrsPsfiYVbXfifNMcaWwuk8iFcp": [
      {
        "body": "BUMP!", 
        "comment_id": 13, 
        "added": 1490920976
      }
    ]
  }, 
  "next_topic_id": 4, 
  "topic": [
    {
      "body": "this happened before i took the red pill\n\n>be me 20 yo White male Christian privileged middle class cis scum in university\n>sitting inside gender and sexuality in society class\n>professor: how many genders are there?\n>class: 2\n>professor: wrong! there are 52 (this was a few years back now it's like 58 or more)\n>me: how?\n>professor: sex and gender are two different things. sex is physical where gender is a social construct.\n>goes into bullshit about society having gender roles and how it's bad\n>i knew what he was saying was wrong but i didnt know why it was wrong\n>few years later i come across an indonesian pottery forum that worships an ancient egyptian frog deity.\n>the answers are so clear now\n\nJews. Seriously fucking kikes and their Frankfurt School.\n\nWatch \"The Greatest Story NEVER Told\" on Youtube.", 
      "title": "We All Share Stories/Reasons WHY LIBERALS ARE SUCH FUCKING FAGGOTS", 
      "parent_topic_uri": "9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj", 
      "added": 1490843025, 
      "topic_id": 1
    }, 
    {
      "body": "Fuck you kike lovers. Suck another baby foreskin dick you Satan worshippers.", 
      "parent_topic_uri": "9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj", 
      "added": 1491087533, 
      "topic_id": 2, 
      "title": "LMFAO! Fucking faggot mods put all Jew-related stuff in Off-Topic because \"Not Zeronet\" and keep the other threads"
    }, 
    {
      "body": "Reminds me when the Obama government wanted to allow protests in a limited area with cones and shit. Collaborators like you will be shot.", 
      "parent_topic_uri": "9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj", 
      "topic_id": 3, 
      "added": 1491087692, 
      "title": "Seriously Mods, YOU GUYS ARE FUCKING FAGGOTS! So much for freedom of speech if you guys are locking us in a tiny thread."
    }
  ], 
  "topic_vote": {
    "2_12p3yAJYYbtSY226FLMaxXLMtFkBaLxu9a": 1, 
    "1_12p3yAJYYbtSY226FLMaxXLMtFkBaLxu9a": 1, 
    "3_12p3yAJYYbtSY226FLMaxXLMtFkBaLxu9a": 1
  }, 
  "next_comment_id": 17, 
  "comment_vote": {
    "2_1LQSdNRDWWooy3Z9o5DH3EqggaburDsTu9": 1, 
    "1_1BGWexcsjvPpnPZVmmioZvwBBQ3WoZsWuQ": 1, 
    "1_12p3yAJYYbtSY226FLMaxXLMtFkBaLxu9a": 1
  }
}