{
	"next_post_id": 14,
	"next_comment_id": 10,
	"next_follow_id": 3,
	"avatar": "jpg",
	"user_name": "Lmt",
	"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
	"intro": "新 ZeroNet 用户",
	"post": [
		{
			"post_id": 1,
			"date_added": 1490452151,
			"body": "你好 ZeroMe!"
		},
		{
			"post_id": 1490476533,
			"body": "早上好，五点钟起床的第一件事就是打 开zeronet,因为我想了解如何使用及创立网站。\n\n今早发的第一个帖子，我要将一切的荣耀归于天上至高全能的神，因为没有他的话，我的存在就没有任何意义，如果不是为了他的话，我的一切作为没有丝毫价值。如果不是他的引领的话，我的一生也将无任何值得记念的作为。荣耀归于创造天地的 全能神，归于圣父、圣子、圣灵三位一体独一至高的主，他是我在天上的阿爸父，是赐我生命气息，让我来到这个世界的主，他是把我从罪恶中拯救出来，让我有活泼的盼望，让我的一生有真正永恒归宿的神。\n\n哈利路亚，至高的神啊！全能的神！我心所爱的呀！愿你引领我，一生行在你的旨意里，愿你真理的光照在我的生命中，让我在你的光中欢喜快乐！我主我的神啊，除你以外，这世上还有什么值得追求呢？除你以外这世上还有什么值篮球恋慕呢？我要歌颂你，赞美你，因你的慈爱比生命更加美好。",
			"date_added": 1490476531
		},
		{
			"post_id": 1490931707,
			"body": "有一个原则也许你没有注意到，就是什么树结什么果子，什么人说什么话，从果子可以知道树的好坏，从人口中的言语可知他的善恶。虽然许多作恶者往往狂妄自大，以为他可以任意妄为无所惧怕，但事实上他的良心也告诉他，作恶者总有一天会受到刑罚和报应。因为良心也告诉他，只有行善才是人的当行之道。只是许多行恶的人往往故意压制良心的声音。当然，良心的声音在今生可以被人勉强压制下来，到将来有一天，当它真正发声的时候，必然叫人对自己的刚硬和恶行无可推诿。",
			"date_added": 1490931704
		},
		{
			"post_id": 1490974254,
			"body": "有一种人如果说他是畜类与他实际的生命是完全相合的，这种人首先是满口恶毒的言语，却自以为很良善。把自己吹嘘成神明，却从来没有反观自己卑鄙不堪的行为。他在人前把父母封为神明，却从来没有想想自己有没有真正孝敬父母。\n\n这种人藐视创造天地万物的真神，却夸口自己才是真正孝敬父母的人。如果他能认识真神的话，一定会发现自己的这种行为是何等的神经错乱。因为只有这位真神才能正确的教导人应该如何孝敬父母。因为造物主创造了第一对男女之后，就藉着夫妻的结合来传递人类的后裔，所以父母就成为地上子女生命的来源。所以，父母在地上就如同神，在人际关系中，创造主把孝敬父母摆在一切行为的首要地位，他也藉其他的受造物提醒人类，连他所创造没有灵性的动物尚且知道孝敬父母，何况照着神的形像创造的人呢？人若对父母不孝敬，就连禽兽也不如了。所以，神的律法要求，咒骂父母的当治死他。\n\n虽然否认创造之主的畜类人也可能发现孝敬父母的重要性，却根本不懂得如何去孝敬父母，他只知道表现自己的伟大，擅长用恶毒的言语咒骂别人，甚至辱骂我们，以为敬拜真神会令人不孝敬父母。这种荒唐的言语也只能从没有灵性的畜类口中发出来，因为但凡有灵性的人，至少会在下结论前先了解一下别人信仰的内涵。绝不至于闭着眼睛张口辱骂别人，以此表现自己的伟大。好象犬类以为自己如果不狂吠的话，人类会不知道他是畜生似的。\n\n这种人把自己的父母封为神明时，看似真的很伟大，事实上他是人格分裂的，一方面夸口说父母是神明，吹嘘说我们当孝敬父母，另一方面并不会真正孝敬自己的父母。此外，如果此人的父母是作妓女或娈童的，如果他是淫乱生的，他一定会把妓女和恋童封为他的神明的。而且他一定还是夸口自己的伟大，因为他创造了一个自以为很伟大的神明。\n\n",
			"date_added": 1490974250
		},
		{
			"post_id": 1491047427,
			"body": "今日在link一个群里发现有一位自称民主人士的人诋毁基督教信仰，不得不回复他一句：\n民主是谁的不重要，开口闭口鸡呀狗呀的，连对人性起码的尊重也没有，这种人有一天真正有自由了，也必定会以自己的自由践踏别人的尊严。一旦他在民主人士中得势了，必定会以所谓的民主实行他的专制独裁。\n\n谁知一句话就把他惹恼了，竟然又一次恶语相加，并说受不了要退群了。\n\n这种不要真信仰的人，就是把自己抬举起来，自以为是神的人。所以，他们的行事为人完全是以自我为中心，遇到有什么不合他的心意，什么恶毒的话也会说得出来，如果手中有权力有机会，对那些不利于他的人什么恶毒的手段也会使的出来。\n\n但承认自己的败坏，承认自己的行为要向至高的神负责人的，虽然也会有被人激怒产生恶念的时候，却能时时提醒自己，他所行的有一天都要向神交账，即使在世上行恶做得天衣无缝，将来也逃不了神的审判，因此必然会收敛他的行为。不敢过份为恶。所以，以自己为主，以自己为神的人，结果必然会比信仰神的人产生更大的罪恶。\n\n事实上许多所谓的民主人士，揭露别人罪恶的时候，表现得非常有正义感，自己背后的生活行为却非常败坏，他们所寻求民主和自由，不过是寻求一种犯罪的自由而已。人若弃绝上帝，诋毁上帝，却妄言要建立一种理想的民主自由社会，只不过是以伟大的口号，去寻求建立另一个专制败坏的社会而已。\n",
			"date_added": 1491047421,
			"meta": "{\"img\":\"482,700,877dddddceedbbbccc999aaafff89d88ddbbbbdaad,011231332454533111133657454331288833332233399AAAB39AAAA139A9AA13CDDDD1\"}"
		},
		{
			"post_id": 1491638556,
			"body": "这个ZeroNet零网看来还真搞不懂，虽然复制开通了博客总是发表不成功。另外，象这个如同发微博一样的地盘，也是弄不明白，是不是如同新浪微博一样，只要记住自己的这个lmt@zeroid.bit名称就可以了呢？记住这个名称和密码是不是走遍天下都可以登录发帖呢？另外象博客，只怕到了另一台别人的电脑，就根本找不到自己的博客了。我博客的登录名在哪里呢？或者哪个是我博客的网址呢？\n\n换句话说，这个零网有哪些资料是我必须备份牢记的？可以让我无论在哪里都能发信息，或者在博客中发博文的。这些资料我自己又如何获取呢？所以，说句高傲的话，对这零网的问题，我是十窍通了九窍呀？\n",
			"date_added": 1491638549
		},
		{
			"post_id": 1491639096,
			"body": "再看这个头像的菜单吧，上面显示我在关注这个用户，可是这个用户明明是我自己呀？如果我在关注他，那我自己在哪呀，我又是谁呢？如果我取消关注，是不是连自己也会从这个零网世界里消失呢？想来真的有点可怕呀，这个取消关注按钮，我万一尝试动一下，会不会如同启动了核武器按钮，会带来毁灭世界性的灾难呢？",
			"date_added": 1491639088,
			"meta": "{\"img\":\"853,700,efeeeefffaaadddbbbdccced4c86d95c87d9deebec,0110222222134122222215641222222221222222222000002222789AAB220C0DDDDC220C22221222\"}"
		},
		{
			"post_id": 1492219595,
			"body": "人体芯片就是兽的印记吗？\n\n有姐妹问我：人体芯片就是兽的印记吗？\n启示录13章16/17节说：在末后的时代，将会有一个兽出现，“它又叫众人，无论大小贫富，自主的，为奴的，都在右手上或是在额头上受 一个印记，除了那受印记、有兽名或 有兽名数目的，都不得作买卖。”\n\n随着近代科技的发展，现在已经出现了人体芯片，人体芯片是一个很小的芯片，可以很容易地植入人体皮肤的下面，上面记录着个人的资料。用特定的机器就可以显示里面的内容。实际上它是一种利用无线射频识别技术开发出来的可以植入人体的芯片，里面装有芯片、天线和信息发射装置，对应身体之外不同的接收装置。\n\n显然，将来人体芯片会集成身份证、银行卡、社保、医保、病历等各种功能。也就是你出门坐车买票，作买卖、看病、办理各种手续，都有可能通过人体芯片来辅助完成。而人体芯片既然是植入到人身体里面的，不象现金或银行卡身份证、手机等，有携带的麻烦，有丢失的可能。如果有一位君王强制要求他的百姓都植入人体芯片实施管理，芯片就极有可能会成为控制奴役百姓的一个工具。因此有人说将来的兽的印记，就是一种人体芯片，我认为这种说法是比较可信的。\n\n当然，有一个概念我们要弄清楚，兽的印记极可能是一种人体芯片，但我们不能因此说所有人体芯片都是兽的印记。比如今天有许多年轻人好奇争相植入人体芯片，并不等于他们已经受了兽的印记。虽然这类人往往大都会有一种叛逆神的天性，但是如果他们有一天悔改接受耶稣为救主，也必然能蒙恩得救。\n\n当然我的意思绝不是说我们基督徒可以植入人体芯片，虽然从理论上说，如果人体芯片仅只是把现有的金钱身份证等等资料和信息集成在一个芯片上，再植入人体，为的是生活、工作上提供便利，我们不能因此说这就是受兽的印记。然而，人体芯片的发展，却是在为受兽的印记预备道路。现在好奇或为了今生的益处争先用这种新科技以为时髦的，潜在的危害将会是无可估量的。所以，我个人的立场是：坚决反对基督徒植入人体芯片。\n\n但对于某些特殊的病症，必须植入芯片来治疗的，也就是说随着科技的发展，有某些特别的病症，需要植入芯片来辅助治疗，而这芯片功能只为治病用的。我们并不能因此说，这是在受兽的印记。也不能因此说，你必须放弃治疗。\n\n许多人可能会好奇人体芯片带来的便利，以致盲目跟潮流而植入人体芯片，以为可以比众人更早享受新科技带来的益处。我劝这种人一定要冷静对待人体芯片问题。因为在人这个生命的肌体中植入人造产品，本身就是不相宜的，如果某人有病了不得己而为之，比如病人用钢板植入固定骨头，这是无可非议的。但正常的人把人造物植入人体，本身就是不适应的。也许未来的科学家们会用谎言来欺骗你说没有任何的副作用，但可能隐藏的害处暴发时，往往是致命的伤害。\n\n启示录第16章提到第一位天使把碗倒在地上，就有恶而且毒的疮生在那些有兽印记、拜兽像的人身上。有人说，这种毒疮很可能是因为人体芯片里面的元件出问题而对他们带来的苦难，我相信这是极有可能的事情。\n\n另外，人体芯片与外在其他设备交换信息的时候，很可能会被恶意植入病毒，也就是说，当一个国家的元首要控制百姓的时候，可能会预先偷偷在芯片里植入某些信息，这种信息在经过与某些外在设备接触扫描时，就可以跟外界产生信息交换，把控制人、毒害人的信息导入芯片，从而达到影响掌控人的目的。\n\n也许随着对人体芯片技术研究的深入，将来极有可能会制造出一种芯片，能藉着无线电波向散布世界各地被植入芯片的人发送信息，从而干扰、影响或操控人的思想和行为。那时所有被植人芯片的人，都将成为某个人思想和意志奴役的工具。说不定当那个兽出现，普天下人受兽印记的时候就是这样一种光景。\n\n所以，虽然新出现的人体芯片不等于兽的印记，却仍然是为将来兽的印记预备道路，仍然是极其危险的东西。当然，当兽正式出现时，警醒的基督徒必然能察觉。如果用强制的方法来要求人人必须植入某种芯片，那必然是兽印记的推动者无疑。\n\n当然将来的发展可能不是明令强制执行，而是极有可能通过取消身份证、银行卡或现金的使用，用一个大环境来迫使所有的人植入人体芯片。面对这种情况，有些人可能会以为这是一种社会发展的结果，是大势所趋，但背后必然是出自一种邪恶的意图的推动。因为真正爱护人，尊重人的君王，必然是体贴百姓，照顾穷苦弱小，极力想办法解决穷苦大众需要的人。绝不会用一种把你逼上绝路的方法，强迫你达成他的意志，强迫你一定要过一种他们要你过的生活。\n\n正如启示录所告诉我们的，将来的兽不管社会上有许多穷人和为奴的这一现实，要求不论贫富，自主的，为奴的，都在右手上或是在额头上受 一个印记，除了那受印记、有兽名或 有兽名数目的，都不得作买卖。也就是说，他根本不顾贫苦下层百姓的需要，而是要想方设法消除他们生存的可能性，制造生存的艰难来迫使人受兽的印记。虽然他提出的口号似乎是极其伟大而崇高的，口口声声是为了百姓的幸福着想的，为了让大众都享受高科技的好处，甚至可能会通过减免手续费帮你植入芯片。但有智慧的人必然会明白，这是一种顺我者昌，逆我者亡的敌基督者的作为。\n\n经上说：「若有人拜兽和兽像，在额上或在手上受了印记，这人也必喝　神大怒的酒；此酒斟在　神忿怒的杯中纯一不杂。他要在圣天使和羔羊面前，在火与硫磺之中受痛苦。他受痛苦的烟往上冒，直到永永远远。那些拜兽和兽像，受它名之印记的，昼夜不得安宁。」圣徒的忍耐就在此；他们是守　神诫命和耶稣真道的。(启示录 14:9-12 ）愿神的话语成为你我生命的警戒！\n",
			"date_added": 1492219586
		},
		{
			"post_id": 1492241870,
			"body": "浅谈教堂装监控的好处与注意事项\n\n近来，听说浙江教堂都要安装监控了，有的教堂据说是正斧偷偷地给安装上的，我相信这也是我国在科技发展后的必然趋势，换句话说，应该是我国的独有的特色，是正斧爱民如子的一种表现。\n记得前不久，在某群里谈到关于三自问题的时候，有人提到官方的目的原是要控制信仰，并且试图用世俗化的信仰改造基督教信仰，比如利用丁光训之流的新派思想、社会福音把宗教信仰所寻求的永生改变为求今生的福利，教导信徒作好人好事好公民，实现人间的天堂。有一位姐妹听罢就勃然大怒：我们的正斧如此爱民如子，你们竟然说出这种话来，实在让人无法忍受。当时就拂袖而去，退出了所在的群。\n我很理解姐妹的观点，正斧确实是爱民如子，这种爱从当年我父亲对我的爱中曾经有过深刻的体会。当我从一个反对基督信仰的人，竟然走上了信耶稣的道路。眼看着儿子走上了邪路，爱子心切的父亲用尽一切手段，总要让我改邪归正，甚至宁可不要这个儿子，宁可打死他，或把他赶出家门，也不许他走这条信仰的道路。如果说某些在高位的人，对百姓的信仰，也如同我父亲当初对待我一样，有如此爱儿子之心。我感到是比较亲切的，因为这是我切身经历过，刻骨铭心的感受。\n这也是为什么当年许多没有加入三自的家庭教会的神仆，会被捕入狱的原因，据说王明道牧师就曾被关押三十年之久。到出狱时已经是迟暮的老人了。我没有查过这方法的资料，但相信死在牢狱中的也不在少数。然而蒙神奇妙的保守，后来三自竟然失控了，所以我们发现近来十几年许多三自会名下的教会，有些牧师传道人的信仰还是比较纯正的，许多在官方/教会的信徒能听到神的福音。\n这种失控的局面是很令上面的人担忧的，于是乎，这几年出现了浙江各大教堂的风霜雨雪。从十字/架和教堂的各种事件开始。教堂的十/字架不见了，国旗开始在许多教堂门口飘扬了。近来似乎平静下来了，然而背后的各种工作却从来没有停顿下来。因此才会有继之而来的监控进教堂的事件出现。\n因为许多人都知道正斧是爱民如子的，我们总不能误解这份爱心，不然，某些人又要勃然大怒，拂袖而去了。所以，我们先谈谈教堂装监控的好处吧，\n好处确实是很明显的，因为教堂不用掏半分钱，这是免费的服务，至于那些不懂得这份爱心的，要么会偷偷地爱你一下，背后给你装上了监控，要么强制地爱你，勉强给你装上监控。\n除了免费的好处以外，我觉得假设有那么一个教堂治安很差，经常有小偷光顾的话，也是一个好处，因为免费给你装了个监控。至于如果真有信徒发生钱包丢失后，去查看监控要不要花钱打点关系，或者如果报警会不会因为丢失金额太少不予理睬。或者会先给你备个案，等到猴年马月小偷如果碰到枪口的话会给你报个喜。由于这是未来的事，我就不加猜测了。\n前不久看到某群里有人提到教堂装监控还有一大好处，那就是传福音的好处，公安天天看监控听讲道，不是向他们传福音的好机会吗？说不定他会因此信耶稣了呢？我想确实也有这个可能性。说不定将来到天堂时，确实能找到一二个通过这种途径蒙恩的人，这可以算是第三个好处了。\n既然有这么多的好处，而且对于我国的教堂来说，不论你要不要这福利，有一天必然会霸王硬上弓，强制送到你手上。接下来我们谈谈享用这福利的注意事项吧。\n我看讲道的人，如果要保住饭碗，引用故事作例证时不能讲社会上发生的时事了。除非天天看中央新闻，照着中央台的思路引用新闻联播倒是比较保险的。当然，危险还是无处不在的，正如前不久在某群里有人说，周小平同志一直来积极响应正斧正策，曾经发表一通仇美的话说：“我们有一万个理由把中美的关系搞坏。”没想到前不久习主席与美*国总统会面后会说出一句话：“我们有一千个理由把中美关系搞好。”这样一来，周万一脑瓜没转过来，不及时转变风头，岂不是很危险吗？看来江湖上这口饭，确实是不好混的。\n当然，如果能允许你在讲台上诚诚实实讲圣经中的真理，传讲救恩的信息，倒也不算太坏。正如前面提到的第三大好处，很可能会让某正斧人员信耶稣。然而问题是，这位爱民如子的老爸，是无法容忍儿子走上邪路的，你若不能跟他走同一 条路，万一他宁可不要这个儿子，那样危险就大了。\n所以，我从父亲对儿子这种所谓的爱的角度来看这个问题时，就不难发现，装监控主要还是为了不惜一切手段达到让儿子跟老子走同一条道路的目的。所以，虽然法律规定信仰是自由的，但是如果在明文的法律之外，背后给各地的监控 人员下一个什么指示。叫他们在监控前听道时如果发现某位传道人，是忠实传讲圣经真理的，深信圣经是神所默示的，相信圣经中的神迹是真实的。相信只有耶稣是罪人的唯一救主的。相信世人都有罪，都需要信耶稣才能得永生的。对于这样的传道人，多作一些思想工作，告诉他你自己这样信没关系，讲道时别讲这些，反正要讲的内容多着呢？多讲为人民服务，多讲爱国爱d，多研究国家文件，照上面的方针来讲道。结果必然是那些听话的饭碗保住了。不听话的卷起铺盖走人了。于是乎有一天，在教堂里再也找不到一个有真理立场的人了，再也别想听到真正福音真理的信息了。\n那时候，可真应了许多家庭聚会点的弟兄姐妹说的话：“你们在三自里是不得救的。”为什么不得救呢？因为得救的福音真理在那里绝迹了。\n所以，这可是危险的日子到来的前兆呀，各位弟兄姐妹该当如何警醒预备好心灵去面对呢？",
			"date_added": 1492241860
		},
		{
			"post_id": 1492341301,
			"body": "基督徒的得救是稳固的\n伪恩典福音的异端也知道得救稳固的道理，结果就藉着恩典废掉行为，以恩典为藉口反对神圣洁的律法。传讲一个虚假的、没有生命的得救道理。许多受他们迷惑的人就落入无知的自欺之中，连得救的生命是怎么样的也不知道，更别说去活出得救后生命的样式了。可是他们却盲目的自欺说：因着耶稣，我是义的，因着耶稣我是圣洁的，我是永远不会灭亡的。\n\n有的弟兄就面对这种异端的现状，就认为都是一次得救永远得救的道理惹的祸，因此对得救稳固的真理也很不喜欢。\n\n圣经中虽然没有一次得救永远得救的说法，但得救是稳固的，却是圣经明确的教导。一个真正蒙恩得救的人，他的得救是稳固的，是不会灭亡的。\n\n如果一个人听说得救是稳固的，得救后是不会灭亡的，就因此认为，既然得救后是永远不会灭亡的，那我从此后无论怎样犯罪都没关系，不用怕灭亡了。这种人其实根本不明白得救的真理，是把一种片面的头脑的知识取代了生命。\n\n得救之所以是稳固的，因为全能的神必保守他的儿女到底，而神的保守，是藉着所赐给他儿女的圣灵，和赐给重生得救之人的新生命的特性来保守他们的。一个真正明白得救稳固的真理的人，他会每天提醒自己，我真是一个得救的人吗？我得救的生命的表现在哪里呢？如果我与世人行为没有分别，是不是我的生命有问题呢？是不是我根本没有得到重生的生命呢？他一方面从神的话语中，知道神的儿女是不会灭亡的，另一方面，从自己神儿女生命的特性中，比如：对属灵福分的盼望，不愿意犯罪的心，对良善的渴慕之心、犯罪后生命失去平安的痛苦等等。确知自己是属于神的，深知神必不会撇下我，知道自己所需要的是每天过一个悔改的生活。\n\n但没有神儿女生命的人，虽然听说得救是稳固的，却根本不明白神的旨意，更别说活在神的旨意里面，他们自欺欺人的以为自己不会灭亡有什么用处呢？\n\n有一个弟兄对得救稳固的教义很感冒，他说了这么一句话：圣经里有一次得救永远得救的人，也有一次得救后来灭亡的人。他举了两个例子来说明问题，一个是大卫王，他一次得救永远得救了。另一个是卖主的犹大，他得救后却灭亡了。\n\n这位弟兄把大卫的一次得救永远得救归功于他犯了奸淫杀人的大罪后，悔改的非常彻底。而犹大得救后出卖耶稣，结果就灭亡了。\n\n\n这种教导虽然对某些信徒的生命也会有点造就，但在得救的真理上却并不合乎圣经的教导。\n\n因为大卫悔改彻底不是他得救的原因，请别误会了，以为我是反对人要彻底悔改。因为每一个神的儿女犯罪后都要彻底悔改。但是不是他悔改彻底让他得救，而是因为他是一个已经得救的人，是有属神的生命的人，所以面对神的责备管教时，才会有如此彻底的悔改。如果他是一个假信徒，绝不会有真正的悔改，当然也不可能得救。\n\n卖主的犹大绝对不是得救了不悔改而灭亡，而是因为他根本没有得救，所以结局只有灭亡。也许有人说，他怎么没有得救过呢？他是十二使徒之一呢？他跟其他使徒出去传道也同样有权柄医病赶鬼的。\n\n是的，神就是特地拣选一个灭亡之子，给他使徒的职分，也让他有权柄行神迹。结果显出他是一个灭亡的人，好让教会知道，牧师传道的职份不能让人得救，恩赐很大才干很好，也不一定是个真正得救的人。只有真正有神的儿女的生命，名字记在天上生命册上的，才是真正得救的人。\n\n有人可能会说：“你凭什么说犹大本来就没有得救呢？”就凭主耶稣所说的话：“耶稣说：「我不是拣选了你们十二个门徒吗？但你们中间有一个是魔鬼。」耶稣这话是指着加略人西门的儿子犹大说的；他本是十二个门徒里的一个，后来要卖耶稣的。(约翰福音 6:70-71)”在犹大卖主的心意还没有显露之前，主早就知道他是属魔鬼的。\n\n也许有人说，犹大不是悔改了吗？不是到祭司长面前认罪了吗？问题是他根本不认识耶稣是救主呀，世俗的懊悔只会叫人死，所以，他的结局只有灭亡。假设他曾经得救过，他一定会回到救主面前认罪悔改了。那时，在十字架的底下，主的宝血会洗净他一切的罪，然而既然他从来没有真正认识耶稣是谁，从也没有得救过，他的灭亡就不足为奇了。\n\n所以，不是得救的人会重新灭亡，而是灭亡的人从来没有得救过。\n在此我再提醒大家一个事实，不要以为犹大是因为卖了耶稣上吊自杀才导致他灭亡的。他出卖耶稣上吊自杀显明他是一个灭亡的人。但真正让他灭亡的是他的不信，因为不信才会有卖耶稣的行为，才会最终走向自杀。所以，即使犹大没有出卖主耶稣，没有上吊自杀，结局也必然是灭亡的。因为他只是混在教会里的假信徒而已。假信徒虽然可能会平平安安活到老，但结局必然也是灭亡的。\n\n所以，我们一定要好好省察自己：我是真信耶稣的吗？我有神儿女生命的表现吗？我活得象个真正得救的人吗？\n\n\n\n",
			"date_added": 1492341290
		},
		{
			"post_id": 1492612415,
			"body": "到不信的亲戚家吃饭，需要问他食物有没有祭过吗？\n\n今日某牧师提到，如果我们春节过年到亲戚家作客，有的亲戚知道你是信耶稣的，会好心的告诉你，这肉是祭过偶像的你不能吃。但有的人会故意不告诉你，让你吃祭过偶像之物。所以，我们要学得聪明一点，得私下向亲戚打听一下，这肉有没有祭拜过，如果有祭过的就不要吃。\n事实上，很多基督徒都有这样的心态，总是担心自己到不信的亲戚家作客时，万一吃了祭过偶像之物怎么办？所以，某些谨慎点的弟兄姐妹，就宁可少吃一点，对桌上有可能会祭过的肉尽量不吃：我为了主的缘故，宁可少吃一点。不管他有没有祭过，我不吃最保险了。\n这种为了信仰的缘故谨小慎微，为了信仰的愿意约束自己的口宁可少吃一点东西，我感觉还是比较可爱的作法。\n可爱是因为他们时刻不忘自己是基督徒，常提醒自己要与世人分别为圣，也愿意为信仰牺牲口福，这种心态当然是值得肯定的。\n但是如果从圣经的真理来衡量就会发现，这种可爱的举动，其实在真理的认识上是有缺欠的。是缺少真理知识而产生的不必要的纠结。换句话说，这是无知而给自己背上的不必要的包袱。\n我理解牧师这样教导的原因，主要是对于耶路撒冷第一次大会议中所定的教会规条乏正确的认识，以为该会议规定的四大禁戒是永不更改 铁律。所以，才会出现违背圣经明文教导的教训也不觉得有问题。因为当牧师教导你要问一下亲戚，桌上的肉有没有祭过时。正是在跟圣经的教导唱反调。保罗说：“倘有一个不信的人请你们赴席，你们若愿意，凡摆在你面前的，只管吃，不要为良心的缘故问什么话。(林前10:27)”\n保罗劝我们不要为良心的缘故问什么话，就是劝我们良心不要感觉到不安，只管放心大胆的吃。而我们却劝人要问一下，这其实是把一个不当有的轭加在别人身上，让他的良心没有平安，这是不合真理的作法。\n有人会说，万一他的肉是祭过的怎么办呢？这样问的人还是没有跳出一个思维上的误区——以为祭过偶像的物就是不洁净的，就是不能吃的。如果祭过偶像的物就是不洁净的，吃了就是罪的话。保罗的教导一定会跟上面的这位牧师一样：“你要问一下，不可随便乱吃哟！万一吃的是祭物就有罪了。”保罗劝你不要问的意思是：祭过又有什么关系呀？我在神面前感恩着领受，凡物都是洁净的。所以，不要为良心的缘故问什么话。\n还有人说，如果我明知那是祭过的，那就不能吃。事实上这也是许多基督徒常有的处理方式，但这也不是圣经的教训，只能是信心软弱的基督徒的处理方式。就拿我来说吧，一般情况下，如果看着亲戚拿肉祭回来，切好摆到桌上，我也会选择不吃。一方面是怕他论断，另一方面总会觉得有点怪怪的，特别是这肉从庙宇里提回来的，总会感觉被弄得很脏，是叫人难以下咽的。\n但如果我们认为，祭过的就不能吃，这仍然是真理认识的不足所致。因为地和其中充满的都属乎主，不论别人有没有祭过，不论我是不是知道那是祭过的。我吃喝是从神领受的，吃的是神所造之物。我谢恩之后，就可以放心大胆的吃。也许有人会想，万一魔鬼说：这个是某人拿到我面前 祭过的，你敢吃，我就搞死你。然而，我们当知道，神比万有更大，我们从神领受的食物，魔鬼根本没能耐动我们一根毫毛。\n当然，如果你信心不足，或良心软弱的话，还是选择不吃为上，因为凡不出于信心的都是罪，如果良心软弱，就必受魔鬼的控告，容易落在它的网罗里。\n从这里也让我们看到领受食物时谢恩祷告的重要性，我们要常常提醒自己，我每次都有为领受食物祈祷感恩吗？如果有，我们当知道：凡神所造物都是好的，若感谢着领受，就没有一样可弃的，都因着神的道和人的祈求成为圣洁了。（提前4：4/5）",
			"date_added": 1492612403
		},
		{
			"post_id": 1492667892,
			"body": "若有人对你说：这是献过祭的，基督徒要不要吃？\n\n昨日我曾论到基督徒如果到不信的亲戚家吃饭，要不要问桌上的食物有没有献过祭。圣经的教训是很明确的，我们不需要担心食物有没有献过祭，根本犯不着问这个问题。问这个问题的人，是把献过祭这件事看的太大了，好象世人的偶像也是众神中的一位，曾经献给它的东西你吃了的话，会叫你吃不了兜着走。事实上那根本不是神，世人其实是无知把不是神的当神来拜，如同小孩子无知玩的游戏一样，我们完全可以无视。\n\n另一种恐惧的心理是，既然已经献给偶像了，我们去吃的话，我们的神会不会吃醋向我们发怒呢？你如果真这样认为的话，那神可真要向你发怒了，因为神看的是人的内心，而不在乎食物。如果你认为世人献过祭，就真的是另一位神明之物了，你当然得跟这位假神的一切撇清关系，不要有任何瓜葛。但如果你明白偶像算不得什么，知道只有一位神，就是我们所信靠的主，万物都是本于他，归于他。我是从他领受一切食物，你的心中就不会有这种担忧了。\n\n圣经已经很明确的告诉我们：如果有一个不信的人请你去吃酒，你只要愿意去，就只管吃，不要为良心的缘故问什么话。\n\n今天我们要反过来讨论另一个问题：如果你正在吃的时候，你的亲戚跟你说：这个肉是祭过的，你不要吃。这时，我们怎么办呢？\n\n这问题的答案也很简单，圣经已经明确教导我们了：“若有人对你们说‘这是献过祭的物，就要为那告诉你们的人，并为良心的缘故不吃’”（林前10：28）\n\n也就是说，既然他认为我们信耶稣的人，是不能吃祭过的物的，那我就不吃吧。不是因为我真的不能吃，而是为了不让他论断的缘故。免得他在心里说：“这人是假信的，我跟他说过这是献过祭的物，他竟然还只顾吃。”或者说：“想不到信耶稣的人也这样贪吃，祭过的物竟然也吃。”这样，神的名就不得荣耀了。\n\n换句话说，当有人跟我们说：这是祭过的物时，我们要考虑的不是食物的问题，而是别人的良心问题。会不会让他的良心产生论断的问题。虽然我完全有吃的自由，吃了保证不会拉肚子或出别的问题（当然暴食暴饮是另当别论）但是，为了他的良心的缘故，我宁可不吃。虽然，那也许是你比较喜欢吃的东西，你还是要选择不吃。\n我希望弟兄姐妹明白一个事实，不是因为知道这是祭过的物就不能吃了，而是为了不让别人的良心论断的缘故我们要选择不吃。不是我们没有吃的自由，而是我们用神的智慧来处理自己的自由。必要时，宁可选择放弃自由，因为我们或吃或喝，只为了荣耀神而行。个人的利益得失，那是摆在其次。\n\n为了让大家明白这是圣经的教导，而不是我个人的意见，我把经文列出来：“我说的良心不是你的，乃是他的。我这自由为什么被别人的良心论断呢？我若谢恩而吃，为什么因我谢恩的物被人毁谤呢？（林前10：29/30）”\n\n这里清楚的告诉我们，不是为了自己的良心的问题，而是为了别人的良心的问题。换言之，当别人对你说，这是献过祭的，你的良心大可不必不安，不要说：“啊，献过祭的呀，那怎么办呢？你怎么不早说呢？我刚才吃过了，这可怎么是好？”如果你这么想就是无知了。真正明白真理的人是不会有这个担忧的，当然如果你真的不明白真理，那就低头向神认罪求主宝血洁净，主也必赦免你的无知。\n\n但如果你明白真理就不会因此惴惴不安，你会考虑到另一个问题，就是别人的良心问题：这时我如果还继续吃的话，对方会不会论断我，会不会因此毁谤我的信仰。我不能因着谢恩领受的食物让别人论断，让别人毁谤，所以，为这个缘故，我还是不吃吧。\n\n\n\n",
			"date_added": 1492667879
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "你好，愿天父赐福你！",
			"post_uri": "1DfbbkYCasRTA1gQmJpRRA5TwwudFeMLUT_1490429550",
			"date_added": 1490452231
		},
		{
			"comment_id": 2,
			"body": "这事谁也无法给出一个肯定的答案，只能让时间来显明结果。",
			"post_uri": "1DfbbkYCasRTA1gQmJpRRA5TwwudFeMLUT_1490429550",
			"date_added": 1490515505
		},
		{
			"comment_id": 3,
			"body": "@大家一起p2p: 看来我真遇到一位把自己当成神，然后凭自己的头脑创造出一位创造天地的神的人了。人凭自己的自高的理性所造出的造物主，不过是名为造物主的偶像而已。真正的造物主不是人创造出来的，而是自己启示人，人只有透过他的启示才能认识的。只有把自己当成比造物主还伟大的人，才会凭自己的理性来制造一个造物主，却拒绝那一位把自我启示给人的创造者。",
			"post_uri": "1C1aAbU3HHPiupcbEz2XmNjnjq6MT5SbVL_1490476533",
			"date_added": 1490516855
		},
		{
			"comment_id": 4,
			"body": "@Xiha: 谢谢！",
			"post_uri": "1C1aAbU3HHPiupcbEz2XmNjnjq6MT5SbVL_1490476533",
			"date_added": 1490516963
		},
		{
			"comment_id": 5,
			"body": "@Yinyue: 如果你的理性不从宝座上下来，你会认为自己永远是宇宙中最高的那一位，你自己就是自己的神，其他的一切都只是低于你理性的存在而已。当然，你绝不会因着自己把自己想象成最大的神，就会真正超乎万有之上，因为毕竟你的理性也不过是受造之物而已。用神所造的理性，去反对创造万有的真神，只能说明你缺少自知之明而已。",
			"post_uri": "1C1aAbU3HHPiupcbEz2XmNjnjq6MT5SbVL_1490476533",
			"date_added": 1490527896
		},
		{
			"comment_id": 6,
			"body": "@Aom: 有一个原则也许你没有注意到，就是什么树结什么果子，什么人说什么话，从果子可以知道树的好坏，从人口中的言语可知他的善恶。虽然许多作恶者往往狂妄自大，以为他可以任意妄为无所惧怕，但事实上他的良心也告诉他，作恶者总有一天会受到刑罚和报应。因为良心也告诉他，只有行善才是人的当行之道。只是许多行恶的人往往故意压制良心的声音。当然，良心的声音在今生可以被人勉强压制下来，到将来有一天，当它真正发声的时候，必然叫人对自己的刚硬和恶行无可推诿。",
			"post_uri": "1C1aAbU3HHPiupcbEz2XmNjnjq6MT5SbVL_1490476533",
			"date_added": 1490931626
		},
		{
			"comment_id": 7,
			"body": "@Booma: 据我所知，最好还是少吃猪内脏，这种用药物催肥的动物，内脏积累的毒素会更大。",
			"post_uri": "1C1aAbU3HHPiupcbEz2XmNjnjq6MT5SbVL_1492667892",
			"date_added": 1492669029
		},
		{
			"comment_id": 8,
			"body": "@Booma: 回民是伊斯兰教的，请他吃猪肉非常危险，因为他们的古兰经教义是制造恐怖主义的，主张要强迫所有的人信他们的宗教，要消灭一切不愿归信者，为信仰而战的人胜了可得战利品，若战死了，在天堂可得七十个美女当老婆，有享不尽的福乐。",
			"post_uri": "1C1aAbU3HHPiupcbEz2XmNjnjq6MT5SbVL_1492612415",
			"date_added": 1493123180
		},
		{
			"comment_id": 9,
			"body": "@Booma: 也未必这么简单，如果遇上搞邪术的要整你的话，你必定中招，但基督徒若每次向神谢恩祷告之后，一切邪术必失效。魔鬼根本无力加害他。",
			"post_uri": "1C1aAbU3HHPiupcbEz2XmNjnjq6MT5SbVL_1492612415",
			"date_added": 1493648576
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1DfbbkYCasRTA1gQmJpRRA5TwwudFeMLUT",
			"user_name": "Emilie",
			"date_added": 1490452175
		},
		{
			"follow_id": 2,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1C1aAbU3HHPiupcbEz2XmNjnjq6MT5SbVL",
			"user_name": "Lmt",
			"date_added": 1490453889
		}
	]
}