{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "History of Central Banking and the Enslavement of Mankind (2014) - by Stephen Goodson, former director of South African Reserve Bank - is a clear exposition of how Jewish bankers have scammed and swallowed up the world. It is analyzed how the Jews have perfectioned their bribing, blackmail and financial scamming practices since Roman times to finaly enslave the human race.",
			"body": "Stephen Goodson’s A History of Central Banking and the Enslavement of Mankind (2014) is a clear exposition of how Jewish bankers have swallowed up the world with their diabolical lending scheme. When you realize the evil and destructive nature of this scam that has fooled absolutely everyone, you will realize that the United States of America is not only on the wrong side of history, but principally responsible for the destruction of the human race.\nJews have always targeted all countries without a central bank for robbery and destruction, just as they are doing at this very moment.\n\n\nWhen you realize that the serial obliterations of Libya, Syria, and Iran — and earlier, that of Germany, Japan and Italy in World War II — were all because these countries had their own honest banking systems, and refused to be swallowed up by the criminal Rothschild central bank scam which robs countries of their hard earned money — you will begin to understand how you have been swindled throughout your lifetime by lying newspapers and fatheaded commentators in the pay of the criminal bankers themselves who have convinced you that you have been experiencing freedom when in reality you are locked in the prison of usury and giving away more than half the earnings of your labor to goons who create money out of nothing and then steal even more from everybody on the planet.\n\n\nhttps://www.amazon.com/History-Central-Banking-Enslavement-Mankind/dp/0992736536\nhttp://pwgl.us/lsgp/a-history-of-central-banking-and-the-enslavement-of-mankind.pdf",
			"added": 1490359341,
			"parent_topic_uri": "9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		}
	],
	"topic_vote": {
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": 1,
		"1_1E1fsmFRrsPsfiYVbXfifNMcaWwuk8iFcp": 1,
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_1NU6gdra9qhUhdbYGLia1G3HYT87qUTA7w": 1,
		"1_1KLTeqiNMx1QNWTqBzJsjTQp112dDZPeqZ": 1,
		"1_1At4zensbxPGhXYbe5bnx9eGuE4V1vnbc8": 1,
		"1_1DqaWUpq6dRXfuXCokpjYoAkDj2nzZDnAn": 1,
		"1_12Xj1w5HYu6w5xtEwwLyEiMYGuCqvYKL2q": 1,
		"1_1AQwGx5xyBi5Fvv9WHJFMCMNtQhUc8UhQF": 1
	},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}