{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Sensational Revelation: Michelle Obama is a Man(tranny). Barack Obama is Gay. Their children are adopted. Michelle Obama Shows Her Penis On The Ellen Show. Michelle’s birth name was Michael.",
			"body": "Sensational Revelation: Michelle Obama is a Man(tranny). Barack Obama is Gay. Their children are adopted. Michelle Obama Shows Her Penis On The Ellen Show. Michelle’s birth name was Michael\nThe Jewish Joan Rivers after revealed her secret died unexpectedly with hearth attack diagnosis.\nhttps://en.wikipedia.org/wiki/Joan_Rivers\nhttps://www.youtube.com/watch?v=gvuulZPbfBg\nMichelle Obama Shows Her Penis On The Ellen Show\nhttps://www.youtube.com/watch?v=dQwR0A3-xWA\n100% PROOF Obama Is Gay, Michelle Is A Man\nhttps://www.youtube.com/watch?v=efyRkR3hVp8\nObamas Kids Are Adopted!! I Found The Real Parents!! 2016 \nhttps://www.youtube.com/watch?v=RVwptjfdWlo\nFascinating videos proves that physical traits, including Michelle’s fingers, shoulders, neck muscles, head-to-body ratio and trace of an Adam’s apple, all point to her being a biological male.",
			"added": 1481408301
		}
	],
	"topic_vote": {
		"1_1yk1FeoNn1RmZRtCXcsgL59nNp7xs3aYu": 1,
		"1_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1,
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": 1,
		"1_12Xj1w5HYu6w5xtEwwLyEiMYGuCqvYKL2q": 1,
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": 1,
		"1_1AQwGx5xyBi5Fvv9WHJFMCMNtQhUc8UhQF": 1,
		"1_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": 1,
		"2_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1_12Xj1w5HYu6w5xtEwwLyEiMYGuCqvYKL2q": [
			{
				"comment_id": 1,
				"body": "https://www.federalreserve.gov/faqs/about_14986.htm\nLet's quote from their site\n\"Some observers mistakenly consider the Federal Reserve to be a private entity because the Reserve Banks are organized similarly to private corporations. For instance, each of the 12 Reserve Banks operates within its own particular geographic area, or District, of the United States, and each is separately incorporated and has its own board of directors. Commercial banks that are members of the Federal Reserve System hold stock in their District's Reserve Bank.\"\nVery well formulated.\nOn the Federal Reserve official site they say that the FR is public interest and not privately owned.\nThis might be true. But it is organized on 12 Reserve Banks which stocks are hold by private banks.\nSo they are Privately Hold but Indirectly.\nThe money they create they lend to the privately controlled( with shares) regional banks without any interest.\nBut don't let yourself fooled by the word lend because they never have to pay back this money.\nAnd from time to time they get new stacks of money as lending with never pay back and no interest rate.\n\nHistory\nIn November of 1910 a secret meeting on Jekyll Island off the coast of Georgia at a private resort owned by J.P. Morgan took place. This was the conception of “The Fed Scam” to set up a powerful cartel of international cutthroat bankers! Seven men attended this exclusive meeting where an estimated one-fourth of the total wealth of the entire world was represented.\n\nWho Are The Current 'Owners' ?\n1.  Rothschild Bank of London\n2.  Warburg Bank of Hamburg\n3.  Chase Manhattan Bank of New York\n4.  Warburg Bank of Amsterdam\n5.  Rothschild Bank of Berlin\n6.  Lehman Brothers of New York\n7.  Lazard Brothers of Paris\n8.  Kuhn Loeb Bank of New York\n9.  Goldman Sachs of New York\n10. Israel Moses Seif Banks of Italy\nThe greatest scam in history has been exposed -- and has largely been ignored by the media. In fact, it’s still going on.\n\nhttp://articles.mercola.com/sites/articles/archive/2011/02/09/biggest-scam-in-world-history-exposed.aspx\nThe specifics of a secret taxpayer funded “backdoor bailout” organized by unelected bankers have been revealed. The data release revealed “emergency lending programs” that doled out $12.3 trillion in taxpayer money ($16 trillion according to Dr. Ron Paul) -- and Congress didn’t know any of the details.\n",
				"added": 1481410148
			}
		]
	},
	"comment_vote": {}
}