{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 1,
				"body": "St John of Damascus of the 8th Century, whose authority is recognized by all Christian denominations, states that the Anti Christ \n1) will be a Jew \n2) will come to the Jews \n3) will be accepted by the Jews.\nhttps://en.wikipedia.org/wiki/John_of_Damascus\n\nJesus Christ affirmed this when he warned the Jews: “I am come in my Father’s Name but you will not receive Me. Another will come in his own name and him you will receive.”\n(St John 5:43)",
				"added": 1476040964
			},
			{
				"comment_id": 2,
				"body": "The feminist groups Pussy Riot and Femen desecrated Christian churches with urine in Paris, Kiev and Moscow.\nMain financiers are the Jewish Jed Sunden, Alek D. Epstein and Georg Soros.\nhttp://davidduke.com/jewish-supremacist-hypocrites-behind-radical-feminists-femen/\nhttps://www.stormfront.org/forum/t914591/",
				"added": 1476177287
			},
			{
				"comment_id": 4,
				"body": "Brother Nathanael grew up as Jew but accepted Jesus and now is showing us the secrets of the Jewish lobby:\nWhy Jews Push Gay Marriage\nhttp://www.realjewnews.com/?p=808\nDirty Tactics Of The Jewish Lobby\nhttp://www.realjewnews.com/?p=794\nThe Coming Of The Anti-Christ\nhttp://www.realjewnews.com/?p=817",
				"added": 1476262227
			}
		],
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": [
			{
				"comment_id": 3,
				"body": "Brother Nathanael grew up as Jew but accepted Jesus and now is showing us the secrets of the Jewish lobby:\nObama’s Alleged Homosexual Past\nhttp://www.realjewnews.com/?p=720\nIs Hillary Clinton The Anti-Christ?\nhttp://brothernathanaelfoundation.org/news/322-brother-nathanael \nWill Trump Defy The Jewish Lobby?\nhttp://www.realjewnews.com/?p=1115",
				"added": 1476261858
			}
		],
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 5,
				"body": "Brother Nathanael born as Jew in Israel embraced Jesus and explains the Jewish Kosher scam\nhttps://www.youtube.com/watch?v=ecGWikgw3jw&list=PLFFB05929141EE377&index=16\nBrother Nathanael Foundation\nhttp://www.brothernathanaelfoundation.org \nDonate Bitcoins on the above site\nor send your contribution to:\nThe Brother Nathanael Foundation; PO Box 547; Priest River ID 83856\nE-mail: brothernathanaelfoundation@yahoo.com",
				"added": 1476301522
			}
		],
		"1_17q6Zhf7PFjrY3ddySK2F78JhAH3FVhmWr": [
			{
				"comment_id": 6,
				"body": "Hillary Clinton fulfills for the first time in the human history all Biblical, Catholic, Islamic, Buddhist and Nostradamus related  apocalyptic end time prophecies.\nHillary Clinton, Prophecy, and the Destruction of the United States - read the new book of Bob Thiel, Ph.D.\nhttp://www.hillaryprophecy.com/",
				"added": 1476623669
			}
		],
		"1_125b8FxS36xSSCHkvZEhimvF5KPxjckS7o": [
			{
				"comment_id": 7,
				"body": "Everybody have learned in the school that six million Jews died in the WWII.\nhttps://en.wikipedia.org/wiki/The_Holocaust#Jewish\n\n6-million Jews  is a kabbalistic number in Talmudic lore composed almost 900 years before WWII occurred.\nIn the Hebrew text of the Jewish Torah prophesies, one can read \"you shall  return\". In the text the letter \"V\" or \"VAU\" is absent. Because ancient Hebrew does not have numbers,  the letter V stands for the number 6.\nThe kabbalistic branch of Judaism interprets the texts of the Torah with secret meaning in relations with numbers. \nNumber mysticism was very usual in the antic world and even now an entire school in Israel is learning this (science).\nThe prophecy then reads: You will return, but with 6 million less.\nJewish prophecies in the Torah are interpreted that the state of Israel can be formed only after 6 million Jews vanished.\n(Ben Weintraub, religious scientist: \"The Holocaust Dogma of Judaism\", Cosmo Publishing, Washington 1995, page 3.,\nBabylonian Talmud, Succah 51:B,\nJudah David Eisenstein, 1937, 'The Tales of Rabbah bar-bar Hannah: The Aramaic Text with Hebrew Translation', 1st Edition, Behrman's Jewish Book House: New York, p. 17)\nhttps://en.wikipedia.org/wiki/Kabbalah",
				"added": 1476818557
			},
			{
				"comment_id": 8,
				"body": "Now I am coming with the second part of my explanation.\nWhat it means holocaust?\nhttps://en.wikipedia.org/wiki/The_Holocaust\nThe Wikipedia, the biggest encyclopedia says:\n'The Holocaust (from the Greek ὁλόκαυστος holókaustos: hólos, \"whole\" and kaustós, \"burnt\"),[3] also known as the Shoah (Hebrew: השואה, HaShoah, \"the catastrophe\"), was a genocide in which Adolf Hitler's Nazi Germany and its collaborators killed about six million Jews.'\nThis is the meaning today - Holocaust is the murdering of six million Jews in the WWII by Germans. \nIt mentions also some former Greek meaning 'catastrophe with burning', which suggests that was the meaning maybe 2000 years ago. But it is not so.\n\nLet us see the Encyclopedia Britannica 6th edition from 1823.\n'HOLOCAUST (formed from \"whole\", and mttut, \"I consume with fire)\", a kind of sacrifice, wherein the whole offering is burnt or consumed by fire, as an acknowledgment that God, the creator, preserver, and lord of all, was worthy of all honour and worship, and as a token of men's giving themselv…'\nAs we see the former meaning of Holocaust was 'a sacrifice for God which need to be burnt by fire'.\n\nWe still need another element of the Talmudic logic of Judaism to understand how a sacrifice is valid. It is logic that it cannot be made by a Gentile who is just an animal. A sacrifice to the God of the Jews will be accepted by God only if it is made by a Jew.\nNow let us traduce the prophecy from the Torah with the Talmudic interpretation which was given by learned rabbis more then 100 years before the WWII:\n\nThe state Israel can only be created again only when 6 million Jews will be sacrificed to God(by a Jew) by burning them on fire.",
				"added": 1476909352
			}
		]
	},
	"comment_vote": {}
}