{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Trump CIA pick wants to execute Edward Snowden",
			"body": "https://theintercept.com/2016/11/18/obama-refuses-to-pardon-edward-snowden-trumps-new-cia-pick-wants-him-dead/\n\nFor all those hoping Trump would pardon Snowden and/or Assange. Scary stuff.",
			"added": 1479779290
		},
		{
			"topic_id": 2,
			"title": "Any Open Source P2P private chat services?",
			"body": "Does anyone know any? I'm thinking like Tox, but actually usable. Tox lacks important features like being able to use multiple devices effectively.",
			"added": 1482343813
		}
	],
	"topic_vote": {
		"1_1BEyFJrKVaGLuogLirnrsa7yV2MXNvYpcp": 1,
		"1_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt": 1,
		"1_1C1gnFcVv9J9kUjF4odDMRYcEWVPJbbqFp": 1,
		"1_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd": 1
	},
	"next_comment_id": 219,
	"comment": {
		"1_11pADbvn3XmFZ5sbM9ZANRb5Gv9igHLCF": [
			{
				"comment_id": 1,
				"body": "> [crypton](#comment_18_17fgJ3tZjhM7HCkTkd5TWf2BLLWmhRKcXB): It might help to know WHAT you want to do. Do you understand what Zeronet actually is and what it isn't? Have you explored through the ZeroTalk threads? Have you read some of the developer Blogs? Have you looked through the ZeroSearch results to see what sites are available?  You might want to check out my article on a basic understanding of how things work on Zeronet.  http://127.0.0.1:43110/cryptonbits.bit  \n> Explore, learn, don't just expect people to hand you everything.  Tell us what you know and then maybe some others can fill in the gaps for you.\n\nEasier said than done. There is no exploring to do. Everything seems pretty dead and empty.",
				"added": 1478301006
			},
			{
				"comment_id": 11,
				"body": "> [planespherev2](#comment_88_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): It is not dead, it's just new.\n> P2P internet will take off. Maybe Zeronet, maybe an other network in the future. We just have to use them in order to accelerate the process a little bit. \n> I don't like to post on a privately owned central server (most likely owned by some of the 0.1%) prone to censorship anyway.\n\nI don't mind censorship of your own platform. You have a right to free speech but others arent required to give you a platform.",
				"added": 1478310607
			},
			{
				"comment_id": 14,
				"body": "> [planespherev2](#comment_90_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): Yes but in some countries, even in the west,  the state can punish \"hate speech\", and \"terrorism\", which is in fact everything this state doesn't like. In France for example, many people were convicted for just some posts on twitter. \n> Anonymity and censorship resistance are important in order to be safe and if we do not want to hesitate before we add content.\n\nThat's a totally different issue. I do agree the state shouldn't punish people for what they say, unless it's slander. It's different in the private industry though. Facebook, Google, Microsoft, Twitter *should* be able to censor their platforms. If people feel they are being censored, they should always be allowed to create their own platform though.",
				"added": 1478353051
			},
			{
				"comment_id": 25,
				"body": "> [planespherev2](#comment_94_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): I never said that they shouldn't be able to censor their platforms, just that i don't like to use these platforms if they do this.Here if nofish starts to censor too much, people will flee and migrate to an other Zerosite without censorship (some already mentioned 0chan).\n> Also in Freenet, the plugins Sone and FMS are 100% without censorship (it's not possible to suppress a post) and everything is fine. You can block people locally if you don't want to see them.\n\nYou will flee to somewhere else, other people might, but most people won't care or find it useful. I don't mind censorship of hatespeech, spam and slander. If it grows out of hand, you move platforms.",
				"added": 1478391716
			}
		],
		"1_1AhXDbKvcLap7TcS2542J7bFYzKHM3xeRU": [
			{
				"comment_id": 2,
				"body": "Amarchism doesn't work. People immediately start forming groups, conquer other groups and form nations.\n\nWe started out with Anarchism, and we became a civilization. It'll just happen again if we were to reintroduce anarchism.",
				"added": 1478301105
			},
			{
				"comment_id": 7,
				"body": "> [planespherev2](#comment_85_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): Exactly. You have it right.\n> That's why communism cannot happen tomorrow.\n> For it to happen, there must be no human antagonism left. \n> But here is the good news: the only real quality of capitalism is that it liquefies humans identities, and replace them by a generic one. \n> The more capitalism develop itself (there is still margin) the more humans will look alike: the universal consumer.\n> Then, 2 things will happen.\n>  Firsty, humans will begin to suffocate, due to the pressure of capitalism on life itself. Humans today are weak, in the future, they will be weaker, but survival instinct is a real thing. Even the weakest man start to fight back if you push deliberately his head under water until he can't breath. \n> Secondly, the capitalism final crisis will happen (it's inevitable: tendency of the rate of profit to fall). \n> In the end, it's not a choice. It's this or rebooting everything (which would be something very stupid to do).\n\nThat's not possible due to natural selection. Even if everyone went along in a fair way, it only takes one person to corrupt it. That person can profit of the others like a parasite, and they will only survive if they work in their own self interest. Everyone will start forming groups, conquering other groups...",
				"added": 1478305462
			},
			{
				"comment_id": 10,
				"body": "> [planespherev2](#comment_86_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): Someone called Arminius did this in the German tribes. See what happened to him. \n> You are projecting our money and hierarchical society logic in a superior communism future.\n> Without money and hierarchy, i don't see how corruption works. \n> You seem smart, but you see the world from the cell you were born in: the money game society. Thus you cannot imagine how it would be outside.\n\nYou cannot defeat nature. Nature rules everything.",
				"added": 1478310506
			},
			{
				"comment_id": 13,
				"body": "> [planespherev2](#comment_89_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): Here we go. Another one who think that our ancestor in primitive tribes were super hierarchical being, ruling without mercy on poor subordinates. \n> It's just the opposite. \n> It turned to shit when money and delegation of power was introduced.\n> About the argument that a complex civilization need a fungible value of exchange: money, and hierarchy, that's wrong, and the German tribes, which were pretty developed, perfectly demonstrate it.\n\nYou don't understand the argument I am making. As soon as you create anarchy, some people will just not agree, they'll form nations, and they'll conquer the anarchists. Anarchy doesn't work. Even if every human on earth believed in anarchy, it just takes one person to create the first nation, and _all_ others will have to follow, or they'll get conquered.",
				"added": 1478351634
			},
			{
				"comment_id": 16,
				"body": "> [planespherev2](#comment_91_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): I see what you mean. \n> I the current state of the world society, it's 100% accurate. \n> However, in a future society were there is no money, no private property, no hierarchy, no borders (not the Soros version of no borders, but a world commonly accepted as this), there wouldn't be any sense to conquer an other living space. \n> Why conquer something that already belong to you, and the others around you? \n> Just to give you an example, and it's a little abstract, do you want to take over the Linux kernel? Or Debian? For what? it is already open source, if you do this, maybe you'll have control of it, but other will just fork the previous version, and those working for you will flee you or fight you if they just have a touch of manliness. \n> In a world were everything is property-less, going back just doesn't make any sense. \n> In about 15 years, i predict that linux desktop will represent 80% of the market share. Will it be possible for others to begin to sell windows again? I seriously doubt it. \n> I believe the trend toward a non proprietary world can be like a one direction mechanism, more and more and more until it reach it's contradiction and we find something else. \n> Feudalism give way to capitalism when it was confronted to it's own contradictions. \n> Same for capitalism, we will have more and more of it,  and once the process of a money less society is induced (simultaneously), and it already has, with open source and open patent, it will just follow it's course until it become the whole of the world. \n> By then, when humans will have reached this point, this new mode of production will be confronted to it's own contradiction. But instead of going back,  an other mode of production will be found, a new one, which we cannot even foresee yet.\n> Humans rarely go backwards. We are creature designed (by nature or by God, your choice), to constantly push forward. Going backward is too embarrassing to be considered, except if you try to wipe the memory of all, which is, in this day and age, almost impossible (too much books and data optical support around the world, destroying everything is almost impossible).\n\nHumans go backwards a lot of times. Democracy was invented in ancient Greece, yet it took till a couple of centuries back to re-emerge. Just when you think xenophobia has become a niche, you have president Trump on the horizon. \n\nHumans want to be organised. They need strict rules on what they can and cannot do. If there are none, they'll make some. Living in an anarchy is also dangerous to the weakest in society, because they need protection.",
				"added": 1478354729
			},
			{
				"comment_id": 17,
				"body": "> [thisweb11](#comment_25_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Nope.  The opposiute is true. Anarchists believe in protecting the weak through community, that is the point.  ie 'to each according to their needs from each according to their means'   Anarchy by definition is a method of ensureing NOBODY is exploited against their will.\n\nPeople don't care about each other, and have an evolutionary insentive to do so. You cannot make sure everyone is taken care of instead of organising a system that forces that. Oops. That's not anarchy anymore.",
				"added": 1478375192
			},
			{
				"comment_id": 18,
				"body": "> [thisweb11](#comment_28_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Humans care for each other innately.  Your existence is proof of this. We are social animals and form strong bonds in large groups. Its what allowed us to evolve large brains,  share information.  Its evolutionary useful to co-operate.  That is something humans are  exceptional at.   There is no incentive to fight another animal or person (for any organism on the planet) except to eat it - if there are alternatives we choose those rather than risk death or injury.    As 'extreme' social and intelligent animals - we are able co-operate and not fight. We do all the time.  .    Its never advantageous to choose fighting over cooperation for any organism except for limited food and mating opportunies.  We dont need or have those, we can cooperate.  Only capitalism and a slect few have fictionalised the problems, made us fight, indoctrinated us to believe we have more rights over others.   Should have more things than others.   Innately,  even today, we still feel guilt about this, even the capitalist who kicks the begger on the street, cant really square his capitalist logic with his emotions.  Often he denies his guilt, it turns to anger and sadness .   Humans are VERY compassionate.    Human brutality is  created out of extreme fear, false fear and false necessity .   It is not the first choice of any human to behave that way except by creating those artificial circumstances.  Our first instinct is to share and bond.\n\nThose circumstances aren't artificial. It's unavoidable. If one person stops caring, he has an advantage, and by natural selection he'll be more successful and become dominant.",
				"added": 1478377826
			},
			{
				"comment_id": 19,
				"body": "> [thisweb11](#comment_29_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): You were born an anarchist.\n\nI was born in a hierarchy. So were you.",
				"added": 1478377927
			},
			{
				"comment_id": 20,
				"body": "> [thisweb11](#comment_30_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): “The most effective way to destroy people is to deny and obliterate their own understanding of their history.” — George Orwell\n> The history of all human existence is not one of greed and misery.  Only in the last 8,000 years.  And to varying degrees.  Just a a tiny fraction of our time as humans on earth  have we had money, credit and debt  (the source of all war) .  The myth is that capitalism, greed and selfishness is innevitable.  Not only is it not innevitbale.  Its unliklely to last very long at all.\n\nIn every single year in those 8000 people have lived in organised structures.",
				"added": 1478378103
			},
			{
				"comment_id": 21,
				"body": "> [thisweb11](#comment_33_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): to put it anpother way, why do non-anarchists ignore the 92% of human history where capitalist oppresion and war wasn't innate.   Orwell was right.\n\nBecause quite honestly, life sucked in those times. Death rates where high, people were starving to death.",
				"added": 1478385715
			},
			{
				"comment_id": 22,
				"body": "> [thisweb11](#comment_32_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Yes.  Anarchists live in organised structures too?  Whats your point.    over 100,000 years, just 8% of human history (conservative estimate) has   slavery existed.  There is no archeological or anthropological evidence of slavery existing before money came into existence.\n\nOrganised systems need to be imposed.",
				"added": 1478385742
			},
			{
				"comment_id": 23,
				"body": "> [planespherev2](#comment_93_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): Are you, by any chance, Adilson Lanpo from freenet? (you have quite his rethoric).\n> Like some other here and in society in general, you have absolutely no clue of how our ancestors, and how the last primitive tribes on earth lived/live. \n> I highly suggest you to  watch -even mainstream- documentaries and/or read a bit of studies about the social organization of homo sapiens in it's natural state (primitive tribe). \n> Begin with this, about hierarchy: https://www.psychologytoday.com/blog/freedom-learn/201105/how-hunter-gatherers-maintained-their-egalitarian-ways\n> \n> This demonstrate you have no real knowledge about the subject. The german tribes even during the roman empire were a complex civilization, but they had no money and no hierarchy (war chiefs were collectively designated, temporary, and symbolic).\n> \n> I you were born in the last primitive tribes around the world, like the Jarawas, the Pigmees, or the Guayakis, you wouldn't be.I was born in hierarchy, but my (probably) german ancestors were born in anarchy just 1500 years ago (money appeared in the german tribes around the 5-6 century, mostly due to the necessity to exchange with other countries already having money).\n> \n> In the primitive tribe, if one begins to act as an asshole, he begins to be mocked by the others (mostly the elders), and if he persist, he'll be shunned. Then he cannot be more successful or dominant.  That was/is social mechanisms to ensure that everybody contribute to the interest of the group. \n> \n> By who exactly? The richest? The technocrats? Goldman Sachs? \n> You just project your own alienation on others.  It confirm your quote \"I was born in a hierarchy\".\n\nAll your utopias have one thing in common. They were not developped. \n\nNo, I oppose unfair rule, I propose fair democracy and I impose the majority rule.",
				"added": 1478391538
			},
			{
				"comment_id": 24,
				"body": "> [planespherev2](#comment_93_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): Are you, by any chance, Adilson Lanpo from freenet? (you have quite his rethoric).\n\nAnd also, no I am not.",
				"added": 1478391577
			},
			{
				"comment_id": 26,
				"body": "> [planespherev2](#comment_95_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): Of course they were not developed. The paris commune (anarcho-communists, 1871) was crushed by the french republic (about 30000 death).Same for the Barcelona commune (1937): about 8352 deaths.\n> As for the Budapest commune (1956), it was crushed by the Bolsheviks (who were state capitalists). 2500  deaths and 13000 injured.\n\nThat was a point I made earlier though. Even your beloved German tribes had to adapt to the society. Anarchy cannot survive.",
				"added": 1478393947
			},
			{
				"comment_id": 27,
				"body": "> [planespherev2](#comment_96_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): Because capitalism is more efficient. It is a design made to conquer and transform humans and biodiversity. \n> It will devour anything until the breaking point of human tolerance is reached. \n> You seem to enjoy this mode of production. Good for you. I don't blame you but i'm sure that even you feel that something is wrong. Not in the political organization, but in  the current mode of production itself. \n> The more capitalism tighten it's grasp on humanity, the more people will think about changing our mode of production. \n> I don't want bad things to happen, but if we don't switch gradually to an other one mode of production, we will hit the ground without any parachute. \n> The tendency of the rate of profit to fall hasn't been solved, so the final crisis is inevitable. (Although the mode of production could potentially morph gradually with open source, open patent, crowd-sourcing, direct democracy...).\n\nYou're an absolutist. No person in the world who knows me will describe me as a capitalist. I do believe in capitalism. It insentives people to make other people their lives better. I don't believe in a complete liberal society runned by capitalism for the exact same reasons I don't believe in anarchy. People aren't good. People exploit other people. There needs to be a clear organised system to protect everyone equally to make sure everyone can live a good life.",
				"added": 1478442426
			},
			{
				"comment_id": 28,
				"body": "> [planespherev2](#comment_96_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): The tendency of the rate of profit to fall hasn't been solved, so the final crisis is inevitable. (Although the mode of production could potentially morph gradually with open source, open patent, crowd-sourcing, direct democracy...).\n\nLet's also not forget that systems like open source, open patent, crowd sourcing and democracy all fit in nicely with capitalism.",
				"added": 1478442489
			},
			{
				"comment_id": 29,
				"body": "> [planespherev2](#comment_97_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): People aren't good in a capitalist society. People exploit other in a capitalist society. You read but you don't understand. \n\nExploitation always happened. Slavery existed before currency existed. \n\n> There is no half way with capitalism. You cannot control it. You think you can, but you cannot. \nI disagree. There, I used as much facts to back up my claim as you did.\n\n> They is no liberal capitalism or social capitalism. It is one and the same system. And there isn't difference for the people in both of those systems. After 50 years of trying those systems you should know. Did you see a difference between Tatcher politic (liberal capitalist) for people and Mitterand (french president from 82 to 95) during the same period? Of course not. Supposedly they were opposites, but the lives of people in England and France were approximately the same during this period. All the scam is to make you believe that there is a difference between liberal capitalism and social capitalism when it's the same. \nThere is no liberal capitalism and social capitalism. There is capitalism. Socialising the private market is merely limiting the scope of said capitalism.\n> And about people exploiting people, apparently a good night sleep haven't help you to understand: there is no exploitation in the primitive tribe. Only money and hierarchy: the core of the capitalism mode of production, allows to exploit.\n\"Primitive tribe\" - we talked about this before. They are all gone. Natural selection.\n\n> Yes they do because they are just drops in an ocean of capitalism. If you're an open source developer, you need to buy food at a supermarket, thus you need to be paid. Thus there is a paradox were you produce something that is non proprietary (gnu software), when you still need money to buy you property and food.\nI completely agree with this point, but getting rid of capitalism isn't the solution. People should just be granted an existence where even if they choose to do nothing, they can still live a happy life. That's not getting rid of capitalism though. The market will still be supply-demand based, but people will merely be granted an allowance.",
				"added": 1478460127
			},
			{
				"comment_id": 30,
				"body": "> [thisweb11](#comment_35_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Also Id like to pooint out that MOST people on earth TODAY struggle to feed themselves or have access to fresh water.  Life still sucks for the majority.  A LOT!\n\nThat has always been the case. Also, the advanced technology that you say there wasn't in the past, that only emerged with capitalism.",
				"added": 1478460664
			},
			{
				"comment_id": 31,
				"body": "> [thisweb11](#comment_36_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): No they can be COMMUNIST.  ie, collectively and voluntarily organised.  Like a house party. Organised but not imposed.   Or 'lease pass the salt' organised but not imposed.\n\nThat's an absolutist view. I don't believe in communism. In a communist society it's in people their interest to not care about others. It just takes one bad person to ruin it for the others.",
				"added": 1478460725
			},
			{
				"comment_id": 32,
				"body": "> [planespherev2](#comment_98_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): With all respect, you should study the 4 types of modes of production, and their respective dates.\n> For the last time, i'll do it for you but you should just read the wikipedia pages about it. \n> Slavery didn't existed at all before 12000 BCE. From 160000 BCE to 12000 BCE, it was a primitive communist organizatin, without money and hierarchy.\n> About the 4 modes of production:\n> Primitive communism (160000 BCE-12000 BCE).\n> Slavery: occured in diverse area and in diverse dates since 12000 BCE. But mostly during the roman empire, which was an entire mode of production based on slavery.\n> Feudalism: division of society in 3. Laboratores, oratores and bellatores. Laboratores worked for bellatores who protected them. \n> Capitalism: current system of production with the separation of humans in 2: the owners of the means of production, and those working for them (employees).\n\nCapitalism doesn't have to be seperated. Cooperatives are also capitalist. Crowd funding is also capitalist. Those are all capitalist by nature. You don't need to get rid of something that has proven to work to work together. Capitalism doesn't require there to be seperation. \n\nIf anyone has been brainwashed it's you. You do not understand what capitalism actually is anymore.",
				"added": 1478460962
			},
			{
				"comment_id": 33,
				"body": "> [thisweb11](#comment_37_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): and who decides who we get to vote for?  And who decides when?  And if having decided that democratically, who calls the vote.  And if you even manage that, what happens if other people don’t want to vote or take part, or decide they want a vote, a new parliament of their own,  for example.  There is no democracy without anarchy.\n\nThose are all rules cooperatively constructed by the people and laid down in a constitution. Yes, to create a state you first need anarchy, because you cannot create a state where there is one.",
				"added": 1478461032
			},
			{
				"comment_id": 34,
				"body": "Every example you guys listed for anarchy sounds horrible and I definitely do not want to live like that. They're all stuch in even before the dark ages.",
				"added": 1478461075
			},
			{
				"comment_id": 35,
				"body": "> [planespherev2](#comment_100_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): Complete bullshit. Do a google (i just did it to be 100% sure) and the definition of capitalism is a mode of production with 2 class: the owners of the means of production and the ones working for the owners of the means of production (employees).\n\n\"An economic system in which the means of production and distribution are privately or corporately owned and development is proportionate to the accumulation and reinvestment of profits gained in a free market.\"\n\nThe definition says nothing about WHO privately owns the production.",
				"added": 1478462338
			},
			{
				"comment_id": 36,
				"body": "> [thisweb11](#comment_38_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): BUT IT ALREADY HAS!   For 100,000 years!   And STILL today, it survives.  less than capitalism sure, but diseases pass.   Humans, all humans are BORN and INNATELY driven by anarchy, if they continue to suffer the sickness of capitalism all humans will die.   Its anarchy or death.  Its just maths at this point.   There is no other choice because capitalism depends on infinite growth.    There isnt an economist on the planet with half a brain that would deny this fact.\n\nYou don't need growth in capitalism at all if you do proper redistribution.",
				"added": 1478462385
			},
			{
				"comment_id": 37,
				"body": "> [planespherev2](#comment_101_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): Great vision you have from your ancestors.\n> They were living in harmony with nature, with each other, weren't scared about death, were highly spiritual, didn't have mental illnesses, were able to heal with about 3000 medicinal plants, and you think they were horrible.\n\nTheir healthcare sucked, they lived horrible and short lives and there is literally no evidence to suggest they didn't have mental illnesses. Usually the statistics saying we used to have less metally ill don't take into account the fact that we got better at diagnosing.\n\nIf we were to go back to the point we where back then, people would just form states again and everything will start over. Some people just love to see history repeat itself.",
				"added": 1478462608
			},
			{
				"comment_id": 38,
				"body": "> [planespherev2](#comment_103_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): Their longevity were about 70 years old. Their healthcare was better than current one with bigpharma, and it's capitalism and it's alienation that creates most mental diseases. \n> A 3 second google search about longevity in old times: http://www.ancient-origins.net/news-evolution-human-origins/life-expectancy-myth-and-why-many-ancient-humans-lived-long-077889\n> God dammit what's your problem you watched too much TV?\n> \n> There you fail to understand an other concept: superior communism: the primitive tribe organization (a system which aim to organize society in conformity with our ancestor way of life) but with modern technology.\n\nBigpharma isn't an issue in every country. Their healthcare was horrible with an average age of death of 25. Death during childbearth was through the roof! \n\nAlso, your technology point doesn't make any sense. Modern technology only came about with capitalism, and capitalist nations have had more technological advances (PER CAPITA!) then non-capitalist states. Why aren't your favourite tribes designing the next microchip? Because they aren't capable.",
				"added": 1478463122
			},
			{
				"comment_id": 39,
				"body": "> [planespherev2](#comment_104_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): http://www.ancient-origins.net/news-evolution-human-origins/life-expectancy-myth-and-why-many-ancient-humans-lived-long-077889\n> \" It was found that once infant mortality rates were removed, life span was calculated to between 70 and 80 years\"\n> Technology was something present in the german tribes. I suggest that you take an interest about they skills in metal forging, architecture, astronomy, arts, architecture.\n> I debate in good faith, so i admit that capitalism accelerate technology. But it doesn't create it. Romans created the colyseum with an other mode of production (slavory which was also bad), and Vikings visited america with the feudalism mode of production. http://www.bbc.com/news/magazine-35935725\n> Capitalism doesn't create technology. Since capitalism is a system which has no choice than to constantly race forward (see previous post about money creation), it's logic that it accelerate technological progress. \n> However, even technology enthusiast like H.G Wells admitted that technology is increasing far too fast. \n> We create technologies but we don't master all it's aspects.\n> Anyway, the better example to proove you are wrong is again open source. Some open source softwares, even not integrated in capitalism, making 0 profit, are just the best thing you can find in a particular domain. However, they appeared without any profit made, or necessity to make profit.\n\nOpen source exists within capitalism and thus your point is defeated.",
				"added": 1478469768
			},
			{
				"comment_id": 40,
				"body": "> [planespherev2](#comment_105_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): Mode of production do not change overnight. The first step of a new mode of production always happen within the previous one. \n> The beginning of capitalism happened during feudalism. When bankers started to take over (medicis) and serf were enticed away by rival lords.\n> Same could be happening for capitalism with open source. The very first steps but it'll grow more and more. The more it grows, the less money will be made in the particular area of software and OSes.\n> Money regarding open source software isn't made by selling the programs, but indirectly with advertisement (amazon in Ubuntu),  data mining, and support (E.G red hat). The open source concept itself, doesn't generate money, in opposition to closed source software (E.G Microsoft), which very nature is to be sold in exchange of money.\n\nCooperations can exist within capitalism. It doesn't have to replace it.",
				"added": 1478478356
			},
			{
				"comment_id": 41,
				"body": "> [planespherev2](#comment_106_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): You repeat again and again that human nature is to exploit each other (which isn't true: primitive organization). \n> However you promote cooperation in the very system which consist to make the most profit for oneself on the detriment of others: capitalism.\n> So in short you say: \"exploitation is inevitable, it's our nature. Let's be capitalists. But heh, we still good guys from time to time,  within this capitalist system, we can still cooperate\".\n> That looks like  dual personality traits.\n> In a capitalist system, we fuck up everything, and then we distribute bandages to the one who paid the price. Whether it to be the poor, unemployed, the biodiversity, the atmosphere, the soil (shale gas), the planet herself.\n> That's how we buy (again) us a good conscience. It's 90% pain and 10% reassurance. Looks like you love your 10%.\n\nI don't say exploitation is human nature. I say it merely takes one person to exploit it to force all others into doing the same. \n\nYou are actually using a strawman argument regarding capitalism. Capitalism can be regulated. Demand and supply can be influenced. For instance, a tax could be applied on greenhouse gasses or they could even be directly controlled by the people.",
				"added": 1478523917
			},
			{
				"comment_id": 42,
				"body": "Let's tackle the problem in a different way because I feel this is goin nowhere. \n\nWhat issue does capitalism have that requires anarchy? Also, I see I'm running out of my quota so if @nofish could fix that, that would be great. (I sent an email yesterday)",
				"added": 1478552982
			},
			{
				"comment_id": 43,
				"body": "> [thisweb13](#comment_18_1NLj8uWHVf68dt53Wuz5HRqQvX7fScCXpD): I could be here for a 5 year writing that list for you.   Instead ,   I'll summerise it in one word:  \n> Greed.\n\nWhy is greed an issue? As you said, it's a feature, not a bug.",
				"added": 1478602118
			},
			{
				"comment_id": 44,
				"body": "> [planesphere](#comment_14_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C): In the primitive tribe, when some begin to feel superior, he is first mocked, and if the persist, he is shunned.\n> In a primitive organization, there are social mechanisms to prevent greed.\n> Capitalism, on the other hand, only pours oil on the fire, with a system were the one who have the most money have the most power. \n> Capitalism is not a system which encourage the power of the wisest (the elders in the primitive tribe), but the richest, the most powerful. \n> Take a dog, put him in a cage, 24H, in the dark, and strike him regularily (make me thing about the dog scene in snatch the movie). he'll become agressive.\n> On the other hand, take the same dog, take good care of him since his birth, and he'll be a nice dog. \n> If you think humans reflect greed, it's mostly due to the current mode of production we live in.\n\nYou didn't answer the question. Why is it a problem? In capitalism, greed is just an incentive to help others.",
				"added": 1478685525
			},
			{
				"comment_id": 45,
				"body": "> [planesphere](#comment_15_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C): No. Greed, is what makes children make your shoes in Bangladesh.\n> Greed is what makes bankers speculate on food and create famines in Africa.\n> And most importantly, greed is at the origin of the rainforest deforestation and destruction.\n\nSo? Why would we replace capitalism. All of those issues aren't the result of capitalism but the result of not having proper regulations. Child labour is already banned in the West. Food supply and climate change can both be regulated.",
				"added": 1478689356
			},
			{
				"comment_id": 47,
				"body": "> [planesphere](#comment_16_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C): What you propose is patching a system which is inherently bad, because it's based on profit.\n> You can patch windows, install an anti-virus, which only make the whole system heavier, or you can switch to Linux.\n> Anyway, this doesn't answer the tendency or the rate of profit to fall: https://thenextrecession.files.wordpress.com/2014/04/world-rate-simple-mean.png\n> It would be better to change the whole system, a mode of production based on the well being instead of profit. It's not even a choice in the end since this profit will fall and fall until it will be non-existent in the end, which will cause capitalism final crisis. At this point, when capitalism final crisis will happen,  we could switch to an other mode of production, even go back to slavery, or change for a new one, not based one property and the exchange of goods. \n> In order to realize that an other mode of production is possible, many must understand that well being doesn't necessarily mean making more money or having more new objects at our disposal.If you think that your well-being is related to your buying power, then no change is possible.\n\nThat wouldn't be irrational if Windows was a better operating system overall. Capitalism is more efficient, faster and relies less on trust.",
				"added": 1478699004
			},
			{
				"comment_id": 48,
				"body": "> If a CEO of any major company stops working tommorow or your local refuse collector does. Which one do you think you'll notice first? Easy right? So which one deserves the most reward?\n\nThe one who is the least replacable you'll notice first.",
				"added": 1478699175
			},
			{
				"comment_id": 50,
				"body": "> [planesphere](#comment_17_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C): It is not clear if capitalism is more efficient than superior communism. It depends on what you mean about efficient. If it is producing more goods, capitalism is possibly more efficient. It you mean saving ressources or biodiversity (those which haven't been definitively destroyed like half of the wild animals during these last 40 years), superior communism will probably be more efficient. \n> Yes capitalism relies less on trust, capitalism relies on coercion. The whole capitalist mode of production relies on coercion.\n\nPlease explain why conserving resources is a good thing? Furthermore, biodiversity can be _regulated_ when needed. If you argument is people are good, then why would they not be able to agree on common rules they can follow? It's a very contradiction to suggest anarchy or communism is needed.",
				"added": 1478729383
			},
			{
				"comment_id": 51,
				"body": "> [thisweb13](#comment_21_1NLj8uWHVf68dt53Wuz5HRqQvX7fScCXpD): Ok, well if you can't see greed is bad for society I have nothing else to add.  Even christians see it as one of the deadly sins?\n\nGreed is a bad word. All animals by nature have a desire to improve their current situation. You call it greed, but just calling it that won't remove the fact it's not something introduced by capitalism. Capitalism sees this desire for more, and makes use of it by directly correlating your welbeing to other people their welbeing. You can only become wealthy by helping other people. Sure people can cheat, but that's why they can agree on common rules.",
				"added": 1478729514
			},
			{
				"comment_id": 52,
				"body": "> [thisweb13](#comment_22_1NLj8uWHVf68dt53Wuz5HRqQvX7fScCXpD): But greed, a part of capitalism (because profit is greed) , means regulation becomes de regulated - because deregulating regulation increases profit, .  Regulation is anti capitalist. And the people who regulate are the powerful, who are rich capitalists.  No regulation lasts becasue the greed drives the mostpowerful to deregulate!  Regulation and capitalism are antithetical\n\nThat only holds true when we correlate money to speech. There is no rule in capitalism which requires this. When liberalism was just emerging, the system was built to correlate money to speech, after all, the revolutions were lead by the wealthy.\n\n> Yes because its more cheaper to use child labour in the east where theres no regulation and much of your clothes and goods are made. \n\nThat's a contradiction. \n\n> If we value the person by how replaceable the work they do is then what does that say about you?\n\nYou're the one who is saying the amount of money someone earns is correlated to their worth. It only makes sence to give people who do replaceable jobs less salary, because it insentives them persue somethign else. \n\n>  The difference here is that you dont appreciate the ceos because he does nothing for you personally. The refuge collector does. He personally collects your rubbish. In any case whether CEOs are more replacable than rubbish collectors or not now is debatable, but without oppresion by money, you'd struggle to find anyone to empty your bins.\n\nThe CEO only earns more because as a society we agree being a CEO is a much harder job. It's easier to replace a rubbish collector with a qualified alternative than a CEO. As such, we want to incentivise people as much as possible to persue these more difficult jobs.\n\nIf your argument is that CEOs earn disproportionally much compared to what they deliver, I agree. This can be regulated. A progressive tax rate directly correlates with wealth equality.\n\n> Wanting a CEO wouldnt cross your mind, unless you wanted them to OPPRESS people into cleaning your bins. \n\nA CEO doesn't oppress anyone. If you're talking about people who are doing jobs they don't want to do, that's hardly the CEOs fault. The CEO isn't forcing them to do that job, it's the fact that society fails to guarontee that person's basic rights no matter what. A universal basic income would immediately enable anyone to only do the jobs they want to do.\n\n> The economy is built on structural violence, violence imposed on anyone who doesnt pay their debts and services to others with money and money alone. The CEO is a step in the levels of that structure, baring down, threatening the violence and power from above handed to him.\n\nI've never heard of violence committed to anyone because they couldn't pay their debt. Debt usually gets forgiven, except for bussinesses. \n\n> Are you serious?\n\nThat's not an argument. There is nothing fundamentally wrong about using resources, that's the entire point of them. If there is a need to conserve certain resources, those can be regulated.\n\n> Becasue under capiatlsim if 99% of the worlds population were good and wanted common rules they could follow, it wouldnt happen if the 1% capitalist sociaopaths who are rich, powerful and have armies didnt agree.\n\nThat's false. Capitalism is an economic model, not a political one. I have used this argument in other forms before, but I can't seem to stress it enough. Nothing about capitalism says anything about how a country or the world should the rules. All capitalism is, is a way to model the economy in a way which allows the most freedom yet guarontees resources are used in the most efficient way. Thats what we have and that IS exactly what's wrong with capitalism. Your question is the most important one. I hope ive answered it.\n\n> Hunger, wants and needs are not the same as greed. There are no other greedy animals. None. If a lion has just eaten he wont kill a zebra. In fact he has evolved to conseve it and let it breed for a meal when he needs to eat. (whch also answers your why conserve resources question)\n\nWhen a person doesn't need food, he won't work to be able to buy that food. There is no difference. Capitalism still follows the law of diminishing marginal utility. Humans need more than food however, but fine, if you think that all you need is a house and some food, go for it. You're still free to do so in capitalism. No one requires you to be greedy. Capitalism doesn't create greed, it acknowledges it and makes use of it. If it was capitalism which created greed, than people would've never created it as it wouldn't make sense. Yet they did.\n\n> Are you sure about that? How does robbing someone help other people?\n\nRobbing something isn't something unique to capitalism. Long before capitalism existed thieves existed. Capitalism correlates your wealth to how much people are willing to pay you for what you do for them. As such, your wealth correlates to the welbeing of others. This is one of the most basic rules of capitalism.\n\n> Lots of people get rich through blackmail. Oh yeh, the banks in 2008 blackmailing the public with economic terrorism, demanding bailouts from the taxpayer for which they did not cause and for which the banks helped nobody, destroyed homes, jobs, and lives whist paying themselves huge salaries and bonuses and still asking for more. That is the very essence of global capitalism today. Its not theoretical, its already failed most people. even the western upper middle classes.\n\nI agree with you. People blackmail, and again, they did so before capitalism existed. People lie, and they did so before capitalism existed. What happened in the banks is the result of a broken political system. Again, capitalism is an economic system, not a political one. It's not capitalism which failed people, it's the political climate. No political system will work if it is ruled by a minority. This has nothing to do with capitalism. \n\n> Capitalism made Trump president of the world. There is no argument I can make against capitalism that is more powerful than that fact.\n\nCapitalism is not a political system and the USA is not the world. Furthermore, Trump had only half the capital of Clinton and wasted a much bigger proportion of it.",
				"added": 1478777426
			},
			{
				"comment_id": 53,
				"body": "> [planesphere](#comment_18_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C): Have you heard about the sub prime crisis, were people saw their houses confiscated and were (still are) obligated to live under camping tents?\n\nAt least where I live, debt that cannot be paid is forgiven. \n\n> Theft only exist on modes of production were there is money and/or property. Thus slavery, feudalism and capitalism. During the primitive communism, there wasn't theft inside the tribe. In superior communism, there won't be theft anymore. No need to steal when everybody have everything he need (not everything he wants, but everything he need).\nWhy would people not steal to get what they want? \n\n> So, is planned obsolescence, something capitalism created, a guarantee that resources are used in the most efficient way? \n> Anyway i just thought about it yesterday, and with the tendency of the rate of profit to fall, capitalism NEED planned obsolescence. Otherwise the final crisis will come sooner than later. If people don't buy again and again the same stuff, the economy crash and the system collapse. \n\nThis is somewhat true. People need to keep spending their money instead of sitting on it, otherwise inflation will skyrocket. There's other ways to keep the economy going other than by making worse profits, like by making better products, or by inflating prices by cutting on maximum permitted work hours. \n\n> I just thought about it and it could be even worse in the future, lobbies could impose  laws which compels you to change you belonging regularly (with excuses like security, protection of the environment etc...) Even if, for example, buying a new car (which consume less) in exchange of the old one pollutes more because of the energy and resources used to build the new one).\n\nLobbying is part of the political system and not the economic system.",
				"added": 1478790840
			},
			{
				"comment_id": 54,
				"body": "> [planesphere](#comment_19_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C): Do you steal inside your family? It happens but it's quite rare.\n\nStealing in general is quite rare. Furthermoreme, even in a communist economy, most people close to you will be strangers. \n\n> It's not only about inflation, but about the tendency of the rate of profit to fall. \n\nYou keep saying that but there is no evidence whatsoever for that hypothesis. Economists widly agree that it's not a thing. It doesn't make sense either. As long as profit exists it creates an economic incentive, and profit cannot decline unless demand declines or production costs increase. Production costs don't generally increase and demand might go down, but that only means people do not want a certain good anymore, so it only makes sense to get rid of the incentive! Profit will never reach 0 as this implies that there is no demand at all. \n\n> The more mechanization happen, and we all agree there will be more and more mechanization in the future, the more the rate of profit fall. In the end, even selling non needed goods regularly won't be enough. Prices drop and drop but people don't need goods they already have, which are produced in a bigger and bigger quantity and at a cheaper and cheaper price. In the end, there won't be enough profit to make because there will be massive quantity of cheap good that won't sell and the system will crash. \n\nMechanisation _increases_ profit, not decreases it. Labour costs go down, profit goes up. Overproduction is only an issue when there isn't demand to match it. There is plenty of demand, and we aren't even redistributing the capital to its fullest yet, which will increase demand even more!\n\n> In the end (about 50 years), it will be machines making machines for almost nothing to pay, and the system will crash because a system which produce goods without work and very massively (sell for a cheap price) cannot make profit.  Capitalism is based on profit. Thus it will inevitably crash when the total mechanization of all production lines will have been completed.\n\nAt such a time capitalism is still the best way to go about it. By giving everyone an allowance they can buy what they want, and that ensures production is always matching the demands.",
				"added": 1478812815
			},
			{
				"comment_id": 55,
				"body": "> [planesphere](#comment_20_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C): https://thenextrecession.files.wordpress.com/2014/04/world-rate-simple-mean.png\n\nhttp://www.abc.net.au/news/image/4719410-3x2-940x627.jpg\n\n> Here is the abstract part. You should understand it yourself, but i'll help you.\n> At first, after some mechanization in a particular production line, profit go up because more goods are sold. This competitor has an advantage: he produce more for a lower price.  However, later, competitors do the same in order to keep up, and mechanize. More goods are sold on the market.  What happen then? Prices go down. Less profit is made for a particular item for all the competitors. Selling a particular item give less profit,  because more items of this kind are on the market.  You'd say: it's not a problem, we'll sell more of the stuff to compensate. At first, it'll work. And planned obsolescence will help. However,  here is the critical point: who need 200 pens, 15 cars, 18 laptops. No one.  At one point, goods will be cheaper and cheaper, profit will be compensated by selling more, but you can only sell as many as people want, or need.  At one point, less and less people will buy the particular good, until no one will buy it. This is capitalism final crisis. \n\nThat's not a crisis. In fact, this is one of the very issues capitalism is made to address. To say it in a more jokinly way, it's a feature, not a bug! \n\nSay at one point the industry gets mechanised. This decreases labour costs. In other words, supply becomes cheaper, and competition will decrease the price. Demand will still be there though, and thus there will at least be some incentive to keep producing the good. If all demand really stopped, the industry dissapears as there is no incentive to keep producing in it anymore. There is no issue with this. This is exactly how it is supposed to work. \n\n> Also, be realistic: take an abstract example: one production line: 100% automated, extremely energy efficient (In the future,  in 50- 80 years from now). Manufacturing goods in this particular production line will cost nothing. Same for the competitors. Thus the price of the goods will be nothing. Thus no profit. \nIf it truely costed nothing, then I don't see an issue. People could come together for that particular issue, and decide that they will together pay the initial investement that builds this factory, and then they will share their resource with the world. As I said, cooperatives aren't banned in capitalism. All of this can be done in capitalism. In fact, if every single industry becomes automated, there will be an automatic gradual evolution into a communist economic model. If people aren't engaging in these cooperatives themselves, the government could setup such a factory. It's just that easy. \n\n> It's quite simple but many are not conscious of this law of the rate of profit to fall.\nYou demonstrated no such law. Your law only applies in the hypothetical scenario supply cost hits 0, something which I believe is still a while off.",
				"added": 1478905335
			},
			{
				"comment_id": 56,
				"body": "To start off, can I please ask you post everything in one message? I know I also split up my posts earlier in this conversation, but that was by accident. It's just much easier to respond if there is only one message.\n\n> [thisweb13](#comment_31_1NLj8uWHVf68dt53Wuz5HRqQvX7fScCXpD): Its not the lack of incentive its the lack of options.  Refuse needs collecting.  It should always be well rewarded.  I didnt say money correlates with their worth, I said the work they do should be better rewarded.  We dont need to incentivise anyone ( I wouldnt want a CEO to be paid less than a refuse collector either - assuming you think we need them,)\n\nThen how do you incentivise people to do jobs that are in high demand? You disagree with the current model but fail to provide an alternative. \n\n> Um no, he earns more because the wealthy elite like to pretend its a much harder job. Society mostly disagrees with how much, say, the CEO of Roytal Bank Of Scotland or BHS should get.\n\nWe do, or at least I do. The reason CEOs earn so much is because if they fail, thousands if not tens if thousands of people will be negatively affected. As such, they are allowed high salaries.\n\nIf your argument is the salary is disproportionally high, I agree. That's an easy fix though. You could merely have a very progressive tax rate, in which the more a CEO is allowed, automatically the more the state is allowed and thus the community is allowed. \n\n> If you think being a CEO it a harder job than collecting refuse, or say fighting in a war zone, then either you dont understand what hard work is, or you dont understand what value is.\n\nBeing a CEO is a less replaceable job, and a very hard one. A lot of people can collect garbage or fight in a war, but not a lot of people can lead a bussiness. \n\n>  This can be regulated? OK name a wealthy ceo in all of history who has accepted such regulation at any time ever? Any minor regulations that already exist are nearly always avoided. As I said hardly any of the biggest companies on the planet pay tax. And they are regulated to pay tax. They just avoid it. Regulation is easy to avoid. And if it isnt the rich have enough power and enough builderberg meetings to thwart any attempt you might want to make. And I dont mean sometimes. I mean always. For all of capiatlist history. Without exception.\n\nThis is a hypocritical argument. Are you saying that because something has never or barely never happened, it is not a valid solution. If so, I can now dismiss your entire argument. As I cannot see a political anarchy nor a communist model in our current world, both of them must be bad solutions.\n\nI completely agree that a lot of people and corporations who should pay taxes are not. This is a political problem, and not a problem with the economic model. \n\n> Are you kidding. All those foreclosures in 2008, making people including children homeless, bailifs, debt collectors. All will commit acts of violence and arrest you if you dont pay. They have the legal right to use force. All force is violence. Forced starvation and homlessness (when a home lays empty no less) is an act of extreme aggression and violence in my view. And it happens every day. All over the world. Try not paying a debt. See for yourself if it will be forgiven.\n\nThat just depends in which country you live. As such, it's not an argument against capitalism. In my country, people who cannot pay their bills are excempted from paying taxes and are immune to certain fines. You cannot go to jail for not paying your bills nor can you be arrested. If this was not enough, the government will negotiate with the creditors to work out a payment plan. It is in the creditor their interest to agree with such negotiations as otherwise they might never see their money. Such a payment plan concists out of debt relief, a resheduling of the payments, possible selling of property although the person in question is always allowed to do this themselves. Any person who starts these negotiations is immediately disallowed from generating any further debt. In practise this means the person cannot make any new loans, but also that any interest they have to pay as well as other increments of the existing debt is made void. If the negotiations result in the person having to sell property, there is except property as well. Anything required for a basic life cannot be sold, including without being limited to the residence, a bed, a table and a set of chairs. It is not uncommon though for these negotiations to compeltely relief the person of all debt, especially if the person cannot pay their debt due to loss of job or other conditions that are out of their control. \n\n>  The CEO makes ALL his money of the back of that refuse collectors labour and keeping the profit for himself instead of sharing it fairly. It is his fault. And of course the system that allows it. Capitalism.\n\nThis argument is naive at best. As I pointed out before, if you don't like the extrordinarily high pays they get, implement a progressive tax rate that can be enforced.",
				"added": 1478907459
			},
			{
				"comment_id": 57,
				"body": "> [thisweb13](#comment_38_1NLj8uWHVf68dt53Wuz5HRqQvX7fScCXpD): This is an assertion made only in the context of capitalism.  Under anarchy people want to work and contribute to the community.  Under capitalism (and the individualism it promotes) you are indeed correct.   But that isnt an inevitability in other contexts, and you have no evidence to back it up.    There is evidence that communities have always contributed towards to others needs, even when their own needs are met.  Its actually the point of being a social animal.  Making those bonds and social agreements insures our mutual survival.  As capitalism breaks them down, it mutually ensures the destruction of humanity.   That is what we see happening rtight now.  As people hoard resources, let others starve and pulute the planet for CAPITALism!\n\nNo one is doing any of that in the name of capitalism. People are doing that because it brings them profit. To fix it, simply increase the cost of supply or decrease the demand. \n\n> I can't. Only capitalists can do this, as they own the guns of enforcement, theyd have to be willing to give up their money. Thats anti-capitalism. Why would they do that?.\n\n\"Capitalists\" don't own the guns. The government has a monopoly on violence, that's how the state works. If your state is ruled by capitalism, that's a political issue, not an economic issue. You cannot make the argument communism fixes political corruption as it's unrelated to the state. \n\n> Are You An Anarchist? The Answer May Surprise You!\n\nNow I just disagree with you more. I take the bus on a daily basis and let me tell you, there is a lot of horrible people out there. \n\nMy issue with anarchism is that people will just organise into states again. Anarchies don't survive.",
				"added": 1478985630
			},
			{
				"comment_id": 58,
				"body": "> [thisweb13](#comment_45_1NLj8uWHVf68dt53Wuz5HRqQvX7fScCXpD): If a job is worth doing ther is reward in itself of course. Incentive in your context seems to mean 'bribing' people will capitals (and thus granting them power over others) \n\nIncentive means what it means. It means to give people a reason to do something. \n\n> Harder than fighing in a war zone or cleaning maggots from bins in the freezing winter smog?  I dont think you are being entirely honest with yourself here.  And if you are just going to argue about how replaceable they are then you haven’t acknowledged their suffering.   That thinking is exactly why I despise capitalism\n\nThere is a difference between hard and a pain in the ass. \n\n> Im not saying that.   Capitalism is about making profit.  It is not about regulating for less profits. So it MUST be political, in order to prevent regulation:   If regulation happens then capitalism isnt happening.  For capitalism to work, under any system, it necessarily must ignore social rules that prevent increased profits.  The fact we have never seen regulation work, isnt proof in itself, I take your point.  Its just you have no proof it can work either.  What im really saying is we dont need proof,  because capitalism is in direct conflict with mathmatical laws.  We could pretend there are no mathmatical laws I suppose.  But I think its more likely that structural and political violence keeps maths at bay, in favour of political oppresion (stealing back power by making up the sums - by printing new money and creating derivatives and laws that make people who are owed money not owed the money so everyone is so confused we cant proove who owes what to who) .  But build a mathmatiucal model from scratch and it doesnt work.  Not without politics.\n\nCapitalism is an economic model. You are mixing it up with liberalism, which is to deregulate as much as possible often to allow a more unrestricted form of capitalism. I do not subscribe to this ideology at all. \n\nI do have proof regulations work. Child labour is banned, bankruptcy if forgiven, healthcare is not an issue, education is universal and free. There is plenty of things that are regulated within a capitalist system. \n\n> Don't know where you are from, but if this is the case, it sounds almost anticapitalist to me.   Souynds like where you are from is more communist (in the true sense) than elsewhere.  But sadly it wont last, not whilst capitalsism still permeates the economic system.\n\nIt's not communist at all. It's just regulated capitalism.",
				"added": 1478985987
			},
			{
				"comment_id": 59,
				"body": "Under an anarchy, who would enforce the law? What entity provides protection? How do you prevent such entity from doing a power grab?",
				"added": 1478986753
			},
			{
				"comment_id": 60,
				"body": "> [thisweb13](#comment_48_1NLj8uWHVf68dt53Wuz5HRqQvX7fScCXpD): They do.  They also invented them.\nThere is more guns owned by the people than by capitalists. \n\n>  The govnts and monarchs of the world are all Capitalist.  Thats how you gain power, by having capital over the majority.  No communist country exists or ever has since capitalism came about.\nYou're paranoid. It's not that difficult to get capitalism out the political system, but it's the capitalists who made democracy happen in the first place, and they made it work only for them. Now we need to do one final evolution to bring the democracy to the people from the capitalists. This has already succeeded a lot, given your vote isn't linked to your money for example, or by the fact most democracies have very strong financing laws.\n\n> Yes there are and I bet my life every horrible person you met was a capitalist created by capitalists.  \nThere have always been horrible people, even animals can be pricks. Furthermore, your statement has no value. Every good person I ever met was a capitalists. In fact, every person I ever met was a capitalist. Everyone is capitalists.\n> But they did for 1000s of years.\nAnd then they stopped existing. That's my entire point. Good they did too, life is much better now.\n\n\n\nThere is many good arguments against capitalism but yours are really bad. Either you forgot what is wrong with it or you simply don't know and are just being anti-capitalist because it's \"cool\".",
				"added": 1479081581
			},
			{
				"comment_id": 62,
				"body": "> [planesphere](#comment_21_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C): Our political system isn't a democracy. Representative democracy isn't democracy.\n\nNow we're just arguing semantics. \n\n> Firstly they didn't stopped existing. Secondly, the point of superior communism isn't to go back live in caves or in huts. \n> The point is to use modern technology, but within a system of organization close to how our ancestors lives. And for sure it wasn't a capitalistic organization. \n> Being the most efficient system doesn't mean it's the better. Well being doesn't relate to efficiency.\n> I can make an analogy with coal energy. It's one of the cheapest, and we have at least 110 years of coal left. However, everyone agree that it's the worst. (check coal pollution china).  \n\nThat just makes it less efficient. You proved nothing. And I do understand you don't want to live in huts. My point is, if anarchy worked, it'd still exist. Yet everything has been replaced by the nationstate. \n\nDon't get me wrong. I sincerely do think an anarchy would be good to live in, but I do not have faith it lasts nor do I have faith it can work with the same efficiency as a nationstate. \n\n> No offense but sometimes i feel that guys like you (binero) are AIs. \n> It's super far -fetched and even here some will say i'm a conspiracy theorist, but it's not 100% impossible.\n> Your name itself, binero, makes me doubt...\n> If you're a human, i suspect that you're paid to spread this propaganda. Even paid people can be convinced if the arguments are right. \n> But anyway, it's only doubts, and i must admit that you debate in calm (no insults). So i thank you for that.\n\nI'm not an AI, and boy do I wish I got paid for this. \n\nThe reason I don't go to insults and ad-hominem attacks is because I'm not here to win a debate. I am here to hear you out and to see if your vision actually is robust enough to the point I _have_ to agree with it. \n\nI have asked before, but what problem is there with the current system that it requires a change to something that radical that is anarchy? Capitalism has its problems, but those can be resolved. Current democracy also has its problems, but that's to be expected given it's still fresh, new and evolving.",
				"added": 1479155488
			},
			{
				"comment_id": 64,
				"body": "> [thisweb11](#comment_56_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): https://theanarchistlibrary.org/special/index \n\nI have read a large chunk on one of the links. I don't think I can answer you now. I do think now that anarchy indeed is _better_ for most people, I still do not think it's reachable at least not yet. I do now even more rigurously disagree that anarchy is fit for me however. A system where there is no clear law nor any objective courtsystem is a system I cannot live in.",
				"added": 1479160939
			},
			{
				"comment_id": 65,
				"body": "> [planesphere](#comment_23_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C): Not quite. \n> Were have you been on the clearnet these last years if you haven't heard about direct democracy? \n> Quote from Sieyes, one of the founding fathers of the french republic, about representative democracy:\n> \"Citizens who call themselves representatives shall renounce and shall refrain from making the law themselves; They have no particular will to impose. If they dictated wishes, France would no longer be this representative state; It would be a democratic state. The people, I repeat, in a country which is not a democracy (and France can not be), the people can not speak, can only act by their representatives. (Speech of September 7, 1789, headed precisely: \"To say of the Abbe Sieyes, on the question of the royal veto: at the sitting of September 7, 1789)\n\nI have heard about direct democracy. I'm a mild advocate, but I'm unsure the public really cares.",
				"added": 1479160973
			},
			{
				"comment_id": 66,
				"body": "> [planesphere](#comment_24_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C): In a recent poll, 75% of the french people want poplar initiative referendums in the political decision process.\n\nYet voter turnout is always way lower.",
				"added": 1479161273
			},
			{
				"comment_id": 67,
				"body": "> [thisweb11](#comment_59_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): 'A study by the Common Cause Foundation, due to be published next month, [...]\n\nThe Brexit referendum is one if the reasons I am only a mild supporter of direct democracy. Most people who voted leave have absolutely no idea what they voted on, and before you go on to tell me I am prejudiced or whatever, I have talked to _a lot_ of people who voted leave, and I have yet to hear an argument that is actually backed up by facts and not by lies. Maybe the most incorrect and most common argument is the argument that a Brexit would somehow benefit the British fishing industry. \n\nThat said, yes, I do see that humans can work together and I have never doubted it. I am a strong supporter of things like cooperatives. Personally however, as I said, personally I cannot support anarchy. Any system which rejects the idea of a clear, predetermined and universal law, as well as rejects the idea of a specialised and objective court system is not one fit for me.",
				"added": 1479236531
			},
			{
				"comment_id": 68,
				"body": "> [thisweb11](#comment_63_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Admittedly they were lied to  about what they were voting for, but again thats capitalism (murdock, Dacre etc) using their power and capital to manipulate the media and representatives into lying.\n\nI do not see a correlation between the Brexit and the leave vote, and capitalism. I do see a ongoing corruption, a strongly outdated political structure and the politcal oppertunism of flawed politicians as the causes.",
				"added": 1479236622
			},
			{
				"comment_id": 70,
				"body": "> [thisweb11](#comment_64_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): People with the most wealth have the most power.  Capitalism creates wealth. Capitalism creates power.   Power creates politics.   PArliament in the UK, both commons and the lords, is made up of 80% millionaires.  Is that representative of the nation they supposedly represent?   If you think theres no connection with wealth (capital) and politics you are either insane  or disingenuous.\n\nOh, I do think there is a connection between wealth and politics. After all, the wealthy designed the current political system. That's something that definitely needs to be addressed. That doesn't mean capitalism is the issue. That means a political system favouring top economic brackets  is an issue.\n\n> I agree with this. As I said. But the fact they had no idea what they were voting for just shows it wasnt direct democracy, but a media-corpo-cracy.\nThe people were handed a referendum and they messed it up. Even without capitalism people will always try to influence each other. \n\n> Those with the most wealth run the media, the media informs the vote. Ego wealth (capital), and therefore capitalism, decided brexit by manipulating the publics view to conform with those who had the most power (via wealth and capital). I think you're smart enough to understand this, but like many people, on the left and right, they hate to feel they have been manipulated, that they can form opinions in a vacuum. They cant. Capital controls influence, it can't tell us what to think, but it can tell us what to think about. Don't underestimate the power of propaganda. And the most powerful propaganda comes from those with the most powerful platform, and that requires wealth.\n\nRegulations on lobbying and a progressive tax rate could fix this. There is also an uprising of cooperative journalistic unions.",
				"added": 1479332450
			},
			{
				"comment_id": 71,
				"body": "> [planesphere](#comment_26_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C): Here we go again. Another one (dear binero) who think we can control capitalism. That politics can control the mode of production. It's the mode of production which defines the political system. Not the other way around. Most of the people think that politic has control over the mode of production. It hasn't. It's the mode of production which define the political system which suits it the best. In our case, liberal representative democracy.\n\nIt is politics which defines the economic model. There is no evidence saying capitalism cannot be controlled if attempted. There is evidence in the opposite direction. There are numerous studies which show which policies contribute to equality, working conditions, and so on.",
				"added": 1479348079
			},
			{
				"comment_id": 72,
				"body": "> [planesphere](#comment_27_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C): I didn't say the economic model, but the mode of production (primitive communism, roman slavory, feudalism, capitalism and ...). Politics can't define the mode of production. The mode of production morph when it become less effective than a new one, or when nobody is interested anymore by playing the rules of a particular mode of production (what seems to have happened to feudalism). \n> Yes you could adjust the mode of production, by changing the economic model, but it's still the same mode of production. It's like modifying a (currently bad) design. You won't get marvels. Better to start from scratch. \n> In the capitalistic mode of production, you'll always have private property (which comes from the work of some humans for other humans: the owners of the means of production). You'll have a state, and money.  You'll have alienation (which comes when someone does a job he doesn't like). You'll have class struggle, coercion, lots of laws. And last but not least, you'll have the tendency of the rate of profit to fall which end with a final crisis.\n\nYou still haven't backed up your claim that the profit falls, and furthermore, a profit ratio of 0 suggests that people consume less than they produce. If you take issue with overproduction, the solution is simple. Apply worker rights and production drops. \n\nCapitalism provides a system in which people are incentivised to do jobs that are needed the most, and that's what has started all thee economic revolutions in the last three centuries. I do not see how a communist economy can still provide this.",
				"added": 1479394036
			},
			{
				"comment_id": 73,
				"body": "> [planesphere](#comment_28_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C): https://thenextrecession.files.wordpress.com/2014/04/world-rate-simple-mean.png\nSame source, different story? https://thenextrecession.files.wordpress.com/2012/09/world-rate-of-profit.png\n \n> How can they consume something they don't need? Nobody want 15 car and 50 phones. With full mechanization, that's were we're headed. Then you'll say that we could build more technological goods, but still, if the production line is 100% automated, it will still cost about nothing to produce, then to sell, then no profit. \nAs I alluded to earlier, if the production cost is 0, then it's not unthinkable that for the sectors where this is true, cooperative organisations will take over, and slowly capitalism will be phased out. \n\n> And what to do if there is no workers needed to produce? Also, this doesn't take the relocation problem into consideration. Apply worker right in the west, and companies will relocate anywhere there isn't such rights. \n\nI'm not in favour of modern day free trade. The same worker's right standards should be applied for imported goods as domesticly produced goods. \n\n> And what to do with the 80% which will not be needed anymore in the near future? \n> You really like your mode of production.\n> Think it will last forever?\n\nI said before I don't think it'll last forever, because a zero production cost will kill capitalism and will boost cooperatives. I'm also in favour of a universal basic income, to make the evolution smoother. I actually advocated for subsidising cooperatives in our federal parliament in 2014, and also lobbied for a universal basic income at the same occasion. While since then there is now a vast interest in cooperatives in our country, I do not see the universal basic income happening as long as people do not actively fight for it.",
				"added": 1479403654
			},
			{
				"comment_id": 74,
				"body": "> [planesphere](#comment_29_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C): Maybe we haven't the same eyes, but it's still falling. Capitalism just keep it's head above the water because of the third world were there is still growth to accomplish. In the west it's ineluctably falling:http://www.leftcommunism.org/IMG/jpg/Graph_3.jpg?1469656899\nStill I remain skeptic. Furthermore, as long as people want to buy something, everything is alright. If demand is so low that capitalism is not sustainable, then production costs are automatically also sufficiently low so it's not needed anymore.\n\n> Yes but it's very important that many people understand the dilemma, because if not, the 1% will still own the means of production, even if it cost nothing for them to produce. \nI'm not saying there isn't an issue atm. \n\n> This is somehow delusional. Capitalism doesn't care of what is right. Only to make profit. You'll have relocation, whether you like it or not.All of our current standard of living is based on the fact that chineese worker manufacture our daily items for wages 10 times lower than in the west.As i said before, the only way for no relocation to happen is if there were no countries with different legislation anymore. One world government of some sorts. However, most of the people don't want this, and i understand them. \n> I, for myself, don't like the concept of nations, because it was itself created by the capital, however, a world government is not the abolition of money and the state, but just one big capitalist and technocratic  super-state, and probably totalitarian (see Orwell or Aldous Huxley). \nYou can only relocate if the law permits it. It does today because of global trade being seen as something to be worshipped.\n\n> I'm skeptic about the basic income. Looks like Tittytainment from Zbrezinzky. Also basic income would put the beneficiaries of this basic income on the hand of the state which allows it. And since the state is in the hand of the capitalist class (owners of the mean of production), it'll put them in the hand of this capitalistic class. \n> It could also create a third class of people: the UBI people. \n> Workers have a strong leverage against the capitalistic class: general strike. \n> What leverage does basic income people have? None. If they don't behave, the state will just shut their UBI down. \n> The hand which gives is always above the hand which receives. \n> I won't fight the basic income. However, people should not be naive, and understand that there could be some bad side effects about this basic income. It could also create inflation, and increase housing prices and cost of living for the working class.  \n> There is also the problem of immigration. If you propose a basic income, everybody from countries were such  income doesn't exist, will try to come to countries were basic income exists.\n\nPretty easy to fix the issue of immigration. Only give it to citizens. \n\nIt's also unlikely a basic income will inflate prices. It doesn't put extra money into the economy. It merely relocates it. \n\nYou are completely right that the leaders of a country could theoretically freeze someone's income, so it's absolutely crucial democracy stays with the people.",
				"added": 1479428149
			},
			{
				"comment_id": 75,
				"body": "> [thisweb11](#comment_68_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Capitalism and regulation are antithetical.  They can and have never worked.\nSame can be said about your \"modern communism\".\n\n> Im afraid that wont work either. It just prolongs the problem. Nice idea - but its doomed in the long term. Heres why: https://thenextrecession.wordpress.com/2016/10/23/basic-income-too-basic-not-radical-enough/\nI never proposed it as a long term solution. As I said numerous times in this thread, capitalism will phase out itself sector by sector once production becomes cheap enough.\n\n> Agree. This is actually what a lot of rich do now already. It is the new economy. Landlords. Its a big problem in the uk . Owning land can cost nothing (or near nothing). There are car parks that require no labour, have no tarmac, just bare rubble, all over the UK where the owners charge extortionate sums, and the cost of producing the 'space' for cars to park is ZERO - thanks to internet they dont even have to pay for a ticket machine.\nI agree. I actually made a similar point to someone else earlier today. Renting your land isn't adding anything to the economy. It's just not being a dick by slowing the economy. It's a tought on the regulate though. \n\n> Capitalism can be controlled. By anarchists and socialists ( only in a limited way by socialists because it wants to hold onto the state, a hierarchy, and hierarchies all require some capital to hold power, and power needs more capital to sustain it once used) . Anarchy is what I am promoting. But you say you dont want it. How do you feel about socialism out of interest?\nDepends on how you define it. I'm in favour in socialism as the political ideology that puts the responsibility and the freedoms with the community as opposed to with the individual. This means the community pays for education, healthcare and other things, as opposed to the individual. The opposite of liberalism, basically.",
				"added": 1479429064
			},
			{
				"comment_id": 76,
				"body": "> [thisweb11](#comment_74_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): No, its parasitic, it sucks money from peoples pockets and creates extreme wealth and power.  (i dont care much about car parks, cars are a luxury and we should cut down on their use anyway, but housing, and profiteering from renting places to live, I think is one of the most parasitic, destructive, unethical and unequal forms of wealth accumulation possible.  It is the flagship example of perfect capitalism.  It doesnt help the economy for the people, only for the landlords.\n\nThat's the kind of capitalism I oppose though! Capitalism is about creating economic incentive to meet the demands of other people. By renting out car spaces or homes you are filling demands you yourself created (by having bought the property rights yourself instead of allowing someone else who is going to use it to buy it)! I oppose this kind of capitalism as it doesn't add any value.\n\nI see capitalism as needed though. It is a way to stimulate people to willingly create things that other people want, and it automatically assigns value to those things. How are you going to distribute goods fairly without capitalism? Once everything becomes virtually free to produce, sure, capitalism can be removed from that area. If we make a machine which harvests free tomatos at no cost, sure, some cooperative can buy such a machine and provide the population. Heck, the market could be nationalised.",
				"added": 1479506904
			},
			{
				"comment_id": 77,
				"body": "> [thisweb11](#comment_76_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Im not sure what you mean by modern communism.  I'm talking about anarchy.  Or anarchy-communism.   It has worked. As i said, for about 100,000 years.  It also works today. Anarchists are everywhere being and living as anarchists right now.  Its so good, it can just ignore capitalism.  Thats the beauty of it.  You dont have to wait for it.  Its not a system that needs to arrive or find approval from a leader,  its a way of living.  The only problem  is that others who suffer under capitalism dont realise the cause of their oppression.  Or that they can ignore it.   The capitalists make them live in fear.  Anarchists want that to stop.  The less oppressed people feel the more beutiful all our lives can be.  Anarchy is alive and well. The secret is to begin: http://www.crimethinc.com/tce/\n\nI do believe leadership is needed because some things are impractical to organise otherwise. Try to launch a rocket in a cooperative way. This is next to impossible. You cannot have thousands of people who build the rocket vote on every decision that has to be made. You have to do it in smaller groups and send representatives. There will be management involved as well.",
				"added": 1479507138
			},
			{
				"comment_id": 78,
				"body": "> [planespherev2](#comment_109_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): Yes, leadership is needed (today anyway, maybe not in the future), as in the primitive tribes, hunting chiefs were designated, but they should be dismissible at any moment. \n> Take the Debian organization. It's close to a worker council (revolutionary Catalonia 1937). It works without money (like shareholders in commercial companies) and without non-chosen hierarchy (in a commercial company, workers don't choose the CEO). \n> http://debiananwenderhandbuch.de/bilder/allgemein/debian-constitution.png\n> As you can see, the developers, who are volunteers, elect or recall the project leader. \n> Also in revolutionary Catalonia, production increased after the collectivization. Decisions were made through councils of ordinary citizens (check wikipedia, for once it's well documented). Those who wanted to keep their lands were allowed to, but only as much as they could use on their own. And they weren't allowed to use workers.It worked wonderfully and production even increased.\n> For a short time, in the 20th century, in Catalonia, humans lived for a few months as they were supposed to live. Until the Republic crushed them all.\n\nIronically enough I would oppose such a structure for not being democratic enough. Furthermore, this is just a representative demoracy.",
				"added": 1479511115
			},
			{
				"comment_id": 79,
				"body": "> [planespherev2](#comment_110_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): Not really a representative democracy since they can recall the project leader and override him. \n> Seems the project leader take the decisions, but if the developers don't agree, they can override him, or even recall him.  \n> The Debian project (i indirectly benefit from it since i use one of the forks of Debian) should inspire way more other organizations than it currently does. \n> This is a very technical project (OSes are  complex systems) but working in a very democratic way.\n\nI oppose electing single leaders because a single leader can never accurately represent the population it was chosen by. Instead a council of representatives aka a parliament can proportionally represent the people who they were voted in by without losing the benefit of a concentrated leadership. I guess in your structure, I'd see it as more democratic when the project secretary and technical comittee was elected and not the leader. \n\nI see a concentrated leadership as it happens today as a danger for the state, as giving one individual a lot of power can mean that one leader can also absuse a lot of power. What happens when the leader decides that he doesn't want to represent its electorate anymore, and refuses to step down? The community can only theoretically force him to step down, but typically a leader is very influential within an organisation, and the organisation might decide to follow the leader as opposed to the people who elect him. After all, they do work for the leader. This has happened too many times in the past as well.\n\nOf course, with Debian you can just create a fork, but this is not the case with everything. You could refuse goods to the cooperation / commune which is not respecting the people, but they could do the same in return and their goods might be more valuable than the things you can take from them. \n\nI don't see a structure like this resolving any issues compared to the structure we have today. In fact, I don't think this is much different from a regular representative democracy, although admitidly more democratic. I know quite some people who run bussiness in a similar way to this.",
				"added": 1479516600
			},
			{
				"comment_id": 80,
				"body": "> [planespherev2](#comment_111_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): In a traditional commercial company, it's the shareholders who have the power. It is them who decide to nominate or revoke the members of the boards of directors. \n> In a structure like Debian, it's the developers (thus the workers in a sense, however since they are volunteers they aren't really workers) who decide to nominate, or revoke the project leader. \n> So it's still an evolution from the traditional commercial company since it's the base of the pyramid, the majority,  which decide, not the owners of the capital.\n\nIn a cooperative, the workers are the shareholders.",
				"added": 1479598649
			},
			{
				"comment_id": 84,
				"body": "I take no issue with censorship. Censor all you want, it's your right. \n\nComparing development of the Linux kernel to launching a rocket is a bit unfair. Building a kernel is just a minor requirement for building a rocket, and something like a space mission needs a clear objective, while the Linux kernel does not.",
				"added": 1479774963
			},
			{
				"comment_id": 86,
				"body": "> [zeratax](#comment_4_1KWfi9GbSvnLzLM3QbLSBhvRRiB2aq5rjH): Since when is censoring a right. I guess you mean self censorship, but even that can be problematic if you're forced to do so. Free speech is a right, censoring would be the opposite, but lately the term has been misused a lot, for example when people compared youtube not giving adsense to controversial videos to censorship.Of course deleting comments from a forum is not censorship, you have the right to free speech, but nobody is required to give you a platform to do so. Zeronet and other decentralized systems are a platform from everyone for everyone for free speech\n\nI agree 100%, but I considered deleting people from your own platform as censorship.",
				"added": 1479854198
			},
			{
				"comment_id": 87,
				"body": "> [thisweb11](#comment_82_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Graffiti, is the closest i can see in terms of free speech, as the counteculture to big media and advertising.  Anyone can graffiti anywhere, even over others graffiti.  Yeh I know thats controversial , but i genuinely prefer to see graffiti over ads.\n\nI would advocate for banning graffiti and advertisements out of public space.",
				"added": 1479854247
			},
			{
				"comment_id": 88,
				"body": "> [planesphere](#comment_31_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C): By recognizing the right to suppress posts in platforms owned by a particular individual, you just recognized the right to private property. \n> Okay, right, i'm no bolshevik, if some want to have something only for themselves, and have absolute rights over it,  good for them, but i don't want to participate in it if i have the choice not to do so. \n> That's why we need to advocate more P2P platforms. Platforms which doesn't belong to anybody.\n>  Those who want to post on traditional  central servers platforms could do so, but in those central servers platforms, self-censorship (coming from fear of being banned) is always a problem. \n> Even here in Zerotalk Nofish has administrator rights. \n> The only forum systems which cannot be censored at all and that i use are Sone and FMS (in freenet).\n> \n> Exactly. That's why using P2P networks like Freenet or Zeronet are  small steps further to real democracy. Here no one own anything. We all own everything.\n\nI agree with P2P, but you need censorship. Not to get rid of others' opinions, but to get rid of stuff that doesn't belong. If I open a website about cats, I don't want random spammers to come talk about their religion or whatever.",
				"added": 1479859848
			},
			{
				"comment_id": 89,
				"body": "> [planesphere](#comment_32_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C): This doesn't really happen if you have humans (people interferring with your content). Thus strong (but simple like images or very simple logic tests) captchas could garantee that you have humans.\n> I only believe in local censorship, like  banning locally (on your install) an other person.\n> If there is a global censorship option, it must come from the majority, like in Sone or FMS in Freenet. In such system, you can ban locally (on your freenet install) as you like, but for someone to be globally banned, he must have a global review of less than -1 (between -100 and +100).To my knowledge, no one has ever been globally banned in Sone and FMS, and there is no spam.\n\nIt does happen when you have humans. Humans break rules, even in an anarchy. There should be a way to enforce some rules on certain platforms.\n\nTake YouTube for instance. It's supposed to be a kid-friendly website. You don't want people to upload porn there, and as such, it should be censored. If people do want to upload their porn, they can create their own platform and upload it there, or find a platform someone else already created.\n\nI don't think censorship will become as much of an issue if you have a P2P network like ZeroNet where everyone can create a platform and it is virtually impossible to censor one.",
				"added": 1479896724
			},
			{
				"comment_id": 90,
				"body": "If you don't like the idea of private ownership of a platform, you could allow for independent censoring communities. You can subscribe to one, and every post which is flagged within that community is hidden from you.\n\nIt'll be really hard to enforce non-private ownership of digital information though, unless you want to keep track of everything everyone does on the internet, which is a very dangerous thing to do and in direct violation of privacy.",
				"added": 1479896892
			},
			{
				"comment_id": 92,
				"body": "> [thisweb11](#comment_83_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): in place of what?  Grey paint?  White paint?  Who gets to decide what our world should be decorated with if not everyone?\n\nEveryone, but you shouldn't start spraying graffiti everywhere, or be poluting the scenery with ugly ads.",
				"added": 1479945292
			},
			{
				"comment_id": 93,
				"body": "> [thisweb11](#comment_84_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): how about Banksy?   That graffiti doesnt get banned.  Do you disapprove?\n\nI do.",
				"added": 1479945302
			},
			{
				"comment_id": 94,
				"body": "> [binero](#comment_93_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): I do.\n\nAs a disclaimer though, usually he has permissions.",
				"added": 1479945321
			},
			{
				"comment_id": 95,
				"body": "> [thisweb11](#comment_85_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): (and in  my view even worse than Brexit or Trump being elected)\n\nWhy would an anarchist be pro-EU?",
				"added": 1479945388
			},
			{
				"comment_id": 96,
				"body": "> [thisweb11](#comment_87_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Really?  Who gets to decide what's good art and what isn't?  How about architecture?\n\nI'm also in favour for strong regulations on architecture. The best way to create an ugly city is to let everyone build what they please.",
				"added": 1480030326
			},
			{
				"comment_id": 97,
				"body": "> [thisweb11](#comment_89_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): I didn't say I was.  And being an isolationist nationalist  isn’t anarchist either.  I prefer the second most worse option  in every election but my vote always goes to Nobody.  She's the best candidate by far.\n\nOut of interest, do you actually write that in?",
				"added": 1480030354
			},
			{
				"comment_id": 98,
				"body": "> [thisweb11](#comment_88_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): No, most of his work he does not.\n\nI was not aware, merely repeating what we got taught in art class. :)",
				"added": 1480030376
			},
			{
				"comment_id": 99,
				"body": "> [thisweb11](#comment_87_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Really?  Who gets to decide what's good art and what isn't?  How about architecture?\n\nWe all get to decide. That's what the local/city parliament is for.",
				"added": 1480030445
			},
			{
				"comment_id": 100,
				"body": "> [thisweb11](#comment_93_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): I don't vote. It only encourages them. No matter who you vote for the govnt always gets in.\n\nIf you really want Anarchy, it'll have to come through government.",
				"added": 1480033771
			},
			{
				"comment_id": 101,
				"body": "> [thisweb11](#comment_94_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Disagree.\n\nWould you argue modern day cities look good? It's way better when it's uniform, with only changing details for contrast, like it used to be.",
				"added": 1480033982
			},
			{
				"comment_id": 102,
				"body": "> [thisweb11](#comment_96_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Did you?  What did you say when asked?  Representative democracy can't decide for you what art you  like however much you wish it could!\n\nIt can't decide it, it can represent it. Either way, it doesn't matter so mmuch which design to go with, just that there is one.",
				"added": 1480034616
			},
			{
				"comment_id": 103,
				"body": "> [thisweb11](#comment_97_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Thats a contradiction.  It wont happen that way.   Anarchy is already everywhere. The govnt doesnt have a clue what it is.\n\nAs long as the government doesn't represent you, they have no reason to listen to you.",
				"added": 1480034655
			},
			{
				"comment_id": 104,
				"body": "> [thisweb11](#comment_99_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): No.   It cant represent art.  That's the point of art, it IS the representation.      Its like sending a representative to play a game of chess for you.\n\nYou can send someone to play chess for you. I'm also not a fan om meaningless metaphores. Art can be represented. Furthermore, those things could be decided using a referendum, like the flag of New Zealand. In any case, I would be happy with just *a* standard, like how it used to be. There needs to be uniformity.",
				"added": 1480035066
			},
			{
				"comment_id": 105,
				"body": "> [thisweb11](#comment_102_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Yeh you could, my point is why would you? The only reason to play is for personal pleasure.   Do you ask people to represent you at dinner parties too?\n\nIf only I could. If only I could.",
				"added": 1480035606
			},
			{
				"comment_id": 106,
				"body": "> [thisweb11](#comment_101_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Um, thats direct democracy. Not representative democracy. But thanks for making my point.\n\nAs I said before, I do support _some_ form of direct democracy. I don't think it's always ideal though. For instance, a recent poll showed that 60% of Finnish people and 48% of British people would support an authoritarian leadership.",
				"added": 1480035737
			},
			{
				"comment_id": 107,
				"body": "> [thisweb11](#comment_102_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): I think asking a representive to decide what kind of art you like  is more akin to asking a someone to decide who you should vote for.\n\nMost people aren't that picky as you, I'm guessing.",
				"added": 1480035909
			},
			{
				"comment_id": 108,
				"body": "> [thisweb11](#comment_103_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Hah! well yeh ok,   l've been there.      My point: People need to make their own decisions or the whole world becomes a representation of whoever  has the balls to seize power and subdue.\n\nIt's hard to grab power in a parliament. You'd need a massive conspiracy.",
				"added": 1480035947
			},
			{
				"comment_id": 109,
				"body": "> [thisweb11](#comment_105_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): You are.  You dont like banksy.  Most of his works are now protected by the state.\n\nNever said I don't like him. I said he shouldn't spray without approval. Furthermore, I don't like paintings in the public area as a whole.",
				"added": 1480036292
			},
			{
				"comment_id": 110,
				"body": "> [thisweb11](#comment_107_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): But I dont like concrete.   So whos right?\n\nEven plain concrete would look better than a mess of a billion different styles.",
				"added": 1480036662
			},
			{
				"comment_id": 111,
				"body": "> [thisweb11](#comment_108_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Maybe you should think long and hard about  what you would really like to see, what would give you pleasure,  and just go and do it yourself, rather than passively wait to be told what your having to look at.\n\nI'm not going to build a city.",
				"added": 1480036676
			},
			{
				"comment_id": 112,
				"body": "> [thisweb11](#comment_106_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Anarchists dont want to grab govntl power !  Thats not anacrhism!\n\nRead in context! You said representative democracies can be easily seized.",
				"added": 1480036737
			},
			{
				"comment_id": 113,
				"body": "> [thisweb11](#comment_110_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Well thats why you end up with the mess you have.  Polluted, ugly, corporate, financial concrete machines almost entirely devoid of human imagination and joy.\n\nThe problem is they use imagination, but everyone differently. You get a series of buildings which individually look reaaly good, but as a whole looks really bad.",
				"added": 1480038010
			},
			{
				"comment_id": 114,
				"body": "> [thisweb11](#comment_112_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Approval from who?   What if the council approve graffiti (as they do with banksy - implicitly by not removing them - now he brings in tourist money)?\n\nThen it'd be fine.",
				"added": 1480038047
			},
			{
				"comment_id": 115,
				"body": "> [thisweb11](#comment_111_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): No I didnt.  I was talking about  those already in power! When you let them they will abuse it.\n\nAn individual member of parliament holds very little power. Just make sure they cannot be rewarded externally, and you're all set.",
				"added": 1480038122
			},
			{
				"comment_id": 116,
				"body": "> [thisweb11](#comment_114_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Then why are you so bothered about graffiti?  If you dont actually care of the final outcome .\n\nI realise my opinion isn't the only one.",
				"added": 1480038452
			},
			{
				"comment_id": 117,
				"body": "> [thisweb11](#comment_115_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): No, I think individuals in parliament can hold a hell of a lot of power.  Tony Blair for example.  Or Theresa Unelected May Brexit means Brexit.\n\nBecause the UK is a very unrepresentative democracy, and doesn't even respect seperation of powers.",
				"added": 1480038514
			},
			{
				"comment_id": 118,
				"body": "> [thisweb11](#comment_117_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): great thats anarchy!\n\nThat's democracy.",
				"added": 1480194806
			},
			{
				"comment_id": 119,
				"body": "> [planespherev3](#comment_1_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Representative democracy isn't democracy (direct democracy is the only real democracy). So i can't even begin to contemplate what an unrepresentative representative democracy is.\n\nRepresentative democracy is, how I see it, the only practical form of democracy. You cannot have a referendum on everything",
				"added": 1480204430
			},
			{
				"comment_id": 120,
				"body": "> [planespherev3](#comment_2_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): If you want to have something \"practical\" (before you should ask Switzerland how they do to vote 2 times a month), then take an interest in liquid democracy (aka delegative democracy). Far better then representative democracy.\n\nI kid you not, but I never knew such a system had been thought out. I have been wondering for years why that's not how we do it. I've been calling it proxy-voting. I would 100% support such a system.",
				"added": 1480295047
			},
			{
				"comment_id": 121,
				"body": "> [thenineswords](#comment_2_1KdH7Rbk9viJxmJ3SApQR6ZpB8iYAN35gR): cant even scroll down\n\nThe posts are still here?",
				"added": 1480295178
			},
			{
				"comment_id": 123,
				"body": "> [planespherev3](#comment_3_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Yes liquid democracy is not popular enough even if it is a more \"democratic\" system. The mainstream medias don't talk about it at all.\n\nI would understand why. It's not relevant atm.",
				"added": 1480367362
			},
			{
				"comment_id": 124,
				"body": "> [planespherev3](#comment_4_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): I think it's because the republic, and representative democracy, is the cherished system of the Capital. The capital really took off when republics were instigated in western europa. Today, almost every developed country has a republic as a political system. The reason for it is because it's easier to buy 500 representatives (in a parliament) than a king, a dictator (who are all-powerful) or all the citizens (in this last case,  if the political system is a direct democracy). We know that there is a lot of conflict of interests in the EU institutions, especially in the EU commission and the EU parliament. For us citizens conflicts of interest are a problem, but the capital like them. He is the one buying representatives. \n> I think the future of the capital (if we don't stop the process one way or another) is not even a republic anymore, but a pure technocracy. Like the European commission which has law initiative in the EU but isn't elected.\n> Liquid democracy would mean more democracy (although for me there is democracy or there isn't, but i can accept that liquid democracy is somehow better than representative democracy but not as good as direct democracy).\n> Thus, more democracy isn't in the Capital best interest. The Capital would like a pure technocracy (which isn't a democracy at all) better.  That's why mainstream medias, which are owned by the capitalistic class, don't talk about liquid democracy.\n\nI've had so much discussions already on how the Commission actually works. In essence, it works for the parliament and for the council. If it doesn't do its job, it can be gotten rid of. I don't think the issue lies with the fact the comission isn't directly elected but rather that the Parliament actually needs to demand the comission to propose laws. I don't think the Comission should be the middle man here. It's still a lot better than pre-Lisbon however, as now at least the parliament can demand proposals. \n\nI don't think the issue is because the capital owns the media. I think the issue lies with the people. Who honestly cares about what type of democracy we have? A lot of people if not most people do not. A significant portion of people here do not know who won the election, even though they voted! We do not have an absurd system here where you can buy advertisements. Political candidates, their parties and anyone supporting them is prohibited from advertising. All exposure the candidates get is from policy proposals. Even so, people still don't care. \n\nNot everyone cares, and that's why I'm a supporter of your 'liquid' democracy, as in such a system everyone is allowed to care, but not everyone has to.",
				"added": 1480409232
			},
			{
				"comment_id": 125,
				"body": "> [thisweb11](#comment_121_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): The state opposes democracy. Corporations oppose democracy. The media opposes democracy. So they invented representational democracy. And now the people oppose democracy too. Democracy was portrayed as something for bomb throwing violent 'anarchists (tm)' . Direct (or delegated) democracy can happen only in anarchist societies. And no capitalist system would even allow the people to contemplate it. Like Osama Bin Laden, if socialism didn't exist capitalism would have to invent it. They need to frame every system around the idea of a state. They need an opposition that frames society around a state to bolster and reinforce the idea in publics mind that representational democracy is the only system possible. 'The enemy , even dictators sell the same idea - that all society must be run by state representatives'\n\nEh? Socialists and communists alike are both in our federal and local parliaments, and our country has been run by socialists for decades until the populists finally took over this legislature.\n\nI don't oppose a state. It organises, it provides logistics. Again, I don't see direct democracy working on any larger scale than a village.",
				"added": 1480460416
			},
			{
				"comment_id": 126,
				"body": "> [planespherev3](#comment_5_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): If they want money, if they want a state, they are not communists, but state capitalists. In my country, there is not a single political party which propose the abolition of money and the state.\nThey're for public ownership, like the definition.\n> Have you heard about revolutionary Catalonia (1937, before it was crushed by the republic)?\nYes. It was ironically a very unjust rule, killing thousands, and above all, still had a state with ministers.",
				"added": 1480461954
			},
			{
				"comment_id": 127,
				"body": "> [thisweb11](#comment_123_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): No they arent .  Thats simply not possible.  Google the word communist (its true definition).  It opposes the state.  Just like democracy can't exist under a state.  Neither can Communism.  But the capitalists will tell you anything to make you believe all systems are derived from the state.  (they even think anarcho-capitalism is a thing - its like being a christian atheist - its nonsensical.)\n\nNot really. Socialism is a political system while communism is an economic one. They only relate in the way that a communism is the economic system modelled after socialism.",
				"added": 1480538536
			},
			{
				"comment_id": 128,
				"body": "> [thisweb11](#comment_122_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): my point is if you want liquid democracy , or direct democracy you cant have capitalism, because capitalism needs the state.  No statist society can have liquid democracy. .  The 2 simply cannot coexist.\n\nNo reason they couldn't exist together. You're asserting things.",
				"added": 1480538564
			},
			{
				"comment_id": 129,
				"body": "> [planespherev3](#comment_6_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): So you haven't really read about it, or you mistake the anarchists with the communists during revolutionary Catalonia.\n> I'll copy past  wikipedia, about the workers self management during revolutionary Catalonia:\n> https://en.wikipedia.org/wiki/Revolutionary_Catalonia#1936_Revolution_and_worker.27s_self_management\n>  \"Anarchic communes often produced more than before the collectivization. The newly liberated zones worked on entirely libertarian principles; decisions were made through councils of ordinary citizens without any sort of bureaucracy. \"\n> (...)\n> \"If you didn't want to join the collective you were given some land but only as much as you could work yourself. You were not allowed to employ workers. Not only production was affected, distribution was on the basis of what people needed. In many areas money was abolished. People come to the collective store (often churches which had been turned into warehouses) and got what was available. If there were shortages rationing would be introduced to ensure that everyone got their fair share. But it was usually the case that increased production under the new system eliminated shortages.\"\n\nRegardless, I cannot have confidence in it just because it worked for a couple of years. Such a system sounds very unrobust, with a tendency to collapse into a state again. It also seems like no everyone agreed with the lack of a state either.",
				"added": 1480539039
			},
			{
				"comment_id": 130,
				"body": "> [planespherev3](#comment_7_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Regardless, I can have confidence in it just because it worked for 148000 years.\n\nDid it though? Seems to me we live in organised states now.",
				"added": 1480540723
			},
			{
				"comment_id": 131,
				"body": "> [planespherev3](#comment_8_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): The state is a concentration camp. \n> Just a few years ago, when an ancom wrote this in a forum, i got really upset.\n> But when you think about it, and when you understand that the capital needs a state in order to enforce debt, collect taxes, and manage money (with the use of coercion), then you realize it makes sense.\n\nDebt can be privately enforced. Taxes are not unique to capitalism. Money can be independantly organised. We choose the state as clearly the state works best.",
				"added": 1480547484
			},
			{
				"comment_id": 132,
				"body": "> [planespherev3](#comment_9_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Like cages work better for animals: they have a longer longevity and a lower death rate than in the wild.\n\nYes. Consider me pro-cage.",
				"added": 1480620748
			},
			{
				"comment_id": 133,
				"body": "> [thisweb11](#comment_127_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): how do you enforce debt. And how do you decide who owes who what?  What is a human worth if they cant pay?\n\nA bussiness could simply hire someone to enforce the debt. This is what you typically would see in failing states where the government has no interest in or is incapable of enforcing the laws.",
				"added": 1480782240
			},
			{
				"comment_id": 134,
				"body": "> [planespherev3](#comment_15_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Later he did other videos on youtube.He explained everything about the distinction between Bolchevism (Leninism, Trotstkyism), Stalinism, which were based on state coercion,  and radical marxism (which is anarcho-communism). \n\nThis was part of our high school curriculum. Still, no one was convinced.",
				"added": 1480782304
			},
			{
				"comment_id": 135,
				"body": "> [planespherev3](#comment_16_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Maybe your school teacher had the charisma of a lizard in a nappy compared to Francis Cousin. You're Swiss aren't you? (i guessed..., or maybe Scandinavian...) Anyway if you speak french take a look.\n\nI am not Swiss nor Scandinavian, but I do speak a bit of French. I actually had to learn it twice as I had a second sit in the same year, and I had two different teachers as a result. The teachers were not charasmatic if by that you mean convincing. That's not what they did. They went over different movements that existed. Teachers _have_ to stay neutral on anything that even remotely touches politics, but she clearly prefered anything on the socialism side over anything on the 100% free market side. We talked about the difference between conservatism, liberalism and socialism, and in context of the 20th century dug deeper into the different movements within socialism including social democracy, Marxism, Bolchevism and Stalinism. We even addressed the anarchy that's supposed to follow Marxism. \n\nIn case you were wondering, I am Belgian.",
				"added": 1480802170
			},
			{
				"comment_id": 136,
				"body": "> [dud](#comment_8_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG): How do your determine a labour's worth? I know Karl Marx said that, I did read the manifesto. But the very idea that a labour has any word, at all, is stupid. The product of the labour has worth, the labour itself is nothing. I am currently typing an argument on my keyboard, which could be called \"labour\", does it have any worth? If it does, then the capitalist model in today's world would work very well to recompensated my arguments. Things like flattr permit to recompensate nearly everything one has done, and this model will soon move to cryptocurrencies, I believe. \n> Capitalists do not exploit others labour, they recompensate other for the production of a product that is not their original idea. Capitalism recompensate ideas, and those who help them achieve their ideas. If it was \"exploitation\", then you likely wouldn't be paid. Marx called the product of a labour \"labour-power\", and that it was the item they were selling. They are not selling anything at all, they're helping the capitalist (Industrial owner, if you didn't get it) product items. In today's society, this could include selling those items, shipping them, because the industries need money to function, money being a representation of their buying power. And they get recompensated for it.\n> If labour had any value at all, then all labour would be equally recompensated, but what constitute labour and what doesn't couldn't be determined by Marx, and all Marx has achieved with his opposition to capital was the creation  of totalitarian states, which realized that money was necessary to represent the value of one's work and kept using money.\n> Don't try to tell me I'm oppressed by working, I am not. I am a working class person and I don't think there's any wrong with that.\n\nA worker is exploited when the return they get on their labour is worth less than the product they produced. Why should one guy at the top benefit from all the profit? Most of the work is done by the employees.",
				"added": 1480809768
			},
			{
				"comment_id": 138,
				"body": "> [dud](#comment_11_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG): But how do you determine the value of a labour? That's the main question.\n\nI would do it using the capitalist way. Labour is worth what the results are worth. I would however recognise that often people aren't paid what their labour is worth, and I would try to solve that. I would also recognise that humans aren't worth what their labour are worth, and distribute wealth more evenly without doing away with the capitalist incentive. ",
				"added": 1480855292
			},
			{
				"comment_id": 139,
				"body": "> [thisweb11](#comment_144_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): It makes it almost impossible to talk about communism and anarchy as ideas with specific values and understandings without having people wonder where you hide your Hitler moustache and Stalin boots..\n\nThe only people I know who think like that about communism are American and don't care about anything political to the slightest.",
				"added": 1480896841
			},
			{
				"comment_id": 140,
				"body": "> [thisweb11](#comment_146_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): What with guns?  Battons?\n> Yeh thats the problem.  Anarchists oppose that.\n\nThat's why you have a state with a monopoly on violance.",
				"added": 1480898625
			},
			{
				"comment_id": 141,
				"body": "> [thisweb11](#comment_147_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Money is backed by guns.  When I say money, I mean coinage.  Eg the Dollar $ .  Coins were invented to pay the army.  If you don't pay a debt with the correct currency (which you MUST earn) you will be hurt with violence.  This is aas true today as its always been.  I call this Structural Violence.  If you always pay, you dont see violence, but the reason you pay, ultimately is because you will be subject to violence.  Try it.  See what happens when  you dont pay your restaurant bill, or your mortgage using the 'army approved' currency of the nation you live.\n\nBogus. If you don't pay your debt, you won't see any violance.",
				"added": 1480898703
			},
			{
				"comment_id": 142,
				"body": "> [thisweb11](#comment_152_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Through love.\n\nThat's not an answer.",
				"added": 1480900995
			},
			{
				"comment_id": 143,
				"body": "> [thisweb11](#comment_156_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): I dont care who does the violence, I just want it to stop.  Private violence is no better than state violence.\n\nWho prevents people from comitting violance in an anarchy? If the answer is people who commit violance, then what is the point.",
				"added": 1480902420
			},
			{
				"comment_id": 144,
				"body": "> [thisweb11](#comment_157_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Bogus?  Tell that to people on the streets who are dragged out on the street during a foreclosure in the US or UK. OIr most countries in the world.\n\nYou proved my point. Most.",
				"added": 1480902433
			},
			{
				"comment_id": 145,
				"body": "> [thisweb11](#comment_154_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Thats the Anarchist answer to ' But how do you determine the value of a labour? That's the main question.'\n> Human beings are priceless.    To pretend otherwise is as rediculous as when white european men told  American indians they now owned the land on which they stood.  'Suuuure' they said, in the way you might tell your child you believe in their imaginary friend.  I mean how can you own the earth? .   Its only when  the guns came out that they realised they were truly insane.\n\nHumans aren't worth their labour. How do you determine the value of their labour? Is it worthless to you?",
				"added": 1480902492
			},
			{
				"comment_id": 146,
				"body": "> [thisweb11](#comment_158_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): I recommend you watch a film called 99 homes.\n\nI don't watch films. At all. I also nicely cited you our legislation on debt.",
				"added": 1480902534
			},
			{
				"comment_id": 147,
				"body": "> [thisweb11](#comment_153_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Are you a capitalist or a socialist.  I mean this is NOT the capitalist way, but the socialist way.  Capitalist way is to threaten lower pay and violence.  Not incentivise for the food of mankind.\n\nYou don't seem to use the American definition of socialism. Socialism isn't a contradiction to capitalism. Capitalism is an economic model, socialism is a political one. Socialism is about the community, capitalism is about private ownership of the production, and a free market. You can have private ownership and a free-ish market and still make community oriented policies.",
				"added": 1480902700
			},
			{
				"comment_id": 150,
				"body": "> [thisweb11](#comment_159_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): You walk away or fight back.  Not the same as actively perusing people for power over them to exploit.  This has been described as rose theory and various other things, and discussed at length by anarchists . But the simplist way I can explain this is by looking at any other animal on earth.    No animal hunts down more than they need, and no animal actively goes seeking other animals or their territory to destroy it just for the sake of destruction.  Aphids are exploited by ants , but at no point does the aphid feel threatened or aware of this.  But mammals simply dont exploit this way.  Nor do even great apes. And nor do humans EXCEPT in the last 5000 years because we have been so oppressed by a few psycopaths.  Other mammals will be around long after we have wiped ourselves out because of this catastrophic psychological mutation..\n\nIf violance is the answer to prevent violance, just organise it.",
				"added": 1480903404
			},
			{
				"comment_id": 151,
				"body": "> [thisweb11](#comment_160_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): I dont understand. Sorry?  We agree?\n\nBy admitting that that's not always and everywhere the case, you also admitted anarchy isn't needed at all.",
				"added": 1480905618
			},
			{
				"comment_id": 152,
				"body": "> [thisweb11](#comment_163_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Hmm.  But violence isnt the only answer and it never has been under any system.  Organised expression of thought is one of the greatest forces for change.  As you well know.  Its why you reply.\n\nWe're not talking about violance to start a revolution. We're talking about violance comitted out of evilness. Regardless of how utopian a society is, there will always be violance comitted. There needs to be a way to stop this violance. If the way to stop this violance is with more violance, as it has been in every system, then why not just organise and monopolise the violance?",
				"added": 1480905707
			},
			{
				"comment_id": 153,
				"body": "> [thisweb11](#comment_162_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Socialism you describe is neo-liberal capitalism.  As opposed to hard line capitalism.    I agree you can have countries that have more socialist elemnts than others even under capitalism, but they are both still all political.   Economics is purely a capitalist invention.  As it is entirely framed around  money.  GDP etc.\n\nSaying capitalism is political is just being intellectually dishonest. You can implement capitalism under any form of political system, be it a totallitarian dictatorship or a direct democracy, be it a far rigth nationalist state or a far left socialist state.",
				"added": 1480905811
			},
			{
				"comment_id": 154,
				"body": "> [planespherev3](#comment_22_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Labor isn't supposed to exist. Also, value isn't supposed to exist. These concepts only exist since the neolithic revolution (12000 BCE).\n\nThey only exist literally since the dawn of civilization?",
				"added": 1480973919
			},
			{
				"comment_id": 155,
				"body": "> [planespherev3](#comment_24_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): You have it upside down. You don't implement capitalism. Capitalism is the whole of the world today. You don't implement capitalism under any form of political system, but you implement any form of political system under capitalism. \n> The capitalism mode of production is the foundation of our world, and all the political systems are just different flavors, but they are all capitalistic.\n> Nazism, Bolchevism, liberalism, socialism, Maoism, Castrism (Fidel Castro), Even north Korea is state capitalist.\n\nYou do implement capitalism. There cannot be private property unless a state enforces it.",
				"added": 1480973944
			},
			{
				"comment_id": 156,
				"body": "> [planespherev3](#comment_23_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): In the primitive tribe the response to such acts of violances are immanent. The responsible is shunned or if he pursue, perhaps banned.\n> Since it's not possible for a 7 billion humans tribe to be immanent, violence should be exerted by citizens randomly drawed, or elected through direct democracy.\n> In a non capitalistic society, evilness should considerably decrease anyway. There would be no reason to steal anymore.As for rape, most rapist today are social misfits, so they would also disappear in a non monetary world.\n\nWhat's the difference with what we have today? The only difference is the monopoly of violance is held in an organised structure.",
				"added": 1480973991
			},
			{
				"comment_id": 157,
				"body": "> [planespherev3](#comment_25_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Today, the cops are not here to defend the people, but the system. (The sub-prime example summarize it).\n> They are paid, they are given wages, so the system can function. \n> When there were the firsts agrarian stocks, it was also the beginning of theft. Before, there was no theft, since there was no stock. Everything was consume directly from nature. When humans begin to stock, necessarily, theft came. So the first owners of these stocks (first owners of the means of production) paid some people in order to defend the stocks. The police was born. The police is born from private property. They are a consequence of private property, and their reason of being is private property.\n\nThere will always be stock to steal from, whether there is private property or not. The police aren't paid to protect the system, they are hired to enforce the law made by the people.",
				"added": 1481012162
			},
			{
				"comment_id": 158,
				"body": "> [planespherev3](#comment_26_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Always, certainly not. If we live in a world post scarcity, and scarcity mostly reside in our minds, then i don't see the point of theft.\nIronic how you call a word without any stock one without scarcity. \n\n> So the system says. \n> In the end, people participate in their own imprisonment. And that what direct democracy will be in the future: prisoners of the capital, managing their own prison. However, it is a necessary step in order to finally go back to real anarchy again, in a far future.\nYou didn't make any argument for anarchy but just evaded the entire point. If the police enforces the law by the people, and people will always make these laws regardless of the political system (as you clearly impleid with \"people will participate in their own imprisonment\"), then anarchy is not an issue but a problem.\n\nIt seems like you are more concerned with changing human nature than actually implementing anarchy. Direct democracy, sure, but direct democracy can be done in a state. Most recent public votes have not turned out well. It's what kept prison slavery in the US, got the UK to Brexit and started a movement to ban abortion in the EU. I'm a mild supporter of direct democracy, as I said, but one has to wonder, do we really want to trust people with such a powerful tool when it seems they are more moved by emotion than facts.",
				"added": 1481063049
			},
			{
				"comment_id": 160,
				"body": "> [planespherev3](#comment_30_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): It's about inertia. You don't change someone in a day, and you don't change a society in a year. It will take decades, possibly even more. Of course it's only possible since the horizontal society made possible by the internet. \nWho says anarchism won't just die out? \n> I trust the people more than our representatives.\nYet it's the people who want to limit other people their freedom.",
				"added": 1481150250
			},
			{
				"comment_id": 161,
				"body": "> [thisweb11](#comment_164_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Ok.  But WHO gets to monopolise? Its not violence itself that concerns me so much as its monopolization by a few powerful people (how gain their power through capitalism granted by peopple) .  Nature is violent, psycopaths are violent. Thats life.   Its structural, powerful, oganised, heirachical, unjustified calculated violence that I oppose.  I accept I can be eaten by tigers, snakes and/or psycos .  Not by my peers who organise against me.  As you do with your capitalist support. \n> Representative democracy is brutalisation against the people by the people for the people.\n\nWith an organised monopoly you are prevented from being attacked by the tiger. The owner of the monopoly is you and your peers, so if it turns against you, it just means that's how your peers wanted it to be.",
				"added": 1481150332
			},
			{
				"comment_id": 162,
				"body": "> [planespherev3](#comment_35_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Because it's written in your DNA.\nIf you'd ask most other people they'd claim the opposite. Organised structures is what's in our DNA. \n\nThe state has brought humans to their greatest successes.",
				"added": 1481227093
			},
			{
				"comment_id": 163,
				"body": "> [planespherev3](#comment_44_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): longevity of 70 years contrary to the common belief\n\nIf you ignore all the people who die young, sure. Livespan in Medieval times wasn't very good, and death was part of the culture. (memento mori etc)",
				"added": 1481411522
			},
			{
				"comment_id": 164,
				"body": "> [planespherev3](#comment_44_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): What fucking up the planet and making humans killing hundred of millions of other humans? That the greatest successes? \n> If i had the choice, i would prefer to live before the neolotic revolution (primitive communism), or in the middle age (during feudalism), which wasn't so bad when you study it just a little (direct democracy in the cities during this era, longevity of 70 years contrary to the common belief,  and single women could work and even be healer or crusaders,  but nobody talk about it...).\n\nGood for you. Most people like the internet. You seem to like it too.\n\nWe're living in the most peaceful time in human history. The only reason so much more people are dieing is because there is so much more people. I also do not give a single bit about our planet. If we need to destroy it to advance as a species, go for it. That doesn't mean we shouldn't protect it. We need to fight climate change to help ourselves, not to help the planet.",
				"added": 1481411667
			},
			{
				"comment_id": 165,
				"body": "> [planespherev3](#comment_43_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): What the state and  money are in our DNA? \n> Binero, have you watched (serious) documentaries about the primitives societies? Are they organized structure? Not really.\n\nThey all phased out. Time and time again. Structure is in our DNA. Organisation is in our DNA. The state is just a logical expression.",
				"added": 1481411784
			},
			{
				"comment_id": 166,
				"body": "> [thisweb11](#comment_178_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): If the police are beating up a young girl do you interfere or trust they are doing their job correctly?  By law you must not interfere.  What do you say to that?\n\nBy law I am allowed to interfere, because the police are breaking the law. I would be allowed to save the person.\n\n> If the state says the law is that all black people must use seperate bathrooms what do you say to that?  If you believe the state is just. Then you believe in nothing yourself. You CANNOT act according to your conscience.  Indeeed that is what the state is for to prevent you dong that.  Ande thats why you vote for a president/leader/prime minister - the man/woman who will tell the people they must act according to the state  conscience and not their own.  \n\nYou do not need a state for racism. If a democratic state is racist, then that just means the people are. Anarchy won't help here. Even in anarchy you cannot act to yoru own conscience, you're always bound to the people around you. The democratic state just brings that to a bigger level.\n\n> Its not that anarchy is the best sytem, or that it would even work that matters.  Its that its the only one we can try with a clear conscience.  We should, with love, give every person a real chance to think and act according to their conscience.  Who knows what promises we might choose to make to each other when we are truly free?\n\nEven in anarchy we are truely free. If you do something the others don't agree with your will get lynched in a state and in an anarchy.",
				"added": 1481412007
			},
			{
				"comment_id": 167,
				"body": "> [planespherev3](#comment_48_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): In the middle age, people ate about 600 grams of meat each day (i'm vegetarian but just to prove they weren't starving or eating hard bread everyday like we are supposed to think). What's more, and that's interesting, they drank 3 liters of wine every day. Hard to believe but it's the truth.\n\nSource? I can only find sources which say in Medieval times, most people did not get to eat a lot of meat. Furthermore, drinking wine makes sense. Humans have evolved to be able to consume alcohol relatively safely compared to other animals. Putting it in the water kills the germs.",
				"added": 1481494059
			},
			{
				"comment_id": 168,
				"body": "> [planespherev3](#comment_49_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Internet is the tool that was needed to realize anarchy again. It' an horizontal media. The first since verbal speaking in the primitive tribe. The one to connect each humans without any intermediaries. \n> What's more, it's only rumors, but i read that Arpanet was designed by anarchists. For the benefit of the US government, of course, but possibly by people who knew from the beginning what it was and what it could accomplish once in the hand of the people.\n\nThere was no internet in primitive tribes, and there would have never been any.",
				"added": 1481494104
			},
			{
				"comment_id": 169,
				"body": "> [thisweb11](#comment_191_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): how will you be able to judge without all the facts? more to the point WHO are you to judge?  The cops are the law enforcers you MUST trust them,  according to law.  To interfere with a police officer is a criminal offence even if you think the cop is breaking the law.  That is the point of police.   That's what distinguishes them from anarchists. Your public responsibly MUST not interfere with police state work. \nFalse. Furthermore, no one here is advocating for a police state. \n\n> Anarchy is anti racist.  It will help. \nIt is not. With anarchy there is no protection against racism.\n\n> No anarchists dont lynch people.  People must choose anarchy. This is your mistake. Solidirity leads to anarchy.  Theres no need to lynch.\nThere is never any need to lynch. People do it anyway, at least, they used to do it anyway. Luckily in the modern democracy it's a rarety.",
				"added": 1481494212
			},
			{
				"comment_id": 170,
				"body": "> [thisweb11](#comment_193_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): https://www.psychologytoday.com/blog/freedom-learn/201611/instead-job-creation-how-about-less-workThis is not an anarchist site.  But the philosophy of play that it promotes is anarchist.   Less work. Less Jobs. Not more.   Can any capitalist really look at their job and disagree with the idea, I mean practically, not ideologically.  Work is disapearing whether we like it or not  -  because of automation.  Its insane to create ever more bullshit meaningless jobs we don't need just to give things for people to do.  We need radical rethink.  You dont have to be an anarchist to see this (as this article shows)\n\nI am for collective ownership of the means of production in the long term. As I said before, I think this will naturaly evolve when production becomes cheaper, and thus harder to turn into a profit.",
				"added": 1481494309
			},
			{
				"comment_id": 173,
				"body": "> [planespherev3](#comment_52_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): This is not mainstream but they potentially  can access far greater networks than the internet with Ayahuasca.\n> I am not sure if it's true (i didn't try), but i tend to think it's real.\nIt's hillarious to even suggest that a hallucigenic could somehow replace the internet.",
				"added": 1481640106
			},
			{
				"comment_id": 174,
				"body": "> [planespherev3](#comment_51_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): http://medieval.mrugala.net/Alimentation/\n\nThe highest number I can find on that page is 70 grammes per day, which is barely a tenth of your claim, and still under the average today.",
				"added": 1481640441
			},
			{
				"comment_id": 175,
				"body": "> [planespherev3](#comment_55_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): So you still need to improve your french: in this same page: \"En 1397, à Berlin, on mange 1,3 kg de viande/j.\"  /j means: per day.\n> Also, in case this last figure is somehow wrong: \"En 1307, à Francfort sur Oder, on mange 100 kg de viande de boeuf/h/an.\"\n> 100 kg of beef meat per year is a little less than 300 grams of beef per day, and beef only. They also ate other meat, mostly pork.\n\nI dismissed the 1kg/jour because quite frankly even if you wanted to you cannot consume that much meat on a day. \n\nI overlooked the 100kg/j which tbh I still cannot believe since this is the only page making such a rediculous claim.",
				"added": 1481645190
			},
			{
				"comment_id": 176,
				"body": "> [planespherev3](#comment_56_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): I don't know, maybe you should try and then you'll give an other answer.\n\nAnecdotal evidence is invalid evidence. Even if I would make such a claim, that wouldn't make it true and it would likely have to do with the fact it's, again, a hallucigenic. That's like saying God is real because you saw him while you were on LSD.",
				"added": 1481645295
			},
			{
				"comment_id": 177,
				"body": "> [planespherev3](#comment_57_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): The fact that most people experiencing it begin to believe in non material things is itself intriguing, from a \"rational\" point of view. Even some hardcore scientists doing researchs about it totally changed their mind and their conception of reality after experiencing it. But you're right, it doesn't \"prove\" anything.\n\nYou're right. Let's change the world with magic.",
				"added": 1481743303
			},
			{
				"comment_id": 178,
				"body": "> [planespherev3](#comment_59_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Magic is just science we don't understand.\n\nAnd science we don't understand is useless.",
				"added": 1481751685
			},
			{
				"comment_id": 179,
				"body": "> [planespherev3](#comment_61_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Not necessarily. Take into consideration LENR. Mainstream scientist don't understand, but it could be very useful.\n\nWe do understand it and so far it's useless.",
				"added": 1481835928
			},
			{
				"comment_id": 180,
				"body": "> [thisweb11](#comment_194_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Interfere with a cop in my country you get arrested.  But honestly I dont believe there is a single country on earth including belgium where this isn't true.  And possibly one of the most harshly punished offences.  Just like perjury \n> \n> Erm, except anarchists being anarchists under anarchy\n> \n> Even rarer for an anarchist to lynch (ie it has never happened)\n\nA new system won't change the people in it. Since the dawn of time there have been pricks.",
				"added": 1481835991
			},
			{
				"comment_id": 181,
				"body": "> [thisweb11](#comment_195_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): So you are an anti-capitalist?  I thought you said capitalism was what we need?One thing is absolutely certain: Karl Marx (socialist), Adam Smith (capitalist), Ayan Rand (libertarian capitalist), Stalin (facist dictator)  and Emma Goldman (Anarchist) all agree whole heartedly that collective ownership of the means of production is anti-capitalist.    You cant support capitalism and collective ownership of the means of production.  One negates the other absolutely.   You must destroy capitalism (or at least will its demise) to expect shared ownership.\n\nIn the long term. As I said before, I think it'll naturally evolve over the centuries.",
				"added": 1481836059
			},
			{
				"comment_id": 182,
				"body": "> [thisweb11](#comment_196_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): I dont think he said that.  He said access to greater networks.    Who knows, many drugs can open up worlds  and perspectives  we can't imagine.  At one time few would have thought anaesthetic was possible (cut someone open without them feeling anything, not even the passage of time?  Don't be ridiculous!)\n\nThere is a difference between communicating with a rock and putting someone to sleep.",
				"added": 1481836126
			},
			{
				"comment_id": 183,
				"body": "> [thisweb11](#comment_197_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Well, 'the internet' doesnt prove anything either.\n\nIt didn't exist.",
				"added": 1481836149
			},
			{
				"comment_id": 184,
				"body": "> [thisweb11](#comment_198_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Capitalists think money is real.  They refuse to believe its possible to live or have power without it.  Its all anecdotal faith.\n\nIt's been proven to work.",
				"added": 1481836180
			},
			{
				"comment_id": 185,
				"body": "> [thisweb11](#comment_200_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Science is very useful.  But not understanding something definitely doesnt make it useless.   Like the laws of gravity.  We know only how it works.  Not WHY it works.  But I still find it useful.   As did centuries of people before Newton sat under a tree.\n\nWe understand gravity.",
				"added": 1481836208
			},
			{
				"comment_id": 186,
				"body": "> [planespherev3](#comment_64_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): I'm not a scientist but... No. At best only theories. And some scientists (like Tesla and more recent ones) think it's only a form of electromagnetism.\n\nThat reasoning is flawed. We understand gravity, we know how it works and we have a model which can accurately predict it. In science, a theory is as reputable as a fact. It's a hypythesis which can be used to make accurate predictions and is well accepted. \n\nWe might not understand what causes gravity to exist. That's irrelevant though.",
				"added": 1482080838
			},
			{
				"comment_id": 187,
				"body": "> [planespherev3](#comment_63_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Since the dawn of    ̶t̶i̶m̶e̶ civilization there have been pricks.\n> You don't understand there is something inherently wrong with civilization. Something linked with delegation of power and abstract value like money. Okay it's comfortable to have electricity and networks but this whole social organization is flawed. We must only keep the technology but change almost everything else.\n\nYou attribute human indecency to civilization, but I see literally no evidence for that.",
				"added": 1482080860
			},
			{
				"comment_id": 188,
				"body": "> [thisweb11](#comment_202_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): There is certainly lots we do understand that is useless.   Capitalism is one.\n\nCapitalism has caused the greatest leap in technological advancement in history.",
				"added": 1482080899
			},
			{
				"comment_id": 189,
				"body": "> [thisweb11](#comment_204_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): you are made of carbon and water.  So its all relative.  Where does your consciousness reside exactly?   What is it made of?  What makes something conscious?    Nobody knows.   Incidentally, I still think being conscious is useful  ;)\n\nYou proved my point. It's useless because we don't understand it and cannot make any predictions based on it.",
				"added": 1482080946
			},
			{
				"comment_id": 190,
				"body": "> [thisweb11](#comment_203_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): True, but its a daft defence of your own position.  Presumably you dont think your own politics and capitalism should disappear entirely  because it has pricks within it?  Why defend any system?  Isnt life about damage limitation by pricks.   So why say anarchy can't do  that?\n> Of course there will be pricks, but some systems make more pricks out of us than others.  Capitalism is the king of  prick making.  Ask Sylvester McMonkey McBean\n\nYou can't really have a discussion if you keep continuously conflating two positions. Capitalism doesn't oppose anarchy.",
				"added": 1482081002
			},
			{
				"comment_id": 191,
				"body": "> [planespherev2](#comment_113_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): With specialization came alienation. Humans not doing what they want, but what society let them do in order for them to pay for their food and shelter.It still on today. People saying that it's not their fault if they are soldiers hired to kill people for higher interests.  They'll say they don't have a choice: it's for the wife and kids at home. \n> Learned recently that in native Indians tribes, you weren't obliged to fight if you didn't agree with the conflict.\n\nIt's not with specialization but rather with private ownership of production that came alienation. People feel disconnected from their labour as they cannot see who benefits from it.",
				"added": 1482183085
			},
			{
				"comment_id": 192,
				"body": "> [planespherev2](#comment_114_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): I understood (in the manuscripts of 1844) that it's not because workers cannot see who benefits from their work, but rather the fact that when they work, they are not, and do not do, what they are supposed to be/do as humans. Rather, they are something else, thus the word alienation.  Especially in factories. Who wants to be an assembly line worker?\n> Specialization increase alienation, and specialization is one of the element of capitalism. Capitalism began in the 13th century with the textile mills. Capitalism is clearly linked to more and more  division of labor, specialization, which tend to increase alienation.\n\nSee, I disagree. Furthermore, I capitalism is one pushing the hardest to get rid of the assembly lines atm.",
				"added": 1482343533
			},
			{
				"comment_id": 193,
				"body": "> [thisweb11](#comment_206_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): But there is  other stuff we dont know.   Isnt that lack of knowing just as irrelevent?\n\nYes.",
				"added": 1482343544
			},
			{
				"comment_id": 194,
				"body": "> [thisweb11](#comment_207_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): That's weird.     Nazis are the most obvious example.\n\nThat's not an example. How does that prove anything?",
				"added": 1482343573
			},
			{
				"comment_id": 195,
				"body": "> [thisweb11](#comment_208_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): How?  And also what is your control sample?  If all we've had is capitalism what are you comparing it to?\n\nFeudalism / Merkantilism.",
				"added": 1482343591
			},
			{
				"comment_id": 196,
				"body": "> [thisweb11](#comment_209_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Huh?  Being conscious is useless?  Then what are you doing here?\n\nStrawman.",
				"added": 1482343611
			},
			{
				"comment_id": 197,
				"body": "> [thisweb11](#comment_210_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Er..but anarchy definately opposes capitalism.  Its fundamental to anarchy.   I have no idea how you think the two are reconcilable.     'anarcho-capitalist' ?\n\nYou can as perfectly have a society without state _with_ capital as without capital. I think we can all agree though that a capitalist anarchy would be a horrific dystopia.",
				"added": 1482343681
			},
			{
				"comment_id": 199,
				"body": "> [thisweb11](#comment_214_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): so not anarchy then\n\nBut not capitalism.",
				"added": 1482351008
			},
			{
				"comment_id": 200,
				"body": "> [planespherev2](#comment_118_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): About the state, it was born after the neolitic revolution, when human cohesion inside a group exploded because of the separation of society in 2 classes: working class  and owners of the means of production.\n> To maintain the cohesion in this exploded society with strong antagonism (the interest of the 2 classes do not converge), the state was created. With laws and coercion, the state force the 2 classes to coexist without destroying themselves. Sometime, the state is not enough to cement the 2 classes, and revolts happen.That's what happened with the peasants revolts in the late middle age, but also during the paris commune (1871), the barcelona commune (1937) and the Budapest commune (1956). \n> It is possible that if capitalism doesn't die out progressively, a final global revolt during capitalism final crisis will happen, crushing it once and for all. \n> However, i think it will die out progressively, with open source (software but hopefully also hardware) and mechanization.  The sooner the better.\n\nCapitalism might, the state won't.",
				"added": 1482443766
			},
			{
				"comment_id": 201,
				"body": "> [thisweb11](#comment_238_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): I miss binero.\n\nI wasn't gone for that long, was I?",
				"added": 1484812159
			},
			{
				"comment_id": 202,
				"body": "> [warlock](#comment_41_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): I don't buy that argument. In a true free market products will be produced as cheap as technological possible at that time. It optimizes production. You cannot say the same because you don't have the same incentive to improve the production.\n> \n> No, to the contrary. In a free market nice things will become much cheaper.\n\nIn a true free market there is no attention to important things like climate change. It also opens up the way for deceit and lies. Who regulates the food is healthy? At least with communism, bussiness interests are aligned with public interest, in capitalism this is not the case.\n\nYou'll probably use the argument that with capitalism your personal interest is aligned with other people their interest, but that's only superfically true. Your interests are aligned with what other people _think_ is in their interest.",
				"added": 1484818222
			},
			{
				"comment_id": 203,
				"body": "> [thisweb11](#comment_276_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): And raising the standard of living for people reduces population growth.\n\nIt increases population growth. The reason areas like South East Asia or Africa see such a massive population boom is because living standard there are improving. Once they are caught up it'll stabalise again, but the extra people caused by the growth won't go away.",
				"added": 1485219670
			},
			{
				"comment_id": 204,
				"body": "> [planespherev3](#comment_119_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): I have a completely different opinion on this, and it's even different to other an-com point of view. \n> I think the earth can take 30 billions of people with high living standard and without destroying the environment. \n> Quickly how: 1/Living in giant structures in the desert (3d printing), where there is nothing to destroy or pollute (Sarah, Gobi, Kalahari, Antarctica), or in floating structures in the water. 2/Clean and quasi illimitable energy: fast breeder reactor, thorium, LENR, fusion reactor, or simply massive PV panels with V2G technology in these deserts (with just an area like Spain, we could provide the whole world with PV electric energy). 3/Stop torturing animal and ecosystems by being full vegan, and growing vegetable with aquaponics (or other systems), which use a fraction of the land for a way higher yield, thus stop deforesting and exploiting lands were animals should be left at peace.\n> Just MHO.\n\nArea is not the problem, resources is, and the Earth only has resources for 10 billion people with the current technology.",
				"added": 1485219774
			},
			{
				"comment_id": 205,
				"body": "> [planespherev3](#comment_125_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Most ressources has alternatives. Carbon composite for steel. Hybrid metal for copper. Graphene for platinium. And the bottom of the oceans are rich in rare earth.\n\n\"With the current technology.\"",
				"added": 1485278767
			},
			{
				"comment_id": 206,
				"body": "> [warlock](#comment_55_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): So did Soviet on the free market. The disinformation continues to this day - from both sides. I agree 100% with information. From what I've read I've come to the conclusion that an-cap is true freedom. You have come to the conclusion that an-com is. One side will never manage to convince 100% of the people, so we have to find a way to agree to disagree and co-exist.\n\nThe Soviet Union wasn't communist nor claimed to be.",
				"added": 1485278812
			},
			{
				"comment_id": 207,
				"body": "> [warlock](#comment_57_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): Then you and I have different view of what freedom is.I would love to try an-cap, an luckily I will. We're getting there. It's inevitable.\n\nWhat's the difference between not being allowed to do something, or not being able to afford something, and being inable to generate sufficient funds? They both are not freedom. \n\nHow does anarcho-capitalism prevent things like slavery? When there are no regulations, you get slavery. Look at Africa or South East Asia. Lack of regulations creates inequality and eventually slavery. At least a communist can argue in their system there is no incentive to be a slave master.",
				"added": 1485279025
			},
			{
				"comment_id": 208,
				"body": "> [thisweb11](#comment_284_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Their lives are not improving.  Nor is it improving in China, unlike popular myths.  Poverty has increased over the last couple of years in these regions.  But because inequality has increased -  china has far  MORE wealthier and middle class spending power than it did before.  But thats not the same thing.  It has this makes the rest (majority of the population)  poorer.  Vietnam is wealthier than it has been.  Population growth is slowing from what I read. So Im not sure where you get this idea from?   Still, long term when living standards improve for the MAJORITY in those nations, population slows.  Or to put it another way, population growth (by local birthing mothers) is much  lower in cities in most countries in the world than poorer rural areas of those nations.\n\nDemographic Transition is a widely accepted model of why population has grown so much, and how it has. https://en.wikipedia.org/wiki/Demographic_transition\n\nChina mortality rate dropped, and is still dropping: http://www.indexmundi.com/facts/china/mortality-rate\nChina natality is also dropping, but not nearly as fast: http://www.indexmundi.com/facts/china/birth-rate\n\nAccording to demographic transition, when China is fully developed the natality rate will go down as well, causing the population to stabilise. All people that were born during the transition will stay.",
				"added": 1485370791
			},
			{
				"comment_id": 209,
				"body": "> [warlock](#comment_59_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): In your opinion.\nThere is a difference between an opinion and a fact. You cannot dismiss a fact as an opinion. Both are scenarios where people aren't allowed to do something, and that's the defining trait of freedom. \n\n> Well, if we're talking philosophically here, then by definition they wouldn't be an-caps, since they would enforce people to do something against their will.\nThen how do you prevent this from happening?",
				"added": 1485371033
			},
			{
				"comment_id": 210,
				"body": "To any argument regarding changing the culture: I think we need to change the culture so everyone just loves being a slave and work for Donald Trump. \n\nThat argument is as valid as any of yours. A system should be made to fit humans, not the other way around. If your system requires humans to change, then it's not a good system.",
				"added": 1485371240
			},
			{
				"comment_id": 215,
				"body": "> [thisweb11](#comment_330_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Which reminds me  -  another point about releasing the cockroaches in mcdonalds:    It ensures the workers don't have to flip burgers for people that day.   And the public are forced to ask, 'do I really want a Big Mac anyway?'\n\nWhy would we want to do everything ourselves? Specialization is what lead to the enormous production capacity we have these days.",
				"added": 1485976468
			},
			{
				"comment_id": 216,
				"body": "> [thisweb11](#comment_332_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Why?  Because most people, the poor, middle class, even a lot of the rich, spend most of their day working for someone else.   Middle class woman goes to work,  she pays a poor woman to look after her kids whilst she is at work earning her boss money so he can buy nice things for his kids.   And then somehow the poor woman has to look after her own kids too!  Who benefits from this circular system - it makes more sense for everyone to look after  own kids and work for own family.  What is the point in this kind of productivity except for its own sake, which usually means doing bullshit jobs, to sustain people doing bullshit jobs looking after the fallout of the bullshit jobbers (eg, cleaners sweeping the shit from office floors, and fast food workers serving busy managers of bullshit jobbers).  A vicious circle.   Why dont we all clean our own toilets and cook our own food, look after our own kids and garden, and work LESS hours doing other peoples work.    Who the hell should want to flip burgers all day for other people? Or clean the bosses toilets.    It might be great if you are able to afford it, but not for the poor (ie the majority of all humans) .    But even the middle class who use these people have to do shit jobs , long hours, to get paid so they can afford to pay these people to do the things they'd be otherwise doing themselves!   Save for a holiday so you can take time of work which you do so you can afford a holiday.  Rinse repeat.  Capitalism is stupid.   Its dangerous.  Its mind numbing.  Its soul destroying.  It ruins the planet.  And wastes our time.  Did I mention it is stupid?  Its insane to keep going on like this  (unless your at the top of the pyramid).  It cannot be reformed.  And doing one job all day every day (as most of us do) is mentally unhealthy, we need to be generalist workers, working few hours on many things.  We will surely die of boredom doing the same job all our lives.  Even if thats a 'good' job, repetition always becomes boring.   No wonder people are so damn depressed.  Efficiency is a drag.  Work should be abolished.  'In praise of idleness' by Bertrand Russell is one of my favourite anti-capitalist essays.  (consider how long ago it was written)  Theres some other great essays on the subject here as well if you are interested :  \n> http://www.audioanarchy.org/antiwork.html\n\nI don't think that's true at all. I would never want a society where I cannot simply have a job I can go back to everyday, in order to sustain myself. The issue isn't in specialisation, it's the fact a lot of people are overworked and doing meaningless jobs. \n\nAutomate the meaningless stuff, drop work hours and everyone will be fine.",
				"added": 1486241602
			},
			{
				"comment_id": 218,
				"body": "> [binero](#comment_216_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): I don't think that's true at all. I would never want a society where I cannot simply have a job I can go back to everyday, in order to sustain myself. The issue isn't in specialisation, it's the fact a lot of people are overworked and doing meaningless jobs. \n> Automate the meaningless stuff, drop work hours and everyone will be fine.\n\nTo add to that, it's more meaningful to work for as many people as possible doing something you're good at then trying to do something yourself that other people can do better, and even more likely enjoy doing more than you do.",
				"added": 1486250722
			}
		],
		"1_1Cxt2k3farSSee7HTkJKJ7eCTKxfFGNXe6": [
			{
				"comment_id": 3,
				"body": "> [quasimodo775](#comment_9_1Cxt2k3farSSee7HTkJKJ7eCTKxfFGNXe6): Notice put out today:\n> http://redstatewatcher.com/article.asp?id=46959\n> Breaking! Assange Just Emerged From Hiding To Deliver The Biggest November Surprise To Hillary\n> *Please share this and spread the word\n> On Thursday, we discovered that Julian Assange had emerged from hiding and alllowed John Pilger from Dartmouth Films to record him in an interview. The video will be aired this Saturday November 5th on RT but we've found a teaser trailer.\"\n\nHow do you mean hiding? He isn't hiding. He does livestreams and everything.",
				"added": 1478301176
			}
		],
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": [
			{
				"comment_id": 4,
				"body": "> [covet](#comment_1_17KsAKebu6NJC9KTPu1yzhy435HtoUzBF1): He's successful salesman.\n\nI guess successful is very relative. Started with 250 million from his father and crashed that to 200 million in debt now.",
				"added": 1478302021
			},
			{
				"comment_id": 5,
				"body": "> [xxx123](#comment_1_13ELteG7zNJLe88rQQ69U2up82Fa9b3q9c): well i dont have voting right for him, but i like him, cause i think all lives matter, i dislike political correct\n\nDo you know what political correctness is? It's trying not to offend anyone. By saying you don't like political correctness you're implying you like to offend people...",
				"added": 1478302090
			}
		],
		"1_1FZEtMSz2tKFZPmBtjhD7JgR4awtAMD47G": [
			{
				"comment_id": 6,
				"body": "> [planespherev2](#comment_35_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): In a capitalistic system, there is no such thing as socialism. Only some ideologies derivated from the capital and one of  them  is called socialism. Every political party, everyone, is for capitalism. All the parties are representing the capital. From the extreme left flavor to the extreme right. It's all about the same system, but with different flavors.\n> You cannot have what people imagine to be socialism and a money based society. It is just not possible. \n> So you and those believing in socialism are the two sides of the same coin.\n\nYou can. Do note there is a difference between socialism and communism.",
				"added": 1478302433
			},
			{
				"comment_id": 8,
				"body": "> [planespherev2](#comment_84_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): Socialism aims to tame money. To collect and redistribute it. \n> It can give the illusion that it's making well-being better, but in the end money always finds it's way.\n> Money is like water. Block it by the front door, and it'll pass by the window. \n> E.G: Collect tax from the capital, and it will find tax paradises. Increase the wages, and companies will relocate. Strike, and the capital will organize it's reserve army (migrants). \n> Capital is flexible. You think you can control it as a socialist, but you cant. Only way to stop this mad societal organization, take capitalism down, entirely.\n> Adjustments will only make the impression that something better happened, when it's only (at best), saving time until capitalism final crisis.\n\nCapital is pretty easy to keep under control. Tax paradises only work if people can transfer their money to there. They can today because these paradises negotiate trade deals with corrupt politicians, but if you get rid of those, then money is stuck on the social democracy where it is subject to imposed taxes.",
				"added": 1478305586
			},
			{
				"comment_id": 9,
				"body": "> [planespherev2](#comment_87_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): And with what are those politicians corrupted? You see the point...\n> Why do you like money as the fuel of our mode of production? Because we can't do otherwise?\n> Yes we can. Just need a little faith and imagination.\n\nIt's practical and easy. Money didn't corrupt those politicians. If there wasn't any money you could give them other stuff.",
				"added": 1478310441
			},
			{
				"comment_id": 12,
				"body": "> [enoch](#comment_12_1QH1N2BcCN6bQu1J98yUovsnnkvHn8TKhC): Hahahaha...says capital is easy to keep under control while using elliptic curve cryptography (i.e. Bitcoin tech) to post on the hardest platform to control in history. You Ancoms make me laugh.\n\nJust because the taxing system is outdated, naive and corrupted doesn't mean it cannot be solved. Bitcoins can be taxed. After all, at some point, bitcoins need to be exchanged in the real world.",
				"added": 1478347516
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 15,
				"body": "> [jro](#comment_19_18DbeZgtVCcLghmtzvg4Uv8uRQAwR8wnDQ): Very nice with ZeroNet and public zites like this. Trolls will also be in here. Censor is not the solution. I think that the best solution is an option for the user to enable/disable a trolling filter. Disabled when zite starts as no censor must be the default on ZeroNet.Personal I would like to up/down voting people and use my personal votes + the votes from the people I have up voted for some kind of filter when seeing posts and comments in here.\n\nSuch an absolutist view will never work. People should be allowed to censor on their own Zites, and if Zeronet wants to ever be treated seriously by a wide audiance, it'll have to do this on its default zites as well. If people feel they are being censored, they can make their own zites.",
				"added": 1478353640
			}
		],
		"4_1KVbKJBqXdkUr4ogZGJEjDFsm2y9vtX8Bj": [
			{
				"comment_id": 46,
				"body": "Make a Zite!",
				"added": 1478692853
			}
		],
		"3_1Cxt2k3farSSee7HTkJKJ7eCTKxfFGNXe6": [
			{
				"comment_id": 49,
				"body": "?",
				"added": 1478708038
			}
		],
		"1_1ANXCwkxieV453iigVj4d6FNNkQJCHaPwE": [
			{
				"comment_id": 61,
				"body": "> [anonmaster](#comment_1_1LLVuz3mTYn4ajKXYS2rtwJauQCQPXhJrq): Well, it seems like this is just a side effect of decreased censorship. However, I think this will decrease in time as more people from all over accept less censorship. It seems more people interested in no censorship have unpopular opinions to begin with.\n\nMost people don't care about censorship because it affects them in a positive way. Furthermore, it is in other platforms their interest to only censor people who hold very unpopular opinions, censoring any more than that means less people and thus less money.",
				"added": 1479081785
			}
		],
		"1_1L14vSk76tujfNoqrcRuFk2tBBZgUPy92t": [
			{
				"comment_id": 63,
				"body": "> [alisa](#comment_4_1LH3seL2knRt5Np5LeGRcgGdpwEu4Nc9Bx): I hope Trump will drop the false accusations against Assange and will recognize his merits.\n\nHe probably won't.",
				"added": 1479155529
			}
		],
		"11_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": [
			{
				"comment_id": 69,
				"body": "> [electrcninja](#comment_1_1JbEyQy3G6XfGSW5i1ebPhLHuvEExzTrDJ): Yes legally, but no not really. The state could say \"we're not part of the US\" and they could back it up as much as they want... The armed forces will take them back. There is also the whole International-level politics, and the US allies most likely would not even recognize a independent California. Remember, Texas tried this once... You could have the entirety of the United States' Armed forces vs. at most the California National Guard and a few citizens with guns. It would not be a good Idea on California's part.\n\nJust because the USA _can_ take them back doesn't mean they will. It will be a hard sell for them to do.",
				"added": 1479317876
			}
		],
		"1_1JtxPipMFzvBTQ8fwSeupUxfiVMbutBfhG": [
			{
				"comment_id": 81,
				"body": "So this is where the insane people hang out. Cool.",
				"added": 1479608807
			},
			{
				"comment_id": 82,
				"body": "> [jooo](#comment_3_1Emt893wnu4LEJXRFvVND42E6nVd5G5FD): Do you like what your Jewish friends do ?https://www.youtube.com/watch?v=nbEdJLD0hRM\n\nI'm opposed to all religions. Judaism is bad, Islam is bad, Christianity is bad, Buddhism is bad, all of them are bad. They're all based on some made up stories from people who were almost certainly high when they made them up.",
				"added": 1479666251
			}
		],
		"3_156xbcM9BrbdhtYZUPAQBFvLDGGyy5AjdM": [
			{
				"comment_id": 83,
				"body": "Don't publish when you don't want people to update?",
				"added": 1479738715
			}
		],
		"5_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": [
			{
				"comment_id": 85,
				"body": "> [ancap](#comment_89_1FYXQGLBeNabf5jZHgP4CwzbmJSKaK4oMz): I see I'm dealing with clueless central planners here.Why stop at that?Why settle for $500 to still let 20% of the victims die or get injured?Why not \"throw\" $5,000 or $50,000,000 worth of equipment on every car and completely eliminate pedestrian hits?\n> \n> Right, so why is the taxpayer forced to subsidize Tesla cars and various other monstrosities? The $400 that the average Joe could spend on this simple add-on ends up as subsidy for the socialist elite that buys Tesla cars.Each Tesla car (assuming average subsidy of $10,000) takes away 25 of these $400 anti-collision devices from the market\n> Don't bother replying - I know you don't get it and can't understand any of this.\n\nHe never said on every Tesla, he said on every car. That means everyone's car gets one. Everyone's.\n\nFurthermore, cars don't descriminate against who they hit.",
				"added": 1479841191
			}
		],
		"1_1Gi4g59DwnkjgL9VmvmrfC95tMymyWFaaY": [
			{
				"comment_id": 91,
				"body": "Looks like a lot of unjust fearmongering to me.",
				"added": 1479897284
			}
		],
		"5_156xbcM9BrbdhtYZUPAQBFvLDGGyy5AjdM": [
			{
				"comment_id": 122,
				"body": "What is that?",
				"added": 1480295519
			}
		],
		"2_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG": [
			{
				"comment_id": 137,
				"body": "> [dud](#comment_2_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG): Libertarianism does not depend on state violence, and rather considers that the state should stay out of an individual's life as much as possible. It is possible to be a libertarian anarchist, in fact.\n> That would usually be anarcho capitalism, or anarcho syndicalism,, depending on your personal perception of freedom and liberty. The very basis of libertarianism however is limited state role in all aspects of an individual's life, which means minimal taxes and limited state role in social services. Social services from a libertarian standpoint should be maintained by the individual or private groups (commercial or not), because they are less likely to infringe on personal liberty than the state. Private groups don't impose taxes on the individual and don't impose a certain service on people (state education, for instance), which is why libertarians believe that private groups are naturally better than the state in this role.\n> I mentionned anarcho-syndicalism as a form of libertarianism, and I say that because it is naturally free association between people to attain the highest quality of life possible, without imposing it on anyone, which is what the state does.\n\nEvery state depends on a monopoly on violance. When it doesn't, it gets toppled by one that does.",
				"added": 1480822339
			},
			{
				"comment_id": 148,
				"body": "> [dud](#comment_9_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG): [...] and the arrival of competent privately owned alternatives in social programs. This means private insurances, in short.\n\nDisgusting. Too often the profit of a company and the best interest of the people do not align.",
				"added": 1480902936
			},
			{
				"comment_id": 159,
				"body": "> [dud](#comment_19_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG): The profit of a company and the best interest of the people never align, but so do the government and the interest of the people. I am saying that private alternatives are naturally better, because they have to be competitive, while the government is the law, and can do as he wish.\n\nThe government represents the people. It does as the people wish. For quite a lot of industries, nationalised industries perform better than privatised ones, usually things like water, electricity and such.",
				"added": 1481150109
			},
			{
				"comment_id": 211,
				"body": "> [planespherev3](#comment_129_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): I'm not medium, i don't know exactly.  Something like centralization of all needs, but not managed by a state or a company, but by direct democracy through the network. Plenty of algorithms to ensure that not too much resources are used, and that some person don't use too much of a particular stuff for something different than the common good. Correction mechanisms to ensure that no one is Favorited. Full transparency to avoid cheating. \nNo matter how democratic, any organisation you are forced into is a state. It doesn't matter if you're not directly forced into it.",
				"added": 1485396354
			}
		],
		"1_1MxX4JMJ71sfYS1Lo3jL8Ja5u811nySEJJ": [
			{
				"comment_id": 149,
				"body": "If Clinton won you'd have gotten a new Trump 4 years after.",
				"added": 1480903011
			},
			{
				"comment_id": 171,
				"body": "> [gremious](#comment_2_1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA): I'll just leave this paste from somewhere here, just to get it out there\n> \n> Prove they were all Americans. \n> For those who are still hinging on the \"Popular vote\" as your main argument, one of the biggest reasons why we see it being seen a illegitimate is the location of the votes. All primary counties that house sanctuary cities with little to no voting laws. \n> California even acknowledges that 13% of illegals vote, as they also do not require Social Security Numbers or Driver License Numbers. You can go through the process yourself. \n> covr.sos.ca.gov/Home/MainForm \n> www.capoliticalreview.com/capoliticalnewsandviews/poll-13-of-illegal-aliens-admit-they-vote/ \n> thefederalist.com/2016/10/13/voter-fraud-real-heres-proof/ \n> www.fairus.org/issue/noncitizens-voting-violations-and-u-s-elections \n> www.washingtonpost.com/news/monkey-cage/wp/2014/10/24/could-non-citizens-decide-the-november-election/ \n> dailysignal.com/2015/06/02/poll-shows-noncitizens-can-shape-elections/ \n> www.politico.com/magazine/story/2015/10/illegal-immigrants-could-elect-hillary-clinton-213216 \n> Even Huff post admitted to it. \n> www.huffingtonpost.com/howard-foster/democrats-benefit-from-illegal-immigrants-voting_b_1418523.html \n> In California, Hillary Clinton won the state by over 4 million votes, almost twice the Pop Vote Lead, and centered in just a few counties. \n> All their party has to go on for the popular vote, is the cities with practically zero voting laws. It's not even just about their being concentrated cities with high populations, its the fact it is so easy to manipulate and pad voting numbers from the voting populations from the lack of voting laws. \n> Thank God some states are now going to make Voting IDs mandatory now thanks to some of the fraud uncovered from the recount.\n\nYour sources are meaningless given they were posted before the election, or were opinion pieces.",
				"added": 1481494430
			},
			{
				"comment_id": 172,
				"body": "> [sthetz](#comment_20_1BNmjz9tBLY3M1tq2z7DKvA1LjFXYsmLd9): Implying \"fascism, racism and sexism\" is something bad. Get fucked, libtard. Fascism is back and you can't do shit about it.\n\nDo you identify pro-fascist? Fascism is defined as a dictatorship disallowing of any opposition, which retains its power through nationalism and racism? \n\nSo you are basically:\n- anti free speech\n- anti democracy\n- nationalist (not the same as patriotic!)\n- racist\n\nIs this correct?",
				"added": 1481494579
			}
		],
		"2_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt": [
			{
				"comment_id": 198,
				"body": "> [0ivy](#comment_2_1Q3wv52h6RSubdYu5aoxZzfkFHmEx9wtfM): zeromail would work for that, unless you want voice.Other than that I think wire is your best bet, but that's not P2P.\nZeromail doesn't really provide a good chat interface, and doesn't work on phones.",
				"added": 1482350984
			}
		],
		"1_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd": [
			{
				"comment_id": 212,
				"body": "> [warlock](#comment_63_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): Just to be clear. The act of genocide is not an opinion. Advocating genocide is, per definition, a legitimate opinion. However, it's also outrageous. And yes, I agree that it is objectively wrong and objectively evil. I understand you 100%.\n> However, the reason I'm critical is this. Just like you're on a mission to \"remove\" hatred, I'm on a mission to support freedom of speech, no matter what the opinions might be. That's one of the reasons why I'm running this zeronet node. The whole emergence of \"fake news\" motivates me even more, since governments are seriously discussing to remove \"fake news\" from existence. (E.g. implementing ministry of truth).\nIt's a tough issue though, because fake news *is* a serious issue. While censorship might not be the best action, something needs to be done.",
				"added": 1485396452
			},
			{
				"comment_id": 214,
				"body": "> [warlock](#comment_65_18id3A8UHCU9RmkVBeBhsDrnPf27hQXdS1): Not to me. To me holding an opinion doesn't change any thing. Action is what matters to me. If people believe we didn't land on the moon or people are involved in Truther movements, really doesn't matter. If only shows that there is to much secrecy.\n> Honestly. Fake news is easy to cope with. Just have a transparent administration. But they won't. So they cannot cope with fake news, because they have to many skeletons in the closets.\n\nA transparent administration is needed, but how would it help? Even in areas where there is transparency fake news is winning grounds. Look in the UK, where there is fake news everywhere claiming the EU parliament is not democratically elected, or that the EU commission appoints itself. Or the wildly debunked myth that the EU had a negative impact on the UK fishing industry, while in fact it had no impact to a slightly positive impact. \n\nLook at Sweden where there are still claims that immigration increased the amount of sexual assault even though we know that the reason it increased is because the laws were made stricter. \n\nLook at Donald Trump who is claiming there were millions of people who voted illegally in his country. Look at the Clinton campaign who claims without any evidence Russia hacked their emails. \n\nAll these claims lack any evidence, and most of them can be easily debunked. All of them happen in very transparent areas. Yet most people will believe all of these claims, and they all have a direct impact on our democracy. Fake news is a very big issue.",
				"added": 1485434022
			},
			{
				"comment_id": 217,
				"body": "Why not just have community moderation? If too many people dislike something and too few like it, the post becomes unlisted. If you feel that's censorship, you can create your own zite. \n\nIt's no good to have a lot of spam or bad content on the homepage. It puts people off.",
				"added": 1486241731
			}
		],
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 213,
				"body": "> [psy](#comment_1_1CF2st1nsRZ9AP1YdUw3rVQAgg3vMQraKA): It has been demonstrated neurologically that lying very much changes the brain structure.As they have habbits not accepted by the society they had to disguise it and doing it since many centuries this ability has been impregnated in their genes. \nThis is not how evolution works. Behaviour doesn't make it into the genes if you keep doing it for enough generations. \n\n> [psy](#comment_1_1CF2st1nsRZ9AP1YdUw3rVQAgg3vMQraKA): This creates by many Jews rupture in their brain structure, schizophrenia.Schizophrenia occurs with a much higher percentage by Jews, this is a statistic evidence.\nCorrelation does not imply causation. https://en.wikipedia.org/wiki/Correlation_does_not_imply_causation\n\nMy favourite example of where this goes wrong is the pirates cause climate change hypothesis: https://upload.wikimedia.org/wikipedia/commons/d/de/PiratesVsTemp%28en%29.svg\n\nAnother fun one is the hypothesis claiming lemons decrease car accident fatality rates: http://pubs.acs.org/appl/literatum/publisher/achs/journals/content/jcisd8/2008/jcisd8.2008.48.issue-1/ci700332k/production/images/medium/ci700332kn00001.gif\n\nStatistics are not good evidence at all. They can be used to show the most absurd things.",
				"added": 1485433393
			}
		]
	},
	"comment_vote": {
		"1_11pADbvn3XmFZ5sbM9ZANRb5Gv9igHLCF": 1,
		"4_1J55h6E9SKsKLhSDNeXyY94qkMP9SsxQQ9": 1,
		"2_1HBTzHV2pSqMGo8R4UyrRP3BvzJVxRXPS6": 1,
		"6_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"51_16w7UuJAHbt8YBa8zxHS7UFk9mq8Q5DpE4": 1,
		"21_16tWPYFLbad3R8iGcMuetyiwC2q5qXp45T": 1,
		"804_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"49_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt": 1,
		"1_1J5uFzQBpLpoyTZfH28Fv8KrThShewrF2d": 1,
		"5_1JLLVhK19A1UYp32U38LY8dT3wMVmTg1nF": 1,
		"2_1KgQuToz1c1PBEHhZjijgdVfgBW1BEETd8": 1,
		"3_1H6K1WXWJnJVftS9SBB7aQZS8mJeHHUr6C": 1,
		"5_1KgQuToz1c1PBEHhZjijgdVfgBW1BEETd8": 1,
		"3_124UCSJsQB8voEb761ZcLf6TRQZpsWM3se": 1,
		"1_1LoQzLusqaY8j8eLgQ3GsrxPVbzff4P7oL": 1,
		"42_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR": 1,
		"1_1KVKzRFAm8LuVfG8zmvqQgLfTd2ggfQNLL": 1,
		"89_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"103_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"6_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG": 1,
		"1_133PfjoNP94oHC3GczL9e7SCKoeKEMyCDJ": 1,
		"142_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"38_1xf9XC4Nsa7YfQWFiK6xGsNDJA3AaCTUa": 1,
		"192_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"3_1FkfXgnEgbmetRyCjXRjt7ATDWUWVPkL5T": 1,
		"213_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"215_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM": 1,
		"25_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"9_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd": 1
	}
}