{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": 1,
		"9_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1_12Xj1w5HYu6w5xtEwwLyEiMYGuCqvYKL2q": 1,
		"1_1NU6gdra9qhUhdbYGLia1G3HYT87qUTA7w": 1,
		"1_1AQwGx5xyBi5Fvv9WHJFMCMNtQhUc8UhQF": 1,
		"1_1KLTeqiNMx1QNWTqBzJsjTQp112dDZPeqZ": 1,
		"1_1Q5Mm6xjT8YP62gaKX22AArMuw6ywndfrq": 1,
		"1_1At4zensbxPGhXYbe5bnx9eGuE4V1vnbc8": 1,
		"2_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1,
		"1_1DqaWUpq6dRXfuXCokpjYoAkDj2nzZDnAn": 1,
		"2_1HiJDred9Tjdqz23kiGbPsqMAFqfpCbRYL": 1,
		"1_1NeXP2x3A1ukhykJhGWNYtJndivjP35Buk": 1,
		"1_18bomQ8x4FH1Kejt9vqDdRER8N5HaoPenS": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1_12Xj1w5HYu6w5xtEwwLyEiMYGuCqvYKL2q": [
			{
				"comment_id": 1,
				"body": "US president John F. Kenedy was killed by Jews\nPresident John F. Kennedy planned to exterminate the Federal Reserve System. In 1963 he signed Executive Orders EO-11 and EO-110, returning to the government the responsibility to print money, taking that privilege away from the ROTHSCHILDS JEISH MAFIA RUN Federal Reserve System.\nShortly thereafter, President John F. Kennedy was assassinated. The professional, triangulated fire that executed the President of the United States is not the most shocking issue. The high-level coordination that organized the widespread coverup is manifest evidence of the incredible power of a “hidden government” behind the scenes.\nJack Ruby who killed Oswald was Jew.\n\nUS president McKinley was killed by Jews because he tried to create honest money and he opposed scam money created by Jews\nTHE JEWISH HOUSE OF ROTHSCHILD had lost a fierce battle with President Jackson with regard to keeping their Central Bank. For in 1834, Jackson removed all government deposits from the Rothschild’s “Second Bank of the United States.”\nA new System of National Banks was established in 1862 eliminating the Jew-controlled Central Bank up through 1901. It was on September 6 1901 that President William McKinley was assassinated through the intrigues of the Rothschilds and their hit-men.\nWith McKinley out of the way, the path to the Federal Reserve Act of 1913 was easily paved through the pawns of Jewish agents of the House of Rothschild. Two such Rothschild agents were the powerful Jewish bankers Jacob Schiff and Max Warburg.\nPresident William McKinley was known as a “hard money” man. This was because he advocated a gold standard. Unlike his opponent, William Jennings Bryan, McKinley was against “easy money” with no backing — printed by Jewish lenders at interest to the borrower - namely the US government. This was the essence of McKinley’s 1896 & 1900 successful campaign against William Jennings Bryan who advocated for “free and unlimited coinage of silver.”\nBUT BY McKINLEY FIGHTING AGAINST “easy money,” (translate Jew-coined & printed-at-interest money) McKinley sealed his death warrant. A death warrant signed, sealed, and delivered by the powerful House Of Rothschild, criminals in bankers’ suits.\nhttps://always-myown.blogspot.de/2009/01/assassination-of-president-mckinley-was.html?m=1\nhttp://www.realjewnews.com/?cat=149",
				"added": 1490297711
			}
		],
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 2,
				"body": "Secrets of Jewish Money Control\nhttp://www.realjewnews.com/?p=978",
				"added": 1490298315
			}
		]
	},
	"comment_vote": {}
}