{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1_17q6Zhf7PFjrY3ddySK2F78JhAH3FVhmWr": [
			{
				"comment_id": 1,
				"body": "In football and generally athletics You just pick a team, wear a T-shirt that shows to everybody, which SIDE, team, You're on, and then run around and play to make Your own team win and the opposing team loose.  In politics, not just with Hilary, the competing SIDES, teams, have to differ more than simply a T-shirt color, team logo, set of financiers. Hilary's main problem is that apart from team logo and T-shirt color she does not really differ from her competitors. But that's not even the biggest problem. \n\nThe biggest problem is that even if the Hilary and Trump and whoever else were forced to form a single team like the different parties are forced to form in the Parliament of the U.S., then it seems that the United States as a whole looses its capability to differentiate itself from other parties. For example, classically Americans think that they oppose China, Arab states, Russia. But when it actually comes to the situation, where truly disgusting people, like one bearded \"Ladenn\", have to be treated by using the rules that were advertised, by offering a fair trial to everybody, allowing everybody to represent itself in court, then in stead of a trial a team of soldiers is sent to just execute the accused on spot. How does that differ from the actions of other nasty regimes?  Or take the topic of whistle blowers. The WikiLeaks and Julian Assange may be useful idiots in a role of Russian KGB puppets, but it is a fact that within advertised rule set they did not break practically any rules. Assange has been sloppy recently, but that's just recent development. He was pursued much earlier. Even the Bradley/Chelsea Manning rots in U.S. prison for revealing what constitutes as a mass murder of civilians  by the U.S. army. Again, if people get tortured for revealing U.S. government, in this case, Hilary's team's, murderous behaviour, then how does that differ from China or Russia or the Arab states? The way I see it, the only difference is the team logo and T-shirt color.\n\nhttps://www.youtube.com/watch?v=5rXPrfnU3G0\n\nhttps://www.youtube.com/watch?v=hl4NlA97GeQ",
				"added": 1477870486
			}
		],
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": [
			{
				"comment_id": 2,
				"body": "> [planespherev2](#comment_58_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): True. In Philipp Dru: administrator, Edward House wrote that in a republican election, half of the sheeple will vote for one representative, the other half for the other. This happen everytime. Then all the puppeteer has to do is to concentrate on the 5-10% indecisive sheeple. The use of mass media on them, some last minute scandal or revelation, some paid experts to criticize one or the other, and it's in the election is in the pocket.\n> Representative democracy is rigged from the beginning, and the mass medias make it totally artificial. This is manufacturing of consent, social engineering. \n> This shit and the regular false flag operations are what make our era truly despicable. This and the sheeple who buy it.\n\nI really like Your comment. You really nailed it. Unfortunately I agree with You on this one. However, the \"sheeple\" are quite slackers to depend on the travesty that the Washington provides. In stead of running non-profits to take care of the sick and elderly and orphaned, the people, in Europe and America alike, think that depending on yet-another-church for the fulfillment of their vital needs is OK. The modern \"representative democracy church\" rips the sheeple off, just like the medieval Christian church(es) ripped people off, including the taxation. You decline to pay taxes to the medieval Christian Church? Here comes a crusader knight with a sword...\n\nImagine, all of Washington is essentially built and run from tax-money. All those thousands of bureaucrats do not do anything but repress and keep the repressing church running. All of them are fed and cared for by using tax money. Most buildings in Washington are built and maintained from tax money. The amount of people, who are parasites and get their livelihood from taxes, is enormous. The communists figured it out long ago that a vote from the poor costs less than a vote from the rich, because it takes less loot, collected tax money, to buy a vote from the poor than it takes to buy a vote from the rich. And the rich, the banksters, CEO-s of megacorporations, do not really do almost any work either. It's the sheeple, the ordinary workers and small business owners, who pay for the Washington, banksters, CEO-s.\n\nOn the other hand, there is hope. A laser printer does a faster, more reliable, higher quality job than any slave ever does and with the declining price of equipment, the food and shoddy shelter of a slave costs more than using a machine to do the same work, except that the machine does it more reliably and with higher quality. The plain workers will starve, die off, but the CEO types actually are not capable of hiring the brightest minds in the industry, with any amount of money. That is to say, the CEO-s and banksters can get whatever house-sex-maid with whatever price, high price, dirt-low price, but the brightest scientists and engineers send the CEO-s to hell no matter what money the CEO-s offer. That explains the rise of portals like upwork.com and the decline of universal usefulness of money. Smart people actually do swap a job with a nasty boss with a lower paying job with a good boss and smartest of them dump salary based jobs altogether, work as freelancers. Meaning: the banksters, the washington and the majority of population, the sheeple, simply do not matter in the future, just like the insects in the forest are always in democratic majority, but they live their life, eat each-other, bite each-other, and the rest of the world moves on, lives a separate life. Just like the Christian Church lasted for thousands of years, the representative democracy church will also last for thousands of years, but some people are atheists. A few citations:\n\nNoam Chomsky on Anarchism:\nhttps://www.youtube.com/watch?v=7_Bv2MKY7uI\n\nhttp://eng.anarchopedia.org/Anarcho-Capitalism\n\nLiberty 101\nhttps://www.youtube.com/watch?v=ZpYUAucm1ZI\n\nThe peaceful, revolution free, solution is to do a better job at feeding the old and poor than the Church of Representative Democracy does and that renders the Washington ilk as irrelevant in practice as the Christian Church currently is. Nobody dies, no revolution, the crap just fades away, just like monarchies have faded away in Europe. There is absolutely no need to kill the British queen. Let the fools cheer and the queen wave from a balcony. The Egyptian Arab Spring demonstrated, that taking down a nasty regime is useless, if there is nothing better to put to its place. The proposed solution solves that issue so elegantly that all the old and nasty politicians can keep their positions, because the whole old system is/becomes irrelevant. There's also the issue that the philosophy of a constitution of a social arrangement depends on the way the new social arrangement, \"regime\", came to existence. If a new regime is created by using violence, then the violence can not be deemed immoral at the constitution of the new regime. The proposed solution is nonviolent, while using economic force to literally force the old regime to its irrelevant position, a bit like winning a chess game, which might not be physically violent, but is certainly based on using force to impose one's will on one's opponent. So, there's no need to wait till \"somebody else\" or \"majority\" does anything. Anyone of us can look at our surrounding from the perspective of our own occupation and figure out, how to do a better job than the government and all of that with the resources that one privately has.\n\nYes, it's just another puzzle: do a better job with Your own, personal, scarce resources than the Washington bastards do with their loads of money. The world is full of puzzles and smart, capable, people like puzzle games.",
				"added": 1477870746
			},
			{
				"comment_id": 3,
				"body": "Jew.S.A, Jew.S.A",
				"added": 1479043523
			}
		]
	},
	"comment_vote": {}
}