{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "[Poll] Pokemon GO - Which team are YOU on?",
			"body": "[ZeroPolls: Instinct, Valor, Mystic, or etc?](/ZeroPolls.bit/?Poll:1-1Gtj7AdXhzMFUVVvFm2ZGCbTFdgNwdtuMn)\n\nPokemon GO has made its way into about every social media network, industry and conversation, so why should ZeroNet miss out? :)",
			"added": 1468549424
		},
		{
			"topic_id": 2,
			"title": "ZeroChat Live - A General Chatroom For Everyone",
			"body": "One of the most common observations I've read all around ZeroNet is that the place feels like a ghost town. To the point that people are losing interest because a de-centralized platform feels de-centralized even in the social aspect if the community isn't bonding over this strength.\n\nThat being said, here's a general chatroom we can all come together in.\nIt's not any more sophisticated than the tutorial it was made from, but it can serve as a beginners tool to get the conversation started. Hopefully it will also prompt better chatrooms that offer various rooms and etc. But for now, it's a start!\n\nhttp://127.0.0.1:43110/1XdLr61DgYL2RLFzb6aDMxhbzHSP5sbrx\n\nHere's to a better community!",
			"added": 1483667476
		}
	],
	"topic_vote": {
		"2_1J7dTw3ZsXUsXzpBqVWVj5aXRUMsMC6Nfc": 1,
		"1_1Gtj7AdXhzMFUVVvFm2ZGCbTFdgNwdtuMn": 1,
		"24_1CMYxdit4qq9QGk9DYRu2ruRPd2YDGckH8": 1,
		"2_1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA": 1,
		"1_1PATLUvPPBevt2FssoojBEzwK1k7E2Frbc": 1,
		"1_1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA": 1,
		"1_1CYj7o5iamDZeKZvdSAW4P2aEngmAXb78T": 1,
		"9975_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"2_1Gtj7AdXhzMFUVVvFm2ZGCbTFdgNwdtuMn": 1
	},
	"next_comment_id": 15,
	"comment": {
		"2_1J7dTw3ZsXUsXzpBqVWVj5aXRUMsMC6Nfc": [
			{
				"comment_id": 1,
				"body": "Signal is so far the best messaging app I've come across in terms of security mixed with enjoyable UI and smooth functionality.",
				"added": 1468527179
			}
		],
		"1_1Gtj7AdXhzMFUVVvFm2ZGCbTFdgNwdtuMn": [
			{
				"comment_id": 2,
				"body": "Team Valor here!",
				"added": 1468549492
			},
			{
				"comment_id": 4,
				"body": "> [smiba](#comment_3_1FuufvPjG7U2JYz8GKyJthajxLXGELqccQ): Team Valor represent!\n\n:D",
				"added": 1468550730
			},
			{
				"comment_id": 5,
				"body": "> [ks](#comment_116_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): Why not make a real poll?\n\nI'm brand new to ZeroNet so at the time of making this thread, I wasn't aware of polls. \nBut perhaps for the better, since an poll-less thread may spark more conversation between the teams.\n\nCould be a good social experiment anyhow :P \n\nThanks for showing me the poll site!",
				"added": 1468556775
			},
			{
				"comment_id": 6,
				"body": "> [ks](#comment_117_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): Sure, but if the thread gets long it will be difficult to get a feeling for how many people are supporting which team.\n> Anyway, there's no harm done. :)\n\nYou raise an excellent point....\nPerhaps I'll make a poll and then link to it here.\n\nYou rock!",
				"added": 1468557614
			},
			{
				"comment_id": 7,
				"body": "> [ks](#comment_118_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): That's a damn jolly good idea! :)\nAnd Viola! We has poll~",
				"added": 1468563964
			},
			{
				"comment_id": 8,
				"body": "> [xenith](#comment_15_1Buq4fyG8B3MxAvs7h4bASyWbrKFxmg4CJ): Harmony\n\nI like your style :)",
				"added": 1468650873
			}
		],
		"14_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 3,
				"body": "A cyberpunk reddit :)",
				"added": 1468549824
			}
		],
		"24_1CMYxdit4qq9QGk9DYRu2ruRPd2YDGckH8": [
			{
				"comment_id": 9,
				"body": "> [decentralizedid](#comment_3_13hcYDp4XW3GQo4LMtmPf8qUZLZcxFSmVw): I feel the same way... it's mostly because most people nowadays lack critical thought, live in a filter bubble, and only care about entertainment.\n\nEver read Brave New World? Cause we've really done a number at bringing an Orwellian / Brave New World reality into existence.",
				"added": 1468651234
			}
		],
		"2_1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA": [
			{
				"comment_id": 10,
				"body": "Definitely agree that there needs to be a more official place where the community can discuss issues in the world, on the ZeroNet platform. It seems that most of the sites on ZeroNet are more \"proof-of-concept\" and thus aren't really that reliable in terms of actual usage.\n\nThat being said, perhaps your topic will inspire someone to do something a bit more permanent :)",
				"added": 1481510221
			}
		],
		"1_1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA": [
			{
				"comment_id": 11,
				"body": "I really like ZeroNet, but I wish it had a more lively community and presence. Some days it feels completely dead like it's been stagnant for awhile... and other days, you get these pocket surges like someone oiled the robots haha\n\nI'd really like to see some kind of front page pulse / or official weekly blog post showing off all the new Zites available to check out and that are of quality. Cause right now, if I don't actively start digging, then zeroNet feels stale to me :(",
				"added": 1483663090
			}
		],
		"2_1Gtj7AdXhzMFUVVvFm2ZGCbTFdgNwdtuMn": [
			{
				"comment_id": 12,
				"body": "> [jsilence](#comment_19_1JoKQwXPzK8uyvMCRcwvMSAJPD5S4aH5Vt): I don't see live chat as a main use case for ZeroNet. Too little integration with other networks (IRC, matrix, signal) and no good integration with mobile.\n> My hope is that ZeroNet will become a regular platform for personal websites. Right now usability is not quite there yet for the technologically challenged, but it might get there eventually.\n\nIt's not necessarily a show horse of what ZeroNet can do, but more of a tool to rally the community together in effort to fight ZeroNet feeling like a ghost town. Definitely not pushing any envelopes, so you are definitely right there.\n\nNow that ZeroNet has a mobile app in the works, ZeroChat will eventually conform to mobile standards as well as to make it more accessible there (kind of rough around the edges at the moment)\n\nUltimately, I hope that this project will inspire bigger and better things :)\nAnd right there with you, I want to see ZeroNet become appealing to the common internet user versus the technologically inclined and curious. Perhaps familiar sites and functionality can help achieve that, such as chatrooms which take no explanation. One can hope anyhow :P",
				"added": 1483913882
			}
		],
		"1_1CYj7o5iamDZeKZvdSAW4P2aEngmAXb78T": [
			{
				"comment_id": 13,
				"body": "There is a part of me that wants a notification system, so that if a post i'm following gets a new comment (or specifically, someone replies to my comment), that zero in the top right circle changes to 1 and then changes to the green color. that's what I want xD\n\nAnd sure, that zero represents ZeroNet... but if you are here, you already know you're using ZeroNet.",
				"added": 1484069847
			}
		],
		"1_183waZSH7rC3CMWuh9nSxpUmRVh498pwGQ": [
			{
				"comment_id": 14,
				"body": "Come say hello in the ZeroChat Live chatroom!\nhttp://127.0.0.1:43110/1XdLr61DgYL2RLFzb6aDMxhbzHSP5sbrx/",
				"added": 1484070083
			}
		]
	},
	"comment_vote": {
		"1_1Gtj7AdXhzMFUVVvFm2ZGCbTFdgNwdtuMn": 1,
		"2_1LfQ8dwqkqkGQNCg1kBevHPxjvTRJTQYBz": 1,
		"3_1FuufvPjG7U2JYz8GKyJthajxLXGELqccQ": 1,
		"3_1LfQ8dwqkqkGQNCg1kBevHPxjvTRJTQYBz": 1,
		"116_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx": 1,
		"2_1Gtj7AdXhzMFUVVvFm2ZGCbTFdgNwdtuMn": 1,
		"117_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx": 1,
		"118_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx": 1,
		"15_1Buq4fyG8B3MxAvs7h4bASyWbrKFxmg4CJ": 1,
		"121_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj": 1,
		"2_17t1SSEctN1Y6feGHkZeWAU62eYytWWbi6": 1,
		"19_1JoKQwXPzK8uyvMCRcwvMSAJPD5S4aH5Vt": 1,
		"12_1Gtj7AdXhzMFUVVvFm2ZGCbTFdgNwdtuMn": 1,
		"16_18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y": 1,
		"7_17t1SSEctN1Y6feGHkZeWAU62eYytWWbi6": 1,
		"13_1Gtj7AdXhzMFUVVvFm2ZGCbTFdgNwdtuMn": 1,
		"14_1Gtj7AdXhzMFUVVvFm2ZGCbTFdgNwdtuMn": 1
	}
}