{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "test vwsf",
			"body": "Hello world",
			"added": 1477628487
		},
		{
			"topic_id": 2,
			"title": "Community Currency",
			"body": "Anyone interested in creating a New Form of Currency, alternative to the central bank notes?\n\nWithout new currency, we remain all slaves.",
			"added": 1477628639
		},
		{
			"topic_id": 3,
			"title": "U.S.A. Second Revolution Underway! 2016-11-01 WoW....",
			"body": "Oh My... U.S.A. Second Revolution Underway\n\nCorrupt Clinton Coup vs Counter Coup lead by 17 U.S.A Intel Agency Patriots!\n\nhttps://www.youtube.com/watch?v=2v20EYJvBUM",
			"added": 1478165657
		}
	],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"2_1MdwjTFbwpWCLfyo2ZjeXzB7DbL7euNPBi": [
			{
				"comment_id": 1,
				"body": "1. Quantity of currency must be known and controlled.\nAs of this writing, there are 70 trillion dollars worth of goods and services combined in the world.\nAs of this writing, there are 550 trillion dollars worth of currency.\nWho has all the money? The top 1% of 1% of 1% of the population. Call them the establishment, Call them globalist. Call them central bankers. It doesn't matter.  They control the world through their system.\nThey use central banking systems to create private bank notes, i.e. money. \nThey use the banking and stock market systems to siphon off the money, leaving barely enough for the rest of us.\nThey use excess money to buy off the 3 sources of truth\n  1.  academia\n  2. main stream media (MSM)\n  3. politicians \nThey use the academia to present what ever propaganda they want\nThey use the msm to appeal to authority , i.e. academia, for further propaganda control\nThen they use the politicians to pass laws, i.e. force, to control the population\n\nUnder the banner of \"Privacy\", they hide who they are.  From the shadows, they manipulate the world.\n\nIf you love freedom, quantity of currency must be known and controlled by the people.",
				"added": 1477629449
			},
			{
				"comment_id": 2,
				"body": "2. Problem with Bitcoin, other cryto currency, gold, silver and other commodity based currency\nCommodity among all these currency is that, the quantity is limited.  When currency is limited, it can be manipulated by 1 or small group of people.  Manipulator, by removing it out of circulation, they can control the value of currency and manipulate the currency based economy.\n\nSee. US History under Andrew Jackson, U.S. Depression in the 30's, Business Cycle, i.e.the amount of money economy cycle, etc...",
				"added": 1477630242
			},
			{
				"comment_id": 6,
				"body": "Thank you for the engagement in the conversation.\n\nThoughts have consequences.  \n\nIMHO, my appeal is that all those currencies are fundamentally, foundationally, and philosophically  flawed. \n\nWhat is the flaw?  \n1. Those who control the quantity, control the value and therefore can manipulate the market based upon it.\n- Consider this. \n--  Those who start it, those who mine it, usually reap the most benefit. \n-- When was the last time you mined a Bitcoin? Truth is, bulk of it already mined and is controlled by the few. Not as restrictive as the current banking note system, but none the less, it can be controlled at any time by the few.  Can be easily corrupted, same as our current system.\n-- Always goes back to those who control quantity of currency, control the market.\n\n2.  Money should be used, not whorled. (See and understand Demurrage currency: i.e. the cost associated with owning or holding currency over a given period. It is sometimes referred to as a carrying cost of money)  All those currency, reward creation and holding currency.  This is same philosophically as our current system. \nCreate massive amount of money, hold it and used it when ever to corrupt the system. Favors the few over the masses\n\nSeveral examples of Demurrage system throughout history, encourages use of money for creation, jobs, building, doing something with money, rather than holding which benefits only those who have it. \nAlso goes back to point#1, holding currency, limits quantity of currency in the market, to get things done. When currency is used, it creates jobs; Things get built; Services are provided.  If currency not being used, it's not doing any good. This, mindset to whord must change. (At lease in this proposed behavior stack)\n\nPros (620 + community currency)\n-- for a small group of people who use it,  all those crpyto currencies, as a medium of exchange will work.\n\nCons\n-- Inherently fails when you think though the life cycle of that technology globally as it scales.\n-- No penalty to not use money, hinders investment in other areas of life, as in creating jobs, building, manufacturing, and doing and provide services. When money is whorled and not used.\n\nNew community currency would be for and based on... \n1. Citizens of a Trust State (Community willing to mutually use force to defend each others lives, liberty and property)\n2. Pure democracy (Maximum Freedom for the individual.  First time in history, technology makes this possible.)\n3. Freedom for the willing (Principle of Peace through persuasion and separation and resists those who pursue Peace through Domination and Oppression)\n\nThink out side the box for those that can't.",
				"added": 1477673913
			},
			{
				"comment_id": 7,
				"body": "> [planespherev2](#comment_71_1C9BTLZFTprZPJXkg9vPuZLBr3LeaxB7nj): Why making an other currency? \n> Can't you imagine a world without money? \n> If you have time and braincells to dedicate to a knew currency, supposedly flawless (but that's the point: currency is power over others by essence), then you could think about making a money less society.\n\nGreatly appreciate your response.\n\n\"Can't you imagine a world without money? \"\nI can imagine a world without money.  It's called heaven.  Unfortunately, I'm a vile sinner, on this side of life.  Means I have to choose make the most out of the circumstances for myself, family, community and state. \n\n\"if you have time and braincells...\", Are you saying that I should spend my time making society better, rather than create new currency?\n\nCurrently, I lean toward the belief that developing better \"money\", will have the greatest return and impact on society than any other subject, for those of us with \"brain cells\" can put our minds to.   Global poverty, disease, hunger, famine, pain and suffering can all be linked back to money. An accountable, traceable, honest, interest free, demurrage money system, has the greatest potential to address these problem at one the root causes for all these issues.\n\nMy appeal.  \n- Money is a medium of exchange.  \n- If one is self sufficient, one has no need for money.\n(While I love the idea of rugged individualism, i.e. in the wilderness, being a prepper, growing my own food,  being self sufficient, being off the grid on my own land, but there are too many genius people with great ideas, services and products, which I'd love to exchange my services and goods for.  To do this one needs an easy medium of exchange.)\n- Most people are not self sufficient, \n- Therefore we need money. (At least on this side of heaven and life)\n\nAs for \"flawless\" currency,  don't know if it's possible, but the focus is on the upward spiral, understanding, improving, addressing known weaknesses in current system to make it better and better. A lot of what crypto currency  has to offer is good. If philosophically, more \"freedom\" for the masses is the goal, then we make it better. \n\nAs for \"currency is power over the others\", while it seems true now with our current system, this does not have to be.  This is why I pose the question; to engage in conversation to learn and improve our current system for myself, family, community and state. While I'm better off than others under this current system, I recognize that it is rigged. Is there not an obligation by those who are capable, to serve and be served by our fellow man?  \n\nWhat say you?",
				"added": 1477757708
			}
		],
		"1_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 3,
				"body": "Bring Back the Greenbacks!  Collaborate on Community Currency! End the Fed! End the Enslavement!\n\n“I believe that banking institutions are more dangerous to our liberties than standing armies.” –Thomas Jefferson",
				"added": 1477658980
			},
			{
				"comment_id": 4,
				"body": "https://www.youtube.com/watch?v=6FSD4pECZ9I\n\nMAGA!!!  Last hope against the rigged system.",
				"added": 1477659252
			},
			{
				"comment_id": 5,
				"body": "Our current monetary SYSTEM is evil.  \nAll Jews as people are not ALL evil.\nMost Jews are just pawns and establishment propaganda to aim your hatred.\nIt is the few elites, the establishment, oligarchs, nephillum, the demon possessed and oppressors WHO are evil\n\nSharia Laws as an oppressive SYSTEM is evil.\nAll Muslim as people are not ALL evil.\nMost Muslims are just pawns and establishment propaganda to aim your hatred.\nIt is the few elites, the establishment, oligarchs, nephillum, the demon possessed and oppressors WHO are evil\n\nOur established shadow SYSTEM is evil.\nThose that actively seek to oppress people are evil.\nSystem seeks to start wars, one group against the other. Jews against Muslims; Democrat vs. Republican; Christian vs Catholics;  U.S. vs. Russia; Japan vs China; Communist vs Republic;They have funded all major wars over the past around 400-500 years.  \n\nWe who love freedom must unite!\n  Ignorant will remain divided\n\nWe must reject their rules \n  Ignorant know not but to comply\n\nWe must create our own freedom based laws \n  Ignorant live under oppressive laws\n\nWe must focus and target our hatred at evil\n  Ignorant without reason hate all\n\nWe must act based on truth and reason\n  Ignorant acts are controlled by lies and emotions\n\nWe must train ourselves to discern evil and know why we act\n  Ignorant have been conditioned to hate without knowing why\n\nWe will always fight for freedom only for the willing\n  Ignorant fights for all and those who don't want freedom\n\nWe who love freedom will prevail\n  Ignorant continue to hate and remain slaves.\n\nLet's aim our hatred, energies and efforts at true evil. \n\n“If you know the enemy and know yourself, you need not fear the result of a hundred battles. \nIf you know yourself but not the enemy, for every victory gained you will also suffer a defeat.\nIf you know neither the enemy nor yourself, you will succumb in every battle.” Sun Tzu",
				"added": 1477662872
			}
		]
	},
	"comment_vote": {}
}