{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd": [
			{
				"comment_id": 1,
				"body": "Hey, down vote as much as you want. We still know that your \"anti-semitic\" bullshit is just that, bullshit. We're here because of jews like you are running Google, Microsoft, mainstream media, Hollywood and every central bank in this world. Fuck you, kike. Fuck you.",
				"added": 1487478632
			},
			{
				"comment_id": 2,
				"body": "> [binero](#comment_214_17ac9ybVj5CtUpBvi5NeP1EwNZjfJoZWvt): A transparent administration is needed, but how would it help? Even in areas where there is transparency fake news is winning grounds. Look in the UK, where there is fake news everywhere claiming the EU parliament is not democratically elected, or that the EU commission appoints itself. Or the wildly debunked myth that the EU had a negative impact on the UK fishing industry, while in fact it had no impact to a slightly positive impact. \n> Look at Sweden where there are still claims that immigration increased the amount of sexual assault even though we know that the reason it increased is because the laws were made stricter. \n> Look at Donald Trump who is claiming there were millions of people who voted illegally in his country. Look at the Clinton campaign who claims without any evidence Russia hacked their emails. \n> All these claims lack any evidence, and most of them can be easily debunked. All of them happen in very transparent areas. Yet most people will believe all of these claims, and they all have a direct impact on our democracy. Fake news is a very big issue.\n\nYou kidding? Even Obama said that illegals can vote. What Trump said is truth, 100%. \nThe only fake news here are CNN, MSNBC, CBS, etc... Mainstream media is fake news.",
				"added": 1487479115
			}
		],
		"2_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": [
			{
				"comment_id": 3,
				"body": "Why are you labeling people? Being aware of the jewish problem is not the same as being a national socialist. \nFor example, I'm nationalist, not socialist (should be called a \"na\"?). Just go back to Google, Jewtube, Redit, Facebook, etc., etc., etc. There you have all the censorship you \"need\".",
				"added": 1487479825
			}
		],
		"1_13GyWy7pXEtCorqUBAv7ZPjyzNfwMA6Hh2": [
			{
				"comment_id": 4,
				"body": "Because there's a lot of chinese. Much more than english speaking users. It's more probable seeing chinese users mistakenly writing here, than polish, french, japanese, or any other people. Besides that, we could agree that chinese are generally a little bit clumsy, hehe. Lovely people anyway.",
				"added": 1487480263
			}
		]
	},
	"comment_vote": {
		"159_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS": 1,
		"22_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"3_1A1itSy8SqrLrX5UZNpXUuRk11WvEHwGca": 1,
		"4_1MrRShZ9dp1stuYhAyzguqFXv8X4E4AjCn": 1,
		"1_1CAUL8cJtANuC6khKYwg6orGWnLbjPgaLu": 1
	}
}