{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"9_12i4LiZ39NxcYtsf36aTWJzcpzw4KFUCJy": [
			{
				"comment_id": 1,
				"body": "Gay Americans are supporting Hillary to make more gays worldwide and to kill all others.\nEuropeans must eat American gay food after making the trade partnership and they will become gays.",
				"added": 1475752778
			},
			{
				"comment_id": 3,
				"body": "> [21x](#comment_4_1LtzSR6qY5YBVNfDvktEd7xHo7dwvE2zBf): I am so disappointed of Trump. He capitulated in front of gays, feminists and Jews.Why needs somebody to apologize if he in a private conversation expresses his aversion towards  women with silicone breast ? I mean these are still humans to a certain degree but sexually are certainly not attractive to normal men. Even Jews know that.\n\nThe end of the world is near. We are all doomed.\nEven Arnold Schwarzenegger is on their side.\nGays, feminists with silicone breast, drones and terminators will kill the last human males.",
				"added": 1476019991
			}
		],
		"4_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 2,
				"body": "Jews may steal from non-Jews.\nIf a Jew finds an object lost by a non-Jew it does not have to be returned.  (Talmud/BT Baba Mezia 24a.  and Baba Kamma 113b).\nA non-Jew must pay wages to a Jew, but a Jew does not have to pay wages to a non-Jew.  (Talmud/BT Sanhedrin 57a).\nIf a non-Jew robs a Jew, he must pay him back.  But whatever a Jew robs from a non-Jew, the Jew may keep. (Talmud/Bava Kama 113b; also Bava Metzia 111b).\nIt is permissible to cheat a non-Jew in court.  (Talmud/BT Baba Kamma 113a) \n",
				"added": 1475920049
			}
		],
		"3_17LQPJZz9sBC1besM5ZwKFKt9CmndJTjcA": [
			{
				"comment_id": 4,
				"body": "here you have the answer\nhttps://www.youtube.com/watch?v=gxVONyqXMJg",
				"added": 1476087604
			}
		],
		"3_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": [
			{
				"comment_id": 5,
				"body": "> [21x](#comment_1_1LtzSR6qY5YBVNfDvktEd7xHo7dwvE2zBf): Japanese men masturbate too much and God have punished Japan.\nThey make a lot of hand-jobs.\nBut having sex with robots is just another form of masturbation.\nJapanese unwillingness to have normal sex paves way for economic collapse\nhttps://sputniknews.com/asia/20160920/1045518698/japanese-sex-economic-collapse.html",
				"added": 1476096665
			}
		]
	},
	"comment_vote": {}
}