{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"4_16UbJDyboDaAjW5fiZouKWpPJztpt43kEj": [
			{
				"comment_id": 1,
				"body": "מילה\nסט מכשירים המשמשים לשם ביצוע ברית המילה, תצוגה במוזיאון העיר גטינגן\nערכת כלי ברית מילה: משחזת, מגן עטרה, מפריד, סכין מילה, מספריים ושפופרת מציצה\n\nשלב המילה, שהיא חיתוך העורלה, הוא השלב הראשון והמרכזי בברית המילה. כדי לכרות את העורלה המוהל משתמש בסכין מילה, כאשר מגן המתכת המגן על העטרה מפני חיתוך בטעות מסמן את הגבול התחתון של החלק הנחתך.\n\nרופאים המבצעים מילה רפואית נוהגים להשתמש במגן מתכת בעל אפשרות לסגירה הדוקה ביותר, המשמש לתפיסת העורלה עד להפיכתה לנמק קודם לחיתוכה, בהליך הנמשך כעשר דקות. השימוש במגן המתכת ההדוק נועד לצמצם למינימום את הדימום לאחר החיתוך. ההלכה היהודית שוללת את השימוש בטכניקה זו לשם קיום מצות ברית מילה, כיון שהמצוה מתקיימת בכריתת העורלה, ואילו בהליך הרפואי העורלה נכרתת רק לאחר שהפכה לנמק ונעשתה 'בשר מת'.[52] בנוסף, לדעות מסוימות בהלכה הטפת דם הברית היא חלק מהמצוה, בעוד שהתופסנים מונעים כמעט לגמרי את יציאת הדם.[52] באופן דומה נשלל גם הליך המילה באמצעות לייזר, במהלכו לא יורד דם. החריג היחידי הם תינוקות בעלי הפרעות קרישה משמעותיות (כגון חולי המופיליה), הנימולים באופן המבטיח כי לא יאבדו דם במהלך ברית המילה.\nפריעה\n\nהפריעה היא חשיפת העטרה על ידי הסרת שכבת העור הדק שבין העטרה והעורלה, הדבוקה אל העורלה אצל ילודים ('inner preputial epithelium'). היא מוזכרת במשנה, אך אופן ביצועה לא נזכר במשנה או בתלמוד.\nמקור הפריעה\n\nבמקרא לא מוזכר במפורש קיומו של שלב הפריעה, אם כי יש שפרשו שהסיבה שיהושע נצטווה למול את בני ישראל \"שנית\", היא שבהיותם במדבר הם מלו אך לא פרעו. לפי התלמוד הבבלי הפריעה נוספה לברית המילה רק בעת מתן תורה,[53] ועל כן בוצעה לראשונה בימי יהושע. מדרשי הלכה לומדים את ציווי הפריעה מפרשת המילה שנאמרה לאברהם,[54] אולם על פי דעה אחרת, הפריעה אינה נלמדת מהתורה כלל, אלא היא הלכה למשה מסיני.[55]\n\nלפי המשנה[56] הפריעה היא חלק משמעותי מברית המילה, ומילה ללא פריעה אינה נחשבת למילה הלכתית. התלמוד הירושלמי[57] אף מוסיף שחיוב כרת על מי שלא נימול חל גם על מי שמל ולא פרע. יש המפרשים[58] שהכונה לנימול, שנותר ערל, מאחר שטרם נתגלתה עטרתו. אך יש המפרשים,[59] שהכוונה בגמרא היא למוהל במקרה שהברית חלה בשבת, כך שנעשה חילול שבת לצורך המילה, בלי לקיים את המצוה. לדבריהם ייתכן, שחיתוך העורלה כשלעצמו, פוטר את הנימול מחיוב כרת.[60]\n\nפרופ' ניסן רובין טוען שהפריעה מקשה על 'משיכת עורלה',[61] ושלשם כך הונהגה, רק בעקבות גזירות אדריאנוס.\nהליך הפריעה\n\nרש\"י כתב בפירושו על התלמוד,[62] שהפריעה היא הליך בו \"פורעין את העור המכסה ראש הגיד\". הרמב\"ם, והשולחן ערוך כותבים שמבצעים את הפריעה בעזרת הציפורנים של המוהל: \"ואחר כך פורעין את הקרום הרך שלמטה מן העור בצפורן ומחזירו לכאן ולכאן עד שיראה בשר העטרה\". לפי מנהג זה, המוהל, שמגדל ציפורן אגודלו במיוחד למטרה זו, מקלף את הקרום הרך שתחת עור הערלה וחושף את העטרה. אולם, לפי מקורות אחרים, כמו תשובות הגאונים לרב האי גאון, ניתן לבצע את הפריעה גם בעזרת כלי. בכללי המילה לרבי יעקב הגוזר נכתב שמנהג שאלוניקי הוא לעשות מילה ופריעה כאחת באיזמל, מחמת אי הנקיות של ציפורן המוהל. כאשר מופרדת שכבת עור זה מהעטרה קודם למילה עצמה (כפי שנעשה על ידי חלק מהמוהלים), מוסרת רוב שכבת עור זה יחד עם העורלה, ועל כן רובו של שלב הפריעה מתבצע יחד עם המילה עצמה, כאשר לאחר מכן מוסרות מעט השאריות שנותרו באמצעות ציפורן, סכין או מספריים.\n\nבמילה רפואית מודרנית נהוג להפריד את שכבת עור הפריעה קודם למילה, ועל כן הקרום שתחת העורלה מוסר יחד עמה בעת חיתוך העורלה, בדומה לנהוג אצל חלק מהמוהלים.[63] בעוד במילה יהודית מוסרות שאריות שכבת עור זו, בהליך הרפואי שכבת העור שנותרת נתפרת למקום החיתוך על מנת לכסות את פצע החיתוך.\nמציצה\n\nלאחר המילה והפריעה מגיע שלב המציצה. בשלב זה המוהל מוצץ את הפצע עד שיצא ממנו דם. דין המציצה מוזכר במשנה[64] ובמדרש (כמובא בדברי הרמב\"ם) אף מובא שכך נהגו משה רבינו ואהרן הכהן.[65] התלמוד[66] מבאר שהמציצה נחוצה לשם מניעת סכנה רפואית מהנימול, אך אינו מבאר מהי סכנה זו.\n\nעניין המציצה מוסבר בדברי רבי יעקב הגוזר, מוהל בן המאות ה-12 וה- 13: \"מציצה כיצד? אחר הפריעה מיד מכניס את האבר לתוך פיו ומוצץ את הדם בכל כוחו משום שהדם נקרש בפי האמה וסכנה הוא אם אינו מוצץ. כדאמרינן בפ' ר\"א: אמר רב פפא אומנא דלא מייץ מעבירין ליה משום דדם נקרש בין האמה והוא סכנה\".[67] מקובל בעדות אשכנז ועדות נוספות שלפני המציצה ממלא המוהל את פיו במעט יין, מקור מנהג זה הוא בדברים שעל פי תורת הקבלה.[68]\n\nהרב ד\"ר מרדכי הלפרין מסביר[69] את הצורך במציצה ביתר ביאור; לדבריו עורקי הגב של האיבר מתכווצים בעקבות חיתוך העורלה, והדם שנקרש עלול במקרים נדירים לחסום אותם ולהוביל לנמק. יש שהסבירו את פעולת המציצה כשחרור חסימת כלי הדם שנחתכו ואינם מדממים עקב התכווצות השריר באזור, אך יחלו לדמם לאחר שהשריר יתרפה. לפי הסבר זה, תכלית המציצה היא זיהוי מוקדם של שטפי דם בלתי נשלטים, לדוגמה עקב המופיליה בלתי ידועה.[70]\nהפולמוס סביב המציצה בפה\n\nהליך המציצה המסורתי בברית המילה נעשה ישירות בעזרת פיו של המוהל. אולם, בעקבות החשש לסכנות בריאותיות של הדבקות במחלות זיהומיות (לדוגמה הרפס ואיידס), הן לתינוק והן למוהל, כתוצאה ממגע ישיר של פי המוהל בפצע הפתוח, יש שהעדיפו מציצה דרך שפופרת סטרילית. סוגיה זאת נדונה בין פוסקי ההלכה במשך יותר מ-150 שנים, ולאור זאת נהגו ביהדות גרמניה שלא לבצע את המציצה בפה.\n\nבשנת 2003 הוועדה הבינמשרדית לפיקוח על המוהלים הפיצה חוזר למוהלים, לפיו על המוהל \"ליידע את הורי התינוק הנימול בעת ההזמנה לביצוע הברית על שתי האפשרויות לביצוע חובת המציצה, ולהחליט על כך תוך כדי שיתופם בהחלטה\". אולם ניסיונות לשכנוע מורי ההוראה של הציבור החרדי להנהיג לכתחילה מציצה באמצעות שפופרת, או בדיקות הרפס שגרתיות למוהלים, נתקלו בהתנגדות, הן מחשש שהדברים יגיעו לביטול המציצה בכלל והן מפני שאחוז הנפגעים נמוך מאד ומדובר בסיכון שמקובל לקחת בכל תחומי החיים. הרב פרופסור אברהם שטיינברג, חבר הוועדה הציבורית לפיקוח על מוהלים בישראל, טוען שמניעים פוליטיים ומגמתיים עומדים מאחורי הניסיונות לאסור את המנהג, \"השיקול שמנחה את הרבנים אינו אסתטי, אלא חשש סביר לפיקוח נפש. נכון להיום, אנחנו יודעים שקיימת סכנה לתינוק רק במצבים חריגים. למשל, כשלמוהל יש פצע מדמם בפה. אבל הניסיון המצטבר ממאות שנים של מציצה מראה שסטטיסטית הסכנה קטנה הרבה יותר מאשר חציית כביש, למשל\".[71]\n\nסוגיה זו התעוררה ביתר שאת בשנת 2005, בעקבות מוהל שהדביק שלושה תינוקות בהרפס (אחד התינוקות נפטר) בניו יורק, במהלך המציצה,[71] וכן בעקבות מחקרים שהתבצעו בארצות הברית, ישראל וקנדה, וזיהו 11 מקרים נוספים של הדבקות תינוקות בהרפס בעקבות המציצה בפה מאז שנות השמונים. לצמצום הסכנה לנימול ולמוהל פרסמה מחלקת הבריאות של מדינת ניו יורק פרוטוקול למניעת זיהום הרפס בילוד.[72] סוגיה זו נתונה במחלוקת בין המוהלים: בעוד חלקם מוצצים ישירות בפה (לאחר חיטוי מסוים), אחרים מוצצים באופן סטרילי באמצעות שפופרת.\n\nהרב ד\"ר מרדכי הלפרין מתאר את בעיית ההרפס כמצב חדש במגזר החרדי בישראל. לדבריו,[69] בעבר היו רוב האוכלוסייה נשאים של נגיף ההרפס. ממילא, היו תינוקות יורשים נוגדנים לנגיף מאימותיהם. כיום, בעקבות שיפור בתנאים התברואתיים, ישנו מיעוט משמעותי של נשים צעירות שאינן נושאות את המחלה, ועל כן התינוקות הנולדים להן פגיעים להדבקה בשעת המילה, במקרה של מציצה שנעשית על ידי מוהל החולה בהרפס.\n\nהרב שאול פרבר ממכון עתים, המספק ייעוץ בטקסי מעגל החיים היהודי, מעריך כי רוב טקסי ברית המילה בישראל, נעשים על ידי מוהלים חרדים, בדרך של מציצה בפה.[71] מאידך, הרב הלפרין טוען,[69] שקרוב \"ל 90% מהבריתות בישראל מתבצעות כיום על ידי תחליף מציצה – שאיבה באמצעות שפופרת\", ומצביע על כך ששבעה מקרי ההדבקות בהרפס שהוצגו בפני הוועדה הבינמשרדית לפיקוח על המוהלים, לאחר שקרו בשלוש השנים שקדמו לדיון, התרחשו במגזר החרדי.\nמהלך הטקס\nמנהגים לפני הטקס\n\nבעדות אשכנז נוהגים לקיים אירוע מיוחד בליל השבת הראשונה לאחר הולדת התינוק, הנקרא שלום זכר. באירוע מוזמנים קרובים וידידים לאחל מזל טוב למשפחת התינוק, מוגש כיבוד, ונאמרים דברי תורה. כמו כן, נהוג לקרוא קריאת שמע ליד התינוק בלילה לפני הברית, יחד עם ילדים, ולחלק ממתקים לילדים.\n\nאצל הספרדים נהוג לקיים לימוד בלילה שלפני הברית, והוא נקרא \"ברית יצחק\".\n\nאצל יוצאי בבל (עיראק), נוהגים הנשים והילדים להתאסף בבית היולדת ביום השישי ללידה, להכין סוכריות אגוזים ושאר גרעינים קלויים הנקראים שאשה (שש), ולשיר שירים שונים. בערב הברית מתאספים לטקס שנקרא עיקיד אליאס (\"ברית אליהו\"), מביאים כיסא של אליהו הנביא, שמים עליו בשמים ואורות, וקוראים מספר הזוהר. מנהג נוסף הוא הזמנת ילדי השכנים של משפחת התינוק לקרוא קריאת שמע עם התינוק בלילה שלפני הברית.\nטקס ברית המילה\nתינוק בידי סנדקו, הישוב על כיסא אליהו.\n\nבדקות שלפני הכנסת התינוק נוהגים בעיקר בני עדות המזרח לשיר פיוטים שונים, כגון \"יְהִי שָׁלוֹם בְּחֵילֵינוּ\", \"אֶעֱרֹךְ מַהְלַל נִיבִי\", ועוד. עם הכנסת התינוק למקום שבו נערך הטקס, נהוג שהקהל מכריז \"ברוך הבא בשם ה'\". את התינוק מניחים על \"כיסא אליהו\", שמיועד לכך. טעם המנהג הוא במדרש שמובא בספר הזוהר (פרשת לך לך, דף צג ע\"א) שמספר שבעקבות דבריו של אליהו הנביא על הפסקת ברית המילה (מלכים-א יט, יד), הוטל עליו להיות נוכח, כביכול, בכל מעמד של ברית מילה ולהעיד על כך שישראל מקיימים את המצווה, בניגוד לתלונתו. לכן מתקינים כיסא לכבודו.\n\nנהוג לכבד במיוחד מישהו להחזיק את התינוק על ברכיו, והוא הנקרא סנדק. אבי הבן מברך ברכת \"להכניסו בבריתו של אברהם אבינו\", והמוהל מברך \"על המילה\". אבי הבן מברך ברכה נוספת - ברכת \"שהחיינו\". לפי מנהג הספרדים, יושב הסנדק על כיסא אליהו ומחזיק עליו את התינוק מיד לאחר הברכה הראשונה, \"להכניסו בבריתו של אברהם אבינו\". הקהל עונה לברכה זו \"כשם שהכנסתו לברית, כך תזכה להכניסו לתורה ולמצוות ולחופה ולמעשים טובים\".\n\nלאחר מכן מברך המוהל או אחד הנוכחים, וכוס יין בידו, את ברכת \"בורא פרי הגפן\", ולאחריה \"בורא עצי בשמים\" על צמח ריחני שהובא לשם כך. את הברכות חותמת ברכת \"אשר קידש ידיד מבטן\" שמסתיימת ב\"ברוך אתה ה', כורת הברית\". אחר הברכות נאמרת תפילה לבריאות הילד, ונהוג שאז מוכרז שמו לראשונה. בתוך התפילה מוזכר הפסוק (יחזקאל טז, ו) \"ואומר לך בדמיך חיי\", וכשקוראים פסוק זה טובל המוהל את אצבעו בכוס היין, ומטפטף לפי התינוק פעמיים.\n\nהטקס מסתיים, לעדות הספרדים - בקדיש, ולאשכנזים - בתפילת עלינו לשבח. אחר כך מתקיימת סעודת מצווה.\n\nעל פי רוב, ברית המילה מתבצעת כיום בבתי כנסת או באולמות אירועים. לרוב הטקס פומבי ונערך בנוכחות קרובי משפחת היילוד ומכרים. בקרב חילונים בישראל יש המפרידים בין ברית המילה עצמה, שנערכת בהרכב משפחתי מצומצם ולעתים בבית החולים, לבין מסיבת הברית, שנערכת מספר שבועות מאוחר יותר.\nהיבטים רפואיים\n\n    Postscript-viewer-shaded.png ערך מורחב – מילה (ניתוח)#תופעות הנובעות מהמילה\n\nמחקרים העלו שמילה מפחיתה משמעותית את סיכוני ההדבקה בנגיף האיידס ביחסי מין הטרוסקסואלים, וכן מפחיתה את הסיכון למחלות מין ומחלות זיהומיות נוספות, לרבות סרטן הפין. בעקבות כך מממן ארגון הבריאות העולמי את מילתם של אלפי גברים, במטרה למנוע התפשטות של איידס ומחלות נוספות.[73] בשנת 2012 פרסמה האקדמיה הפדיאטרית האמריקאית (AAP) נייר עמדה המבוסס על חקירה ובדיקה של יותר מאלף מאמרים בספרות הרפואית, ועל פיה התועלות הבריאותיות של מילת תינוקות עולות על הסיכונים.[74]\nהיבטים חברתיים\nקיום המילה\n\nמצוות ברית המילה זוכה לתפוצה רחבה גם בקרב חילונים שאינם מקיימים את מרבית המצוות, ורוב היהודים החילוניים מלים את בניהם לפי דרישות ההלכה ולפי המסורת היהודית. בנוסף להיבט הדתי, יש למילה גם היבט חברתי, המעודד את קיומה במקום שבו הרוב נימולים. יש התומכים בניתוח גם משיקולים רפואיים. לפי סקר משנת 2009,[75] 94 אחוזים מקרב היהודים הבוגרים בישראל שהשתתפו בסקר, השיבו ש\"חשוב\" או \"חשוב מאוד\" לערוך את טקס ברית המילה.\nהתנגדות לביצוע המילה\n\nישנם מתנגדים לברית המילה, התופסים אותה כפעולה מיותרת הפוגעת בשלמות היילוד וגורמת לכאב, לעתים תוך צידוד בנזקים אפשריים מהתהליך. אחרים טוענים כי אין להם בעיה עם ההליך עצמו כל עוד הוא נעשה בבגרות מתוך בחירה מודעת של העובר אותו (למשל מבחינה אסתטית). כמו כן מעצם היותו טקס דתי. בשנת 1998 הוגשה לבית המשפט הגבוה לצדק עתירה שדרשה להוציא אל מחוץ לחוק את ברית המילה בנימוק של \"פגיעה בחוק יסוד: כבוד האדם וחירותו\". העתירה נדחתה על הסף.[76]\n\nבאוקטובר 2013 הצהירה האספה הפרלמנטרית של מועצת אירופה, כי היא מודאגת במיוחד מ\"הפרות מסוימות של שלמותם הפיזית של ילדים\", שהתומכים בהם מציגים אותם כמועילות לילדים חרף \"עדויות ברורות להפך מכך\" ומנתה ביניהם \"מילת זכרים צעירים מסיבות דתיות\". המועצה קראה למדינות החברות \"להגדיר בבירור את התנאים הרפואיים, הסניטריים והאחרים אותם יש לוודא עבור מנהגים הרווחים בקהילות דתיות מסוימות, כגון מילתם הבלתי מוצדקת מבחינה רפואית של זכרים צעירים\".[77] בתגובה, משרד החוץ הישראלי הכריז שההחלטה היא \"בגדר התקפה בלתי נסבלת הן על המסורת הדתית המכובדת והעתיקה שעומדת בתשתיתה של תרבות אירופה, והן על הרפואה המודרנית וממצאיה\" ו-\"מביאה לליבוי רוחות השנאה והגזענות באירופה.\"[78] במכתב לנשיא מדינת ישראל, מזכ\"ל המועצה הדגיש \"שהמועצה הפרלמנטרית של אירופה היא גוף מייעץ אשר לא מייצג את עמדתה הכללית של מועצת אירופה כולה.\"[79] בעקבות מאמצי שכנוע מצד ארגונים יהודיים,[80] בספטמבר 2015 קיבלה האספה החלטה מתוקנת, שאינה מגדירה את המילה כהפרה של שלמות הילד או כבלתי מוצדקת מבחינה רפואית.[81]\n\nמבין מתנגדי ברית המילה, יש העורכים, במסגרת מסיבת קבלת הפנים לתינוק או לתינוקת, טקס אלטרנטיבי בשם ברית שלום, שמטרתו הצעת חלופה סמלית למילת הבשר, או הבעת הסתייגות מברית המילה המסורתית.\nזבד הבת\n\n    Postscript-viewer-shaded.png ערך מורחב – זבד הבת\n\nלרגל לידת בת, יש העורכים אירוע חליפי לסעודת המצווה או למסיבת הברית, המכונה בשם 'בריתה' או 'זבד הבת'. באופן מסורתי, זהו טקס דתי המשלב תפילות ופיוטים מיוחדים. כיום המנהג לערוך בריתה התפשט לחוגים נוספים, ולא תמיד הוא נושא אופי טקסי או דתי. בריתה אינה כוללת מילה.",
				"added": 1492458047
			}
		],
		"1_1KNaemLKhPio4dCJiSvi81Q24AWUycwV3T": [
			{
				"comment_id": 2,
				"body": "מילה\nסט מכשירים המשמשים לשם ביצוע ברית המילה, תצוגה במוזיאון העיר גטינגן\nערכת כלי ברית מילה: משחזת, מגן עטרה, מפריד, סכין מילה, מספריים ושפופרת מציצה\n\nשלב המילה, שהיא חיתוך העורלה, הוא השלב הראשון והמרכזי בברית המילה. כדי לכרות את העורלה המוהל משתמש בסכין מילה, כאשר מגן המתכת המגן על העטרה מפני חיתוך בטעות מסמן את הגבול התחתון של החלק הנחתך.\n\nרופאים המבצעים מילה רפואית נוהגים להשתמש במגן מתכת בעל אפשרות לסגירה הדוקה ביותר, המשמש לתפיסת העורלה עד להפיכתה לנמק קודם לחיתוכה, בהליך הנמשך כעשר דקות. השימוש במגן המתכת ההדוק נועד לצמצם למינימום את הדימום לאחר החיתוך. ההלכה היהודית שוללת את השימוש בטכניקה זו לשם קיום מצות ברית מילה, כיון שהמצוה מתקיימת בכריתת העורלה, ואילו בהליך הרפואי העורלה נכרתת רק לאחר שהפכה לנמק ונעשתה 'בשר מת'.[52] בנוסף, לדעות מסוימות בהלכה הטפת דם הברית היא חלק מהמצוה, בעוד שהתופסנים מונעים כמעט לגמרי את יציאת הדם.[52] באופן דומה נשלל גם הליך המילה באמצעות לייזר, במהלכו לא יורד דם. החריג היחידי הם תינוקות בעלי הפרעות קרישה משמעותיות (כגון חולי המופיליה), הנימולים באופן המבטיח כי לא יאבדו דם במהלך ברית המילה.\nפריעה\n\nהפריעה היא חשיפת העטרה על ידי הסרת שכבת העור הדק שבין העטרה והעורלה, הדבוקה אל העורלה אצל ילודים ('inner preputial epithelium'). היא מוזכרת במשנה, אך אופן ביצועה לא נזכר במשנה או בתלמוד.\nמקור הפריעה\n\nבמקרא לא מוזכר במפורש קיומו של שלב הפריעה, אם כי יש שפרשו שהסיבה שיהושע נצטווה למול את בני ישראל \"שנית\", היא שבהיותם במדבר הם מלו אך לא פרעו. לפי התלמוד הבבלי הפריעה נוספה לברית המילה רק בעת מתן תורה,[53] ועל כן בוצעה לראשונה בימי יהושע. מדרשי הלכה לומדים את ציווי הפריעה מפרשת המילה שנאמרה לאברהם,[54] אולם על פי דעה אחרת, הפריעה אינה נלמדת מהתורה כלל, אלא היא הלכה למשה מסיני.[55]\n\nלפי המשנה[56] הפריעה היא חלק משמעותי מברית המילה, ומילה ללא פריעה אינה נחשבת למילה הלכתית. התלמוד הירושלמי[57] אף מוסיף שחיוב כרת על מי שלא נימול חל גם על מי שמל ולא פרע. יש המפרשים[58] שהכונה לנימול, שנותר ערל, מאחר שטרם נתגלתה עטרתו. אך יש המפרשים,[59] שהכוונה בגמרא היא למוהל במקרה שהברית חלה בשבת, כך שנעשה חילול שבת לצורך המילה, בלי לקיים את המצוה. לדבריהם ייתכן, שחיתוך העורלה כשלעצמו, פוטר את הנימול מחיוב כרת.[60]\n\nפרופ' ניסן רובין טוען שהפריעה מקשה על 'משיכת עורלה',[61] ושלשם כך הונהגה, רק בעקבות גזירות אדריאנוס.\nהליך הפריעה\n\nרש\"י כתב בפירושו על התלמוד,[62] שהפריעה היא הליך בו \"פורעין את העור המכסה ראש הגיד\". הרמב\"ם, והשולחן ערוך כותבים שמבצעים את הפריעה בעזרת הציפורנים של המוהל: \"ואחר כך פורעין את הקרום הרך שלמטה מן העור בצפורן ומחזירו לכאן ולכאן עד שיראה בשר העטרה\". לפי מנהג זה, המוהל, שמגדל ציפורן אגודלו במיוחד למטרה זו, מקלף את הקרום הרך שתחת עור הערלה וחושף את העטרה. אולם, לפי מקורות אחרים, כמו תשובות הגאונים לרב האי גאון, ניתן לבצע את הפריעה גם בעזרת כלי. בכללי המילה לרבי יעקב הגוזר נכתב שמנהג שאלוניקי הוא לעשות מילה ופריעה כאחת באיזמל, מחמת אי הנקיות של ציפורן המוהל. כאשר מופרדת שכבת עור זה מהעטרה קודם למילה עצמה (כפי שנעשה על ידי חלק מהמוהלים), מוסרת רוב שכבת עור זה יחד עם העורלה, ועל כן רובו של שלב הפריעה מתבצע יחד עם המילה עצמה, כאשר לאחר מכן מוסרות מעט השאריות שנותרו באמצעות ציפורן, סכין או מספריים.\n\nבמילה רפואית מודרנית נהוג להפריד את שכבת עור הפריעה קודם למילה, ועל כן הקרום שתחת העורלה מוסר יחד עמה בעת חיתוך העורלה, בדומה לנהוג אצל חלק מהמוהלים.[63] בעוד במילה יהודית מוסרות שאריות שכבת עור זו, בהליך הרפואי שכבת העור שנותרת נתפרת למקום החיתוך על מנת לכסות את פצע החיתוך.\nמציצה\n\nלאחר המילה והפריעה מגיע שלב המציצה. בשלב זה המוהל מוצץ את הפצע עד שיצא ממנו דם. דין המציצה מוזכר במשנה[64] ובמדרש (כמובא בדברי הרמב\"ם) אף מובא שכך נהגו משה רבינו ואהרן הכהן.[65] התלמוד[66] מבאר שהמציצה נחוצה לשם מניעת סכנה רפואית מהנימול, אך אינו מבאר מהי סכנה זו.\n\nעניין המציצה מוסבר בדברי רבי יעקב הגוזר, מוהל בן המאות ה-12 וה- 13: \"מציצה כיצד? אחר הפריעה מיד מכניס את האבר לתוך פיו ומוצץ את הדם בכל כוחו משום שהדם נקרש בפי האמה וסכנה הוא אם אינו מוצץ. כדאמרינן בפ' ר\"א: אמר רב פפא אומנא דלא מייץ מעבירין ליה משום דדם נקרש בין האמה והוא סכנה\".[67] מקובל בעדות אשכנז ועדות נוספות שלפני המציצה ממלא המוהל את פיו במעט יין, מקור מנהג זה הוא בדברים שעל פי תורת הקבלה.[68]\n\nהרב ד\"ר מרדכי הלפרין מסביר[69] את הצורך במציצה ביתר ביאור; לדבריו עורקי הגב של האיבר מתכווצים בעקבות חיתוך העורלה, והדם שנקרש עלול במקרים נדירים לחסום אותם ולהוביל לנמק. יש שהסבירו את פעולת המציצה כשחרור חסימת כלי הדם שנחתכו ואינם מדממים עקב התכווצות השריר באזור, אך יחלו לדמם לאחר שהשריר יתרפה. לפי הסבר זה, תכלית המציצה היא זיהוי מוקדם של שטפי דם בלתי נשלטים, לדוגמה עקב המופיליה בלתי ידועה.[70]\nהפולמוס סביב המציצה בפה\n\nהליך המציצה המסורתי בברית המילה נעשה ישירות בעזרת פיו של המוהל. אולם, בעקבות החשש לסכנות בריאותיות של הדבקות במחלות זיהומיות (לדוגמה הרפס ואיידס), הן לתינוק והן למוהל, כתוצאה ממגע ישיר של פי המוהל בפצע הפתוח, יש שהעדיפו מציצה דרך שפופרת סטרילית. סוגיה זאת נדונה בין פוסקי ההלכה במשך יותר מ-150 שנים, ולאור זאת נהגו ביהדות גרמניה שלא לבצע את המציצה בפה.\n\nבשנת 2003 הוועדה הבינמשרדית לפיקוח על המוהלים הפיצה חוזר למוהלים, לפיו על המוהל \"ליידע את הורי התינוק הנימול בעת ההזמנה לביצוע הברית על שתי האפשרויות לביצוע חובת המציצה, ולהחליט על כך תוך כדי שיתופם בהחלטה\". אולם ניסיונות לשכנוע מורי ההוראה של הציבור החרדי להנהיג לכתחילה מציצה באמצעות שפופרת, או בדיקות הרפס שגרתיות למוהלים, נתקלו בהתנגדות, הן מחשש שהדברים יגיעו לביטול המציצה בכלל והן מפני שאחוז הנפגעים נמוך מאד ומדובר בסיכון שמקובל לקחת בכל תחומי החיים. הרב פרופסור אברהם שטיינברג, חבר הוועדה הציבורית לפיקוח על מוהלים בישראל, טוען שמניעים פוליטיים ומגמתיים עומדים מאחורי הניסיונות לאסור את המנהג, \"השיקול שמנחה את הרבנים אינו אסתטי, אלא חשש סביר לפיקוח נפש. נכון להיום, אנחנו יודעים שקיימת סכנה לתינוק רק במצבים חריגים. למשל, כשלמוהל יש פצע מדמם בפה. אבל הניסיון המצטבר ממאות שנים של מציצה מראה שסטטיסטית הסכנה קטנה הרבה יותר מאשר חציית כביש, למשל\".[71]\n\nסוגיה זו התעוררה ביתר שאת בשנת 2005, בעקבות מוהל שהדביק שלושה תינוקות בהרפס (אחד התינוקות נפטר) בניו יורק, במהלך המציצה,[71] וכן בעקבות מחקרים שהתבצעו בארצות הברית, ישראל וקנדה, וזיהו 11 מקרים נוספים של הדבקות תינוקות בהרפס בעקבות המציצה בפה מאז שנות השמונים. לצמצום הסכנה לנימול ולמוהל פרסמה מחלקת הבריאות של מדינת ניו יורק פרוטוקול למניעת זיהום הרפס בילוד.[72] סוגיה זו נתונה במחלוקת בין המוהלים: בעוד חלקם מוצצים ישירות בפה (לאחר חיטוי מסוים), אחרים מוצצים באופן סטרילי באמצעות שפופרת.\n\nהרב ד\"ר מרדכי הלפרין מתאר את בעיית ההרפס כמצב חדש במגזר החרדי בישראל. לדבריו,[69] בעבר היו רוב האוכלוסייה נשאים של נגיף ההרפס. ממילא, היו תינוקות יורשים נוגדנים לנגיף מאימותיהם. כיום, בעקבות שיפור בתנאים התברואתיים, ישנו מיעוט משמעותי של נשים צעירות שאינן נושאות את המחלה, ועל כן התינוקות הנולדים להן פגיעים להדבקה בשעת המילה, במקרה של מציצה שנעשית על ידי מוהל החולה בהרפס.\n\nהרב שאול פרבר ממכון עתים, המספק ייעוץ בטקסי מעגל החיים היהודי, מעריך כי רוב טקסי ברית המילה בישראל, נעשים על ידי מוהלים חרדים, בדרך של מציצה בפה.[71] מאידך, הרב הלפרין טוען,[69] שקרוב \"ל 90% מהבריתות בישראל מתבצעות כיום על ידי תחליף מציצה – שאיבה באמצעות שפופרת\", ומצביע על כך ששבעה מקרי ההדבקות בהרפס שהוצגו בפני הוועדה הבינמשרדית לפיקוח על המוהלים, לאחר שקרו בשלוש השנים שקדמו לדיון, התרחשו במגזר החרדי.\nמהלך הטקס\nמנהגים לפני הטקס\n\nבעדות אשכנז נוהגים לקיים אירוע מיוחד בליל השבת הראשונה לאחר הולדת התינוק, הנקרא שלום זכר. באירוע מוזמנים קרובים וידידים לאחל מזל טוב למשפחת התינוק, מוגש כיבוד, ונאמרים דברי תורה. כמו כן, נהוג לקרוא קריאת שמע ליד התינוק בלילה לפני הברית, יחד עם ילדים, ולחלק ממתקים לילדים.\n\nאצל הספרדים נהוג לקיים לימוד בלילה שלפני הברית, והוא נקרא \"ברית יצחק\".\n\nאצל יוצאי בבל (עיראק), נוהגים הנשים והילדים להתאסף בבית היולדת ביום השישי ללידה, להכין סוכריות אגוזים ושאר גרעינים קלויים הנקראים שאשה (שש), ולשיר שירים שונים. בערב הברית מתאספים לטקס שנקרא עיקיד אליאס (\"ברית אליהו\"), מביאים כיסא של אליהו הנביא, שמים עליו בשמים ואורות, וקוראים מספר הזוהר. מנהג נוסף הוא הזמנת ילדי השכנים של משפחת התינוק לקרוא קריאת שמע עם התינוק בלילה שלפני הברית.\nטקס ברית המילה\nתינוק בידי סנדקו, הישוב על כיסא אליהו.\n\nבדקות שלפני הכנסת התינוק נוהגים בעיקר בני עדות המזרח לשיר פיוטים שונים, כגון \"יְהִי שָׁלוֹם בְּחֵילֵינוּ\", \"אֶעֱרֹךְ מַהְלַל נִיבִי\", ועוד. עם הכנסת התינוק למקום שבו נערך הטקס, נהוג שהקהל מכריז \"ברוך הבא בשם ה'\". את התינוק מניחים על \"כיסא אליהו\", שמיועד לכך. טעם המנהג הוא במדרש שמובא בספר הזוהר (פרשת לך לך, דף צג ע\"א) שמספר שבעקבות דבריו של אליהו הנביא על הפסקת ברית המילה (מלכים-א יט, יד), הוטל עליו להיות נוכח, כביכול, בכל מעמד של ברית מילה ולהעיד על כך שישראל מקיימים את המצווה, בניגוד לתלונתו. לכן מתקינים כיסא לכבודו.\n\nנהוג לכבד במיוחד מישהו להחזיק את התינוק על ברכיו, והוא הנקרא סנדק. אבי הבן מברך ברכת \"להכניסו בבריתו של אברהם אבינו\", והמוהל מברך \"על המילה\". אבי הבן מברך ברכה נוספת - ברכת \"שהחיינו\". לפי מנהג הספרדים, יושב הסנדק על כיסא אליהו ומחזיק עליו את התינוק מיד לאחר הברכה הראשונה, \"להכניסו בבריתו של אברהם אבינו\". הקהל עונה לברכה זו \"כשם שהכנסתו לברית, כך תזכה להכניסו לתורה ולמצוות ולחופה ולמעשים טובים\".\n\nלאחר מכן מברך המוהל או אחד הנוכחים, וכוס יין בידו, את ברכת \"בורא פרי הגפן\", ולאחריה \"בורא עצי בשמים\" על צמח ריחני שהובא לשם כך. את הברכות חותמת ברכת \"אשר קידש ידיד מבטן\" שמסתיימת ב\"ברוך אתה ה', כורת הברית\". אחר הברכות נאמרת תפילה לבריאות הילד, ונהוג שאז מוכרז שמו לראשונה. בתוך התפילה מוזכר הפסוק (יחזקאל טז, ו) \"ואומר לך בדמיך חיי\", וכשקוראים פסוק זה טובל המוהל את אצבעו בכוס היין, ומטפטף לפי התינוק פעמיים.\n\nהטקס מסתיים, לעדות הספרדים - בקדיש, ולאשכנזים - בתפילת עלינו לשבח. אחר כך מתקיימת סעודת מצווה.\n\nעל פי רוב, ברית המילה מתבצעת כיום בבתי כנסת או באולמות אירועים. לרוב הטקס פומבי ונערך בנוכחות קרובי משפחת היילוד ומכרים. בקרב חילונים בישראל יש המפרידים בין ברית המילה עצמה, שנערכת בהרכב משפחתי מצומצם ולעתים בבית החולים, לבין מסיבת הברית, שנערכת מספר שבועות מאוחר יותר.\nהיבטים רפואיים\n\n    Postscript-viewer-shaded.png ערך מורחב – מילה (ניתוח)#תופעות הנובעות מהמילה\n\nמחקרים העלו שמילה מפחיתה משמעותית את סיכוני ההדבקה בנגיף האיידס ביחסי מין הטרוסקסואלים, וכן מפחיתה את הסיכון למחלות מין ומחלות זיהומיות נוספות, לרבות סרטן הפין. בעקבות כך מממן ארגון הבריאות העולמי את מילתם של אלפי גברים, במטרה למנוע התפשטות של איידס ומחלות נוספות.[73] בשנת 2012 פרסמה האקדמיה הפדיאטרית האמריקאית (AAP) נייר עמדה המבוסס על חקירה ובדיקה של יותר מאלף מאמרים בספרות הרפואית, ועל פיה התועלות הבריאותיות של מילת תינוקות עולות על הסיכונים.[74]\nהיבטים חברתיים\nקיום המילה\n\nמצוות ברית המילה זוכה לתפוצה רחבה גם בקרב חילונים שאינם מקיימים את מרבית המצוות, ורוב היהודים החילוניים מלים את בניהם לפי דרישות ההלכה ולפי המסורת היהודית. בנוסף להיבט הדתי, יש למילה גם היבט חברתי, המעודד את קיומה במקום שבו הרוב נימולים. יש התומכים בניתוח גם משיקולים רפואיים. לפי סקר משנת 2009,[75] 94 אחוזים מקרב היהודים הבוגרים בישראל שהשתתפו בסקר, השיבו ש\"חשוב\" או \"חשוב מאוד\" לערוך את טקס ברית המילה.\nהתנגדות לביצוע המילה\n\nישנם מתנגדים לברית המילה, התופסים אותה כפעולה מיותרת הפוגעת בשלמות היילוד וגורמת לכאב, לעתים תוך צידוד בנזקים אפשריים מהתהליך. אחרים טוענים כי אין להם בעיה עם ההליך עצמו כל עוד הוא נעשה בבגרות מתוך בחירה מודעת של העובר אותו (למשל מבחינה אסתטית). כמו כן מעצם היותו טקס דתי. בשנת 1998 הוגשה לבית המשפט הגבוה לצדק עתירה שדרשה להוציא אל מחוץ לחוק את ברית המילה בנימוק של \"פגיעה בחוק יסוד: כבוד האדם וחירותו\". העתירה נדחתה על הסף.[76]\n\nבאוקטובר 2013 הצהירה האספה הפרלמנטרית של מועצת אירופה, כי היא מודאגת במיוחד מ\"הפרות מסוימות של שלמותם הפיזית של ילדים\", שהתומכים בהם מציגים אותם כמועילות לילדים חרף \"עדויות ברורות להפך מכך\" ומנתה ביניהם \"מילת זכרים צעירים מסיבות דתיות\". המועצה קראה למדינות החברות \"להגדיר בבירור את התנאים הרפואיים, הסניטריים והאחרים אותם יש לוודא עבור מנהגים הרווחים בקהילות דתיות מסוימות, כגון מילתם הבלתי מוצדקת מבחינה רפואית של זכרים צעירים\".[77] בתגובה, משרד החוץ הישראלי הכריז שההחלטה היא \"בגדר התקפה בלתי נסבלת הן על המסורת הדתית המכובדת והעתיקה שעומדת בתשתיתה של תרבות אירופה, והן על הרפואה המודרנית וממצאיה\" ו-\"מביאה לליבוי רוחות השנאה והגזענות באירופה.\"[78] במכתב לנשיא מדינת ישראל, מזכ\"ל המועצה הדגיש \"שהמועצה הפרלמנטרית של אירופה היא גוף מייעץ אשר לא מייצג את עמדתה הכללית של מועצת אירופה כולה.\"[79] בעקבות מאמצי שכנוע מצד ארגונים יהודיים,[80] בספטמבר 2015 קיבלה האספה החלטה מתוקנת, שאינה מגדירה את המילה כהפרה של שלמות הילד או כבלתי מוצדקת מבחינה רפואית.[81]\n\nמבין מתנגדי ברית המילה, יש העורכים, במסגרת מסיבת קבלת הפנים לתינוק או לתינוקת, טקס אלטרנטיבי בשם ברית שלום, שמטרתו הצעת חלופה סמלית למילת הבשר, או הבעת הסתייגות מברית המילה המסורתית.\nזבד הבת\n\n    Postscript-viewer-shaded.png ערך מורחב – זבד הבת\n\nלרגל לידת בת, יש העורכים אירוע חליפי לסעודת המצווה או למסיבת הברית, המכונה בשם 'בריתה' או 'זבד הבת'. באופן מסורתי, זהו טקס דתי המשלב תפילות ופיוטים מיוחדים. כיום המנהג לערוך בריתה התפשט לחוגים נוספים, ולא תמיד הוא נושא אופי טקסי או דתי. בריתה אינה כוללת מילה.",
				"added": 1492458124
			}
		]
	},
	"comment_vote": {}
}