{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Hi Zero, nice to meet you. Tell me something about yourself..",
			"body": "Hi people,\n\nI am interested to understand all this, I've been away from all of this for 4 years since I had serious mess in my head. Could you please give me some guide links to all of this so I can slowly catch all up and start doing things.\n\nThank you\n\nRegards,\nAZ",
			"added": 1473760764
		},
		{
			"topic_id": 2,
			"title": "Crypto Investment",
			"body": "You can write me on ZeroMail. \nI support with cryptocurrency. Tell me about you and your stuff.\nI even started to pay few of my employers with crypto.",
			"added": 1473799339
		},
		{
			"topic_id": 3,
			"title": "In Time / Please lets talk about this",
			"body": "What you think of implementing something like from movie \"In Time\" (http://www.imdb.com/title/tt1637688/synopsis) for each new user of ZeroMe.? Let's talk about this feature and don't forget old users also :) For example I think it would fit perfectly with upvotes :)",
			"added": 1473860998
		}
	],
	"topic_vote": {
		"2_19dSnqd1GpiMTnuiD4n1tPasyKTDfNSFyz": 1,
		"3_19dSnqd1GpiMTnuiD4n1tPasyKTDfNSFyz": 1
	},
	"next_comment_id": 14,
	"comment": {
		"1_1DBjD2Xf1DymmjxEi5K7aeoaRByAAXBvFW": [
			{
				"comment_id": 1,
				"body": "Who decides that? There will be or not down-vote button.",
				"added": 1473760269
			}
		],
		"2_19dSnqd1GpiMTnuiD4n1tPasyKTDfNSFyz": [
			{
				"comment_id": 2,
				"body": "> [polyomino](#comment_4_1AMdyAHJ7RdjV8rDNs3jy22fdoMcGESJdG): I'm thinking of creating a trust-less tor-like courier system. Basically, participants would get together on a network and would forward a package between each other. Each user would lock up some cryptocurrency equal to the value of the package that would be returned to them + a fee when they get the package to the next user. The users would only need to know how to get packages to the next person.\n> Using this you can ship packages to a recipient without them disclosing their address to you and vice versa. If it became widely used, lots of cryptocurrency would get locked up, thus increasing scarcity and theoretically driving up the price.\n\nYes I had some similar idea but for communication to stay private over the network. Have you started working on this? Do you have some examples?",
				"added": 1473856188
			},
			{
				"comment_id": 9,
				"body": "> [amaropargo](#comment_3_1AZ8PAvb9ChktEbe1jy38b1TvbYB1xVJbh): DHT Support for zeronet haha 122tqTo5jTsZfF4xFodhM54b5HUkeVQL4E https://zeronet.readthedocs.io/en/latest/help_zeronet/donate/\n\nWhat exactly you wanted to say? :D hahaha",
				"added": 1474003982
			}
		],
		"1_1HRrLnTaJwRCA24L45Sr3cYJ3nDmJmPabf": [
			{
				"comment_id": 3,
				"body": "underground",
				"added": 1473857112
			}
		],
		"3_19dSnqd1GpiMTnuiD4n1tPasyKTDfNSFyz": [
			{
				"comment_id": 4,
				"body": "> [ks]\nFor example you get 1000 ZC(zerocoin/points) call it however you want when you register on ZeroID, you earn this by getting upvote for example. And you spend this by giving upvote for example. Yes tradable why not, I will give you 10 ZC if you are empty :) But keep it in ZeroNet :)",
				"added": 1473861637
			},
			{
				"comment_id": 5,
				"body": "Built here on ZeroNet, not outside :)",
				"added": 1473861681
			},
			{
				"comment_id": 6,
				"body": "> [ks]\nThen I will send you more if I care for you or you earn by getting upvote for example, or by good blog or whatever, so you probably wouldn't want spend your stash on upvoting poor stuff :) If you dont have if you are at 0 balance you cant upvote or dunno anything can go here. So people would use it smart and would give value to it. :) Most important is its built here not outside of ZeroNet",
				"added": 1473887266
			},
			{
				"comment_id": 7,
				"body": "> [ks] some rewardable value should be there thats all I can say :) Yes nothing stop you to do that, thats why we could find a way to make it not happen. Together",
				"added": 1473933026
			},
			{
				"comment_id": 8,
				"body": "> [kaffie]\n1) Yes I understand that. So you don't have any imagination how to do this. Someone will find a proper way.\n2) Lets forget blockchain, start thinking raw from here, from ZeroNet. How would you do some simple points which are used to for example upvote. Start from 0.\n3) But look :) This \"coins\" have no any value. Its just points you get, I agree around decentralized authentication and how easy is to get this coins, this all we could think about right? Anyway what would stop to have central authority to give ZeroID?\n4) Other crypto outside ZeroNet can be traded easy :) ZeroNet internally created coin or whatever it would be would give much more control on shit market and bullshit",
				"added": 1473933804
			},
			{
				"comment_id": 10,
				"body": "> [ks](#comment_181_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): I don't believe in restricting people. I also don't believe in the tyranny of the majority.\n\nMe neither :)",
				"added": 1474004088
			}
		],
		"1_13MUkdCRgz1jXmufWdvJn5qgRrwhrWNYbK": [
			{
				"comment_id": 11,
				"body": "Yes you host it, I copy it and host it also, they take it so on... You have to be creative with your code :)",
				"added": 1474107995
			},
			{
				"comment_id": 12,
				"body": "Yes you host it, I copy it and host it also, they take it so on... -> NODE. You have to be creative with your code :)",
				"added": 1474108043
			}
		],
		"1_15oJLfpirNrTr2Fzhq6reLQ2aJGeDAnLHF": [
			{
				"comment_id": 13,
				"body": "I don't like this 起来了起来成人网站和影视网站来了起成人网站和影视网站成人网站和影视网站来来成人网站和影视网站来来了起来了起成人网站和影视网站来来成人网站和影视网站来了起来了起来了起来成人网站和影视网站来了起来了起来了 I mean I do and I would love to know but control yourself",
				"added": 1474108173
			}
		]
	},
	"comment_vote": {
		"24_1GNdkBSxTw6SpRdGHxDCyfANXnwi7FG7rJ": 1
	}
}