{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"2_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": [
			{
				"comment_id": 1,
				"body": "> [border0464fred](#comment_94_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): patriotism is just an other kind of religious delirium that ask you sacrifice for abstract concepts. \n> Baiting for imaginary fairy tails is edgy to me.\n\nMost human thoughts are `imaginary fairy tails`, some are just more biologically programmed then others. For example, you probably believe in not dying, because death is `a negative thing`. Did you ever think about testing that theory? I mean if you're such a logical person, why settle for belief, when you could just get the truth?",
				"added": 1490917630
			},
			{
				"comment_id": 2,
				"body": "> [alaric](#comment_12_1HiyP7AD74uGuGBZLqhcmfQgwu5VC8nnYY): That's all well and good when you're talking about free speech within a country like the United States - Which the xkcd comic is actually referring to. The internet is a different monster altogether. It's not owned by a country or regulated (at least it shouldn't be). \n> Racists have the same right to comment their bullshit just as much as anyone else. It doesn't matter if you're a feminist, brony, transgendered, white male, muslim, chinese, straight female, midget, giant or an obese asexual that identifies as a 1950' era fridge. Everyone should have the freedom to say what they want on a completely free platform such as the internet. If all racist comments are censored, who's to say all anti-government comments won't be next? Followed by anti-celebrity comments. Followed by anti-Futurama comments. \n> It's a slippery slope and the notion of censorship on the internet should never be entertained. If you support the censorship of shit you dislike and choose to wrap yourself in a little bubble of \"safety\", no one will be there to help you when the things you DO like are censored.\n> I mean really, is it THAT hard to ignore someone? Has society come to the point where we're all so easily offended that we'd rather hand over our rights just to have the illusion of safety?\n\nI think you have some ounce of logic. But not all of it. The problem appears on this line:\n\n> I mean really, is it THAT hard to ignore someone?\n\nYes it is. This is why forums need sections, to separate people who want to ignore each other. Temporarily or permanently. This is why it can't be censorship to block someone from a community or to filter content out of sections.\n\nIf that where the case, then you are censoring someone by preventing them from sending you spam or by using an add blocker. A simple case of subscribing to a single publisher is also censorship of all other publishers. \n\nWhy do you do all those things? Because ignoring, is extremely hard. It's not only a hard problem, its a unsolvable problem without what most call censorship.\n\nThis inst about *safety*, this is about the fact that i would much rather be reading about other things then waste of times, like politics and religion. That requires some system that allows filtration of content. Which in turn is called censorship.",
				"added": 1491018292
			},
			{
				"comment_id": 3,
				"body": "> [border0464fred](#comment_112_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): I think there is a gap between censoring as banning/muting/deleting and asking nazi to not spam the main with  irrational bullshit.\n\nAsking? They aren't going to stop just because you asked. They may be preaching, they may ever be preaching things that you disagree about, but so are you. \n\nNeither side of an argument is ever correct. There are very few absolute truths in the universe. Believe all you want that you are a rational person, there is really nothing to rationalize with apart from beliefs. There is no way to filter content by whats rational and what isn't. Not without beliefs about what rational content is. \n\nThe problem exists because of the websites lack of content classification.",
				"added": 1491040797
			}
		]
	},
	"comment_vote": {}
}