{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1_1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA": [
			{
				"comment_id": 1,
				"body": "I agree that the point is not being an anonymity network, but i think it's still relevant to the issue. If there's no anonymity, officials can still track people down for hosting something that's against the state, and ordinary people will start to avoid the stuff out of fear. Sure, you cannot really take it down, but then it's only for those people, who really only want that their shit cannot be taken from the net. But then ZeroNet wouldn't have very many users. Just the criminals and idealists. Remember that Facebook didn't become successful because of its superior technology of user interface or privacy options, but because everyone nowadays feels kinda forced to use it.",
				"added": 1483628490
			},
			{
				"comment_id": 2,
				"body": "I'm saying that if success is measured by adoption rate, ZeroNet won't prosper, because it doesn't offer anything for the common user.",
				"added": 1483632085
			},
			{
				"comment_id": 3,
				"body": "> [nofish](#comment_851_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): I think the uncensorable, server-less sites can be attractive for some content creators and the content attract regular users.\n\nAgreed. I just fear that something this interesting won't take off. But at least this allows for easy website deployment and that should be used to market ZeroNet to the regular users.",
				"added": 1483645446
			},
			{
				"comment_id": 4,
				"body": "> [planespherev3](#comment_78_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): This alone is the reason why in 15 years most of the web will be P2P.  The dark will become the clear, and the clear will disappear. \n> Always available (no sites down), DDos immune, and no need to rent/own a server.\n> P2P internet is way more cost efficient. It uses a ressource which is scarcely used in the clear today (except for torrent or filesharing in general  of course): upload of the users. \n> So instead of one expensive upload used by big central servers, it use many little uploads of the users.\n\nI really hope you are right",
				"added": 1483653384
			}
		]
	},
	"comment_vote": {}
}