{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "So, how do we get this video streaming running here? (ZeroTube, Kopy Kate OFFICIAL, etc.)",
			"body": "I was tinkering around getting video streaming running here on ZeroNet for the last days. I've achieved enough for jumping into full video streaming and upload action.\n\nAim was:\nLet's figure this shit out completely ! As distributed and anonymous as possible !\n\nWhat zites exist for doing video streaming here on ZeroNet?\nThe answer:\n- ZeroTube - http://127.0.0.1:43110/1FUQPLXHimgCvYHH7v3bJXspJ7bMBUXcEb/\n- Kopy Kate OFFICIAL - http://127.0.0.1:43110/1aCq7GiJfUfGZ4GftjYaYbsEngPFzcxvN/\n\nQuestion:\n- Are there any more zites here on ZeroNet for doing video streaming?\n\nSmall Troubleshooting:\n\nFirst thing: Check if webRTC in your browser is enabled, because it has to be enabled.\nFor doing this in firefox type about:config in the address field and then search for media.peerconnection.enable and make sure that the value of said specific option is set on 'true'.\nThis seems to be the only config change you could need...\n\nIf you want to use ZeroNet in TOR mode within TOR browser, but the zites don't load (you just see grey background + the circle with the \"0\" in the right, upper corner), then it's because of NoScript ! Click on the NoScript icon in the toolbar in the upper, left corner (The \"s\" icon), and choose \"allow temporarily\", then re-load the zite and you will see zites just as good and fully loaded as you can see zites in firefox browser.\n\nWhat is necessary for streaming down and upload?\nStreaming down:\n- You need to download and have WebTorrent running - https://webtorrent.io/ - ZeroTube and Kopy Kate OFFICIAL, both, are working based on WebTorrent, which is a P2P video streaming application \n-- you need to give the following files of WebTorrent firewall exceptions, because P2P video streaming is based on going beyond your own PC, if you block that, of course, it can't work:\n--- your firewall will tell you, what files are blocked\n---- simply look up the firewall protocol and give all WebTorrent files an exception\n----- this could end up like this:\n------ WebTorrentSetup-v0.18.0.exe\n------ WebTorrent\\app-0.18.0\\WebTorrent.exe\n------ AppData\\Local\\WebTorrent\\Update.exe\n\nUpload:\n- You need a ZeroID and log in on ZeroTube and Kopy Kate OFFICIAL\n-- Create one, if you haven't, yet, and want to upload on said platforms: http://127.0.0.1:43110/zeroid.bit/\n\n\nHow does streaming down work?\n- ZeroTube: Good, when videos are seeded enough ! That's the whole trick.\n\nYou visit ZeroTube. You see \"We are looking for peers...\" on the starting page.\nIf any video on the platform has a couple of peers - like 3 to 4 peers - then after a while this message will disappear without you doing anything and at that spot said videos appear as thumbnails plus peer number display.\n\nWhen you click on said thumbnail, the specific ZeroTube video site loads and auto-plays said video.\n\nBut at the same time it can happen that if you use search function searching \"video\" for finding some videos,  you'll see the thumbnail but clicking on it just leads you to an error site...\n\nNo video thumbnails appear anywhere or all are just having \"0 peer\" and are un-clickable?\nThen you've forgot to have WebTorrent.desktop running, or forgot to enable WebRTC by said config change, or all videos on the platform don't have enough peers !\n\n\n- Kopy Kate OFFICIAL - clear mode: IT WORKS !!!\n-- Evidence: With everything being said and applying that, on Kopy Kate OFFICIAL just look for and visit the video \"Charly Chaplin - The Greatest Speech Ever Made\" - here's the link of it: http://127.0.0.1:43110/1aCq7GiJfUfGZ4GftjYaYbsEngPFzcxvN/?Topic:2_1DTUNWykvXLbxZud5a8gJsq7DxmxcGk52E/Charlie+Chaplin+The+Greatest+Speech+Ever+Made\n--- It should run, at least it does so for me\n- Kopy Kate OFFICIAL - tor mode: IT WORKS !!!\n-- Evidence: see above, but:\n--- You need to fix a little bit, because it won't run out-of-the-box:\n---- Probably you're using the TOR browser security setting \"middle\", which is good, but part of it is, that NoScript is adjusted so aggressively, that it blocks video streaming\n------ Solution: Click on the NoScript icon on the left of the TOR browser bar - this \"s\" symbol - choose \"Options...\" -> \"Embeddings\" -> make sure that \"forbid <Audio> / <video>\" is de-activated\n------- after that try again to watch said video\n\nHow does uploading videos work?\nIt works ! The point is just, that the challenge is to let the upload process end with having enough peers. If you ask me, 3 peers are the minimum for practical accessibility. In reflection to this I suggest the following process: You upload on every platform you can get. You start with ZeroTube, continue with WebTorrent.desktop right away, then Kopy Kate OFFICIAL, and then instant.io. And you don't close any window until you've uploaded on all 4 platforms.\n\nStep by step:\n1.  If you already had a successful upload check it to see if at least you on the respective platform are able to stream down your upload. If you could, then continue...\n2. Go to ZeroTube & upload your video to ZeroTube. You will see the ZeroTube upload site giving you telling you that the upload was successful and giving you a magnet link as an output.\n3. Open WebTorrent.desktop and on ZeroTube upload page click, hold, said magnet link and drag & drop it into WebTorrent.desktop - you should see how WebTorrent is loading the video, you see numbers rising, you see a preview pic appearing as a background in WebTorrent.\n4. Now instantly and without closing anything go to Kopy Kate OFFICIAL, left-click on \"+ Upload new video!\"\n5. In WebTorrent right-click on said video you've just placed into WebTorrent before and copy the magnet link from it\n6. Place said magnet link into Kopy Kate OFFICIAL upload page, section \"Load a video from link\" and left-click on the download button.\n7. Type in Title, description, look online fore a nice pic of your video and copy its link and paste it in the respective field, choose the video category\n8. Check on the Kopy Kate OFFICIAL upload page, if your video is running by rolling over the video with the mouse cursor and clicking the appearing play button in the left, lower corner.\n9. Then on the upload page of Kopy Kate OFFICIAL click on the \"add video\" button\n10. Open a new web browser window and in its tab go to instant.io\n11. Copy said magnet link into it and push the \"download\" button\n12. Then the site re-loads, loads the video and auto-plays it. Now a look into WebTorrent.desktop shows that the video has at least 4 peers. A visit of ZeroTube start page and a bit of waiting causes the \"waiting for peers...\" message to disappear. At the very same spot now the new upload appears, displaying is has 2,3, 5 peers. Also on Kopy Kate OFFICIAL your upload will work for your audience.\n\nHere's my example video upload, which I've treated like described:\nOn ZeroTube: http://127.0.0.1:43110/1FUQPLXHimgCvYHH7v3bJXspJ7bMBUXcEb/?/watch/277/6b47beae50804ab1b275d60e7bdcadc86d49516b\nOn Kopy Kate OFFICIAL: http://127.0.0.1:43110/1aCq7GiJfUfGZ4GftjYaYbsEngPFzcxvN/?Topic:8_1PvAednzaMJiuMz1SD5wF3m3Hx7SK75zHv/Test45\n\nYeah, that's it... well, almost:\n\nThere is one downside: Anonymity.\nWhy we're doing all of this stuff, using ZeroNet, in TOR mode, and that in TOR browser?\nBecause we want anonymous P2P video streaming.\nDuring my tinkering around I ran into information, which let me assume, that said way to do streaming down in Kopy Kate OFFICIAL in ZeroNet in TOR mode in TOR browser is not anonymous, and that anonymous P2P video streaming only can exist, if ZeroNet and TOR shift their development strongly into the \"anonymity\" direction for videos. So, if at all, it only can exist in the future.\nWhat made me believe this ? This tor blog post: https://blog.torproject.org/blog/bittorrent-over-tor-isnt-good-idea\nApparently, the torrent protocol is very good in some way and very bad in another way:\nIt's fantastic for P2P-distribution of content, but it doesn't give a flying fuck about anonymity. So, if you are using torrent protocol, you are de-anonymizing yourself. Period. You can tunnel information anonymously through TOR, but if you do so by torrent protocol, then the information as such will de-anonymize you at the end of the anonymous TOR route.\nSaid video streaming consists of 2 components:\n- the torrent file/magnet link, which is really just like a link to a certain file, in our case the video file\n- the actual file - it's transfer from one node to another is called \"torrenting\"\nYou can transfer the torrent file anonymously via TOR.\nThis is fine for your anonymity. And this is fine for TOR network, because you don't consume much TOR exit node ressources, because the torrent file is small.\nThe trouble starts with the torrent file starting phase 2 - Getting the actual file - and you're trying to anonymize this phase 2, as well, by tunneling it through TOR network. That's where your anonymity will break. That's what's not working. And that's where TOR network gets into trouble in case you would manage to tunnel this \"torrenting\" through TOR network, because the actual file is big and so will consume a lot of precious TOR exit node bandwith, which is needed for more important stuff like for instance secure communication for people living in oppressive regimes - it's a matter of life or death for them. So, you don't want to torrent in TOR network, neither for your own personal gain - anonymity - nor for others.\n\nJust to make it clear. There is a difference between using ZeroNet in general and using ZeroNet with WebTorrent (like ZeroTube or Kopy Kate OFFICIAL) or WebTorrent alone:\nZeroNet alone uses \"torrent networking\", whatever that means. Sounds like it's not the classical normal full torrenting, doesn't it ?!\nZeronet in TOR mode in TOR browser still uses \"torrent networking\", but with small files, which is fine for TOR.\nZeroNet + WebTorrent, what you're using when you are using ZeroTube or Kopy Kate OFFICIAL, has 2 channels:\n1st channel is getting the torrent file/magnet link via ZeroNet \"torrent networking\".\n2nd channel then is NOT using ZeroNet anymore, but only WebTorrent, which doesn't work like ZeroNet in TOR mode in TOR browser with \"torrent networking\", WebTorrent is a whole different application than ZeroNet. WebTorrent uses full torrenting like described and in the course of that the torrent file/magnet link tries to get the full actual content file by all peers it knows with ignoring anonymity issues. ZeroTube or Kopy Kate OFFICIAL are just like embedded windows showing you what your WebTorrent desktop is doing. And your WebTorrent desktop is not tunneling the content file stream through TOR, even if you are starting the streaming process by opening ZeroNet in TOR mode and in TOR browser, visit ZeroTube or Kopy Kate OFFICIAL, and say \"hey, Kopy Kate OFFICIAL, get me that one video\". Kopy Kate will say \"Okay\", get you the torrent file over TOR, but the torrent file then will use only WebTorrent, which doesn't use TOR, for getting the content file.\nSo, you see how the process of getting the torrent file/magnet link on the one hand and getting the actual content file on the other hand are seperated processes, although the user experience in ZeroNet looks like \"fuck yeah, now I've done EVERYTHING over TOR and am anonymous !\"\n \nLooking at the FAQ section of WebTorrent the WebTorrent developer will justify his choice of torrent protocol instead of developping a new protocol: He praises the torrent protocol for it's great quality for P2P-distribution of content, and said that his project wasn't supposed to become more complex than it actually already is by additionally having to develop a new protocol instead of relying on stuff that already exists. But he doesn't mention one single word to the anonymity issues of the torrent protocol, which WebTorrent uses.\nAnother thing which confused me: WebTorrent works with WebRTC. WebRTC is like a tunnel for all kinds of media, and that from web browser to web browser, without any middle component like a server. So it has the potential to turn the current server-client structure of the web into a P2P landscape.  WebRTC exists for years, is safe and is default-on on most browsers, so don't worry about that. But: If this is what WebRTC does, why the heck additionally torrent protocol is needed in the first place? Isn't WebRTC alone enough for anonymous P2P video streaming? Good question, good question, I don't know... but the fact is: ZeroTube and Kopy Kate OFFICIAL are using WebTorrent and so torrent protocol.\nThe next question then, of course, is \"Well, what about ZeroNet as such?\". We all know that ZeroNet networking is based on torrent protocol. The answer is: Well, I don't know. It could be, that in contrast to WebTorrent ZeroNet is doing something different. I don't know. Maybe the fact, that ZeroNet is not \"only 100% torrent technology\" like WebTorrent, but instead \"bitcoin cryptography + torrent networking\" saves our asses. But maybe not. Who knows?\n\nAnd this finally raised the question: \"Let's assume, ZeroNet is distributed, but not anonymous - is it still worth it?\" You can't answer this question in a vacuum, but have to link it to alternatives. And the alternative is the normal web, which...\n- gets more and more centralized around major corporations\n-- censoring their networks\n--- by acclamation of content industry\n--- by shaping information flow by own political interests and the aim of earning more money\n---- like for instance YouTube Red, which is creating a 2 class society of \"premium content\" for which you have to pay 10 $ every month, and \"the rest\" which is free but unconveniently shaped (slowed down, hard to find, etc.)\n-- hurting computer user freedom - we lose control about our own computing\n-- and being connected with or very accessable by secret services, both together forming the global surveillance network the hero Edward Snowden revealed, which destroys democracy, freedom of press and privacy, and helps drone war assassinations\n--- strongly lobbying for corporate take over deals like ACTA, TTIP, CETA and TiSA\n- and which is more and more leaning in favor of major corporations instead of the population\n-- which you can see by...\n--- the bad regulatory development of intellectual monopolies and data protection\n--- by the fact that governments do nothing against the global surveillance revealed by hero Edward Snowden, but even legalize those crimes against human rights and extend surveillance power\n--- the fact, that just recently the W3C decided to put DRM into HTML5\n\nSo, you see: With all that being said, even if ZeroNet was not anonymous, the fact that it makes the internet more P2P is so precious, that it still would be worth it.\nBut, of course, there is always room for improvement and best thing which could happen is ZeroNet taking up \"anonymity\" as another core aim next to \"P2P-distribution/decentralization\", and TOR embracing video streaming and big files. Maybe the planned I2P support of ZeroNet will improve the situation of anonymous P2P video streaming. Who knows?",
			"added": 1488377827
		},
		{
			"topic_id": 2,
			"title": "2 Clients 1 Computer",
			"body": "What I want to test if it's working:\n2 separate ZeroNet clients\nsimultaneously running on 1 machine\nwithout disturbing each other.\n\nWhy I think I want that:\nBecause I want to have 2 different ZeroIDs surfing through ZeroMe at the same time, not one after another. In a sence that you have 2 web browser windows open parallel side by side and in web browser window A constrained to the left side of your screen you have ZeroID A logged in ZeroMe seeing it's timeline A and ready to interact and at the same time in web browser window B constrained to the right side of your screen you have ZeroID B logged in ZeroMe seeing it's timeline B and ready to interact.\n\nMy question: How can one achieve that?\n\nMy assumption - and this could be completely wrong:\nConsidering how successive multi user management - one after another - is working on 1 machine... I assume that this could work by...\n- installing ZeroNet on hard disc drive E: and installing ZeroNet on hard disc drive F:,\n-- configure both in a way they can operate simultaneously without disturbing each other\n--- and then have both running at the same time in different web browser windows and do said thing with ZeroIDs A and B\n\nMy problem putting my assumption into practice:\n- I don't know how to configure both ZeroNet clients in a way they can operate simultaneously without disturbing each other\n-- I assume I have to do something with any ports\n--- but I don't know how to change ports of a ZeroNet client, to begin with,\n--- and I don't know what ports to change, yes, probably 43110 ui_port, but my firewall tells me ZeroNet.exe also uses 2 other ports: 15441 (File server) and 53000\n--- and I assume but I don't know if it doesn't matter to what port numbers to change, as long as they don't overlap with any current port numbers in use",
			"added": 1490121640
		}
	],
	"topic_vote": {
		"12_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": 1
	},
	"next_comment_id": 15,
	"comment": {
		"1_1PvAednzaMJiuMz1SD5wF3m3Hx7SK75zHv": [
			{
				"comment_id": 1,
				"body": "> [skylakexts](#comment_14_1JpxTAYzGdJppaeg7xS7VmBaXZF9d94WRj): Nevermind i fixed it and everything is working\n\nskylakexts, I see what you mean, but it's not working: Here's a screenshot of how your videos look like when I search for \"video\" on ZeroTube - 0 peers, no possibility to watch them: http://abload.de/img/zerotube-skylakextc-uxrk0f.png",
				"added": 1488409327
			},
			{
				"comment_id": 2,
				"body": "> [skylakexts](#comment_16_1JpxTAYzGdJppaeg7xS7VmBaXZF9d94WRj): You can't watch unless i am ON ZeroTube and webtorretn is open at the same time , and at night i shut down pc so nobody can watch them :( we must figure out a way for them to be available even when the one who uploaded them isn't online ... :/ i think\n\nWell, if you mean it... you've posted this 58 minutes ago, so it's fair to assume that you're online now with ZeroNet and WebTorrent. So, let me repeat looking at ZeroTube now... sadly still not working... it looks like before...\n\nAside of that I think in this particular case you're right with your assumption, that you need to be online for others to watch it. But only because you're the only one offering it right now. When more people are viewing it, the complete video will be in the network independently from you. That's the magic of ZeroNet of being not just decentralized - like MediaGoblin - but even distributed.",
				"added": 1488475597
			},
			{
				"comment_id": 3,
				"body": "> [styromaniac](#comment_10_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): ZeroTube improved for me.\n> Now it finds peers and opens up the menu of videos with thumbnails missing.\n> When I click a video, it works.\n> Kudos for your good work, skylakexts!\n> One tiny request is a fullscreen button. I use Chrome and it doesn't have its own fullscreen toggle for videos.\n\nReally? What have you changed that it's working suddenly?\nUnfortunally I can't confirm your findings, no matter if I'm using TOR browser, firefox browser, or Opera...",
				"added": 1488475660
			},
			{
				"comment_id": 4,
				"body": "> [styromaniac](#comment_11_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Doesn't WebTorrent work with regular torrents? If so, I can seed with my phone. It shouldn't require Zeronet to run. I use zetaTorrent on Android to grab magnet URIs and seed, which sounds like a cool story for a bro, but if anyone else seeds your torrents with Android, that's pretty much the only app for it.\n> Also, consider using a Raspberry Pi as a 24/7 server.\n\nI'm not so sure, it could be that WebTorrent uses regular torrents. You're right, you don't need ZeroNet for using WebTorrent - it stands and works alone, as well.",
				"added": 1488478252
			},
			{
				"comment_id": 5,
				"body": "> [skylakexts](#comment_18_1JpxTAYzGdJppaeg7xS7VmBaXZF9d94WRj): http://imgur.com/a/tuq354 peers on website cuz the 4th is me , went to 8 then 12 then back to 3 or 4 , if i close zero net all peers in webtorrent drop to 0 and you can't watch anything because none is seeding it or some other reason i don't know about :/\n\nWow... first of all, thank you for the information ! And just in this moment, if I'd do a screenshot, the same screenshot would be produced like the one I've shown before regarding your case... I think one lesson we can take from this is, that not all ZeroNet nodes are the same. It seems like styromaniac's assumption is right, that it's a good idea for performance and user experience to let one's own ZeroNet node run longer than just 12 hours every day, best seems to be 24/7... probably that makes your own ZeroNet node be more inter-connected with other ZeroNet nodes, so that your own ZeroNet node sees more and benefits stronger from other nodes making data available to you...\n\nFor test reasons I will let my machine run through the night and have a look at the video streaming zites tomorrow... maybe that already helps...",
				"added": 1488478632
			},
			{
				"comment_id": 6,
				"body": "> [styromaniac](#comment_12_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Since WebTorrent doesn't have DHT it wouldn't matter if I was seeding, would it? So the torrents probably need to be running on skylakexts' end regardless of my seeding?\n> No online trackers means no ZeroTube videos.\n\nYou're right, or this is the problem... but, then there wouldn't be such an exception like skelakexts being able to have peers for ZeroTube uploads and being able to run videos there right now although others can't...\n\nBtw, just for the record: This is my peer situation right now, no matter if I'm using TOR browser or firefox browser - http://abload.de/img/screenshot-peercount-nhjlb.png\nYou can make these stats appear by dragging/pulling the circle with the \"0\" in the upper, right corner to the left.",
				"added": 1488479946
			},
			{
				"comment_id": 7,
				"body": "> [skylakexts](#comment_19_1JpxTAYzGdJppaeg7xS7VmBaXZF9d94WRj): Soooo we need a server to ermanently run the webtorrent in order to keep everything on zerotube running .... that might be an issue ...\n\nPretty ironic... or we're cultivating the habit in the ZeroNet community to share links and magnet links of published videos on ZeroBoard and help spreading said videos in ZeroNet by downloading them and also start to seed them...",
				"added": 1488484101
			},
			{
				"comment_id": 8,
				"body": "Funny thing: For years all over the internet you can read that webRTC is on by default. But guess what?\nI've found out that webRTC in my firefox and TOR browser is off by default. ;)\n\nKope Kate OFFICIAL's upload page made me realize this, because whenever I uploaded something the red sentence \"This browser is unsupported. Please use a browser with WebRTC support.\" was displayed. I've noticed that before but considered it to be a mistake, because hey, I've got firefox, so, and with all you can read on the internet to webRTC in firefox, OF COURSE, right now I have webRTC and it's on.\n\nWhatever, of course, I've switched it on after realizing this mistake by:\n\nTyping in about:config in address field -> media.peerconnection.enable -> switching value from 'false' to 'true'\n\nIt's not that everything's fine now, but this step definitely made me progress:\n- the change made said red sentence on Kopy Kate OFFICIAL's upload page disappear\n- also the upload on Kopy Kate OFFICIAL seemed to work a little bit better. At least now after uploading a video and then navigating from home site to said video in the list there was 1 peer and the loading process of the streaming made progress and you could see a picture of the video...\n- even ZeroTube benefitted by the change: I could see skylakexts' uploads with '1 peer' and could click on 'watch it'\n-- but I still couldn't see anything, neither skylakexts' uploads nor mine on Kopy Kate OFFICIAL\n--- that was my 1st impression after the change, I will continue tinkering around with it\n---- I assume that either some problems still exist, because... I have too many browser tabs open at the same time for my pc to handle it or because said specific config option is not the only one, which needs to be changed for making webRTC work properly. This is how all media.peerconnection configurations look like right now - do you see any difference from your working configuration ?   https://abload.de/img/media.peerconnectionv4jkqm.png\nScreenshots of about:config media.peerconnection sites of nodes where everything's working fine appreciated.",
				"added": 1488657116
			},
			{
				"comment_id": 9,
				"body": "OH YEAH ! Oh yeah! OH YEAH, FOLKS ! It works! Now on Kopy Kate OFFICIAL I've managed to do streaming down and uploading videos ! Fucking great. And as always: Once you've managed it, it doesn't appear that hard ;) Here's how I've done upload on Kopy Kate OFFICIAL:\n1. Using firefox browser - new, private window (before making sure webRTC is on by config:about - media.peerconnection.enable 'true')\n2. Going on Kopy Kate OFFICIAL - http://127.0.0.1:43110/1aCq7GiJfUfGZ4GftjYaYbsEngPFzcxvN/\n3. right click on \"+ Upload new video!\" and open new tab with it\n4. Under \"Upload .mp4 file:\" click on \"search\", look for the video you want to upload and confirm with \"ok\"\n5. Type in Title, description, look online fore a nice pic of your video and copy its link and paste it in the respective field, choose the video category\n6. Left-click, hold, drag & drop the \"magnet link\" into your WebTorrent.desktop - here's a screenshot how it looks like: https://abload.de/img/kopykateofficialuploa9ekiu.png\n7. wait until WebTorrent.desktop is done with loading\n8. Then on the upload page of Kopy Kate OFFICIAL click on the \"add video\" button\n\nTHAT'S IT !!! SUCCESS !!! You can tell by yourself when you visit Kopy Kate OFFICIAL after the upload, see your video in the list, click on it and then on Kopy Kate OFFICIAL you'll see how your video is being streamed down and has at least 1 peer.\n\nAh, and here's the link of my first successful video upload: http://127.0.0.1:43110/1aCq7GiJfUfGZ4GftjYaYbsEngPFzcxvN/?Topic:6_1PvAednzaMJiuMz1SD5wF3m3Hx7SK75zHv/Reclaim+your+freedom+with+free+libre+software+now+Richard+Stallman+of+Free+Software+Movement\n\nWhen I find the time for it, I will re-shape my starting posting here to be more like a tutorial...\n\n",
				"added": 1488704070
			},
			{
				"comment_id": 11,
				"body": "Just had functional cross platform breakthrough and updated start posting accordingly and as promised.",
				"added": 1490085287
			}
		],
		"26_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 10,
				"body": "I think what's necessary is more a helping active coding hand than suggestions how to make ZeroNet better. Take a look around and consider that all of this here, concept, programming, graphics & animations, Social media coverage comes from 1 single person within 2 years. For people like me already been involved in software projects for several years, this is incredible. Even if you had a couple of people for each of the 4 mentioned branches of development, the current status of ZeroNet would have been impressive.",
				"added": 1488990772
			}
		],
		"12_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": [],
		"2_1PvAednzaMJiuMz1SD5wF3m3Hx7SK75zHv": [
			{
				"comment_id": 13,
				"body": "So far sarasa's posting was closest. I bet it solved the problem for GNU/Linux users. But to my shame I have to confess, that I'm still using proprietary software windows 7. I've understood that I'd better use Free Software OS like one of those: https://www.gnu.org/distros/free-distros.en.html . Currently I'm in the process of moving to one of those...\n\nBut now back closer to the issue: Isn't the port thing the only problem?\nEverything else of 2 seperate ZeroNet installations seems to have no overlap, at all...\n\nso, in what file of ZeroNet installation said default port usage is set?\nWouldn't it be enough to simply change those 3 entries to anything?",
				"added": 1490389003
			},
			{
				"comment_id": 14,
				"body": "> [nofish](#comment_901_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Method #1: Running 2 clients on different port:\n> \n> Download/unpack Client B to a new directory\n> Start it with zeronet.py --ui_port 43111 --fileserver_port 15442\n> Access Client B with https://127.0.0.1:43111\n> \n> Method #2: Using Multiuser plugin:\n> \n> Rename plugins/disabled-Multiuser to plugins/Multiuser\n> This will enable cookie-based authentication made primary for proxies, start it using zeronet.py --multiuser_local if you want to keep settings (eg. newsfeed followings) after restart.\n> In this mode you login/logout to identities on ZeroHello. If you want to be logged in multiple users at the same time, then you need to open different browsers or Client B in private browsing mode, that has separate cookie storage.\n\nThank you so much for the help ! I guess we can tick that box as 'problem solved' :) ...",
				"added": 1490901905
			}
		]
	},
	"comment_vote": {
		"8_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"18_1JpxTAYzGdJppaeg7xS7VmBaXZF9d94WRj": 1,
		"3_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE": 1,
		"254_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"6_1HLFF47LhPMfkv43GJoGCn7ZwXEAZmFHC6": 1,
		"901_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1
	}
}