{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1Cxt2k3farSSee7HTkJKJ7eCTKxfFGNXe6": 1,
		"20_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"2_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG": 1,
		"1_1AhXDbKvcLap7TcS2542J7bFYzKHM3xeRU": 1
	},
	"next_comment_id": 7,
	"comment": {
		"2_1Dg6pvJYXjj2jBffi8Ba5jW9wgQPTkGTMG": [
			{
				"comment_id": 1,
				"body": "hey",
				"added": 1479992809
			}
		],
		"1_1AhXDbKvcLap7TcS2542J7bFYzKHM3xeRU": [
			{
				"comment_id": 2,
				"body": "> [thisweb11](#comment_85_1D9w8AJTfqmn26iT2kF81B8HxXFfycXuXM): Yes I see this FEAR as being the greatest threat to free speech.  The abhorrent Investigatory Powers Bill in the UK has just been made law.  It allows Govt. to legally hack (HACK!)  anyone’s computer or phone. It allows monitoring of peoples internet usage (including by police) without warrant or even suspicion of a crime.   This is  rotten (and in  my view even worse than Brexit or Trump being elected) - Snowden describes at as the most draconian spying law of any country in the western world, including the US.   But what worries me most isnt the spying or security risk of backdoors etc being put in by google apple et. al. its the fear.  If people think this is happening thats all that really matters .  The idea that anyhing you say or read may be taken out of context or seen as controversial or criminal or be seen by police or civil servants (some who may be family members) stops you even risking discussion, or reading around controversial subjects and ultimately thinking.   Studies have shown that the wikipedia search for words like terrorism or  Shia  and Sunnis has significantly declined since the Snowden NSA papers were released.    As far as the state is concerned ramping up this fear by legalising and far surpassing what the NSA/GCHQ was already doing behind our backs is a win win in silencing the public and decent.   A truly terrifying world we now live in.   Decentralised networks and annonymity  tools like tor are utterly vital for the future of humanity.  Without them, there really is a risk of serious dumbing down and subduing  all of society, and once this fear and censorship has started , our collective knowledge and understanding gets less and less until we can no longer think for ourselves, about how to escape the world we will find ourselves in.  And there will be no going back - there may not even be the knowledge to have a violent revolution.  And worse of all the state wont actually need to monitor us much in reality. We will be fearfully and obediently censoring ourselves.  I'm already slightly more fearful  about discussing anarchy as a legitimate  idea.  Projects like zeronet are all that stands between us and this unthinkable and now likely totalitarian future.   Orwell will be turning in is grave this last few weeks.\n\ni agree",
				"added": 1479993086
			}
		],
		"1_1Cxt2k3farSSee7HTkJKJ7eCTKxfFGNXe6": [
			{
				"comment_id": 3,
				"body": "> [quasimodo775](#comment_14_1Cxt2k3farSSee7HTkJKJ7eCTKxfFGNXe6): So where is Assange? He really hasn't been heard from since mid-October. \n> Copied from another source:\n>  \"Apr 16th: John Jones QC, Assange's U.N. Lawyer dies jumping in front of a train. - May 11th: Michael Ratner, WikiLeaks' chief counsel, dies of cancer. - Jul 10th: Seth Rich, DNC staffer who supposedly leaked DNC documents to Wikileaks, is shot in the back and dies. Nothing is stolen from his body. \n> \n> Aug 5th: Edward Snowden (source of leaks on surveillance by the NSA) tweets 64 bit code (potential dead man's switch),  - \n> \n> Aug 10th: Wikileaks offers $20k reward for information on murder of Seth Rich. - \n> Oct 16th/17th: John Kerry visits the UK, personally pressures Equador to stop Assange from publishing documents about Clinton. - Oct 16th: Wikileaks tweets SHA-256 prerelease keys. - \n> Oct 18th: Equadorian Embassy cuts off Assange's internet access. - Oct 18th: Pamela Anderson visits Assange and feeds him a vegan sandwich. - Oct 18th: Witnesses photograph and report heavily armed police and vans outside Equadorian Embassy, are barred from approaching and have cellphones confiscated. Live feeds are cut off. - Oct 18th: Fox News reports Assange will be arrested in a matter of hours. -\n>  Oct 18th: https://file.wikileaks.org/file made publicly visible, file dates/timestamps changed to 1984 (Orwell reference). - Oct 18th: London Airport evacuated due to \"chemical attack\", potentially used as cover to fly Assange out of country. - Oct 20th: /sub/wikileaks, /sub/dncleaks, /sub/wikileakstaskforce and /sub/nsaleaks add 21 new moderators and remove previous mods, all threads about Assange going missing deleted since. - Oct 20th/21st: Wikileaks tweets 5 tweets with misspelled words. The incorrect letters spell \"HELP HIM\". The Wikileaks twitter has never made a spelling error, let alone 5 in two days. -\n>  Oct 21st: Massive DDoS attack on US internet. Wikileaks tweets to imply the attack originates from its supporters, asking them to stop, no evidence supports claim. - Oct 22nd: Gavin MacFadyen (mentor to Assange and key player in Wikileaks) dies of lung cancer. - Oct 23rd: Wikileaks Tweets poll asking how best to prove Assange is alive (he still hasn't appeared on video or at the window since). - Oct 24th: Wikileaks Tweets video of Assange and Michael Moore recorded in June. - \n> Oct 26th: 4chan users successfully successfully decode their first message in Wikileak's blockchain. Threads are instantly flooded by shills saying that it's not worth looking into. The blockchain is blocked with fees and 43000 unconfirmed transactions appear in the mempool. - Nov 6th: Huge DDoS takes down Wikileaks for first time in years. - Nov 7th: Various entities notice hundreds of Podesta and DNC emails are missing from recent leaks, accessed with direct entry. - Nov 12th: Assange meets with Swedish prosecutor regarding rape allegations, lawyers barred from attending, meeting conducted via an Equadorian ambassador (not face to face) - Nov 14th: Wikileaks releases insurance files, SHA-256 hashes do not matches, those tweeted in October.\"\n> And so on. Even the alleged interview with Assange may have been  \"contrived\". \n> Why has Assange's internet not been restored, since the US election is over?\n> And why isn't Assange much more visible and issuing statements?\n> This all may be nothing. Or it may be indicative of something.\n\ngood information",
				"added": 1479993510
			},
			{
				"comment_id": 4,
				"body": "also here is a good article here https://freedomhacker.net/wikileaks-proving-assange-alive-not-possible-weird-blockchain-happenings-5217/",
				"added": 1479993859
			}
		],
		"10_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr": [
			{
				"comment_id": 5,
				"body": "protonmail",
				"added": 1480040490
			}
		],
		"2_1J7dTw3ZsXUsXzpBqVWVj5aXRUMsMC6Nfc": [
			{
				"comment_id": 6,
				"body": "the client side applications are open source so you can check the cod there the only thing that is proprietary is the server software",
				"added": 1480040811
			}
		]
	},
	"comment_vote": {
		"1_14TVizquRR7YJMWRHaWnC97p6GWFRp8nVr": 1,
		"3_1DTUNWykvXLbxZud5a8gJsq7DxmxcGk52E": 1,
		"1_1QEQATgkvbThf8f9r6nBRx6HCPZg3yYma8": 1,
		"4_16Wbf1q3ffLLNpzvyrrGczQK1ZRBJAwMro": 1
	}
}