{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA": 1,
		"3_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp": 1,
		"1_1GuYKebkQAqGJ4tNpNp4TD1UuoHHudCJLA": 1,
		"5_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": 1,
		"1_1MocL2J4KmBk6xozE4eE4jQVfurHdGCTqM": 1,
		"25_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": 1,
		"6_1GNgaj5EqkzqYECYbXa889fGLyuseHRi3t": 1
	},
	"next_comment_id": 38,
	"comment": {
		"1_1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA": [
			{
				"comment_id": 1,
				"body": "It's potentially really cool. But I don't know how trustworthy it is to use over tor (or i2p) while retaining anonymity. I'm also leery about how every site needs to run js (it can't be helped, i guess!) Some of the developer posts on github also lead me to believe that this anonymity and security is not a very high priority to them.\n\nEverything also seems to be set up to use only one identity on all sites. The identity it asked me to post on here is the same I used on ZeroMe and ZeroMail and everywhere else that required an identity (even an anonymous imageboard!) I don't know if I can even make a new one without deleting my entire ZeroNet profile and starting over. It seems I can only be one person on ZeroNet, which is counter to the way people participate on the public internet.\n\nVery mixed feelings, but its still neat that I can publish something, send it to a bunch of peers, turn my computer off, and people will still access it. It's like freenet but not ancient. Everything about the UI is hipster millennial garbage though.\n\nI've only been using it for a couple of days and that's what I think about ZeroNet so far.",
				"added": 1481582131
			},
			{
				"comment_id": 2,
				"body": "> [gremious](#comment_13_1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA): You can use multiple identities, all you have to do is\nThat sounds really complicated!\nIt's frustrating that, in the software's default 'this-is-how-people-should-use-what-we-made' state, the ability to have two different identities has been disabled. It's like they're saying people SHOULDN'T be doing that.\nMaybe it's just culture shock for me since I've always gravitated toward services where I can click a button and generate a new id. And maybe the way this function works will change over the course of the software's development.",
				"added": 1481652447
			}
		],
		"1_183waZSH7rC3CMWuh9nSxpUmRVh498pwGQ": [
			{
				"comment_id": 3,
				"body": "sup",
				"added": 1481653725
			}
		],
		"1_15djDL8TmcrTNVDqc8u8vg7cREZuUx1Rg5": [
			{
				"comment_id": 4,
				"body": "echobot never replied to the first message i sent to her. i waited a day and sent her a second message. she only replied to the second message.",
				"added": 1481845073
			},
			{
				"comment_id": 5,
				"body": "> [whacko](#comment_13_15eMfttUaaszDW39pJHosSc5bgZHuXMEaK): Was it something you said? ;p\n\ni first told her to reply to my mail if she loved me. i wish i was kidding.\ni also get an error updating a single file, just like op",
				"added": 1482014548
			}
		],
		"2_17tQX9J2fScN9APmweSUnzEU4EfTG1ojYb": [
			{
				"comment_id": 6,
				"body": "i just assumed that feature was broken because every time i open the browser all my favorites get reset. how exactly are favorited sites saved? cookies? localstorage? or something on zeronet's side?",
				"added": 1482099967
			},
			{
				"comment_id": 7,
				"body": "it seems to save it in a cookie. so you have to tell your browser to allow cookies to be saved. or else it'll forget everything you favorited. really though, it should be saved on zeronet's side of things. let us customize our own ZeroHello page! that's what it's there for, isn't it?",
				"added": 1482107159
			}
		],
		"1_12UdbJncu6j8isif9jpfDAVETWD8EmsYfM": [
			{
				"comment_id": 8,
				"body": "newbie where are you ;-;",
				"added": 1482280682
			}
		],
		"1_19Sn2ocjSvxhwzp7EvxBrsJdBuzDCjcvDc": [
			{
				"comment_id": 9,
				"body": "i can give you my old yahoo mail account if you want it??",
				"added": 1482363674
			}
		],
		"1_1GuYKebkQAqGJ4tNpNp4TD1UuoHHudCJLA": [
			{
				"comment_id": 10,
				"body": "i think you'll find the community quite hostile, friend. but then what's the worst they can do, censor you? if they succeed, then i wonder what purpose 0net has.",
				"added": 1486763956
			}
		],
		"1_12fSitbSXCwW7nAiyV7jWzrbkkvVBMvHDc": [
			{
				"comment_id": 11,
				"body": "oh yeah? i can double your btc AND trim your rune platemail for only 100gp!",
				"added": 1486855404
			},
			{
				"comment_id": 13,
				"body": "all i'm saying is i can offer the same thing you are offering and more\nif anyone needs their rune armor trimmed you can find me idling in the west bank in Falador. i also do dragonhide.",
				"added": 1487027058
			}
		],
		"2_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": [
			{
				"comment_id": 12,
				"body": "i know! my reason for coming to zeronet to find cp on zerome and for the bitcoin doubling programs. so i could really do without the holocaust denying. come on people.",
				"added": 1487026542
			}
		],
		"1_15LRqNcFJErcQbXY9yRUtffLuToqVr8rDu": [
			{
				"comment_id": 14,
				"body": "this is an underrated thread",
				"added": 1487029108
			}
		],
		"5_1PTaJe3LLeB5Pfxq8KjcpQSPcSK1PQqsQs": [
			{
				"comment_id": 15,
				"body": "ZeroRadio would be cool. i dont think ZeroNet can support something like a live audio stream. maybe the music is all user contributed? maybe with an html player that tries to keep everyone listening roughly in synch somehow?\n\nit might be cool to see some multiplayer games designed to take advantage of ZeroNet's functionality. chess, anyone? or perhaps even something as ambitious as a mud? maybe one of those collaborative drawing things?\n\ni'd like to see people share interactive fiction. twine games are literally just an html file, easy as hell to share as optional files i would think\n\ni'd like to see development on irc-like live chat rooms, like ZeroBoard or ZeroChat Live, and to see people actually active on them ;-;\n\ni'd like to see continue development on ZeroMe. i don't have anything specific in mind. but it's already almost as cool as diaspora. and it's definitely much better than twister. it's probably the single best thing that has come out of ZeroNet.\n\nthis is a non-comprehensive list of things i'd like to see.",
				"added": 1487211031
			},
			{
				"comment_id": 17,
				"body": "if people want to have a distributed network with persistent content which is quickly accessible, they need to develop a culture of giving up that bandwith or their precious hdd space in order to make that network happen.\n\nthis is a social problem and not a technical one, which hampers the growth of pretty much any decentralized service. it cannot be resolved with clever code. people need to learn to share and give back.",
				"added": 1487281702
			},
			{
				"comment_id": 19,
				"body": "sounds like a good subject for a new post, brainstorming how to foster a culture of sharing and contributing resources.\nhey, that qualifies as content we'd like to see!",
				"added": 1487284619
			}
		],
		"2_16ruLucRLto6GhT1Zb3P8JVZzC48fxd9Cc": [
			{
				"comment_id": 16,
				"body": "there is a very serious risk of system/os updates not breaking themselves catastrophically, which can be really difficult to get acclimated to for some Windows users. i speak from experience.",
				"added": 1487212845
			}
		],
		"1_12wGEUrb2N4oeNxs7bEjcV5GJe8VP9Cdsq": [
			{
				"comment_id": 18,
				"body": "looks pretentious and edgy. i've never seen so much fucking cussing in official media, god damn. so basically it looks like closed source retroshare? why don't they just contribute to that project instead?",
				"added": 1487284220
			}
		],
		"1_1DxWcQsQ5cEBqXgc94pKWtzRo6Xn3iWsnK": [
			{
				"comment_id": 20,
				"body": "yes i do",
				"added": 1487373995
			}
		],
		"10687_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 21,
				"body": "all of these news items being pulled here are incredibly pathetic. this article is especially so.\nif these articles were actually curated (not just automatically posted when your bot detects words like \"tor\" and \"dark net\" in them) people might actually read them or discuss them.",
				"added": 1487443382
			}
		],
		"1_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd": [
			{
				"comment_id": 22,
				"body": "are we a private company?\ndo i get benefits for funposting here?",
				"added": 1487446887
			}
		],
		"1_1MocL2J4KmBk6xozE4eE4jQVfurHdGCTqM": [
			{
				"comment_id": 23,
				"body": "i dont think there's anyone here who would oppose more animalporn content on zeronet",
				"added": 1487543832
			}
		],
		"14_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 24,
				"body": "get ready to see \"Sorry this video is unavailable in your country\" a whole lot",
				"added": 1487559189
			}
		],
		"2_15zYrGJKfXo6XXU6rBUsuU3cTgpJkDuQYA": [
			{
				"comment_id": 25,
				"body": "i leaked through my underwear does that count",
				"added": 1488044076
			}
		],
		"1_1ATpj32EgvgApKTmBq1KiY62B5UjzfSRJS": [
			{
				"comment_id": 26,
				"body": "i dont understand, are you saying dolan trump isn't real? how do you explain all his tv appearances then???",
				"added": 1488326850
			}
		],
		"25_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 27,
				"body": "I disagree about the chat rooms, I think people like simple chat, but they don't like waiting more than 30 minutes for someone else to say something. Chat rooms that are not ZeroBoard do not have any exposure, however, and to a new visitor those chat rooms appear to be dead. I've had several conversations on one of these chat sites, and I remain convinced the only reason people don't use it is because they don't know that it's there, or they are under the assumption that the site is dead.",
				"added": 1488923982
			},
			{
				"comment_id": 28,
				"body": "@kai0, I don't understand, sorry. I'm not German.\n@rythrix, that's exactly what I do also. it might be nice if zeronet could show a notification in the tab whenever new content is published",
				"added": 1488938369
			}
		],
		"1_18YE3Sc5daizwqVAoPu3YDvURfie2VmSwC": [
			{
				"comment_id": 29,
				"body": "how do you propose we share them?",
				"added": 1489457719
			}
		],
		"1_1HLFF47LhPMfkv43GJoGCn7ZwXEAZmFHC6": [
			{
				"comment_id": 30,
				"body": "it's weird that that site would be the only one you have trouble visiting. try deleting it and visiting it again maybe.",
				"added": 1489509718
			}
		],
		"6_1GNgaj5EqkzqYECYbXa889fGLyuseHRi3t": [
			{
				"comment_id": 31,
				"body": "I love you",
				"added": 1489592543
			},
			{
				"comment_id": 32,
				"body": "> [yinyue](#comment_16_1GNgaj5EqkzqYECYbXa889fGLyuseHRi3t): Really ?\n\nyes because this is really cool! it was one thing i really wanted to see happen on zeronet! the only way it could be better was if the music played in synch with everyone who was on the page at the same time, but that might not be feasible and might not be an enjoyable experience for everyone",
				"added": 1489699794
			},
			{
				"comment_id": 33,
				"body": "sick must have made it then?\n> [rythyrix](#comment_43_18eGWSaM3Vc9i61LVfogjQJf5gp7EN7b9Y): Will you be making permanently store the tracks, or will you be aiming more toward ephemerality?\nmaybe when it reaches a certain amount of MB space, the oldest songs should drop off as new songs get uploaded?",
				"added": 1489784698
			},
			{
				"comment_id": 34,
				"body": "i assume nothing would stop one person from flooding it with their unique idea of what counts as music. i dont want to be the person who tests this though.",
				"added": 1489958150
			}
		],
		"1_1PfXizQkX7L7ho96Yqva2hvdk6VFT9Dnk7": [
			{
				"comment_id": 35,
				"body": "it seems that english speakers are bigger shitposters than chinese friends.\nchinese posts, while completely indecipherable, are still vaguely on-topic if you run them through a google translate.\n\nif this makes you uncomfortable, you should create a decentralized blog to express your feelings to the world :(",
				"added": 1491337797
			}
		],
		"1_1FNuZtJdubQVu1Mxs65nBVWKuE84pSsoBG": [
			{
				"comment_id": 36,
				"body": "some of us like posting cat pics\n\nyou want to talk about anonymity concerns and protecting yourself from ww3? i recommend burying your head between your knees or uploading your brain to the net before they lock cyberspace down.\n\nalso zeronet does not have a \"target\" \"demographic\". its a neutral platform for anyone to make use of. are you asking what this specific forum ZeroTalk is about? it appears to be a poorly moderated test/proof-of-concept for a message board that anyone can copycat if they want to.",
				"added": 1491497852
			},
			{
				"comment_id": 37,
				"body": "> [anonymouslogin](#comment_7_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Most people are not comfortable enough with technology to use this forum, and though it's not so much a target demographic, it certainly is a limited demographic. As ranxerox said, the technology needs to be easier to use and the interface made more intuitive before the sort of discussion OP wants will be possible.\n\nwhat you describe is a social problem that exists everywhere throughout the internet. it cannot be fixed through software. you have to change the way people think about and interact with computer technology.\ni also cannot imagine how zeronet could be made any easier than it currently is. you plug it in and it works.",
				"added": 1491772698
			}
		]
	},
	"comment_vote": {
		"13_1H8x2Aeu28Lnj6vhXFNZ32kpvGS6dnqWGA": 1,
		"2_15EAH8W3qs47ZJ9wsxEakKtwZ238VFeYGt": 1
	}
}