{
	"next_post_id": 4,
	"next_comment_id": 1,
	"next_follow_id": 1,
	"avatar": "generate",
	"user_name": "Zengjm",
	"hub": "1White24UrrwQrD86o6Vrc1apgZ1x1o51",
	"intro": "新 ZeroNet 用户",
	"post": [
		{
			"post_id": 1,
			"date_added": 1492234985,
			"body": "你好 ZeroMe!"
		},
		{
			"post_id": 1492235035,
			"body": "关于成立中华联邦共和国筹备委员会的倡议书\n\n（参与2017年4月4日讯）\n\n如今中共政权赖以维持的条件正在迅速丧失：社会危机加深、生态危机加重、高层内斗加剧、经济濒临崩溃、国际上好景不再、四面树敌，朝鲜问题进退两难，台湾问题、东海问题、南海问题骑虎难下；而美国特朗普政府的贸易保护主义，对中共国濒危经济的打击，犹如釜底抽薪...中共的垮台已不远，筹备新政府、新国家的时机已经成熟。\n\n近年来，由于身在台湾的中国国民党完全丧失了光复大陆的理想，兼由于台湾中华民国政府背弃大陆民主化事业的不争表现，中国大陆广大人民大失所望，中华民国在大陆的号召力，正在急速的丧失，而中华联邦建国的号召力大幅上升。\n\n中国联邦建国先驱、民运烈士彭明先生首先提出“中国联邦”，并提出了中华联邦建国的系统方案——《民主工程》，其后民运人士贾甲提出“中华民主联邦共和国”，在2008年的“零八宪章”运动中，刘晓波先生系统地提出了创建“中华联邦共和国”的目标和方案，高智晟先生也公开支持“中华联邦共和国”的名号...今天，“中华联邦共和国”越来越被各派接受，以“中华联邦共和国”作为凝聚民运各派的目标，正在成为大势。\n\n有鉴于此，我们认为：成立中华联邦共和国筹备委员会的时机已经成熟。成立中华联邦共和国筹备委员会，至少有如下重大意义：\n\n一，它使民运有了明确的共同目标和向心力；\n\n二，它使民运有了一个统一的平台，大有利于汇聚目前分散的民运各派力量，实施统一的行动，将大大增强民运的力量；\n\n三，民运有了一个统一平台，更有利于争取外界资源。\n\n我们呼吁民运各派顺天应时，尽快圆桌会议，商讨成立中华联邦共和国筹备委员会的事宜。\n\n海外中华联邦政府筹备委员会\n\n曾节明起草\n2017.4.3",
			"date_added": 1492235033
		},
		{
			"post_id": 1492235097,
			"body": "为什么说成立中华联邦共和国筹委会是大势所趋？\n\n\n\n\n  改良之路走不通，只能以革命驱除中共，在习近平变本加厉倒行逆施的今天，已然成为民运的主流共识。\n  那么驱除中共是为了什么？总得有个明确的目标，不能够为反共而反共。且目标明确了，才能够更有效地汇聚力量、激励斗志、振奋人心。\n  就好比一支军队于暑热当中行进于半途，又累又渴，领军者为了振作军心，需要告诉军队前方有解渴的东西，那么是笼统地告诉有解渴的东西好呢，还是具体地指明前方有泉水、有大又甜的柑橘果林好呢？肯定是后者的效果好！因为后者明确、具体。\n\n  所以，树立中华联邦共和国这一具体的目标，要比近三十年来民运吟唱的建立“民主中国”、“自由中国”等泛泛目标，更能凝聚人、振奋人！\n\n  1905年，孙文领导的同盟会，就提出了“驱除鞑虏，恢复中华，建立民国，平均地权”的奋斗宗旨，明确地树立了中华民国的目标，其后，创建中华民国取代满清，成为了反清革命党人的共同目标。\n  而今中国民运与中共较量近三十年，连一个具体的建国目标都提不出来，这不能不说是反共民运不如当年反清革命党人的地方。\n\n \n  方今国内、国际形势的发展，令树立中华联邦共和国目标的时机已经成熟：\n\n  其一，中共政权已近崩溃。中共政权的经济基础，已经濒危。“计生”导致了中共国年轻人口呈几何级数崩坍，劳动力严重短缺；中共政权公务员恶性膨胀和急剧增长的维稳开支，导致地方政府横征暴敛变本加厉，而实业萎靡，外资的撤逃更是雪上加霜。\n  中共采取的政策倾斜，使得中青年人口大量涌向一线大城市，从而维持北京、上海、深圳大城市的虚假繁荣，而内地，尤其是东北和中西部地区，一片衰败，且加速衰败，民众大量返贫，地方政府入不敷出，继而更加压榨掠夺恶暴，以致于民变四起，日趋频繁爆炸性，最近的泸州事件就是青萍之兆...未来几年，中国必出现大面积地方财政破产，激起大范围的民变，引发类似武昌起义后的效应。\n\n  其二，中共政权的崩溃，一定地震式的突然崩溃，需要明确、具体的方案取代中共建政，其中包括具体的国号和政权的组织形式。现在准备正得其时。\n\n  其三，“中华联邦共和国”的国号，优于“中华民国”的国号。民国虽有值得留恋的风物遗产，但因为时过境迁，人心已经生疏，且因为台湾中华民国对大陆反共事业的抛弃，以及种种令人失望的表现，民国在大陆的号召力已不强；再则，树“中华民国”的国号，又因与一心台独的台湾现政权国号雷同，而产生尴尬...反此种种，在中华民国迁台近七十年后的今天，再刻舟求剑去恢复大陆民国，是非常不利的。\n  中国历史上没有哪个旨在恢复前朝的运动，是能够成功的，如刘福通的反元复宋、郑成功、天地会、红花会、洪门...的反清复明，都失败了。\n\n  其三，树立“中华联邦共和国”这一具体的目标，是国内民众的强烈要求。国内好些民众给我们反馈说：中华联邦共和国筹委会“早就该成立”了！停留在以前那种政党状态，毫无希望。\n\n  其四，成立中华联邦共和国筹委会，是最大限度汇聚民运力量的需要，中华联邦共和国筹委会，足以汇聚有心结束中共专制的民运各派，不管是革命派还是改良派。\n\n  其五，成立中华联邦共和国筹委会，也是争取资助的需要。外国政府或者心怀大志的富豪，现在已不太可能资助民运某个政党，因为谁知道中共倒台后，会轮到你们党执政，但是很有可能资助一个跨政党的准政府平台，如果中共统治危机了，而这个跨政党的准政府组织又干得好的话。\n\n\n\n\n曾节明 起草\n海外中华联邦政府筹委会\n2017.4.10  \n",
			"date_added": 1492235094
		}
	],
	"post_like": {},
	"comment": [],
	"follow": []
}